Nese ka mbet pak moral te partite politike kosovare, duhet te ndalohet fushata zgjedhore per zgjedhjet komunale   2021
 Respekt, po mundohemi qe te bejme me te miren per vendin, me shprese qe te avancohemi si komb, flmnd
Kjo deklarate skandaloze tregon dy gjera. 1 Naivitet politik 2  Me qellim te keq, ose te dyja bashke. Atehere qever… 
Kane kerkuar: Krejt dhe Drejt. Shijojeni! 'Arben Ahmeti: Kryeministri Kurti paska zgjedhur rrugen e izolimit te Kos… 
Ju skeni te drejte te ankoheni. E keni dhene voten per Presidenten pa kushte. Tash eshte vone. LDK: Shkarkimi i Val… 
Cfare momentumi ka krijuar kjo qeveri , me qene ish ushtar i UCK-se te trajtojne si kriminel pa te drejte’Faik Faz… 
Edukimi fillon ne Familje 
Liria jone eshte e paplote pa Lirine e Lugines se Presheves 
Po te ishim kaq te interesuar per Luginen e Presheves, se sa per disa vende tjera, Lugina sot, do te ishte ne gjendje shume me te mire.
Po te ishim kaq te interesuar per Luginen e Presheves, se sa per disa vende tjera, Lugina sot, do te ishte ne gjendje shume me te mire.
Interviste per Tv Syri
Shume shpejt do ta kuptojme se: a eshte Shtepia e Bardhe nje shtepi humoristike? Kurti jep shenja se nuk do ta zbat… 
Ju lumte qe po perkujdeseni per ambientin e , sepse  vec eshte model per   'Deputeti i… 
Propozoj qe edhe nje flamur per Luginen e Presheves te vendoset ne Presidence 
Po ne rregull deri ne nje fare mase por kush e merr pergjegjesine per sektorin privat apo ska rendesi'Arben Vitija:… 
Urime zonja Presidente  ! Suksese!
Ata, po por edhe keta po bejne pazare🤭
Edhe  eshte femer zonja Presidente . Pavaresisht bindjeve momentale politike. Parimet dhe… 
 Kujdes cka po deshiron 🤭
 E para shume e sigurt, per te dyten mund te them shume relative...
 Kur ska plan konkret keshtu behen punet shiptarce
Ne javen e ardhshme te behen Parlamenti, Qeveria,Presidenti dhe te punohet seriozisht, cdo vonese e demton mireqeni… 
Intervista ne Tv Syri 
Pak befasues ky reagimi i kosovareve ne lidhje me harten ne zyren e Lajcakut: BE nuk e njeh Kosoven si shtet, e si… 
Derisa Prishtinasit jane te knaqur, ska lidhje, me rendesi me i numru votat, nuk eshte vetem vendi, por edhe qyteta… 
Per ata qe e kuptojne 
Kur i sheh partite politike ne fushata pa asnje mase anti-Covid. Me qene si  me kishte ardhe turp m… 
===