Kjo loj osht per dy vet
Jete e zymt e ksi sene
Kisha dasht me fole me ty, vec edhe nje here...
Kisha dasht me fol me ty, me t'thane qe je tum mungu, pavaresisht sa shume m'ke lendu.
Me shprese qe   sko me naj zgat vesht deri ta qet kangen
Qekjo shkon deri part 100  
Neser e paske ditelindjen, mos i gzofsh te 25-tat .
Pom pelqen, spo ma kupton boten, prap pom pelqen, po du me rrok shuplak.
 Vec thash me ju tregu qe sot ni vjet eshte kalle Katedralja ne Paris. Me fjale te tjera qiky eshte kane problemi kryesor ne bo…
O bre moti skom kesh ma shume se me qeta, mka nxiiiiiiiiii 
 Mos e votoni mocionin! Mos na obligoni me i lone edhe varret e me ik! - Kosovare Kelmendi
A pe shpallim dit zie, a ska nevoj se prej tash kem me u kthy nterr ku jem kon
 A duhna me i kerku falje qikes tem te cilen jom duke e rrit me nje shtet ku deputet eshte niveli i Daut Haradinaj, Haxhi S…
Valentina Bunjaku pas pak qastev 
 mire qe i kan maskat se u myt tu pshty fakte albini
 Veq ngone opoziten cfar kunder replika, krejt inat pa kurrfar baze
 Se meritojm na ksi Kryeministri qe nuk lexon kur del n’foltore !
Dmth ju ka dasht 27 min per me fol per  virus  
Qetu qe 14 min ti ndegju lajmet, hala skan fol qe  ka shku ne 63 numri i te infektumve, tu fol per presindentin🤦‍♀️
Se kom zakon me sha veq, ropt ja qifsha juve 
Cka ke nime qajo zhurma ka ora 5 mengjes?
 E burrit t halles saj i kish ra korona
 Qe ndhom pe pres busin per sallon.
Gjendja te kompleksi jone 
Si pacov qeky Isa.
 “Nuk kam me dek prej korona virusit, kam me dek prej skamjes”!   
Kur e vesin koronen kur e ki njet mu nal 
 Cilt filma jeni ti kqyre pash kejt se marova
Cka t fol Isa mut e bon
O qonu o popull   skan me naj rrxu
Pse more hala e kom lon pinned tweet, sjom mo kjo kom ndrru🤦‍♀️ 
 Ama spo hargjojm pare
 O albin shkarkoje 2020 mos u muno palidhje me kto tjerat
 Me mengjes keq a
 Opaa pasmi mi kall kujtimet kismet
Me mu kthy exi qetash e di qe e ka virusin, se sosht i hajrit per tjeter sen aj
Hajt a po rrini naper shtete tjuv
Naj emer tmire per djeeeem
Do mem lind nipi pa emer
Shume ishin njerz t mire a
 No one:*baba jem ti kshyr bostanat nmarket* 
Po du me msu frangjishten
 PllUs shampanj e qka tkem🥂
A mkoft perhajr depresioni mkoft aa
 Shoqnia osht si stilografat shum i ki ama veq do shkrujn
Tash na qe jem kon n lidhje edhe na kan lan partnerat pa kurfar arsye e shpjegimi edhe po na thoni hajt se u kan "m… 
Boll pi thom vetes "oj qik nuk jan krejt njerzit qysh po menon ti" po badihava kujt mi fol, po kam qef mu "surprizu"
Njeri kaniher skish qka i bon as vetit
Asniher sjom ni ma e ofendume prej dikujt se sa sot
Kur qajo shoqnija ngusht sta man anen per diqka qe ti ki tdrejt, atehere qka me prit ma shume
Niher pot bojn mu ni shume mire me vler shume, amo si po perfundon diqka po bohen kishe ska ndodh kurgjo edhe pot b… 
Frymen ma ke marr, kohen ma ke marr
Te interesuarit per bllok veproni ne kete menyre 
Une me bo edhe naj dham operacion kurr hiq, deken me sy me pa
Te llogarit rrogen qe mshkon krejt n ushqim 
O ishalla nuk des pa ta rras shuplak
Tash a duhet me myt veten une qe paske bo femer a?
Paske bo femer, tkoft perhajr
 Oj shoqni e fminis a dalmi bashk qetash n'mahall ? 
Sonte dua ti jap fund vetmise
Qe dy dit pasna met "agla kalbim agla"
A veq hajt ta kqyri a o tum prit hala mshkrujte a?
Te lyp vullnetin mu qu neser heret 
A ka ma zor se kur t vet nana "Kush ta ka hup driten e syve qika jem?"
Mka marr malli per vetveten time te dashur dhe te lumtur. Faleminderit
Me ja dit vleren qdo senit n jete
A bon me mu kthy veq pak lumturi nshpirt veeeeq pak
E pres mem thon niher qeshtu, sado vone me kan 
 Pse so qashtu a
Shume sene per me bo "shyqyr" e me ja dite vleren, po une jom aty ku spo muj...
Tlutna ndihmom mu bo mire...
Hajt be tung pash Zotin
Pse sjom e lumtur kur jom me to?
O boll u ndikova nga fjalt e tjerve bre🤦‍♀️
 Si ajo te thy qafen tdu shuuuum shuuum shummm
 HAHAHAHAHAHA ZENDELI ME MUSTEQE
Aj n instagram tum shkru 
  Emri me i mire deri tash
  Hahahahah ska lon vend me menu tjeter emer
A lidhmi e di cfare emri ka me ja lan  djalit vet
A ban me kry ket pune niher e pergjithmone.
Spo du me jetu te prit diten e pushimit, po du cdo dite me kan e mire.
Fast forward deri n qershor t lutna
 Hahahahahahah deri t shashtrisna ekom njet
Qysh i ika temes mos me kallxu ku osht hajt se po shkoj me kajt 
Valla mos t tham veq shume palidhje mka nis 2020-ta
Nana Yllit je ma e forta 
  A don me t‘bo stres si per kangen Harrom deri ta publikojsh a qysh o puna? 
Kur te sho qe kan kesh shume me ni post ngrup 
Ishalla sma prish kerkush naten
Sun pe besoj qe hala se kom pa asni post "new year new me" 
NUK JOM KA MUJ MET KUPTU
Jemi pas nda permes telefonit para 4 muje, e tash po dalim mu nda si burrat🤦‍♀️
 Allahile a ja bone bllok?
A bon veq sene tmira me na ndodh
 Kur t osht ajo e lire une vi ju perkrahi
Ti ki me kon msim per mu a?! Ik se po ta hupi faren
Si rrufe pa prit s'te dua me tha nje dite..
 pash zoti mos e qit qdo dit tfejumin nstory
Javen tjeter viti ri?! Wtf where the fuck osht bora
Hiqmu qafe pash ni Zot
Ditelindjen e kom n maj, ama prej tasj pe di qe ka me kalu shume keq me plot kujtime
 Mos e rrit zerin po rrite fjalen eshte uji ai i cili i rrit lulet e jo bubullima.
Shume bosh po ndiheeeeem
Prap pe thom, ju e boni pishman ni femer pse u kon kaq loyal 
 Jeni me te miret, faleminderit
 Ja se di qka po thu veq qajo nashta osht
Krejt i keni ju Shkupi veq qka e keni qet 7 burgerin sdi sdi a🤤
 Ty nqet menyre koka tut denu
Hahaha frik mka ndodh 
Une njeri ma tpaftyr se ti kurr skisha pa, tmarroft Zoti
Qfare sprova o Allah
Do mem kup zemra
 Un krejt jeten zi, e kta mthojn bone edhe twitterin dark-mode se shum fort.
 Ngrehe kamen zhag nashta na shkon edhe neve njejt
A di cka ? Hajt be tung
Ani ama uner kom proteza kur t keshi qeshtu tmerr a 
 Rrite dashnin jo menen.
 A folim si at'her ?
   Ja ja ju drenicakt jeni t shtir veq na juve ju tutem 🤦‍♀️
Sun jom ka boj saber
Do me dek Kemajli, mos mshtini me ju sha a 
Alo, miremengjesi kujt i themi
U knaqa tu bo hor
 Sdu as me kujtu kur e kam ditelindjen 
 Po de, qe qysh u kon e qysh bohet kishe🤨
 Jeta tsprovon me gabimet qe niher i bon heren tjeter menon.
 Dmth hala sje tu fol me to
 Po i mireee qaj djali permas n foto
La ve la qka ki o djaaaal
Na po bojm qka po dojm, e qka sdojna sboooojm
Qaq shume o tu kesh Dora mu o tum dal idhnim
 HAHAHAHAHAHAH msheleeee gojen doraaaaaaaa
Masi sot e xhuma dit e bekume i knova dovt edhe e morra rrugen me knaq krejt ket pune
E bona berllog hehe
Spe di a sot dite ma e mire me bo berllog a neser
 Dashuria eshte si lufte lehte per me fillu shum ran me perfundu.
E me lind ne Kosove e me jetu ne Kosove? Ska ma mire a🤥 
 Tu shtoft fara HAHAHAH
 Faleminderit baci Xhevat per kshillen do e marr parasysh
 Nket mosh e kom puth buken kur mbijke ntok 
 Jeta me ka borxh buzqeshjen.
  hajt diten e mire
Kap ndreqe vet se kerkush spo ta ndreqke 
Po qka me shkym kur nuk shkrun kush, se diqysh tdhem ma shume kur e dhez e she qe apet kerkush ska shkru hahaha po… 
 A u bonen bashk a jo
Taman bre e gjeta ni film thash u rahatova sish kon hd hala Allahi ju kaaaaallt
 Kur ma bon dikush sa je e vetmumeUne: 
 Vendimin qe e mora ,So dicka qe deshirova....
Mka hup ni shoqe diqka fort so ka mirret me mu 
Ni histori duhet me qu deri n fund me perfundu qysh duhet se ndrysh ton jeten me nashta kena me met
 HAHAH mami e krejt familja
Po qysh bre njeri hin mu la pa muzik
Hajt be bone diqysh ta takoj e mos ti thom kurgjo veq ta sho nsy
Me ba be me ta rras shuplak
 Shpresoj qe nji dite te jesh I vetedishem per plaget qe je duke me shkaktu...
 Edhe pse e di qe te du...Prap sje me mu....
Punt ma nterezi se ti kush si paska. Enjoy life girl 
Jaa kompirat spo pjeken nfurr sikur n furr tshporetit druve
Mu qu me pervlu ni xhygym qaj se so ka rrihet
Te dy e donim njeri-tjetrin, por...
Mu ka bo shoqe ni puqerr midis faqes
 E pa lumtur e tu mos punu n andrra tmia
 E lumtur tu punu per andrra tmia
Qfare tipi depresiv jom bo kaja belan
Qfar njeri jom kon tash nj vjet e qysh jom tash ncncnc
 po ama edhe shum veta perputhen ama asniher nuk puthen 
Sot kesh ball perball me at ndjenjen qe nashta e kom ni semundje,po ma e keqja ke qe kurgjo nuk mvike prej zemre me… 
Vallahi edhe qaq e thjesht mos u bon se krejt ta keqperdorin 
Tybe skam fjal ma , ndrysh kom menu qe ka me u bo
Ja shkrujta thash pi diqka prej meje tha dalum e ma qet ti... guess what tre muj jon bo kurr su pam HAHAHA tu kajt e tu kesh
Ko me dek me marak qe se pitem bashk edhe birren e fundit
Kokmi qu pesh me kto andrra Zoti hajr e boft 
Poget qe po dreqi kryt ja hankt 
 zemra mu ka mush merzi, edhe pse loti s’del
 Me ma nxiii jeten ta qifshaaaa at naaan. 
 Hala pa ja nis, perfundoi.!
Po ti koke vet topi 2019  
 Rruges i trishtuar, dikush po ecen, nje i dashuruar dhe fare vetem, dashurine qe humbi duke kerkuar si i erdhi fundi iku…
Po ju djemt e boni pishman ni femer pse ju don 
 O ti mut 1 muj dit foton nwallpaper ta kom majt
Diten kur e kom njoft e mu shkatrru jeta 
Nuk pe di nqfare gjendje shpirtrore jom qe  twitterit me ja hek dark mode
Jom largu prej qdo sendit po hala po dhem
Se pasna vrejt ama dukshem isha largu prej rrjetev sociale
 Ti ma zgat jeten mu Nejse ti edhe mandarinat 🧡
 Lekundu zemer para se trupi yt te te perze, merr keshille para se te behesh perkujtim.
===