 Ma shum po te dhemb ty se opozites!
 Sa mir qe bile ty kush nuk te ngon!
 E paskan shkarku edhe ni here a? !
 Ishalla po pshton me mend ne krye ti!
 Ti ma para fol keq per Albinin se mir per vete, qka me ba tash qe Albinin po e don populli!
 Po kysmet sa here na thirre Kosova e Albinit!
 Ti nuk munesh pa ja mar Albinit per gojë?!
 Veq gazeta expres e ka kete informacion, pshurrsha gazeten!
 A ki kUnkUrU ti najka ?  
 Ty po dojshin met ba ambasador se vesht e mdhaj!
 Populli e vlerson Albinin e jo I pa dituri Berat Buzhala!
 pot nin najkush   i mashtron fmit me ket Tweet!
 Keq qe Albini nuk po merret me ty hiq e ma bash hiq!
 Qef ke ti mos me pas drejt po ske me pas kete knaqesi kurr !
  Te thojsha qe me mbiemer Hoti veq furragji munesh me kan!
 Hahahahha i madh je! 
 Kosova ka shum qen endacak sikur ju!
 Ja pa sherrin dulles!
 Prej qe te ra virusi u bane ma shum i mequm, lumet na qe kemi analista sikurse je ti !
      Qka ta mer menja a kan keta sy simptom… 
    Ku votove dje o terbesh apo votove online ?!
 Jo veq ra fjala se une per veti ma para e kqyri shfajcin tu mi kuq syt se qe e kqyri Palin!
 Paramendoje ky me ta udheheq vendin 🤣🤣
  Çfar njeri analfabet,pa vizion,qka pritet prej teje?!
  Nuk je president i unitetit!
 President analfabet,budalla,pa vizion,qka pritet prej tij,
   Edhe arbani po mungon edhe kompletohet lista serbe! 
 Tash tka met veq edhe me shku me ja kthy grenellit edhe u kry puna!
  Ta bon Kosneti ni termin me grenellin e shko ktheja prapanicen!
 Njeri grek e tjetri serb ose magjup!
  Veq mos rreni, se nuk jeni zgjedh me voten e popullit por me pazare politike, turp turp!
 Çfar njeri analfabet,budalla,pa vizion,qka pritet prej teje!
  Populli me Albinin e psikopatet jane ne anen tjeter!
 Populli esht me Albinin, president i jo unitetit!
 E hupi kontrollen llaposhi !
 Po te dhem ty ma shum se opozites po !
 Tka hi hasha ne qef, me gjys zani je ka i thu hasha!
   Je nje genjeshtar more Alban!
 Muti ma i madhi dole te jesh ti berat buzhala
 Deri mas lufte ka pi uj ne prrocka te brojes !
 U bane bajat qitash llaposh bla bla bla!
 Ti je hipokrit e jo besimtar e ti han mut tu kushtu bureku 50 cent, edhe qe ski pare une ta kisha pagu!
 Ku po ta nin ty kush qka thot, as sheje sta ka lan bile!
 A pot hargjon frigoriferi ty hiq !
  Mere grenellin qoje ne shpi!
 Ma shum po te dhem ty se atyre qi ka shkarku!
 Rri ne shpi, rri ne distanc e mos e hap gojen pa lidhje.Pandemia covic 19!
   Te kisha preferu me votu VV.Respekt per ty i nderuar!
 Nashta ta bon hasha ( keshtu i drejohesh ti) naj vend ne qeveri se edhe ashtu ke leh shum kohen e fundit e meriton ni post!
 Krejt shtetet e botes kan mafi kurse ne Kosove mafia ka shtet!
 Kam pas respekt per ty po dole qe je nje rrenc i keq!
  Agim veliu a je ka e din qe je figura ma tragjike ne kete kohe epidemie!
    A e din pse mocioni ne kete gjendje ?Sepse po na e cungojn… 
   Kam frik qe kan me sundu edhe shum vite keta hiena, une perfundimisht mendoj qe… 
   Heret a po von e verteta do te dal ne shesh se kush kend e ka vra , edhe VV nuk… 
  Ty sen nuk te veta i nderuar?
 O berat a i kerkove LVV-se falje per shpifjet qe i bane per sulmin ndaj teje, nuk dolen te jen te sakta, d… 
 O kta kan interesa per pushtet e jo per Shtet !!!! Me pas desht kta me punu drejt qe 20 vite s'ishum ne ket gjendje .
 Ti je e keqja e ketij vendi!
 Sa qesharak qe je o deshtak!
===