 Fara budalles eshte problem mu hek h3h3
Kur jemi te pushimet luksoze. Ramush Haradinaj si Kryeminister per qef te vetit ka nejt 9 dite nder hotelet me te s… 
 Xeni si ka mediat mas vete. VehbiU i ka + shoqaten e gazetarve qe menihet thirret mu nal "linçimet"
 Une menoj qe me pas lujt Anglia lojen tipike angleze e kish fitu lojen, po zgjodhi ate italiane edhe qata hupi
 Percjell futboll koxha moti, ne shumicen e rasteve Italia bon ata qe boni Anglia sot, u mbrojt edhe… 
 Sigurisht se ka meritu aspak :p 
 i ka dit senet me kohe 🤣 
 Njejt i kem edhe Muja e Halili, veq vendet e tjera te ballkanit me emra tjere.
 Ne fakt gjarpri u kan mbrojtsi kulles, prej brejtseve qe i kan hanger te korrat. Gjarprit t'shpise nuk ju kan tut as familjet.
 Bazohet ne pagat e sherbyesve civil, pagat e njerzve qe punojne ne shkolla, posta, komuna qdo vit kan pas rritje.
 Veq edhe vizat me naj hek ka met 🤣
 Mu bash e kunderta, dje kesh me marr thash po du AZ, tha jo valla skem veq Pfizer 🤣
 Serbet genjejn qe kishat ne Kosove jane te tyre, Shqiptaret po ashtu
 Po bre, ama diskriminim. Jo krejt po mujn me marr vaksinen
  Shumica e arkitekteve ose studentet nuk kane pasion traditen po vetem . Nuk ka edhe fort stud… 
 Po de, pikerisht per qeta e shajn. Se sipas tyne i ka ble krejt politikant, e ka bo Shqiperin vend te pa… 
 Po le ta qin nanen krejt ren ather. Ju dhifsha nviza tpunes qe vonohen ka 2 vjet edhe nfund i anulojne
 Ne Kosove hala fort nuk kan nis me permen qaq. Ne Shqiperi e shohin si fajtor per gjendjen e tyre, me dem… 
 Ku tjeter mundesi ma e mire me vjedh ne tendera se sa asfallt. Toka te shpronsuara me vlere shume here me… 
 Pak kan ra kta n% sa u dasht, tash priti sa skandali ka me ju dal ktyne
Thojshin VV-ja po e bon situaten me te keqe se qe eshte ne Kosove, e ka veq per popullizem se eshte punu ne kete ve… 
 LoL dmth me qaq ka mjaftu mu konsideru si "parti e djatht" 🤣
Gati per plazh starter pack 
  E ka ameriken e grenellit hehe
 Ja shok une jam i interesum per gjith me hec, per 4 jave veq halitna keq nuk me rrihet edhe ma hiq ne Kosove masnej 🤣
 I ndrrojm vendet kur dush, pak qe tu ka bo bajat ku je 🤣
 Po me del pune me marr frigorifer me vete 🤣
 Faleminderit shqipe, po duhet mi flladit dyqysh nket nxeht 🤣
 Hahahahaha qfar syni e paske, e vrejte. Me thojke njani Bleta Bleta ka qebapa e birra. Per shkak te emri… 
 Mergata veq kish nis me mbush qytetin ❤
Never mind, e gjeta nja. Se di nese pronari eshte shqiptar veq kamarierat po folin shqip. Çebapat on fire, mos e kq… 
 I rash anej, mu dok vend i vogel nuk hina, masnej e pash qe e ka tarasen permas ne google tu lyp vene tm… 
 Problemi eshte te mediat tona, e njejta vlen per gjith turistat. Si mase ndaj pandemise me demek e kan b… 
 Po qka po thu me ba, ke qellu vend i vogel. Dika duhet me u majt. Me rusi nuk po bon, me turki jo
  E kuptushme, dje Ronaldo, sot Albini 🤣
 Kjo ma katastrofe me qka duhet mu perballe qdo dite
 Mu ma inati po mvje qe TV e portalet pe prezantojn si Cryptocoin i shtetit, thu ti zyrtar qeveritare e kan bo
 Shqipet ma para investojn ne Safemoon e tjera se sa ne kete shitcoin te Kosoves. Eshte mashtrim edhe pike… 
 Kjo eshte scam, personi qe e ka kriju eshte i njohur per mashtrime te mergimtarve me bileta. Ky mire boll… 
 Khuuuu pshtim ish kan. Kjo kish qel faqe te re ne historin tone te lasht
Valdete Daka mas shkarkimit 
 Dmth PSD jau paska majt zhagun. Bravo ju koft tybe. Fort pi hajm provokimet me direktiva te beogradit
 Pse Serbia ?! A nuk ke PSD qe i boni a ?@
 Ne rastin e Fazliut ka video ku i afrohet policit tu mos ju bind urdherave. Ne rastin e Sveçles nuk k… 
 Pse bojshi ligje me denu sa jeni kan ne qeveri pra. Pse nuk i falet ju para se me lshu poziten. Bile kishi fitu naj vote :p
 Super, njejt duhet me bo edhe me kishen ne oborr te UP
  2her refuzim viza polake, pandemia sene fore vk 🤣. So te dasht me legale, se per vi… 
  Ku mu gjet qeta qe po qesin nzeze 🤣?! I kom provu menyrat e ligjshme, pa rezultat.… 
Si per punen e vizave qysh kan rrejt h3h3 
 Nuk ka muhabet, pa kto ne tavoline 
  Jo, Kina sot ka nis bisedime kinse me bo BAN crypto. Saher e bon kta, bjen çmimi. Kjo ju j… 
 Ahh, ne Shqiperi fort kan punu per te miren e shtetit
 Ku me gjet ortodoks ne Kosove 🤣
Edhe masnej thojne: "Qika keqe, e vrajti baben. Ka mujt mos me fol, sot baben gjalle e kish".Prap fajtore viktima… 
 Me demek " nese nuk blehet me pare, a blehet me ma shume pare, papi". Parja eshte veq leter THUG LAJF
  Hahaha ja pa ty sbon hiq mu nis, na kthejn 🤣🤣
  Na si kem asnjanen per fat tkeq
 Nen 1. Nuk eshte Krishti  Nen 2. Jo vetem Krishti mund te paraqitet si shenjtore.Nen 3. Ku po e di ti perkatsin tem fetare !?
 Knaqsia eshte e dy anshme shoku jem, pak ka njerz si ti nkete vend. Edhe naj dite e tani muhabetet i r… 
 Dikush per kto ja kish lan fajin qeverise Kurti 🤣
 Rroge 250€ nuk ke ne sektorin publik, shume me e madhe eshte. Ne sektorin privat jane me shume dite pune s… 
 Qka ka tboj fotoja jem me kta, ose me Krishtin. Pse po dashka ni foto e tille me kan Krishti !?
 Nuk eshte hoxhe, Burdush hesapi ish
 Ohh hiq bre edhe hoxhe me kan, nuk ja jep te drejten ktij me bo hajgare me viktimen ne radhe te pare.
Profesore idiot! Perdore nje rast te dhunes seksuale per te sulmu fejen. Jo cinik, po selak njeri 
 Nuk e di nese vazhdon ende kjo tradite. Nuk me ka ra me pa gjalle kete tradite
 Ide e mire, veq edhe me naj lan DEA ndore tonen kushi se kish pas 🤣
 Nuk eshte mush mend se, edhe gjeneratat mas meje te njejtin problem e kan pas me te njejtin arsimtar
  Si femije ne klas 8te, e kem rreh arsimtarin qe i ka bo kto sene. E vetmja arsye sepse ars… 
Ne klase te 8te, masi jemi rrit pak me trup do djem te klases,  mas mesimit e kemi nxan arsimtarin e muzikes e kemi… 
A i dini me marr cucllat ngoje, a ju kan rrit gjoksi se ndihmon me pas za ma te mire. Trupin si baski, trupin si fi… 
 A shkoj a jo ?! HeheTi per me kcy, me ja huq me te madhe skish ma tmire
 E ka bo per veti, biznes hesapi per ta. E qet çmimin pertoke, e blen edhe rritet hehe
 Para se te jane arab, jane njerez qysh kemi qen edhe ne. Njejt ka bo edhe UÇK, ka sulmu postblloqe e k… 
 Njejt si shqiptaret po don me than a?
 Pak von, po kurr so vone :p
 Nuk i dihet bre 🤣
 Hahahaha edhe ti a ? Jo, duhet me hi me kqyr ne web mi plotsu te dhanat me confirmation number. Shpresoj ti bile je selected
 Nuk e di valla qka duhet me kan, a qka duhet me bo me ik prej ktu. Veq Burdushi mka met pa provu me qel udhe🤣
 Le ti pyet bashk partiaket e tij hehe, ata e din ma mire
 a ka mundesi me ndermarre diqka rreth ksaj?!Shkoni ne vizite tek njerzit qe jetojne rreth Kalase, te trego… 
 A mujna me dit pse eshte vaksinu ky ?@
 Se mos po ju doket jugonostalgji he he he. Kap more modifikone ma mire adhurimin ndaj atij qe e boni me u dokte Kosoven agre…
 Doge, Elonspace, Safemoon e do qesi
 Dikush, a din qysh me u bo +1 ne kto statistika. Paguaj per kete proces 🤣
 Problemi vetem eshte qasja e gabuar ne gjykimin e tyne. Nuk kam qef te denohen per krime qe si kan b… 
 Nese kishem pas konsensus te brendshem, mu pajtu ni here te vetme. Ish kan mire mi ndal bisedimet, e… 
 I kan ra ne fije tash, hala ma mire ne Kanada
 Po, faleminderit, se ky prej Hanes ish jo BE hehe. Ulu 1sh 
 Foto prane flamurit kane, po shume rralle e hiq kan bo presion qe flamuri Kosoves me kan i pranish… 
 Njeri qe "se don" kete flamur, me mbrojte me shume se kta krijuesit e ktij flamuri
 Nope PSD e Shqiperise eshte AAK. Boikeni me shok jane PSD qe na ne Kosove e njohim 🤣
 Normal ajo pune mer, Tom Doshi ky gjigand
 E ka fitu nfakt oskarin ama pa os hehe
 Jo more ne rregull jemi, veqse me than tatim paguesit ma te mdhaj e qata kan perfitu nga pakoja esht… 
 Njejt pagun tatim si ni biznes i madh si nja i vogel. Nuk eshte qe bizneset e mdhaja taksohen me shu… 
Urime Dita Tokes ✌  
Kolegjet private ne Kosove jane perfitues nga skema e rimekembjes ekonomike, pse ?!Klasat i mbajten online, stude… 
 Marre prej neve qka kemi duru qe sa vjet
 Ekspertat ne Posten e Kosoves dhe rrogat e tyne jane mbi 2000€. Kta eksperte kan pru gati ne falimentim
 Jo, ne poste publike ne Kosove ka shqiptare qe i marrin kto rroga te mdhaja dhe vetem dèm kan sjell. Eksper… 
  Shumica e politikanve pagujn banoret ne veri, "qira" per mbajtjen e maqinave per mining.… 
 Sa forja "votone demarkacionin merrni vizat" i kena hanger prej tyne
 Jo bre se nuk eshte. Fakt qe ka islamofobi edhe standarde te dyfishta ama jo qaq sa me pas perqarje fetare
    Tophane, dmth nuk ish kan hera pare qe bohet ni sen i tille 
  E di, qata thash qe ne krejt anet e Kosoves kan bo ksi sene. Shpi te vjetra, objekte kultu… 
  Qashtu po thojne, veq 0.01 besoj qe dikush e ka pershtat qaq mire kete pune kur so qe ka n… 
 Nuk po doket photoshop veq
 Ai manastir nuk eshte i serbve
Shtetet plot histori, kujdesen qe ti ruajn ato per gjeneratat e reja. Ne anen tjeter Kosova, ni vend i vogel i pa… 
  Nese je ne kontakt direkt me Pfizer a spo i bje qe i merr direkt prej tyne a !?
 Me sa e kom ni Kamishin, ai pretendon mi marr permes ni pales 3te qe masnej ja shet Kosoves me çmim te ve… 
Ne anen tjeter, kta "gazetaret" zhbirues e hulumtues i paskan mledh do tipa me fol palidhje qysh Albin Kurti po gab… 
 Ama jo gjate negociatave, jo gjate procesite ku pala tjeter detyrimisht kerkon fshehtsi. E dalja publ… 
 Ku je Visar he drague, qe 1 vjet zani nuk tu ka ni per vaksina. Tash perniher u bo  e rendesishme vaksina
Gazetari hulumtuse, zhbiruse e qka dush thuj  asnjanen nuk e keni bo. Perpos faks newsit e propagande ndaj qeverise… 
 Nuk e shoh si te keqe, nese qajo qka lexova eshte ne plan pernime.
===