 ftone Jerichon n'ven shkaut bre sabahi mos ju nxont.
Ncncncnc per 2 euro e shesin kombin 
 Ma kujtoni qe provimet nuk permenden n'vere. Klm
  hajde se po t'thirrin
 Jo e merr Aguero me kerr Messin, jo shkojne me nenshkru kontratat, jo Ali Ameti e humbi Messin ncncnncc turp per shqiptart
 Do fjel i ke pas ndryshe jaran
Gjesti n'Kalabri, mjafton kjo si serotonine per sot ❤
 Pse t'drejtat e trotuareve s'po fol sen a? Marre
 Une çdo nate para se me nejt edhe 2 ore tjera: 
 Mo ma harro tej Kamjanin
 Mos e vjedhe qeto HEH.
 Ku jon? N'Sarande pse ku tjeter
No one: *tu qit selfie me çdo person t'mundshem*: 
Gjakovart masi ta shohin qe pejont po dhezin n'gara olimpike 
 A don me investu najsen me to?
O vlla çka ka ndodh me trotuar se luva?!
Jau kisha editu ma mire po nejse  
 Pershendetje Dardan, si po kaloni me pushime? Moti mirë? Ketu ne Sarande eshte shume mire koha.
Ohaaa kur pi qesin kta kolegt e mi vaksinat, me demek merrne se e sigurte osht. Diqysh une kur e marr, pse çka keni ju 🥴
 Jaran nuk m'vyjti me e pa ket ven t'shkrete n'kete kohe.
Prej ktij momenti Fortnite nuk eshte prioriteti i ktyne fmive 
T'jau rikujtoj kete video ❤ 
Llapjoni ja len emrin fmisë Shend a Rron.Vllaçko a po bohesh gjakovar me zor a çka o puna?
 Mu la lahen e mu ter se di
 Mjafton kanga e mire 
Op edhe e hupi licensen e punes per 2 jave  
 A din gjo kush a po bohet qeky trip n’Sarande se pak shtrejt kndej t’nxerri najsend
 Ku munet me t'nal shteti qe ti mos me pranu pagen 250 euro? Ose me pranu pagen 5000 euro? Eshte teme tje… 
 SHTETI nuk pagun ma pak nji mjeke sesa nji mjek, nuk e paguan ma pak nji mesuese seda nji mesues. Me ko… 
Cili shtet pe pagujka grun ma pak se burrin per punen e njejte? 
 Haram me mi pa komt najkush 🤗
Mos dilni n'Sarande se po shihshi katunar t'Pejes 
  Dy partite kryesore: Partia Demokratike dhe Republikane. Pytje e testit sigurt.
Kafet ma t'gerditshme n'planet, dmth n'Shqipni 
 Mfal qe po te qes prej modestise, a jeni duke e lexu librin e 3'te ne kto pushime?
Qenia ma e poshter- gazetart. I hijka njerit n'kerr me shti me kajt, tani me i bo video me mijra llajka. Ropt jau qifsha.
  Profil fake, ju lutem raportojeni Neser nuk do te shkoj ne Egjipt, mos me uroni rruge te mbare.
A n'mjeksi je a? E çka po ta merr menja per vaksina ty? A thu çka kane qit n'to?!
Edhe me ndriqim dijne me e lidh feminizmin papapapa 
  PHAAAA qysh ma permwn F*tijen more nket vakt ncncncncncnc mi kujtove lektyrat
"A leper po t'dokna une ty a çka? Ku â mishi?" 
Ndoshta e kam gabim, msheli gropat o zotri 
E pse po dufka me u krahasu me copa muti? 
ME FLAMURIN lara lara hehehehe respekte per alpin kurdin 
 Futbolli i grave ne Kosove osht ma i sukseseshem se futbolli i burrave. Feministet qe tash po mundohen me perfitu ne baze t…
Mos harroni çka mutin jena na. Na lshon neve shpejt 
 o sis sje as e para as e fundit qe je tu pi koktell qa kari 13 poste vlla
 E qka ka pas per buke a kallxoj?
 Qysh ma prish diten ma kujton qe ekziston Sali B*risha
 Podujeva e Azetit &gt;&gt;&gt;&gt;
 Loqki jem si me kon e Prishtines, qe t'sheh qe je katunar tthot qe osht me rezervime 
  Ka zevendsim, ama nuk respektohet distanca kohore ne mes udhetimesh. Pra i njejti shofe… 
  Flej edhe pak, nashta ma vone 
 Ardi s'i livdon senet e veta. Nuk osht pejon dmth
 Ama dmth metin t'pazime per neve. 
Shyqyr e kryjta afatin para se afati mem kry mu 
Ama qysh metet si pa zi diqysh 
Kur tweet ama s'kap asni llajk 
 A din qe je n'toke Shqipnise mor p*dh some
  Kur ka desht ajo: o ti njeri a u kulle?
 A s'qite foto me to a?
 Qeleee: e pash 1 qike, ka hyp n'Ferizaj, ka kesh kur ka thane Riza "kush osht per Shkup"?
Jaran Bajram ke ardh me bo, jo me ta dhone transkripten e notave
 25 euro bakshish n'banke i kisha dhon, ehaaaa
 Nata e Bajromit be shoc
Tu mos kalu provime t'fks n'Korrik since 2017 
 Sa libra i ka shkru ky n'pandemi? Hah.
 A sa meme shkon posht
Refuzo apet Bardhyl he emri tu harroft
 Veç thuj taksistat. Komuniteti i taksistave jon ma te poshtrit.
Une tu u kthy prej Tetove mas afati: 
 Wuuuawwww bual, a ja ka uru najkush please?
 Probleme psiqike plus pagujna per to.
 qka po kqyr vllaqko, a ski pa kurre djale seksi tu honger kifle me xhem a?
 Mo fol kot e kot.
  Transferat tu e vajtu 1000 euro semestrin: 
 Duhet me perfundu me biseda n'Hello
  Ki qef edhe Tiki me e dramatizu, e tani me thirr analista e qeshtu 
 I bojna foto njoni tjetrit de
 N'sa e mi vaksinimin?
  3. Mos i harxho 200 euro
  jo mos ja qit inicialet tani 
"Nuk po du me m'kalu vera si krejt verat tjera"Bro qekjo as si verat tjera nuk osht po nejse 
Ikan.harru rrajt shiptare kto ncncnc per qishtu letshkon nserbi ncnc nc 
 Ndersa tetovarve jau permendim kularin, g ju duet kulari?
 Shtej deftoje tet m'pajt ene mu. Ama mo mfkat ket vaket.
 Ashtu e kane rolin "krijetaret", shtoja rolin me kry provime pa msu.
Jom tu i ra pishmon qe se pyta Ermalin mbramë a ta kane lon n'dor a jo?! Qaty ke be nanen!!
Pash ropt a din kush çka u kon ideja e flamurave mbi shpia qe ishin tu u ndertu?
 Qe del prej meetit n'vend se me bo share screen.
 Naten vijne asi mesazhe
Sex is good ama kur po ju thu "kqyre kur te hup" edhe pe hup penallin phaaaaa
 A s'jon crtana a?
 Italia na ka njoft qata e dhan golle
*jo bre s'ka ku shkon ma keq*Korriku: 
 Se m'ke e dille
 E nime ke shku a?
 A ka ma denim se me pagu 200 den provim qe s'ki me dhon a?
A Podujeva se din qe ti ekziston HAH. 
 Trauma me 3 provime t'kalume jo me 6 
Kur s'jon bo bashke qeta une si besoj kerkujt mo  
 Çdo fitore kunder asaj tetovares eshte fitore e krejt neve ❤
 Llajkin e 100t ejjj
 Haj kuku far maltretimi 3 semestra klasa e 3t
 Sa lande i ka pas ky?
 A prite me 5 euro me fol n'krejt Ballkanin a? E qysh mu nxjerr shtetet e tjera kur Vala ta ofron me 5 euro pa limit
 Po qaq kushton edhe n'Ks. Ose jom tu e keqkuptu une
 1500 more osht provimi
Ka mu qudit naj kafshe kur te lexon kto 
 A osht te hymja e Albinit?
 Nese hala kqyr TV je i njejte me ata qe shfaqen per çdo natë.
 Si Messi me Barcelonen qashtu 
 Pse a bohet ma berllog a 
Po bre interesant kjo neja n'Ultra, ama 500 snapa i keni qo o t'nderum
  Shuj se shkolla e Ramushit i din ma mire 
Ultra party ama arkitektura mshel se covidi. Nejseeee
 12 Korrik n'Prishtine, per ma shume t'kallxoj sa t'marr vesh.
Nejse me 12 Korrik paska organizim. Dhe une sigurisht se nuk kom me kon n'Pr  
 A s'pin Pepsi ti a?
 Jo be kam fol ama nuk m'ke nijt ti 
 Palo more ej 🤬🤬 gjermant na kane nimu n'lufte
 Boni vet qeto letra edhe jeto pa kerkon 
 Xhakaaaaaaa *trauma prej S*rbi- Zvicer*
 Ani thojka mi kqyr punt e tona  
Qata s'jom bo stomatolog se nuk bohesh doktor  
 Kallxoja indexin bir, qysh tshkrun aty
 Shume gabim eshte kjo. Nuk e di si mendoni qe profesoret pranojne keshtu, ata nuk pranojne dollar po euro.
 Ku je o Vijon artisti hehehe
 Dhallën me pi me doren tjeter...
Po se diten jeta qe bohet  
Ai veç n'shkolle fillore edhe i paska dit senet ma mire se kjo. 
 Shtaj mo fol kshtau be shoc. Tet gjej ku ije ene...
Ki qafiri pejon ka bo hajgare me fe, ky se din qi xhehnemi osht hala ma nCet se Tetova. 
 Me Valdanos osht qekjo ama nejse
 Bual, fmija po kqyr me qel far workshopiiii
 Ec me shift hehehehe
 KU JON KTO KSHTUUU??
Dren Abazi tu i mshu boksit. DM for video
A pe kryjna afatin?!UT: 
 Dekaaa… meet macat e arkitektures (kotelet🥺🥺🥺🥺) 
S'po di me qel 1 grup "Marakli t'preliminarit"
 T'ish kon polak bile
 Edhe tu u ndje hala ma i poshter kur e sheh qe po munohet me mbijetu hehehe
Miremengjesi krejtve perveç  qe qon snap prej Ulqini. Allahu t'shkatrrofte o qafir.
 Ma shpifen kto renovime
 Mbrojtje je i mire, ama s'po thirr mo.
  Falja e gjakut hala trend. Hoxhollaret edhe pleqt ndermjetsues. Shekulli XII.
 expressi ne ni linje me beogradin.
 Ti me dit e kishe shkru emrin tend mire, marre 
 Flm vlla qe e lshoj ket video para t'shpise
Qysh more ekziston landa "Futboll i vogel", nejse nese e keni cone kodin se d mduet.
Kur i kapi 100 llajka masi ma bon rt  
 A si ke msu hala permensh a?
 Prof. Mazllumi kur te sheh qe Flaka e din kur ka me dek: 
 Me bicikel tonden a temen heheheh
 Ama bual mos harroni me ardh n'Workshop n'Novi Sad. U shprehke snobi n'Pr.
 Ama klimen e detit e ka
 VV i fiton me dure ne xhepa, fatkeqsisht.  Ky kandidati i LDKs eshte i diskreditum hala pa hy ne gare, alte… 
Une isha anku qe Boratit s'munesh me ja bo bllok edhe n'jete reale po veç n'Tw  
 mi marr krejt nenshkrimet mdoket si mi kry provimet - BH
 A mysafirin e nanes
  Hiqnja dikush qatij perpara masken se deka
Masi e kry kanga e Mossit, kojshia nalt e lshoj Adem Ramadanin. Aha.
Kur kthehni prej UNUMit mos harroni me i majt ngjit shiritat n'dor, nja 1 muj duhet me kallxu qe jeni kon.
 Po kujdesna per shendetin mendor t'u mos i kqyr story-t prej UNUM-it
 Edhe ty tu pranu, tjerve mo asnjo hiç.
Amani ju kofte qe se postoni mo kerkush, krejt e kena qit bre diqysh 
  mos posto me twitter t'Ardit mo
 Te Princesha ktu broja jem tu e prit Muharrem Ahmetin
 U bA mut i nderum.
 bal un kqyri anime amo s’ndikohna shu... 
 pidhat e nanes nime e qojn bothen dom n ato shkalle t dit e natit ka 2-3 sahat veq me kqyr me nxon naj pidh me rrjeta t peshqv…
 Jo wlla qajo osht Rechajca ama neyse
 A qajo pe lshon a? Don me i shkoq pllakat tu i fshi
4 dite me rend provime: 
  "Tu pa, tu ba"
Edhe 1 e Hane ekstra n'Tetove, nejse e shtyjna diqysh
 S'po du mu livdu ama korridorin e pata personalizu 
 Me profesion politikan ama qeee
Arsyeja pse duhet me e urrejt kete qenie humane 
 He be ropt e shtijke me hjek kamionin me ja lshu udhen me ec
Pa ovendime ju lutna 
"Buaaal a ke mendu najhere mos je vegjetarian" 
A Bardhyl t'shkoj ftyra... 
 Qekjo "ndoshta neser nuk jam gjalle" a eshte motivuese?
Hyre hyre analistin, ani jepka menim per vaksina a knej qytetin llug 
Qysh po m'doket si me e pas postu un ma heret qeto  
 E pse je te banesa jem?!
PARA SE TE THUASH SE FAJTORE JAM UUUUUNE
Okej kolege nuk kom kohe me tu pergjigj ne 50 pytje sepse nuk po na han per temen tande t'diplomes. Suksese.
E po moti e kane bo n'Ks kto ehaa 
 Pak ma heret e ngova. Respekte.
Me qet tru s'po muj msoj anatomi qe plote muj, ama tekstin e far kange 2009 hala si me msu dje.
O Mark jahudia, diten e tane mos e pafsh. Klb. 
Kur thirr  me dal per treten here gjate dites 
 A nami po bohet
Informacioni qe taksisti ma dha: "Ermal F*jzullahut ja kane lan nusen n'dor" eshte ende duke u perpunuar...
 Bile s'po ta tesh n'T*tove po n'deti.
 Nah. 1 njeri me 1 gru.
===