 Ma perpara ndodhe kjo. Vec ta gjejme kush tash eshte shtaga 🤷‍♂️ 
   E korre ate qe e mbjelle. Rri se mire po bohet
 Miti per Shpend Ahmetin ka rene, miti per Arben Vitine eshte ne renie e siper, miti per Albin Kurtin bjen edhe disa muaj…
 Kryesorja me 6 dyjat . Btw Shqiperia i kaloj 24 oret e para pa asnje pacient te ri ne spitalin e infektives prej marsit 2020
 Shpend e ke harru edhe rrymen e trete por jo per nga rendesia, Jugonostalgjiket.
  Termi demagogji perdoret kur flet ndryshe e vepron ndryshe. Per mos me i hi fellit se na duhen s… 
  Besoj qe krejt jemi per me fitu vendi, per kete arsye diskutojme e kritikojme. Por me demagogji… 
 Paramendo cka ish dashte me ju bo atyne qe kan perdore arme ne kuvend
  Kan votu per shkak qe deshtimin individual kane dashur t'ja faturojne te tjereve. Dikush e gjen… 
 Fulliranta. Kauza vec per me ardhe ne pushtet.
 Albini ju tha me pa andrra ktyne te Evropes por problemi eshte qe ne fund te fundit vetem andrra kemi m… 
  Vitia edhe Durmishi i paguajne ish punedhenesat jo pse i dojne, por per shkak qe ata mos me fol se cka dine per ta
   Kjo Rinora po mundohet me ra ne sy me mar naj post. Mos ja nxin per te madhe.
   Hala nuk kom mbrri me kuptu pse patjeter duhet aty me u ndertu
 Haha po po. Krejt i kan fajet pervec ktyne
 Jon msu keta prej fushate ne fushate. Si i ka pa kallabllak ka mendu qe ne fushate eshte. Vetem amaterat… 
   Kjo e tregon brumin e tij, menyren e te menduarit dhe deshirat e tij. Ed… 
 Po po, na fatekeqesisht jemi eksperta jemi per kete pune
Cka ndodhi me fushaten ?Po del qe edhe kjo ka qene e motivume politikisht.Tash edhe i mbyllin, edhe ju s… 
  Alban aman mos cito se ta nisin peticionin per shkarkim prej Twitter-it 
 Keta i kan mar vaksinat per veti
 Citimi eshte citim. Me citim nuk mundesh me pervetesu vepren. Njeri ka citu, e faji eshte te ata qe po e asociojne.
Ajo cka ka thane F.Konica per V.Osmanin eshte e papranueshme.
Prej ketij momenti nuk ka me gabime, por vetem pasoja...
 Ma mire me i bojkotu ata qe po na qojne ne zgjedhje se procesin.
 Pa dashte me hy ne detaje, vec as te hajrit nuk ka bo dicka. Mos te harrojme qe eshte nje prej dikaster… 
 Pa dashte me diskutu per ministrat tjere, veç Arberia? Eshte shume nen mesatare.
 Ndoshta e fiton naj post, por politikane kurre nuk ka me u bo.
    Per kta, determinues i cilesise eshte vetem orientimi polit… 
 Eshte ne vizite ne Tirane 
 Albini bon matje te opinionit. Varesisht prej rezultateve varet se a reagon edhe qysh reagon, nese reag… 
 Jo Gani nuk e kom ndermend me iluminu askend.Ti i ke qendrimet tua ose i perfaqeson qendrimet e dikujt(… 
 Qe nji kohe m'dalin kta Tweetat tu. Jom tu u mundu me i ra n'fije cfar problemi ki, po pa sukses. Ishal… 
  Opinionet jon per dikon tjeter ose per nje qeshtje qe nuk ka te bej me ty. Qendrimet jon pe… 
Kur e menon njeri se sa hallakama ka shku per Çakorrin me Bulliqin...bile e kemi hupe edhe liberalizimin per kete p… 
 Mbylljen ja paske jomsh pak Beratit. Hehe.........
 Vec deshta me te pyet pa "paragjyku" a e keni ndermend me marr naj veprim apo jeni dorezu?Mos te… 
 Prej kurreshtjes: A po tmajn me zor?
 Ma shpesh mar tiketa per shpejtsi se kupona fiskal n'kafiqa
 Te njejten gje me ate qe kan votu per ty.
 Akt vandal pa diskutim! Po nuk bon mu cudite per nji apel qe e ke bo, edhe na per cdo dite po apelojme te… 
 Prej romanit te Umberto Eco's. Libri shume i mire, filmin nuk e kom pa.
 Jo gabim e ki. Mundesh me pyet Adonis Tahirin edhe mundesh me i mar logat e qendres se thirrjeve ne… 
 Ani mire boll. Mundesh me lyp Golf 3 e me te dal qen i sharrit 
  Ski faj ti po ky lladupi paska kohe teper, paska nise auditim te profilit tem . Nashta mson najsen bile 
 E ke kall krejt . Nja 10 minuta mu deshten me mendu cka ke dashte me thane 
 Gati krejt grupin parlamentar e kan aksident elektoral. Pahiri jan aty ku jane.
Mbajtja obligative e maskave eshte dashte me hy ne fuqi qe nga ShKurti!
 Kjo zonja e meriton nje padi te mire. Si nje profesioniste (kryeinfermiere) duhet me dite per nevojen e… 
 Te shpresojme per te miren e krejtve!
 Egocentrizmi nuk po i lejon! Injorances e arrogances askush nuk ja ka pa hajrin. Duhet bashkpunim!
 Nese ne Mars pandemia na ka gjete pa pregadite, prej atehere e deri tash ne eshte dasht me i shtu kapacit… 
 Kushtetuten e paten bo si tepison, kah u sillshin e shkelshin.
Bash kisha pas qef me dite cka ka bo Vitia ne qeverisje e tij e qe une nuk e kom pa?1. A i ka rrite kapacitetet e… 
 Historikisht, ne kordinim me Serbine...
 Kur shqiptaret perdorin argumente te Serbise situata behet e quditshme, natyrisht per te keq.
Ti djali i mire nuk ishe ne terezi hic. Paske kogja probleme si shoket e tu qe ju kryjne pune armiqve. Nuk ki nevoj… 
 Po ajo po dihet, po ne anen tjeter eshe njerezit nuk i kan krejt fajet. Menaxhimi medial(i rrejshem) i situa… 
 Gjermania nuk i ka testu ka 40 veta ne dite qe me mujt me dal Merkel me bo popullizem si te na. Tash bile po… 
 I kam lexu disa. Por vec nje ta kisha rekomandu, jane profesor te shkencave politike me renome te Harvard… 
 Shume mire po te kuptoj, vetem prap po them qe dallojme ne vleresimin e rrezikshmerise se ngjarjeve. Jemi… 
 Po te kuptoj. Une edhe ti po dallojme ne perceptimin e shkalles se rrezikut. Per mua nje politikan me ide… 
 Vetem potencoje kush e kerkon, kush e ka padite. Nje numer i konsiderueshem i shqipetareve te Kosoves ker… 
 Pajtohna, per kete arsye ra qeveria Kurti
 Pa dashte me amnestu askend, retorika e krimit 20 vjecar eshte pjese e politikes populliste qe po e perdo… 
 Per fund se u zgjat. Nuk jam as per njeren as per tjetren. Vec prap besoj qe gjuha e urrejtjes pava… 
 Mendimi i jot eshte mendim i joti. Une mendoj qe nuk eshte i shendosh ky diskurs. Paramendo "neser"… 
  E kam vrejte qe te na keqkuptohet liria e shprehjes. Lirine e shprehjes e kuptoj si liri e me… 
  Secili qe e ul nivelin e debatit dhe ne vend te argumenteve fillon me ofendu, e meriton nje Block te madh :)
  Deklarate tipike populliste e VV &amp; Osmanit
    me lot kom kesh. Ju perzi krejt, harroj ku eshte edhe per cka po flitet… 
 Kur ju vjen inati e nuk keni argumente per temen qe diskutohet, qoheni e ofendoni. Edukata ime nuk bjen ne nivelin tand!Suksese!
 Albini kur e kuptoj qe nuk eshte i pari ne dialog, filloj me tentu me zvarrite procesin. Fillimisht shp… 
Nje njeri normal qe perdore logjike te shendoshe duhet te behet konfuz me keto deklarata e fundit te LVV. Krejt kjo… 
    Retorika anti-USA, Kurtit ia ka perfundu karieren politike ne Kosove. Ketu jemi e kemi me pa.
    Strategjia e Kurtit ka qene ndertimi i kultit te personalitetit, n… 
   Alban, arsyeja kryesore e krejt kesaj hallakame eshte deshira per me ike prej… 
 Te na shumica nuk e dijne se as cfar rregullimi kushtetues kemi. Kosova eshte republike parlamentare… 
 Pajtohna plus qe ne rastin konkret nuk eshte puna as per parti, por per individ
 Jam i bindun qe edhe ata (komplet zyra ligjore e KM) kane qene te vetedijshem qe nuk kane rast. Kjo cka p… 
Kjo Fortuna Sheremeti ma mire e ka edhe nje here me i hi librave juridik, me i perserite se sa me nejt ton diten tu… 
 Jon kogja nifar sallate mixe e ideologjive. Po mbi krejt i bashkon nevoja per me pase nje lider se ndihe… 
Argumentet e  per kushtetuten  
  Po kjo vlene vec per ata qe nuk e marin mundin me lexu vet edhe me u informu por zgjedhin int… 
 Se besoj qe behet heren tjeter
Po mendoj qe eshte momenti i duhur  me ja kthy te miren popullit Amerikan ne keto dite te veshtira dhe me ju dergu… 
   Po e shoh nevojen tende per vemendje. Kur me apostrofon mua te lutem te jesh me s… 
 Hic nuk po muj me i ra ne fije cka ke dashte me thane!Ti e paske zakon me spekulu edhe me akuzu palidhje… 
  Nuk keni faj ju qe tash e shfrytezoni lavdaten e kete status per me bo hajgare sepse ed… 
 Cka ndodhi me MCC edhe me Kosova C? Se a merret me cikrrima te vogla vete Kurtin kur ta ki me naj i… 
 Ka ardhe ne perfundim qe ckado qe fole, sado  palidhje i aplaudojne prej Egjiptit ata telespektatoret e… 
 Krejt po duket qe e ke lexu tweetin e  edhe vec e ke pervetesu. Ku eshte kreativiteti, k… 
   Alban e sakte. Por gjithsesi brengosese mbetet fakti qe vetem nje numer i vogel… 
  Po VV e ka pase te drejten e formimit te qeverise dhe e ka formu. Ka pase rast me propozu pe… 
  Gjurmet e Rusise shihen kur proteston kunder pavaresise se Kosoves, kur i mohon simbolet e s… 
Kurti e paska leshu edhe nje deklarate qesharake. Sa per korrektesi, nuk ka tentim per grusht-shtet por ka tentim p… 
E ka lezetin e vet me te qellu qe ne debat me te bo pytje nje injorant-arrogant.Çdo politikan qe eshte nen presion… 
   E para: Faktet kundershtohen me fakte e jo me paranoja (po e shoh qe nuk po… 
 Amerika nuk mashtrohet lehte, mos ja baj gajle. Ne vendet qe ata i cilesojne aleate (si puna e jone) kur d… 
  Nuk po besoj qe nje permbledhje e fakteve mundet te cilesohet si mjet per interesa politi… 
Per ata qe kan harru, e qe hala mendojne qe VV nuk eshte anti-amerikane gazetari Valon A. Syla e paska bo nji permb… 
Kjo e keshnja po e tradhton Albinin. Po ja qet ne pah gjendjen psiqike
 Tregona bile ku ka me ble me t'lire
 Se kom prite prej Fidanit qe i han fjalet kaq shpejt. Ne emision me M. Zeken ka deklaru qe mas Ramushit nu… 
 Problem valla. Kemi pune me raste te randa te shperlarjes se trunit
Po rrezikojme edhe po supozojme qe mas 20 vjete pjeket e mushet mend Rroni. Na tjeret a mundemi me kerku naj demshp… 
 Kom lexu dikun qe humori i zi eshte sheja e pare e dementias. Ruju 🤪
 Kryesorja papunesia po bjen 
A po dihet cka foli kancelarja e Gjermanise Merkel se dicka qete sot ne kampin e VV-se....
 Po ajo po dihet. Menaxhim medial, tu i mshef rastet. Tash e bojn me zbeh efektin e virusit qe njerezit m… 
 Po pregaditet tereni per protesta
Shume paradoksale kur militantet e nje partie politike shfrytezojne nje rast tragjik per qellime politike e pas nje… 
   Fake News! Apo mos i keni perzi ngjyrat🤔
 shume funny k'to videot. Thanks qe po i sjelle sidomos ne keto kohe . Vec aman kujdes se jon do me tru te shperl… 
 S'ka sen prej tyne, vec fjale jon
 Hahaha po dihet cfar pershendetje e meriton. Po le te turren lirisht, nuk e kemi ndermend me u tremb p… 
Po e shfrytezoj rastin me pershendete liderin suprem me kete kange 
  Pasi qe ata dalin ne media per tu ankuar qe askush nuk i ka vizitu per tri jave. Eshte shkelje ligjore
  Edhe ti po duket qe nuk i paske ndegju deklarimet e banoreve qe per tri jave asnjehere nuk jan… 
===