 Mka ndodh me shku n'spital t'Sarandes me dhimbje dhe alivanosje. Pas 2 oreve pritje, ka ardh nje grua… 
  Super meme edhe nese i fiton 🤣
 Ky sigurisht njejt sillet edhe me familjen e vet.
 O mundohu sa dush me kthy ne humor, ama ja ke huq ballafaqe kesaj radhe, bilem tja kishe bo "crop" edhe qo… 
  Skane mujt me vendos a Diara a Rea, e kane bo 2 ne 1. Ose dy vajzat tjera jane qua… 
 Ani foton e profilit 
Une besoj se mund te ua siguroj emrat e laboratoreve. Sepse kam deshire qe ky fenomen hetohet si duhet. Procesi i… 
Jam tejet e brengosur per te moshuarit e pafajshem qe udhetojne ne aerolanet e njejt me persona te tille. E njekohe… 
  Ne Peje kandidati eshte OK.
  Nuk po besoj, se nuk paska bo "be" as ne veti as ne familje. 
 A jeni ne dijeni ju per pazaret per rezultate NEGATIVE te testeve?Te vetmen mase te qelluar (edhepse te… 
  Nese e shkarkon PDF nga faqja e Ministrise, i sheh kogja do nenpika per gastronomine.
  Pak interesant, po kohen kur qenkan inqizu pergjimet edhe Rexha ka ndrru TV. 1 vit pas kr… 
 Qka te shkreten ke bo ti qe tka kap Dardan Nuhiu ne dore? Apo veq je hi ne pako te portalit? 🤮🤮
  Ashtu per ashtu, ti Arber i bjen mos me e hek gishtin nga koka dite e nate. 🤣🤣
  Ani, merre pak mundimin e shikoje performancen!
   Aso kohe 1 ari ka shku 1 Euro.
  Jam kogja e bindur qe ajo hapsire mediale ka qene e kerkuar dhe mire paguar. 
 Na kish mashtru neve me njohje, qysh e ka mashtru vetën me vota.
   Super, kam dasht me kerku se ku muj me e gjet. Thanks për info!
  Haha, njerzt e Kurtit ne RTK!!! Never!!! Krejt qka ka ndodh eshte nje keqkuptim, se kane me… 
  Haha... bona llaf bona!!!
 Dikur edhe bari po u bojke bajat :)
 Hahaha 🤣🤣Ani ai tipi pas saj qe po sillet, garant tu e pregatit edhe ai ndonje fjalim 
   Po bre, mos te ke Buzhala, VV ske tu e kalu as pragun. Pfff, cfare truri, garant… 
  Oh more njeri i prishur, mos u nis nga vetja!
  U pa shume mire rezultati i vizitave fmiljare te bajramit te kaluar.
   Sundu? Dmth mire qeshtu me vazhdu me u sundu me xhamija? Juve u dasht me ju m… 
===