 Sun po i perballon rrenat e Agim Bahtirit mo
 turp te keni te bllokoni ne fejsbuk qytetaret tuaj veq pse ndajn kritika ndaj jush
 Mos u dorezoni, keta matrapaza do mesohen ta pranojn demolracine.
  Block kete e di moti po keshtu sjom shpreh kurr, kta pot detyrojshin me dal jashta vetevetes
 Mfal qe po shprehna bash qeshtu, ama Albin Kurti po lypke bash q** p*** e nan***
  Kete se ka postuar ne fb, se e din reagimin e qytetareve. Para syrit nderkombtar kishe po punoj.
 Krejt kto vyrtyte qe si ka Albini
 Kurti eshte shum i majt, rregullat e demokracise per te nuk vlejn.
 Ne Kosove cdo vit vdesin me teper njerz nga infaekti se corona. Hala se pash 1 reklam qe stimulon jeten e s… 
 Per cfare arsyeje te shkohet me pastaj ?
 Albini krejt kete kaos qe e beri dje, e beri per me te djeg.
 Na duhet nje subjekt i ri, nje subjekt i arsyetushem.
 Une mendoj se ki problem me drejtshkrim
 Nasufi eshte kandidat serioz i nderuar. Vete fakti qe e ka marr guximin me u ballafaqu me Vjosen pas ke… 
 Pikerisht kjo eshte arsyeja, Kurti po i perdor te gjitha mekanizmat per ti shantazhuar Deputet (perfa… 
 Kto i kisha blloku, influenca ma primitive po hyn ne dhomat tona cdo dite permes televizionit
  Ne qofte se do ishin 2 milion vaksina, ndoshta do te kisha besuar. Por ja qe sjan dhe per kete arsye te qofte turp.
 Faliminderit per punen, por mendoj se jeni hargjuar politikisht.
 hala pot shkrun Kryeminister i Kosoves o bir
 Ky asht nje rrenc i madh i cilli qe 6 muaj ka len pa barna popullin e vet sido ata te semur me leukemi
 Shpend labil ishe,qa po merresh me media kqyr puno o vlla.
 o kryeminister a e shikon HD ? 
  po kemi se jetojm ne zvicer
Me dajkon ma te mir 
Sa he kam pelqeeeeeeerrrn 
Hajde gzuar urime perhajer
Niher ramushi i keq tani thaqi tash mustafa... E kush koal i mir o popull demel... Jena msu nja me punu e 10 me hanger !!!!
  jan vanu pak ...
Njerzit mendojn se njerzt e mencur sbajn gabime,por une kam bere shum budallace :p
Musafir sot mikun tim florimin me djal
Telegrafi: Kush ishte Ibrahim Rugova ? ....
Urime festen e 28 Nentorit,le te jete dite e bashkimit dhe e vlerav kombetare,le te jete dita e cilla na... 
te na hajt se koka djali/vajza filanit sban pa e kalu.. ose ma e keqja kur shteti merr vendim me i hek 5 perqind... 
Platini na tpshurrum nfranc
Banesa tash po e merr formen :) 
Nese e keni pyt veten pse kurr se keni pa naj marketing te Lamborghini,arsyja asht se ata njerz qe i blejn nuk... 
Disa fjal te urta 
a mund ta quajm rrip te sigurise ? 
ne rast se maca e zeze jau pret rrugen,nenkupton se eshte duke shkuar dikun ..... B.B
A po ju pelqejn maskat 
Shqiperi etnike... Forca Bashkimi 
kush ka mundesi ju kisha lut qe ta dergoj 1 euro ne 55 049,qe ta ndihmojm luljeten per operim ... ju faliminderit 
shum urime per marinen amerikane :) 
Keta jan sternipat e heroit tone kombetar skenderbeut dhe nje ashtu miqt e mi,respekt per familjen kastrioti 
naten e mire dhe mire mbetshi, zoti qofte me ju :)
Benzin po na mungon
Sapo arritem kualicionin   hahahaha me nje chelsea suporter te vertet fisin
Kisha pas deshir qe qeta deshmort qe po bin ne siri e irak mos ti quajn shqiptar se ne portalet tona po ceken... 
Ktu po ma qet qe e ka lexu  
Shum mire qe e lirun hoxhen,une mendoj qe instituciopnen tone thejsht jan te brengosur per organizatat radikale... 
sapo i kam fshi 400 miqe ne facebook,ju qe keni mbet ju pershendes dhe respekt per ju :)
mu kan qe femant sa i kqyrin te pasmet e tyre npasqyre ushtrojn me i gra kerrit rykferc skish pas qekaq shum ndeshje nkosove.... 
Portieri ma i mire nbot (manunited fans logic) 
Linda ndjep e u rrita....
Ndikimi i Premier Liges Angleze as kohe skem me ba selfie qysh duhet 
Shum laaaaarg jem .... 
nese dikush te lendon,mundohu me kuptu per cfare arsyje e bani para se tja prishish ftyren.. 
===