Militanti i VV tu e bojkotu  
 E di qe pritjet i ke qe krejt analistat e sportit me qene si Ismet Munishi :p
 "Ndihmoni Bre Albinit sa te mundeni" Bini e ka krejt shtetin ne dore, buxhetin, policine, edhe hala mi ndihmu?
 Mihrija me duket me kompetente se plote tjere qe kom pa deri sot.
 Sa copa ne dite kane pase mi vaksinu?
Tu dashte mu kallxu i mencem shume. 
Gjakderdhja financiare po vazhdon. Qeveria transferon keshin prej buxhetit te oligarket.
 O bal mos ja fut bre kot, se ti e din qe so qashtu.
 kerkun ne marreveshje nuk permendet qkepja e tokes :)
Cka eshte puna e redbullit me shije te bostanit se sa mdoli gjumi?
 Pse spe bon ni tattu ‘nje mize mas veshi’.  
Tmerr, edhe mu njejt mka ndodh. 
Vec me si flamur i Kines dhe Rusise mos u vesh. O Di Natale Basha 
   Ani de le tja hiq shteti, por mos ti merr prej taksave tona.
  Edhe mu mvjen inati kur e paguj rrymen amo duhet 
Edhe bashkishet per syneti.
Edhe kredite per kerret qe i kane ble per my fry ne Kosove.
Qeveria osht mire edhe redbullat me ja pagu diaspores.
Faleminderit qe ekziston Peci 
 Shuj se ata na ndihmojne fort 
  Nuk punojme per rroge, per pasion. Vec pse osht kunder Binushit.
 E kam nje lajm te keq, fushata Bojkoto Gazeten Express ka ndikuar pozitivisht ne rritjen e lexueshmerise. I lus organizatoret…
 Njejt sikur portugalia kur u bo kampion para 5 viteve.
 Mendoj qe Malisheva kish me qene me fat nese Urani ish bo kryetar i asaj komune.
 Urani i Kamenices :p. Mirepo te qenit pinjoll nuk eshte garanci e qeverisjes se mire.
 Mareci osht ma afer Kamenices se Prishtines :p
  So e vertete. Bash pom behet qefi per Adelinen.
  Jo se bohesh djale i keq masnej.
  Po ma shume kom une toke ne lagjen e spitalit , edhe spe padis kerkon
  Une e kom humb vetebesimin ne vete 
  Hajde ne kamenice e pijme
 Barcaleta po mendon :p
  E ke humb besimin te une a? Sdi cka tkofte.
  Nje hulumtim qe e ja bo University of Oxford ne vitin 2010.
  Nashta ska dite me tregtu :p
  E dijme sa shume e kane dashte Diego Costa qe ka lu per Spanjen e jo per Brazilin.
 dil merru me ta vet njeri, se ndryshe ski cka bon :(
  Sabri i ka 10 selamete :)
 Me pase qene vend tyre e kisha pergezu 
 Ti po prej prej LDK/PDK/AAK qe jane parti te djathta me kritiku a ? Ska logiike, kish me qene budallaki.
  E kqyra italine por dy golla sjane pak. Tu i pa grupet tjera shume problem e ka me hy si v… 
   Jo per bese sosht gjeneralizim. Une i di qellimet e tua te mira. Mirepo i… 
  Mos i jep ide me shkru prej llogarise zyrtare te VVse 
Haxhi Pishmani apo Molla Pishmani? 
 Ani mo ne linkedin. Kur ja kqyre pervojen edhe skillsat sguxon as mi shkru se tutesh qe tlype rroge 10 mije euro.
 Qaq sport palidhje osht curling qe meritat kryesore i ka pastruesi i fushes jo ai qe e gjun at far topin se as top sosht.
 Sport palidhje mdoket, per mu hyn ne kategory me Curling.
 kush je ti qe ma ke bo follow?
 O Allah po e mire. ❤️
 Per shkak te takses qe ka vendose Ramushi. Per ate arsye ka qene importi ulet.
  Je bo si Milaim Zeka me keto fakte.
  I nderuar, neve na ka kriju Allahu.
 E rekordi i prillit nuk po te ben pershtypje hic a ? 
 Paske vendose me kry heret kampionatin :p
 Paramendo na tu u pajtu me nje sen.
 A je ka na bojkoton hala? Sot e kishe vizitu sajtin 3 here
   Ska fjete kurre te kusherini glaukut. Hajgare ka qene ajo 
   Hajt kallxoma nje status/tuite ku e ke kundershtu?
  Hijne me na gjete gabime 
 I ka hype vlera shume. Problem
 naj fjale per Gosensin?
 Kryesore ronaldo e dha golin e vet 
 Tenderi eshte 90 dite pune. Kur kalojne keto dite e kritikojme bashke.
 Qysh po thu mos me ndreqe rrugen kurre a? Pa u prishe niher krejt nuk ndreqet.
 Une bloka nuk bej vec kete fjalor ruje per ne shpi, e larg profilit tim.
Ne opozite: “reciprocitet me Serbine”Ne pushtet: “mos te ngutemi”
  Po thu qe “institucionet e perkoheshme” ka qene i qellimshem a po? Hajt po e marr si te m… 
 Te ftoj me ardhe nje dite ne Express me pa qysh punohet. Mos u ndiko nga grupacione qe bejne propagand… 
  A don edhe pagat e punetoreve?
Prej qe ka fillu kjo fushata e lodhet me bojkotu , vizitat jane rrite per 20%. 
  Sis, senet jane ma te thjeshta. Gabim teknik kurgjo ma shume. Nese doni me hy ne tripa sju ndal kerkush 
 Kur e perfundon mandatin a ?
 Hajt qysh ja kishe bo ti ma mire?
 Dont bother. Vec dikush qe ska punu kurre si kupton gabimet teknike.
 Bash e kunderta. Panelistet duhet te kene qendrimet e tyre, te majte, te djathte, eurocentrik, euro… 
 Spajtoj me ty. Ta shpjegoj live kurdo qe shihemi.
 Fillimisht duhet me kriju nje komune boshnjake. Por mundet komunen Turke Mamushen me shti.
 Ky lshon pe. Ky njihet per kesi qendrime radikale qe ma vone i ndryshon.
 Me vend e ki. Mire ish kane mu rregullu me ligj kjo pune. Edhe qeveria me vendose kush mundet edhe… 
 Ma se vazhdoj me Shefqen. “Xhelozia osht ves i shejtanit”.
 E vetmja Franca qe mundet me mujt, po tu u mundu fort.
Granit Xhaka po shkelqen me frizure!
 Te juve me kysmet :P
 O po bre. Fort e kom dashte. Edhe e kom percjelle prej Serie B. Shume lojtart direkt eshte.
 Shume bre osht i forteee!
Serbia edhe mundet me nenshkru nje dokument qe nuk e sulmon KS, por momentin qe i vjen mundesia te sulmon. Se kane… 
  Buzhala osht i keq ne shah. Me pase mundesi 10 loje rresht fiton. Edhe bon shume rralle gabime.
. qishtu kom me ta bo frik. 
Keto 4 kerkesat e Kurtit qe i boni sot kane me u harru shpejt sikur 10 parakushtet e dialogut qe i ka pase dikur.
  Ma mire mute se block :p
2 tjera spo me kujtohen. Nejse Albini i ka harru 10 une i kom mbajte mend 8 
Rrespekt per Kurtin qe nuk pranoi me negociu me Vucicin pa kerku falje serbia. Po Negociata, jo VETEVENDOSJE 
===