 Mire e ki thone! Zoti t’bekoft e Krishtlindje te mbara!
 Ma shume pisha ne 2013
   Suksese ne angazhimet e reja!
 Urime ditelindjen e dhuraten neser 
 Urime kete post te rendesishem!
 Ngushllime! Te rroni e ta kujtoni!
      Serial shume i mire! Shpresoj te kete sezon te 2-te!
 Ma trullana jane ata qe marrin keshilla prej tij
 Urime kampione! Shijo kete dite te veqant! 
 Tash ti e ki rradhen Nora!
  Cka po i thote?
 Dukesh si Rrushja e serialit 
 Mas 12 fillon mu nxeh neja 
 Faleminderit! E ty shendet e te mira!
 A je regjistru online apo ne ambulance?
 Kris te kam ditur per nje njeri serioz qe nuk ofendon te tjeret per te ngritur veten! Si duket je veq nje g… 
 Mas miri mos me i kliku artikujt e tyre. Unfollow gjithandej.
 Nuk do te luftojme. Do ta mbajne paqen! Nese vjen puna deri te lufta atehere do te luftojme krah per krah me ta
 Shqiperia eshte anetare e NATO-s. Ne Kosove i kemi trupat e KFOR-it. Mos ki frike! Fli kembe zbathur 
  Urime punen e re! Suksese!
 Bashke me ty Kris
 Dallap dallap dynjaja ka tho shaba paja 
 Pranvera ka ardhe me 14 Mars 
 Kurgjo si ka bo veq i ka kallxu krejt Kosoves kulturen e vet. Nji person i ulte ben gjutje te ulta.
 Duhet te jete synimi 50% por kjo vlen per heren tjeter 
  Edhe Mishi mu pjek edhe helli mos mu djeg 
  Ndoshta ky ka qene misioni. Dhe tash qe u arrit jep doreheqje sepse u kry puna.
  Ndoshta ky ka qene misioni. Dhe tash qe u arrit jep doreheqje sepse u kry puna.
 Faleminderit do te ju percjellim!
 Ajo thike pas shpine nuk harrohet lehte.
 Shyqyr qe me sot po merr fund koha e trumpisteve
 Pse kaq pak? 20,000!
 Mire e ki thone 2020-shit 
  Mire e ki, por te fundosur jane si me Avdullahun si pa te.
 Urime e per shume mot! Shendet e te mira per ju! 
 Edhe 2 millionshi pak ma rishtaz qe u av(d)ullu sduhet mi harru
 A mos i kane marre latinet prej nesh?
 2020 hala tu pi cigare 🤦
 Siguroni vaksinat e gripit sezonal
 Mos e kane huazu turqit nga ne? 
 “Bej si them une, mos bej si bej une”
 Me bo mes mu nal ketu nuk zihet qe je kon n’shqipni 
 Shembull per menaxhim te keq
 Me behet qejfi qe jeni sheruar. Tani duhet te jepni gjak per te semuarit tjere dhe te inkurajoni edhe… 
 Me behet qejfi qe jeni sheruar. Tani duhet te jepni gjak per te semuarit tjere dhe te inkurajoni edhe… 
 Sherim te shpejt. Paska qene fake news
 Nese ka mundesi me i treguar se pari numrin e te sheruarve sepse keta tituj me # e te infektuarve k… 
 Vaksina eshte afer Arianit
  Kqyre veten n’pasqyre! Krejt komentet negative i paske!
  Ne diplomaci gjuha e trupitka shume domethenie. Gjuha trupore e kryeministrit tregon qar… 
 A po ushtron me mask apo pa?
    Ju paska maru qejfin shkijeve trullani! Ma mire e ka mu marre… 
 Ke harru me e bashkangjit foton
 Urime! Me kujtohet kjo dite.
 Keta qe pijne cigare jane shume here me te rrezikuar nga covid-19
   Krizen e shkaktoj isa kur shkoj mi perkrah thaqin dhe iden e tij per gjendje te jas… 
 Shume e vertet! Raftat e miellit, sheqerit dhe vajit po zbrazen si me qene kohe lufte!
===