 Jo se na  viktimizojne topi Boren 
Diqka te re, diqka per kete vere. Punuar me dashuri  nga bee.accessoriesks E gjeni ne instagram .accessorie… 
Po eci mbi det se nuk di t'notoj
Mos debato kurr me nje injorant
Neser pom vyne pak FAT
Andërr : Me hup pesh qaq shpejt sa e hup motivin
 Sa ja ngjita dhomt ma t’bukur n’bote, nanes ma t’mire n’bote. Nanes tem dmth ❤️ 
 Mos na liberalizoni vizat hiq, se po dojme me nejt ne Kosove ♥️
 Gra e Vajza Shqiptare, jeni Zemra. Ju pafshim gjithmone n’maja 
Po vjen era, SHTET.
 Nese Lumiri e ka pas plan me bo kuorumin, pra me u zgjedh Vjosa e mos me shku ne zgjedhje... pse duhet me i pengu kaq shume…
Postimi ne instagram tash edhe ktu ❤️ 
Regjia jepja fjalen babes 
Shko , shko moj lule bore .
 Bee.accessoriesks osht pasioni e biznesi i vogel i Blineres.  Gjithcka osht e punume me dore e me shume dashni.Perdorne p…
 Me bo me t'krahasu me tjera, ty veq vjen tu tu rrit vlera
 Reperi njohur i rikthehet repit 
 Do te jem aty ku ma kerkon VETEVENDOSJA!.Une kurre nuk i iki pergjegjesise por as nuk vrapoj pas posteve. -Glauk Konjuf…
 Twitter duhet me lexu kete storie. 
 Kuvendi kapun i Hashim Thacit, po voton buxhet per Asfallt.Dhe jo buxhet per maska.A dini pse? Se maskat kushtojne lire, s…
 LDK: Boni cka ju thojm, mos boni cka bojme. Besoni, po na jem te pa bese.Rujuni prej virusit, por na nuk ruhem. Etj etj.…
 Rreshitja e Hashimit, per vrasjen e Astritit. 
 S’DUHESH  ME  VESH  FUSTAN  T’BARDH’  N’DARSEM  T’DIKUJT TJETER 
 Qeta qe e kan n'bio 'Human being' a dyshojn n'veti a çka o puna?
Qka po thojshhh bre
 Tash e tutje mu ma then deri m rraj 
 shum fort ki godit ❤❤️
 se ka qeff mi shti hunt apet
 Njerezit ta zbehin deshiren me pas' kontakte me njerez.
Kom ndjenja kur mendoj per veti
 truni: qe nje kujtim i bukur me dikond qe s'folni qaq moune: pse po m'shtin n'ksi tripatruni: veq tybe, s'po rrihet
 Spo ju tutna JO!
 Qdo dite e ma shume po bindna qe sfida ma e madhe n'jete per neve ka me kon me gjete personin qe ki me kon me to per ton…
 ma ma mos ja futt
 Edhe une kisha keshhh HAHAHAHA edhe ta kisha bo ani shum mire
 haha sebesoj qe shkonn kurr merr pergjigjje kurgjo'
 haha sebesoj qe shkonn kurr merr pergjigjje kurgjo'
 hahahahahah ma han zemrwn edhe qka ju kishe bo flokve 
Pe du ni udhtim t gjat 
  oooo rrushooo faleminderit shumee
 Nese sun boj mire bile i keq mos t'bona
 shum filum pot rrikan
 Ncncncncnc marre per kto portalet tona, te mjeret ne ku po jetojme... 
  kthej back kto fjal 
  urime shoqeee hajde edhe 1!!!!!
  sa shumeeee ju duuu
 oooo u dashurova qfar foto 
 as ni pik hahahahha mka kalu ajo kohh hahahhaha u nxivaaa
  kjo eshte dashuri motrash hahahahha kush ka motra boten ka hahahah 
 hahahahaha shkruj vetit shkruj ahhahaha
 as mu spo ma nin per tu a u knaqqe okej.,
 hahahhahah me dash ja boj .
 Le t'i harrojme me krenari ata qe nuk na duan!
 mos pot dhem barku
maje paqen e mbrenshme
qka bre u dont care  
qitu tu e kqyr Naruton 
 e stfolin ata qe duhet
 po se ti sum the hahahaha kesh tu e bo nuj me ty ahahhaha
 to twirati qitu hhahahahaha
 se me tim tina heken ✌️
 a e pin naj kush duhanin te ti ?!
 kryt posht tu i ra fyllit
 ose qka je rrit more ✌️
  sdi veq menimi jot spom pelqenn 
 o qka pom pelqen 
 jo bre n kit zheg e kisha rrok shkelum ntok e kisha qit dhomin  kisha thy 
 jo bre n kit zheg e kisha rrok shkelum ntok e kisha qit dhomin  kisha thy 
 ✌️✌️shum e kom ngu sot 
 jo qaq masi the ti 
 oo urime ditlindja lindi hahahaha i bofsh edhe shum shum tjera i meriton zemer 
 Disa njerez vijne ne jeten tone thjesht per te na treguar qe mos te behemi kurre si ata...!
 Kam arsye te besoj ne vetvete, jo se kam bere zgjedhjet e duhura, por sepse kam mbijetuar ne ato te gabuarat...
 Disa buzeqeshje shkelqejne me shume se diamantet, disa lot rendojne me shume se malet...
 ooo damn na ka thon 100 her :(
Njerzit sot : ma shum e rujn adapterin se veten 
 pata me thirrr me shku 
 po me ni harqq qaty 
 hahahahahhahhahah e lindi qe je ti ✌️
 u nime  kom dash me tshkru me ta bo perhajr 
 boma retweet edhe foton ✌️
 hshaahhahhaah kur jesh bos e se nal doren per kurgjo zemer e madhe pfff (maja vetit bliner maja)
 po per qata 140 pik baboo 
 o hajde urime urimee skom pas kurr ndyshim nty 
 Shum pom mungojn do njerz qe mkan bo mu ni mir e mu kan gjind çdo her, ata hala i kom afer shpesh amo sjon njejt kan ndrru
 qka ka pas mem gjet hahhahaha larg njonit jom
 koke knaqq si un sot hahahha veq qe skom lujt x
 dil mbjell lule hahahha
sot veq muzik popullore kan ngu vesht e mi
 e ke mytt krejt
 haahhahahahahahah ska me tyyy
 op hahahhaha hiq ma lag se kit ver hahahhaha
 hahahhahhahaha lol krenare jom per kit sen hahaha
 op  valla hahahhaha + 9 i kom pas tash mkan met veq 7 HAHAHAH
 shyqyr qe i kom 7 hahahah
 GT 550i hahahaah qe mshkon shum per ftyre hahaahahha
 e moj qur the same shit edhe per ty ahahahaha
 hahhahahaa ta ha pak zemer ty ama si ti krejt qka me bo hahahahaha
 hahahhaha qka ka  keqe oo njeriii
 e diii bre se ska\ me mu hahahhahahahah lol
 e kom honger niher ahhahahhaahhahaha
 ahahahhahahe di edhe ty ishalla te shkojn punt mir me qato biletaa
 ahhahhaahha ASNIHERE ahhahahah shum njeri pa nervoz jom
 qka kA PAS ngjum pff
 valla hiqqqq pffff spo kome se me pas sum kishe pas ksajde hiq
 ANI naten e mir ahhahah edh epak
 pse mu martuu me ty hahahhaha
 Jena njerz qe shume shpresojna n'jet
 op  MA SHUM ZMR
  hiqqq sdi qka mka kapp HAHAHHAHAH ❤️❤️❤️❤️
 hHahaha qajo ke esenca o djaloo hahahahaha
 -.- shuj praa se okay koka puna jo okay po shum najsssen 
 aa sen palidhje o ky si me dasht diqka e mos me mujt me marr hahahaha e le ma me prek
 ouuu hahahahha qikjo ke e ron hahahaha 
 hahahhaha lol goli pra edhe sillja hahahahah
 sen spaske bo hahahahhaha lol
 hahahahahahah the same here
 a ke lujt bastore hahahahahha lol
 ani de gezuar urime perhajr
 po ski ma qajjoo me rendesiii ahahhaha a zxdfjcvdju
 mir e  ki ti masi nuk ki ahhahahha
 qitu ke fol palidhjee hahahhahahaha
 ooo hahahah kqyre lojen praa
 hahahhahahahahahha ke te drejt
 sikur shum ma najs ish kon lojaa
 hahahahahah te dua bre Zemer
 hahahahahaha a jom un kjo
 Shum do foto artistike i bon Blinera
 a sun i qet atje a
 a ski insta ti qik a ?!
 hahahaha edhe unn ty
 hahhahaha i knoww po prpap shumm -.- veq artin po ta duu ✋
 per swag kerkush sosht para capital t
 shum palidhje kur po i bon valla ni or tu i kqyr
  oj bukuri e rrall
 valla po ne pritje je hahahaha dije
 hahahahha un rri n mendime the same shit
 me rendesi kuptova qe sta paska rras
 oo hahahhaha shum keqq aa
 ooo qikjo o shitt valla
 op ishalla sa ma shpejtt pastaj knaqeshhh
 HAHAHAHAHHAHAHAHA po ta besoj ashiqare ke perdor najfar glue hahahaha
 damn qetësohu me JOGA AHHAHAHAHA
 ty te kom looqk per qata
 hahhaha ata se ndrroj me kerkon se shum m don hahahah
 as un se di arsyje skom hiqq hahahaha
 Mos t'foli per sken, se skena ska as sken'artistme tem pa bisht,jem pak t'prisht,e ku skem as gisht ,thojm ktu... 
  po bukuroshe. Bre qe me jenii big love
===