Forcat Detare Shqipetare  per here te pare do te marrin pjese ne ushtrime ushtarake detare  ne Detin e… 
Sokol Ahmeti, tetar i  ze vendin e pare ne garen "Ushtari me i mire" ne Kroaci. Me Sokol'in ishte e… 
Lajmi qe jane shpetu 60 minatoreve ne Stantergut, Mitrovice eshte lajmi me i mire qe morrem sot!Po ama ne rastin… 
Ambasadori i  Kosnett:Kosova ka detyrim ta formoje Asociacionin e Komunave Serbe.Interesat e cilit shtet jane duke u mbrojte?
4/ Qellimi i Korese Jugore eshte fuqizimi i ushtrise se saj krahas rritjes se kapaciteteve ushtarake te Korese Veri… 
3/ Propozimi i vjeter (poshte), propozimi i ri (larte).Propozimi i ri ka gjatesi 280 m, mban skijump per leshim t… 
1/ Korea Jugore po planifikon te ndertoje nje force detare me kapacitet me te madh. Ne kuader te ketij plani pritet… 
Eshte dita e pare e nje jave qe pritja qe te kaloje anormal dendur...dhe une veq se kam humbur energjine.
3/ Ne kete rast posaqerisht Ruset kishin mundesi te provojne sistemet e tyre ushtarake ne krahasim me zbulimin e F-35 ne radar.
2/ Fotografia eshte bere nga nje F-35 tjeter Italian. Perballja mban rendesi pasi qe te dy palet kishin mundesi t… 
4/ Perndryshe Sahand llogaritet si destrojer ne Iran. Ndersa ne literature nderkombetare llogaritet te jete frigate… 
3/ Analiza te tille po behen per shkak se nje udhetim i tille, me nje anije qe nuk eshte mjaftueshem e pregaditur p… 
2/ Shume spekulime sillen rreth qellimit te ketij udhetimi. Disa analiza supozojne se me kete, Irani po transferon… 
4/ Vizita permban edhe disa ushtrime ushtarake me aleatet qe do te bashkangjiten gjate rrugetimit.Ne arenen nderk… 
5/ Kjo eshte nje fitore politike e Palestinezeve si mbrenda ashtu edhe jashte Izraelit.Por ne anen tjeter mund te… 
3/ Ne Izrael u arrite marreveshje ndermejt partive me ekstrem te djathta, deri tek ato me majtiste dhe nje parti Ar… 
Disa analiste te teknologjise ushtarake shfaqin mendimin qe derisa bota lexon kete raport si "surprize", Turqia mun… 
Lapsi me i madh ne Llogarine e Financave te Bilancit te Pagesave te Kosoves eshte "Investimet e Huaja Direkte"; e c… 
Drejtori i ri i Mossad'it, David Barnea:-Do merr detyren ne 06/21-Ish-pilot i Forcave Ajrore Izraelite-Rreth 26… 
2/ Rritja e ndikimit Kinez ne Ballkan eshte lufte e re ne mes tre fuqive. Putini mund te lejoje presionin e SHBA-se… 
4/ Tani mbetet ne diskutim armatimi qe do te mbajne keto aeroplane. NESE Kroacia arrine te furnizohet me raketa ant… 
2/ Aeroplanet Rafale qe do te pranoje Kroacia do te jene te perdorura (por qe ne fakt jane prodhuar me se largu par… 
Me ne fund! Sipas mediave lokale, Kroacia eshte gati perfundimit te marreveshjes per blerjen e 12 aeroplaneve Raf… 
A dojme nje dite me pyt KOSOVES bre vlla a doni diqka me ia dhon se NA e kem ne kufi nji agresor (Serbine), qe leje… 
1/ VEQ PAK! 🤦‍♂️ Ka gati 1 muaj prej ketij postimi qe e pata bo. Kqyr tash FLASH NEWS! Amerika, dosti jon, thu t… 
Problemi seksist ne Kosove eshte nje prej temave me tabu. Dhuna familjare, dhuna ndaj femijeve, ne rruge, ne shtepi… 
2/ Nese raketat vazhdojne te leshohen nga Gaza, sistemi Iron Dome do te jete zgjidhje e shtrenjte per vazhdimin e k… 
1/ Nese jemi tu dasht me gjet pergjigjen e ksaj pyetjeje: Kur fillon sulmi tokesor i Izraelit?Athere kur sistemi… 
2/ Buxheti i parapare per FSK 2022-2024.Rubrika e njajte (Viti 2022 Vleresuar) ka rritje prej rreth 21.60%.Shum… 
 Po pritet deri neser ne mbramje...
Nese nuk ndodhin vonesat, Turqia do t'i perfundoje gjitha projektet ne lidhje me raketat anti-ajer. Kshtu, Turqia… 
Ndoshta kishim mujt me ndjek te njejtin shembull, pasi qe kostoja e vazhdimit te perballjes me COVID19 eshte shume… 
Ju uroj gjitheve 1 Majin, diten e punetoreve, diten e te perkushtuareve. 
Kirgizistani me Taxhikistanin hyne ne lufte per shkak se nuk arriten nje mareveshje per ndarjen e ujit te pijshem.… 
Anija Amerikane per mbrojtjen e brigjeve per momentin ne Detin e Zi. 🤦‍♂️Njajt si me ardh ne darsem me trenerka.… 
Shpresoj te zbardhet sa me shpejte vrasja e nenkolonelit te FSK-se ne Mitrovice.
Nuk po me kujtohet ndonjehere ne histori qe kemi pasur perkrahje te sinqerte nga perendimi.
1/ A i keni pa ushtrimet e fundit ushtarake te Serbise? Gjitha mundeni me i gjet ne Youtube permes .E… 
Fatkeqsisht kto lajme kurre nuk kemi me i pa ne portalet e Kosoves!
2/ Projekti per percaktimin e nevojave te ushtrise Amerikane ne lidhje me llojin e topit, perfshine testimin e topa… 
Aeroplani po behet gati qe te ulet ne Aeroportin Nderkombetar te Prishtines "Adem Jashari".A kish mujt bre dikush… 
Aeroplani Forcave Tokesore Amerikane po ulet qe te zbret ne Aeroportin Nderkombetar i Prishtines "Adem Jashari".A… 
===