  Me Serbine jeni te ju edvinistet e bregoviqet e m...t ...
 Yess, hahaahah, . Megjithate ato te jashtit po interferojne jo pak mbi ne ...
 Ballisti i agjenturave pat deklarue Kastrioti. Te gjithe iu paten versule. Pa te drejte po shihet
 Qyre plot. Po nji bajgë jemi ne te gjithe, pa marak e ke. Sidomos i perngjasojme njeritjetrit ne gjerat idiotike.
 Uncute jo cute hiiiq Nita .... mBare poashtu shemti jo cute ... pranoje!
 Nuk due zonin me ia ndie kesaj struceje. U bo argat i Edvin ...
 Po praaa. Nji m.. jane te dy!
  Jo besa por e sakte kjo qe thue biles jo vetem gomarshengen por edhe zagarshengen i shkon me mire
 Raca tij e ndyre, ka tetedhjete vjet qe jane instalue per ta bere kete brapshti qe paska potencu  Morenaa, .
 "Like" ta bera. Uroj te te mos detyrojne ty edhe te mos na detyrojne ne te gjitheve te marrim edhe doz… 
 ??? ...po ata qe njihere thane 'dy doza bonin pune' e tash po kerkojne "te tretën".  zoti e di… 
 Fjale shume pune pak. E ke jete zgaravelin te poshtroje nji komb ne menyrat perverse. Ti vazhdon bon sehir. Hate iiiit!
   Qe psh nji burim i vockel e te tilla ka me mijera neper bote ... 
 Mos ekrahaso Zogun me kete race sovjetike. Zogu u bo me Beograd konjukturalisht, pikerisht kunder races… 
   Cfare edukate paske me prapanica... une s'te ofendova megjithate o inson... mesohi… 
   Do ta shohim ... loja vazhdon mos ke gajle.  Plus Izraeli pati deklarue se kishte… 
  Nuk u mor vesh vaksinim pa vaksinim. Izraeli tha mbarova vaksinimin 100 per qind. Por Covidi n… 
 Si ka mundesi thanat ne kete stinë?!!!
 Start apo vazhdo, se keshtu disiii !!!
  Ani Gjokaj ishin ne krye te heres besa
 Atlete aaa... ore ju pernjimend qenkeni per t'u kjajtë... uhhhh. Neveritese. Nje ministri del te jete e "pashkolle"..,
 Nuk u hiqet ju nga mendja shkarkimi ... stil komunistesh te shekullit 20. USA e heq dhee ve ate qe do vee… 
 Jo. Ne Perendim perdoren mekanizma te tjere. Nuk perdoret nji "kompani" me 3 persona pa asnje bilanc fin… 
   Asnjihere per 600 vjet nuk e beri nje te mire... s'kemi perse shohim enderr me sy hapur ...
  Race e mjere ... ngeli islamuzmi ta mbroni juu?!! Nuk mjaftojne 1 miliard arabe do ta mbroj… 
 Ajo e beri veteveten t'i referoheshin ashtuuu, Lekaaa 
 Po ky liderri yt dhe yni i perkrahu ata qe zgjidheshin direkt nga populli hahahaaa
 Te dy te mire jenii hehehee!
 Asgje prej gjeje... ishte pa vetedije kombrtare. Kundershtimin ndaj portes e beri per kaprico dhe… 
 Hahahahahahha trape kenka kjo teveqelee
 Nje psikopat i peshtire ish ky vemje...
  Interesante!!! Kaq shpirtvogël djali i ri !!! Si ashuu? Zemerzi nje i ri...
 Ncncnccc ta festojne festen kombetare se per islamike e krishteriste ka mbi 2 miliardë njerez qe i festojne pa "ndihmen" tone
  Jiahahahaaa ...  gjeja me me pa vlere ..., I swear....
 Duhet te shaj e ofendoj per te u kuptue apo duhet teboj tifo per albinushin, si thue. Une s'e boj as njeren as tjetren ...
 Leteni maskarrallek pash zotin se na gerditet kete dhe.
   Pak edukate edhe nje diskurs shqiptar nuk bojne keq, pastaj si te te pelqejë... ne s'… 
   Ty ste paska pas dhone zoti aspak afat se mire ne qe na paska dale .
   Mendesi e shefqet krasniqit. Ai va cakton njerezve vendin ne ate dynja, ju shqipet (… 
   Ncncnccc. Tirana u bo beton keta e rangojne ne green... ala Soros strategy bre fara… 
 Po ata "te veshurit" sa e pranojne ekzistencen e ketij kombi madje, lere te drejten e tij te veshj… 
  Pse a paskemi kene gjalle ndonjehere ne ekonomi qe te ringjallemi?!!! Me kete strukture… 
  , vecse t'u tregosh edhe  Albinit qe deklaronte nje vit me pare se "jemi ne Evrope" tek pe… 
 Po paniken tuaj partizane te lvv e kuptoni 
 !  Revolucioni i "demokratik" pra sipas te Al-binit
 Kurre s'e kam ndigjue nji prej jush te citoje a permend nji thenie a një porosi te vyer nga asnji shq… 
 Edhe keta borde nipash e militantesh do te bojnë, pa marak ...
 U shlirue ky e po flet me admirim per Kinen. Se Trump-i ia pati rrudhe hapesiren idiotike edhe as mendjen… 
  E bojne me qellim ne hapesiren shqiptare. Dhe gjejne argate te piset...
  E sakte kjo qe thue veçse duhet te vleje per te gjithe, besoj, apoo?
 Heu xhemail bre u bone edhe ti mitant . Por s'ka gje. Jane bere edhe shume te tjere para teje. A… 
  Ik se na shpife ... burizan i keq i albin turrecit ... pronto 2 po bonnpikerisht albini m… 
 Po ashtu pra fise sllave por jo serbë. Pasi qe ata si etni u krijuan shume vone ne kohen e ngritjes ruse... kete po thosha 
 Po praa. Rruget asht dashte beheshin pa pare 
 Po ... i ndaloi per vete e na i solli ne...
 Une per ate flamur pe kqyri o Beraaaat, mos m'shti ne folë ma shumë 
 Ata mbiemra sllave nuk jane te vetmit kaa edhe shume te tjere te fshehte. Pastaj mbiemra e emra si im… 
   Ky e meson edhe Ameriken besa, 
 Wyreee... kete s'e paskemi ditë
 Ehhh... burgu mercenar. Por nuk eshte  deshtim i vetem kesaj shtrese.
 Po te besoj 100%. Dhe druaj se nuk i marrin per kenaqesine e keximit por per t'i vene ne vitrinë ...
 Jeta shoqerore ashtu si vete njeriu qe e perben ate, nuk shnderrohen e as mund te  vleresohen dot, si ar… 
   I bon balle secilit kyyy, si "biri i popullit e i partisë"....
  Pa buje, pa krekosje, pa perjargie dhe pa pompozitet duhet te veprojme... ndryshe fundosemi ed… 
 Si ore ashtu?!!! Ncncncc. Ky i çmenduuuuur edhte apo si e ka hallin. Dmth me ardhjen e tij "fillueka" edh… 
 Ca faji ka diaspora ?!!! Ajo nuk i vuri kusht askujt per kete makinacion ..
 Zoti kometen Tokes, Albinin Kosovës 
 Po ku ta zuni sbashk rrugen seee hahahaha
 Yess. Ashtu eshte Rron. Por kush te te kuptojë. Militantet qe te bejne shume like (dhe kujdo tjeter) si mi… 
 Albin kulti, albin kulti, albin kulti 
 Kafshet politike nuk "falin"... sidomos te linjes neomarksiste dhe erdoganiste
 Nji race e tille perverse jeni edhe ju komunistet shqiptare te te gjitha skutave te erresires...
 Vetvenfosje, jo negociata mire e ka opozitaaaaa 
 Has muslimonë . Kqyrin po pa njet "t'keq", !
  Tirana eshte vra... eshte shnderrue ne varreze per se gjalli... ja ndryshimi ...
 Si te kete sukses me nji te papergjegjshem, minimalisht i papergjegjshem, Mustafa. Edhe shume te tjere bes… 
 Nji race komunisti jane te dy ...
 Ju sejmeneve u bjen taman cfaredo qe bon liderri juaj... he ... ipajtimi me Edvinin, Me krimin e oranizua… 
 Ti c'ke qe mirresh me ta?!!!!
  Heee, u krye puna aaa? Kum ju qe ngelet vetem me Edvinin ...
  Ta shohim tash kete turrecin e poezive naive qe perbetohej se kure sdo te kishte takim me se… 
  Mes u bon egoist i keeeq. Hiqeee se edhe ti kajhere kot is fute 
 Hahahahahhaha, ! Aq vlere kane te tilla krijesa. Thirren ne humanizem ne modernitet ne demokraci .… 
 ! Kush te t'degjoje se ... kete keshille me vend.
 Po kur "klyshey" po  mbyshin femijen e vetem te familjes ?!!!
===