 varet ku e ke lexu ne FB, se tan kan ba FB-ka tash.
 keta 2 persona jan politikanet me te paster qe ka pas Kosova ndonjehere.
   Po prej London, England. Posto faturen e Kosoves, me rrena e shpifje kallaj eshte.
  Edhe boll mundohemi me kursy
  E leshuat sallen, u rreshtuat ne anen e LS, turpi ka emer: PDK
 nese eshte e vertet qe  nuk vizitoj Kompleksin Memorial "Adem Jashari" ne Prekaz, turp… 
   Mos bere komente qe as ti vet si beson.
   keta nuk e kane vjedh shtetin, e kan bere me ndjers t'vet. Un me "tiktokun" nuk m… 
   Edhe Hashimi, Ramushi, etj jan pasuru boll po spo ngihen
   une jam zgju dhe per ata PDK-ja se merr ma voten time, sidomos kur gjithe hajnat… 
 e me postu "fake news" cka i bjen kjo?! Kallxona?
   pse pra mediat su "qojshin" kur PLAN-i nenshkruan marrveshje te damshme, ata ken… 
 Pse bre po rren  . Kerkoni falje per fake news o gazetar propagandues, e tani ankoheni… 
 Kur analfabetat s'din me shkru dhe e kritikojn Albinin: Mos ba propaganda. A ki naj reagim per "Adam" Jash… 
 Po edhe familja ime e ka votu Hashimin ne kohet e mehershme po ma nuk e votojm kete hajn, dhe asnje parti… 
 edhe ti pu merrshe veq me tituj te mediave tona te mirfillta
 shikoje presjen pas "Ndermarrjeve te perbashkta kriminale" ⬇️ 
  po edhe hiq mos me pas fshi, asgje t'keqe ky postim nuk ka. Shikoje presjen pas "Ndermarr… 
 e per "qepim" ndaj Presidentes a ju kallxut nderkomtarve?
 e po kur te beni sulme te vazhdueshme t'pa vertata normal ky reagon. E per Thaqin i ke pas 100 e 1000 fakt… 
  trurin jav kane "shperla" juve hajnat qe 20 vjet jeni mesu me hajni ju qe perfitoni prej tyre
 Propagandave tua ju besojn vetem ata qe ende s'te njohin dhe militant e PLAN-it.
 A ata tjert qe kane pas shku ne Amerike e kane pas knaq
 Pse spo thu nuk ju ka perfill urdherave t’policis qe ta liron sallen, çka po mendon ti kamermani me e largu policine a?!
 Po debat?! provo ne shtete tjera: jepi shuplaka policit e sheh qysh te del tani?
 Ne burg kete maniak
 Qeshtu me fabrikime dhe rrena i keni  mashtru popullin por kot e keni tash
 Po de se e verteta p'ju dhemb me ndegju,ne ate kohe keta hajnat e kane refuzu projektin e Gjermanit per ri… 
 Bojlerat i kane pas mbush me para te vjedhta, a ju kujtohet 
 Si qytetar i Republikes se Kosoves me shkrimin qe ke bere ti po e mbeshtet korrupsionin, sipas teje ata… 
 z. Buzhala a pe sheh edhe ne endrra Albinin
  le ti kthen qato qe i ka vjedh boll eshte
 I dim keto premtime, i kena provu qe 20 vite.
 Hashimi e ka votu
 Qitina p’ju dufka libri apet
 A po te duket shtrejt apo lire?! A thu kush i ka bere keto ligje, Pdk Ldk?
 Ende po merresh me qita? 
 Qato “tlinat” qe i ke perdor qe 20 vite qe kem pas probleme me rrym rregullisht; mos ba panik se kete qeve… 
 qishtu e kem pas qe 20 vite probleme me rrym dhe s'keni guxu sen me fol. Tash per 9 muaj nuk mundet mu rre… 
   rrymen ne veri jav kane pagu 20 vite dhe kurgja s'keni fol. Keta jav ka ba t'mu… 
 po ani de si paske humb por paske mesuar diqka
  ja video cka ka thene: 
  nese je shqiptar e din ti keta shume mire
 A ki naj fjal per Blerta Deliun (PDK-se) qe ju ka thene UÇK-se terrorista??
 krejt bonu bashk Ldk, Aaak, Nisma dhe LS s'mundeni ma, po mesoheni me ndejt ne opozite 20+ vite
 *fjalet e Blerta Deliut
 Duhet me t’ardh Keqardhje per Blerta Deliun qe i tha UÇK-se terrorita?
 Per ata tash eshte kthy ne Kosove se tash me qeveri te mire ka shpresa
 Per derisa kem kesi votues qe as vet nuk presin asgje prej kryetarit qe votojn vet, vendi yn kurr ska me hec perpara 
 Po de po vota me pare, mjerim
 E kan votu regjimin e vjeter, ky eshte vendos sa me vota, tash Isa me partner t’vet e komandon… 
 Lista serrbe ishe kampion valla, kush e formoj? ⬇️⬇️ 
 Edhe LS i ka fitu kogja do komuna por a ja dojn t’miren Kosoves, per bes jo
   qe se na keni pas lodhe me propaganda t’juja
 Eshte ardhe te jaranat e vet por per me na e rrezu qeverin s’mundet ma
 T’paska kap sikleti ty diqka 
   Un nuk thash qe skan t’drejt por i keni pas qe 20 vite ne qeveri dhe deri ta… 
  Keta tjert i ke pas qe 20 vjet (kogja shume vite jan keto) Nese sje vetdijesu deri tash sdi… 
 Kryeministri me i miri qe kemi pas qe pas lufte; gjelozia jote ndaj tij shume e ult 
 mos ja fut kot pash zoten, se edhe ti vet e din qe nuk eshte e vertet
 Ska drejtesi me keta gjyqtar dhe prokuror te instaluar nga PLAN-i
 Çmimet jan rrit n’tere boten, bile edhe ne vendet me te pasura qe e kan edhe prodhimin vendas, e lere ma n… 
 Per qata keto komuna jan mbet llom si Skenderaji si Drenasi, i uroj ketyre njerzve qe t’civilizohen najhere.
 po qito manipulime qe i ka ber PDK-ja ne Skenderaj siq jan: blerje votash, shantazhe e presion tek votue… 
 Nivel shume i ulet i PDK-s qe ja moren fitoren Bekim Jasharit duke manipulu dhe vjedh votat, turp per pdk-n
 Çka t’ka rrok ty neper bark tash
 Çka t’ka rrok ty neper bark tash
 Ketij i korruptun nuk mundesh mi than
 E keta liderat e PLAN-it qe nenshkrujten marrveshje t’damshme a i ke pyt najhere a kan dit me lexu?!
 shume po ja fut kot Vlora
  eshte klyshi i Ises
   Po ki qef me kan me shume (qe tani Ti me 'llomotit') por kaq jan. Mos ja fut kot Berat.
   Fajet i kan gjykatat &amp; prokuroria. Normal ka shum pun dhe nuk e kan leht me… 
 qakorri zhlebi, hiq mos fol kurgja, u pa puna jote z. Haradinaj.Qyp qyp
 Ngushellime familjarve per kete tragjedi kurse te lenduarve sherim te shpejt!!
 z. Buzhala po ti se paske kuptu mire, ketu po thot qe te jesh i vaksionuar apo te kesh testin negativ
 Krenar me ty i nderuar KM
     reagoni edhe ketu e jo veq per Albinin qe po ja keni inati aq shume
 Krahasim shum i pa vend. LVV-ja ka bere protesta kunder nenshkrimeve/marrveshjeve te kqija/ damshme qe PLA… 
  ska gajle a je femer apo mashkull, kur te demtojsh pronen publike, policia kan drejt te arrestojn
 pse spo reagon a eshte e drejt me godit policin
 PSD-ja paguhet nga PLAN-i per ti bere keto truzira
 Po mos me pas vjedh PLAN-i qe 2 dekada tash sistemin mjeksor do ta kishim shume t’mire
  Kjo e ka pranu edhe vet qe e ka nenshkru kontraten⬇️⬇️ 
   Kerkush si ka detyru, me qef e kan votu, bile Thaqi thojke kush se voton gjykaten… 
   E keta po i gjykojka Amerikani a? Edhe mu votu kurr nuk ishe votu mu gjyku vetem… 
   Dmth sipas teje ma mire eshte t’ja besh t’keqen vetit dhe ta votosh vet gjykaten… 
  Mjerim per ty qe ti tere diten pe shpenzojshe tu mi shiku komentet e mia kah komentoj
Ja per qfar me bllokoj 
 Amerikes Pavaresine jav kan uru Albini dhe Vjosa. Spo keni ku mu kap veq qatu turp turp per juve
 Hajni i subvencioneve (parave t’popullit )ne Ministri t’Bujqesise
 Shefi i tyre ne Hague ka vendos
  Ne mbi 50% i kem votu per mi hjek hajnat. Deri tash jem t'knaqur, e ky BB me shpifje/propag… 
 For a start boll qe hajnat jan hjek
 Normal qe jem t’knaqur, mos mendove qe per 100 dite Albini me ta ber Kosoven Amerik a? Po a e din sa demet… 
 Mos ja fut kot, posto fakte e jo shpifje/ propaganda.
 Qysh ti po del tash anti amerkane se na keni pas lodh me qita, edhe qeverin na e keni pas rrezu
  se edhe ti je ba si 
  pse spo reagon ketu
 T7 eshte veq propaganda. LDK reformat e duhura 
 Albini tash ka shume pun me pastru berllogun qe kan len PLAN-i
 Paske harru me permend qe edhe gra dhe femij kan pas marr me veti
 Valdete Daken se gjat zgjedhjeve ka pas punu shum per Pdk-n. Vlora Çitaku kukulla e Thaqit: “u ba shef, u kry shef”
 Mos u merzit shume, ka kush merret me kete, tash kem KM legjitim
 Por edhe ti  nese Kryeministri i Republikes se Kosoves po ta zeka udhen aq shume (qe ne mbi 50%nds… 
 Kjo pik ska t’bej asgje me vende tjera
 Nese ajo pik nuk ishte kerku barabart per t’dy palt, atehere Serrbia thot qe n’te ardhmen Kosova mundet… 
 Kur te kerkosh qe t’mos sulmon ty, atehere duhet te kerkohet per t’dy vendet; kjo sdo me than qe Kosova… 
 Nuk i bjen kjo Kosova me sulmu Serrbin, lexoje me mire zoteri.
 Po normal, ata qyqana qe e kan votu kete gjykat speciale e kan marr n’qaf UÇK-n, tash po gjykohen edhe… 
 Edhe t’shpija i ka mbet tash 
 Pu dufka me ja dhen çmimin nobel Veliut
 Ti su duft me marr hiq, ti ke luftu dhe ende lufton kundra kesaj qeverie
 Mbi 20 vite i kem pa punen e hajnave boll por mos ja fut kot, edhe me vaksina e njejta gje kishe ndodh
 Pe kritikon anglishten, por eshte nje lajm super i mire per Kosoven qe vaksinat jan siguru
 Qeveria legjitime ka dallim t’madh. Vitia
  A te kujtohet kur serrbet beshin masakra ne Kosove, zyrtaret palestinez ne Beograd ne at… 
 A t’kujtohet kush e votoj kete gjykat speciale?
   Albini eshte vetem nje muaj ne qeveri, ku ishe me heret qe nuk i kerkojshe… 
 Albini qe nje muaj eshte n’qeveri, ku ishe qe nuk komentojshe kur Hoti ishte ne qeveri: pa asnje vaksine.
 Kosova ka Albinin dhe Vjosen. Ska me pazare si me Thaqin
 Jan t’shkollun per ata te duket ty qe kan USB, ti me  koxha si t’njejt jeni 
   Kush i beri lluge? PLAN-i qe 20 vite.E tash per nje muaj mendoni me jav ba mrekulli
   Si  si  nje atdhe jemi
  Eshte ministri i shendetsis per mu merr me vaksina, ti po mendon mu ba mrekulli per nje… 
      Grenell nuk eshte mik i Kosoves aspak, g… 
 Hahaa boll mire ja paskan pershtat
   Qe sa vite qe jeni shtet a keni pa diqka mire nga keto parti t’korruptuara? Mer… 
===