 Ka edhe me shume :) 
     ka qene prezent kur e kam perfundu shkollimin ne Suedi. Krena… 
 Ju lumte se na knaqet :)
  Qysh kane thone marrja se ka mbyt kend. Shej sja len kti per fat te keq
 Lexoni deri ne fund. 🧵
      Ja paske ly me kos 
 Pse cka ki kunder Inter’it !?
 Falemnderit per sherbimin shoku
  Si ti edhe ky nje “Postim te pangarkuar” !
  se di shume shpejt po kaloj
 Peje - Prishtine per ne pune po e perdori, tybe me pshtoj
 Vezhgime gjithandej Tori :)
 Te lumte Nora!Shume po na beni krenar :)
  Me te miret jemi ne ju shohim prapa kete sezon.Perndryshe Edi eshte 1’sh :)
  Ju dhe Ne kjo menjehere me tregon shume per ty.Me gjithe falenderimin Fushate eshte, para 1 jav… 
 Falemnderit Edit dhe fushates.Pra mire kish me qene me permend faktin qe kta “haverat” e tu ende nuk i kane siguru 
 Cka po te duhet haver?
 Ne qofse disa shqiptar ne Maqedoni ende hezitojn te regjistrohen ose thojn qe nuk kan koh, ju lutem tregojani ket foto te Alm…
  Sa isha tu punu me KFOR’in Amerikan, gjate patrullimeve kudo qe e verejshin Flamurin e tyr… 
  Ti kur na ke ne lufte?
 Une po te flas per vakcine, na kane vdek me shume se 1k bashkevendas e ti me fol per ekonomi. Hajt… 
 Foto nuk eshte e imja por e e kam kontrollu, gjitha keto shtete perjashtimisht Kosoves kane fillu m… 
 Interneti me sakte Google edhe nja 30 min kohe 
 Me sy e shohim ne 
Ja, ky eshte Tweeti! 
 Ka kur thot ajajajajajaj
  Shoqe me sa e di une kokrrat kta prej komunitetit vendas i marrim jo prej ati nderko… 
 Te lumte  ***Share share***
 Hahahahhahaha a hahahahhahahaha a hahahahhahahahh
 Te prift e mbara e nderuar! Me locke te zemres e kam bo tick :)
 Mundem ashtu eshte por me ata qe i konsideroj qe ja qellojne shumicen e kohes, nuk me vie mire kur fill… 
 Koheve te fundit kto mendimet tua shume po lojne per te deshiru. Si nje njeri qe ka punu me/per Amerika… 
 Faleminderit Kenneth, Urime edhe ty :) 
 Hahahhahahahahhaha o moti moti nuk pasna kesh kaq shume ahhahahahahh Kudos
 Ti ne cilen luft je kon kshtu, qe po mban rend e rregull?
 Fushata plako fushata gjithandej
  Modern day "Bully" ka fillu mu bo, nuk po me pelqen!
  Humbje spektakolare :) flas ne fund
 Nuk te degjoj fort por kjo kenfa e fundit thjeshte Fantastie. Kudos
 Zoti ju lasht shnosh! I koft i lehte dheu
 Urime Lenka :) Shume fat e dashni, u trashegofshi
 Bleona hahahahahahah hahahahahahah hahahahahah  hahahahhahaha hahahahahaha hahahahahahahahaha
  U knaqa haver, kanë fillu me lulezu fotot e LDK'se me Biden'in 
  E une qe s'kam flok hiq çka sipas teje!? STOP Diskriminimit 
  Urime ooo Drin haveri, Buroni u beft 100 shendetplot bashk me ju Fort rrokotel koka tamam Interist :)
 Expresi e jep si lajm/ide, Grenelli e ben tweet po ate artikull. Ne fund KM Hoti e mirepret propozimin… 
  Ku mundem me bo kete test ne Kosove!
 Cka paska shkretu keaaj rradhe, se moti me ka blloku!
 Falemnderit per vegzen i nderuar. Dokumenti paska pjese ne gjuhen Frenge, vellimet a jane ne Gjermanisht?
 Ma dhifqa nona si bon qeshtu mu tut njerzia nuk kom pa
  Me mire kish me qene me ju ndejt gati banoreve lokal sesa diaspores
  Problem per banoret se ska kush i mbron mandej zyrtarisht sipas KFOR'it ajo pjese eshte jashte Kosove. Per fat te keq
  Haver kom punu ne kete pjese si perkthyes, KFOR e konsideron nje pjese qe kalon pergjate fsh… 
 Akademiket summed up ne nje tweet
 Akademiket e LDK'se hahahahaha luva
 Bullshit i them edhe une se bullying ka egzistu te ne shume me pare se te tjeret per fat te keq. Pasojat… 
 Thread shume i mire flm :)Si fshatar i qyteterum ne Peje, di me te tregu qe pas lufte te gjithe atyre q… 
 Mire shume qe po ndertohet dhashte Zoti kryhet shpejte, me gjithe rrespektin si besimtar jame shume… 
 Ahhahahahahhahahahahhqhqhahqhahahhahahahhahah so funny hahahhahahahaahahahahahahahhahahah
 Jam kujdesur per to kur isha i vogel tek dajt e mi. Nderi me i madh ka qene me ta shtru vendin ne ode te… 
 Ugiq i thojne nese nuk gabohem
  Ambasadore fort ja qellon po kesaj rradhe shume shume shume, moti i kom thone bonu me Inter'in por spo merr vesh
  Varet ne cilen gjuhe 
 Ngushellimet me te sincerta per plakun Berat! Te Zotit jemi dhe tek aje do kthehemi te gjithe!
 Do te kete hetim mbi hetim!
 Ne rast nevoje nja dy seanca i ke borgj :)
     Nese mundeni nga nje email me pak fakte hist… 
  Ringtone ne tel e kam prej qe kam fillu me perdor smartphone
 Mos me thuaj qe  nuk del me ne TV
 Fleksibil i shpejte si Fleksi
 Hahahahhaah qy qy ka Gepeki, shofershajbnja, tregeri. Untershrajben mit zigell 
===