 As une se mka thon profesoresha koke e killaft spo din me bo skleka :’(
 Ja kan nis moti 🤮
 Qasaj rruge ket vikend jemi po mdoket
Qe tri dit jom vesh si me kon vera se isha kon tu e kqyr motin n shengjin jo prishtine edhe thojsha qka po ndodh qe… 
 Martesa mes gjinive te njejta po na e prish familjen - tha Shqipetari qe vrahet me vllaun per pasuri
  Se e llogaritin shuma qe ke ble edhe kusuri bohen kejt bashk 10 kishe mire ti ka kthy
Perveq ushtrimeve edhe n provim i boj adhuresa adhuresaa 🥲 
 FALEMINDERIT QE E THA DIKUSH
Edhe te shkallt e teknikut 🤲🤲 
Mkish mungu kogja shume me marr pjese ne evente te  fizikisht ❤️❤️❤️❤️❤️ 
 AS MENJA MOS T SHKON ✨✨✨
 ke msu per dyjat apoooooo
Arsyja pse rri hala fiek osht ky edhe isaku deri qitash
Qysh mja nis dites ma mire se me pa blerim rexhen me mengjes ☺️☺️☺️☺️☺️☺️
 Fizik bre mos hifsha mo
 edhe shume tjera programerja ma e mire e fiekut  
 Tkom kallxu kon me thirr po spo m ngon
 Per mu e ke pas apo
 Problemi o qe QDO DIT ndodh ky sen :(
 HAHAHAHAHAHAHAHAHHAHAAHHAHAHAHAHAHAHAHA A DIN SA SHUME BRE MUNOHNA ME NAL VETEN AMA KANIHER SMUNDEM :’(
 Jo more veq kush e perserit vitin pagun
 Une rri n shkall si gjynah se kejt koridoret ka njerz
Une cdo pauze n fakulltet 
 Kto pa njona tjetren ska shanca
 per halloween po du mu bo kishe su bo sen
Is he hot a vec srrin me kerkon n fakulltet 
 ky sistem i drejtesise, osht armiku ma i madh i grave
QYSH harron profa qe ka ore me majt? CKA TJETER KA ME BO ???????
 As sdu me menu 🤢🤢🤢🤢
 Miremengjesi te gjitheve, pervec atyre qe me shume krenari thojne "cfart more, une kurre nuk dal me votu".
  HAHAHAHAHAHAHAHAHAHAH tlutem qaq shume projekte edhe n kafe po duhna
 Njoni m pat bertit qe e kom shkrujt auk jo A.U.K :)))))))))) mytna
 Aha 2 dit ren data t rendsishme
 sot thjesht spo ndihem
Edheune ama o ka don me dek tu msu 
HeejPer t’gjithe ata qe kane dashte me marre pjese ne grupe mbeshtetese por s’kane pase ku, tash grupet e para mbe… 
Tmiat po m rrejn qitash qe mire ama pjau lo masi pju dhimna 🥲 
 qe e premton perparim rama edhe ni teleferik prej bregut ndardani pa ja qit voten se lo
 Ma t mire ska sigurt ama sdin ti
Biblotekat duhet me punu cdo dit* 
Fiks kshtu po ndihem 
Hala spe kuptoj pse duhet me kon qikjo videoja e mramjes
 Tregu i shqiptarve, Nish 1927  
 Sigurt skrahasohesh me Dean :/
 Kogja ma e mire o
 Kemi pas me bo diqka nese skalon matematike....
 Edhe ket vit skemi me bo foton a :’(
 Po nihna keq qe un niher hi e shoh a ma kan uru tani jau uroj
BIBLOTEKA DUHET ME PUNU EDHE KUR KA PUSHIME PALIDHJEEE
 I kena do n mahall qitu 🤔
 Neser s quditna me t pa n shishe
 Mos mjep stres tlutem 🥲
 HEHEHEH SISI MKALL ❤️❤️❤️❤️❤️
 Pal Lekaj i pakenaqur me programin e qeverise ne ardhje. Lajm i keq, miq! 
Un hala sjom kfjell prej afatit t janarit :’(
 Ma t mire se n sami jon sigurt
 Gjithashtu mpaska marr mali per dardani
 Shko n fiek e sheh qa o labirint pernime
 HAHAAAHAHAHAAA okej poshkon kjo 
 Tregom edhe mu masnej
 po bohnaaaa qe spe di ...
 Ma keq ska ku shkon shnosh
 Bohu sa ma shpejt
Sa ma t bukra i kom shenimet qaq ma pak di per qat tem
 HAHAHAHAHAHAHAHAHAH parameno n vit t dyt me qfare keshet
Mi lshu dy online classes njejten kohe edhe me kqyr kursin anen tjeter? Yes. 
Skom pas dit ma t mireeeee se sot QE TEPER MOTI
 Flej se n fund krejt i ndreq notat
 O MIR E KI JA SHKRUJ NI EMAIL EDHE E BOJ HALA MA SHUM NERVOZ HAHAHAHAHAHHAA KNAQNA
 SKAAA SE E KOM MENU :’(
 Mka kap pleqnia me 18 vjet marova
 Bile t kish menu kur fol ish kon super
 HAHAHAHAHAHAHAHA po smunet ajo krijes pa filozofu palidhje per SECILEN TEM per pak vemendje
 Pse bre dren pseee qitash :’(
 Mu m qitke valla
 Per me shku mi ble senet aty
 Ngjitun me xhamine, qe po ndertohet e qe osht kah bohet teme, osht posta e Kosoves, e cila ka bankrotu sonte.
 Si sheh ose veq priton qat her mi kthy ose osht nxon ka plot arsyje bre sdmth me kon kim kardashian mi vonu
 Edhe kjo pytje e mir
 Logjika e ksaj prej komenteve koka qe kishe ky fakt e bon kta qik t shpis
 Mos me deshprooo drin
 Plus shejat qe e ki dalin mas dy jave kto raste sen skan lidhje me tubim po mos tma teshin
 Poo ashiqare shum mir t kishin nejt
Ata lypin me kon fakulltet un veq me naj trajnim najsen qe e kom per qat sen tu apliku si kurgjo 
 Oj qik edhe neveeeeee amo na spo pranojna hala jena tu menuu🤭🤭
 Me ka mar malli per kohen e feminizmit! U knaqshim tu lujt!
 Edhe mja bo bajat jeten adhureses hajt qaty
 Diqysh shmajte duhet mu kon djathte e jo majte
 FALEMINDERIT QE E THE
 Tka met e naj shoqes se e ka harru ajo masnej mos mja lon qaty
 Kjo shkon paket me benzin
 Fiek ose ubt TI
 Edheun qe tkom shoqe haha asi AHAHAHAHAHAHAHAHA
 ma kujtove wife material-in dhe po me mungon edhe ajo sonte HAHAHAHAHAJAJAJAJAJAJAHAJA
 PO DU ME RT PSE PRIVATE 
 Po presim mu ngjall edhe luli edhe kur sigurohem qe e krytem e thojm
 Qe de po gjysa tjeter veq notat na kan qu ashtu si kurgjo hiq zemrat kurr mos i pafsha
  HAHAHAHAHAHAHAHAHAHA diQka ashiqare bAjm
 Se lojm bre pa bo dickaa sigurt
   SKOM FJAL PER TO HAHAHAHAHA
 Masi te kryhen intervistat me Albinin. 
 JA HA ZEMREN HAHAHAHAHAHAHAH
 Edhe per kta mka marr malli
 Qe de ani mja fal thojka ncncn
 PARAMENO PO E SHKRET HAHAHAHAHAHA
 HAHAHAHAHAHAHAHHAAHHA QE DE BAB
 HAHAHAHAHHAA O POO AHAHAHAHAH gjynaaah
 Kurgjo sun bon pa provu kshtu qe pse joo HAHAHAHAHAHA
  Hahahahahahahahahahaha jo ata sbaaan me dit tjert
 Ajo po dihet veq qysh me mujt aty problemi hahahahaha
 Hahahahahahahahahahahahahahah jo hala veq disa mungesa jon ato ;)
 Hahahahahahahahahahahahahahah jo hala veq disa mungesa jon ato ;)
 HAHAHAHAHAHAH mka pushu ej kom pas nevoj
 Sot menojsha mi pre edheunnn karantina fajet hahahahahahahaha
 Amo rtv besa sbesoj qe o e vertet najsennn
 HAHAHAHAHAHAHAHAHA jo mo jo
 HAHAHAHAHAHAHAHAHAHA A PE SHE QE KA DIQKA QE SKAJ
 HAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHA mos m deshpro
 HAHAHAHAHAHAHAHAH t pyta per ni album kap nimom
 Edheun po fore jon ato n ig HAHAHAHAHHAHAHAHA
 HAHAHAHAHAHAAAHAH Mu po ma bojn jeten bajat me ton at bukuri
 Edhe asi qe jau bon 300 sene maf amo prap ndreqen se pe donnnn 
 No ska lidhje kush i ka boo merenci me kon fotoja qe t pelqen hala per me lon
 O GJITH EDHE KU
 KA KA SE KREJT T BUKUR 5
 O PO HAHAHAHAHAHAHHAH u mbledhshin rinia n viv
  Merenci me majt HAHAHAHHA
 Munet mu majt shtator moj
 u dasht me t ngu
 HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA SPASKE PAS FAJ
 AHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAAHAHAHAHA PSE BRE ADN
  HAHAHAHAHAHAHHAHAHAH PO I KEQ
 Ky sen u deshmu shum ma shum me raste ma heret se sa qitash
 Turqisht qa po pret
 HAHAHAHAHAHAHHAAHHAHA po ma merr menja qfare o
 Sot jemi me maska, por asnjehere skemi qene me te zhveshur ne personalitet.- 
 HAHAHAAHAAHAHAHAHHA EDHEUN E KESH TU I THON SAME
 E moj tosk me dit ti qa kish thon aaaajjj 
 Dita* se sna ka dhez
 NUK KA NEVOJ MU MSHEL....
 HAHAHAHAHAHHHAHAH PSE MA KUJTOVE
 Nuk harron me dasht se sosht diqka qe harrohet veq s hup kohe shum n at aspekt n ket mosh
  KISHAAAA VDEEEK TY MOS ME T PAAAAA
 Edhe hekra n dritare ka.....
 Pse per kto qe sjon t pavaruna ska respekt a
 HAHAHAHAHAHAHHAA VEQ KEQ QE KTU SPO MUJN ME KRAH ME BO TRIPA
 Prap rren se un jom
 Edheun 3shen e shkolles
 Ja bon mute storyyyy t qati personi edhe st dalin mo HAHAHAHAHAH amo o edhe ni menyr me dal qe niher e… 
 Kurr se pasna ni n sami kta HAHAHAHAH
 A o mir AHAHAHAHAHA
 Mos ta nin sisi i sisit
 Spaske me dek kurr
 Mja nis me msu per qita se erdh fundi valla
===