 Ishalla bjen asi bore pak e lagt me bo akull met ju qi nanen mir bile
  Jeni bo shum lame tu ju kap per kari ktynve t’IG,e sa per “t’rriturit” 0 fucks giving.🤚
 ni iftar e ki prej meje❤❤ 
Albanian parent be like:Qyqja un kon e kom rrit 
 Si un e paske kit t'mir. Ruju ti prej meje un prej teje
+ Kur m'livdon nana para musafirve- 
  Smet kerkuj jo quatro e kom o daj
  Qe po foli un , a e din kur shkon naj rrug nalt doket tenalt e kur shkon posht doket tepos… 
  Puna e trunit shihet me x-ray, ose rreze x. Mos perzi fakte me diqka qe veq ke ni. Beso spo t… 
  M'vjen me kajt kur e shoh ket tweet kaq t'mir me kto komente kaq negative. Kena shku pe… 
 E kta qe qelin n emer t femnav, gay thang.
+ Un kur ti veshi pantollat e vllaut tmadh.- 
 Njerz qe pordhin n'autobus jon jete.
+ ma para dal npenzi se qe mbon request najkush 
 O kqyre po ku i len njeri vot nfriz more, aj botra jem osht frigorifer sa tvi nprizren un paplumin e pi… 
 Un jom njeri me vlera kombtare e ka kuptu edhe aj qe jom njeri i shtetit sguxoj me dal neper urban se k… 
 Qr mu valla pom vozit shefi deri nshpi 
A thu egzistojn syt qe shohin n'brendsi !?
 Rri ma nto se duhet mi palu do 
Kurgjo ski me mar me veti edhe frymen qe e merr e kthen.
Jo qe mha kari po mos mboni follow kur tjau kthej me hek o magjup tkarit
 A qr a e din punen e farav qishtu diqka pa qel jon shum tmira kur tqelen e i len do per neser s hahen ma.
 Nese e mar edhe un ni snap qishtu qdo mengjes muj me thon qe my life is blessed
 A vi bojm bajram be
Tu u rrit tu u qorodit edhe qikjo estrada jon qashtu mut e bonen.
 Hahahah veq zoti qe ka dit me fal
T'ish kon jeta e mir sishum lind tu kajt 
 A e kishum qit ni CS deri t'ishum pi krejt hahaha
  U mytum tu u lazdru hahaha
  So pun kanceri kur qethesh qel mos disrespekto
  Allahile mos te bojn like qit tweet qato qe sjon qishtu
 Kush na shan naj ha karin❤
Njerzt e presin fatin e jetes un hala pe pres at filterin e qiellit n'snap n'samsung
 Mo be me dissa vet spom shkrun hahaha
Qeky K-ALBO o reper me koqe.
Tu e kqyr perendimin e diellit qe s'lindi kurr!
 A e bonum serioze a? 
Respekt per ata qe hala qojn sene me bluetooth he nanen ja qifsha❤
 Spo jetohet pa dashnin e jetes 
Ma ma luj menemadhin/ken se tqi ropt shuplak syt xixa tqesin.
 Qe je nlidhje me mu a , un kom fol hahahahaha
Nese nuk t'ha kari me m'shkru me m'vet qysh jom kur t'shkruj mos um vet amani t'koft.Mos laj mut me shurr
Mu sum ha kari per jet.
Qe prekni ju bothquta mu sum ha kari
Qe bre ni foto tamon foto qe i perkasin gjinis femrore se jo tu i qit botht nonstop aty. 
 Un jom tu u munu me tshti me ma qit ni kafe po qfart hahahaha
E nashta edhe nbot tjeter nuk ka veq parajs e ferr.
   Ma hongshi karin 3t po ku kari u bot ju me tw fake me honger mut
 Shum ta thejke muzika dje n'bus sa edhe komen e livritshe hahahahaha
"Kur ki me than diqka per mu hajt thuma mu shoki"
  Qeky ke aktrimi yt per sot shihemi ne gjysmefinale
  Bone tag ismetin thuj ki me ma ble ni monte qasi t'lindes
 Down osht per momentin jemi tu e bo maksimunin me gjet problemin, me respekt Mihrije Braha (Instagram owner)
 Dhomt ma tbardh se e ardhmja jem, e ma n'vij se jeta jem bisko
Ma mir me menu se palidhje me fol me t'nime.
  Boma add nsnap tnjojtin vers e kom qit hahahahahaha
  Ska asi tqim nane jo
  A punoni te kta qe bojn postera a qa o ky mangupllak
  Ah be qe se paskna pa ma heret qeto, english be nanen ja qifsha nklas 3 e keni msu kto
 Se marrke bile milka me kqyr veten aty nreklam
Kejt qa po na vyn me ra n'lirim plumat se na trima jem po jem fikana
Ngo mos mshkruj prej 20:00 deri n00:00 se sti kthej me qi nanen
 Nike osht per sportista na jem badihavgji veq qorapat mujm mi pas nike edhe naj maic qe na ka pru daja pi zvicrre
 Askfm u kon legjendar hahahaha
Mos ma thini rakin ktu se sjeni veterana hahahaha  
Sot thash tbohna pozitiv, po a mun i rrin botha shqiptarit pa ti qi nervat bre?
 Ni boks cigare hahahahahahahah
N'koft jeta e inqizume, sja vlen me kthy prej fillimit.
 Ose ni kese heda qetsohen
 Po ku pe din njeri be qija nanen 
  Shum koke per me majt lop papq ti blej do veq mos hi mo ntwitter
Duhet me bo apel me shkrim qr 
 Hahahahah ta ha zemren❤
Follow  ndasht me thy nrrajt
 Shum photoshop qr qy qysh livritka permas ajo garazhda e kerrit, e de mos ja qi ropt mos kqyr se ska jo
Sum ha kari edhe nese neser des.
Afrohu ngat gjithkujt po mos e le kerkon ngat teje.
 Hala per ni dit tmir be tu u lut, mu kan pi durt, trut mu kan kup, pe du ni dit tbardh nkit jeten krejt zi tmlut.
 Veq mut pe bojn qe pe shajn gucci-n, so lame
 Mos ma sill oj Id
   T'shkrujta n'privat qaty mki te mesazhat ajt
   O spermatozoid mos ma luj mangupin
 Pse be Adrian qita pi fshijn komentet
Shum per kari m'shkojn qeta me mene tmadhe. Kam ntok i ki o mut
 kqyr bre n'mujsh me ja marr naj numer se edhe kjo si un pe dojka qit koh 
Bari edhe raki pim merzien e zhdukim
 A ju piskitke gadafi hiq hahahahahahah
 Flexing on my ex me ni eks t'pjeshkes ey
 7:45 veq sa u ndava me gjumin hahahahahahhah
 Veq pordh koka kon mos u tutni hahahahahaha
Un jom asi tipi qe ma thejn muzikat si qikjo Gjiko - Trèndelin
Qicerka e karit hahahahahahahah 
 Se di kur jena prish moj hahahahaha❤
 Nah mojj mu bash ma then qeky mot hahahaha
  Kjo kokerr osht kur han fli me hanger mos met dhimt lukthi, ose kur je unt e han buk qe t'bj… 
Si dritè erdhe si hije shkove
  Veq tkishe pas qef me lujt me tuat tash ishum tmartum, bruh
Kaniher senet e kqija t'bin menime t'mira
 Pse mu dok si kokain, aa se skom pa kurr kokain qata hahahahaha dumb ass me
 A beso qeky tweet u bo nga dora e hauj
  Krejt mir ke fol po qekjo "kk" damn man it's too fuckin' old thing
 A un ta qi at nan ani kosova je serbija, dhija niher
Sdi qysh kan vullnet me jetu mo qita shkavellat, ahhahahahah
  Nese smartohni un sbesoj mo kurr ndashni
Tuta ma e madhe e serbis 
 Nese ni tweet per ta se sbonn sjetohet kshtu
 Po ta sillin hahahahahahhahahah
   Qishtu ja kap ni shqiparit karin edhe pret me tu derdh nftyr hahahahahahaha
 Ooo tu gzoft zemra per kto fjal
 a ta kem qi familjen keq a drejt kallxo hahahahahahahah
Shqiptart mas ndeshjes me serbin, dil nqytet tkallxoj qa o qyteti pussssy 
 Maje nwallpaper o bir kurveeee hahahahahahaha ti kina qi mit piqkooooo mater
 Qu hajde ni shanzher gjuje
  Ti ka qi ropt SHAQIRI o shka muti
Hup nserbi ropt ti qifsha 
 Masi smka lqu zemra qitash kurr smlqon
 O qato viza bre
Kape shkau shtrije ntok e qi nanen qekiq
Refer ti qifsha ropt❤
A don me jau qi nanen shkive bone shqiponjen qijau gjallt
   Tamon puna me ju ofendu per telefona, nah veq kallxova
   Iphone osht per old people qe sdi me perdor teknologjin mir , i mir osht veq osht… 
 Hahahahahahahah ti kisha bo 100 bile
  Shum per me kesh dekum krejt.
 Zot bless this girl qfar zoni❤
- ilaqi ma i mir per kta njerz osht plumi n'lule t'ballit.
 Me ble pitlaka tnxeta, tash a mu bo tburgosuna qikat mos me pas tdrejt sen se hala koke me kanun tlekes t… 
 Tybe na femrat desh me pa ni djal nuk e kidnapojme, sdi qka leshi e arsyetoni epshin e "disa" meshkujve po s'je kafsh mos me…
  Kush o pro mi tredh qita "meshkujt" ✋
 Support e kini per kto "llafe tgrave" qe i bojn do njerz
  Mos ta nin veq stay strong ktynve seneve❤
  Ska kerkush tdrejt as mi fishllu ni femnes, mentalizum. Nese t thot najkush najsen kallx… 
 Kur jom pranu un edhe Ndre Mjeda pranohet e le ju
 Hahahahah m'fal, shum mir po dokesh
Hajt hajt mos ha mut qe 20 cent veq mos qit tweet qe se ke njoft X. Qije nanen
  Boll qe jem gjall na djem e qika, qija nanen
 Sjeni kerka kohve tfundit me pozitivitetin
Nese nalesh te diqka qe kurr se ke menu qe ka me ndodh, kurr ski me arrit qata qe e ke menu.
 X and Peep for our generation the best, legends❤ Nese dikush osht kunder le ti shtin gishtat nmut e ti lpin✋
 E kto nanat skan nejt ntweetera po kan la en e kan bo buk, oj e "rritshme"
  Nese foli per dikon e percaktoj si person e si perfshi krejt se sen tkarit sjeni tu bo me qita tweets.
 2paci ka dek para 22 vjete , hala permenet. Do njerz s harrohen kurr edhe nese shkojn. Senet qe i lojn permas i majn gjall.
 Kur te han kulaqin e fundit tbakllaves edhe tmesin do copa si kap piruni e i kap me gisht tmet do sherbet ngishta
 U mushum shkie hahahahahahahahhahaha
  Ik more ju tpa bes jeni se pini qajin ju se ju hin musteqet n qaj hahahahhahahahaha
 Po vi po boj bajram kaja nanen
 Urime edhe ty, a ki nja 50 cent qaty dal te pi ni kafe e ti boj nja 30 snapa qe jom tu e thy per bajram hahahahahaha
 Edhe un boj apel kur tshkoj musafir nese thom ni her spo du le me qaq se na lodht
 Te kojshikja me bo bajram please
 Perhajr bajrami cutest girl
  O konstadin o haluc mos ja sill qikes marre duhet met ardh burri plak
 Qyysh me hi nfore per bajram, ei llokum kom ni qe e kishe qit ni bakllav tmir qoma ni kulaq lmao
 Babi i ka fry banant ato ballonat i ka fry i ka kup gjysen nanen jav ka, si kompresor nja mas nja
 As un hiq , sidomos e kom ni relationship me mickojat kur t'mhajn edhe ikin vet toni kthehen i mys, skom ndjenja mo per to
 Per bajram kena mu knaq hahahahahahha oj gent paja paja
  Buka that s'shkon qe pi shtoj edhe un po jau blejm ka ni burek
Po m'dhem kryt lot pikojn prej dites qe e gjeta faktin qe shqiptari mer lakmi n'analfabeta.
  Srz qishtu thot a?
  Ta paguj ni deo qfar ndjerse
 E ty tu thaft ajo dor
  Hupsi pagun sum ha kari mu
  O klloshar apet s'erdhe n'sony , po hiq mos hajde veq mos thuj qe stkom lut, kem me Ndre… 
 That means qe ma mir ishin kon me ti bajt drut se gajlet.
 Mori tha skem zemra na hahahahaha
 Perveq adapterit krejt ti fali , merri merri kejt ti fali
 Po skem zemra na hahahahahahahah
 Spaten qare o daj i munoj pasuli
Po qfar veni t'par o zhyllan.
  O kostandin o bir hajde me lu sony se pot qi gllupin e karit qe sa jom tu prit
 U pordh dikush se na myti era, nese mthu mu s`osht e vertet
 Femnat presin asi mesazha ledhatus "jam hamshor i vetmuar me shkruani ne imbox te jau kuqi pjeshkat"
 Qysh po doket e lame eren palmolive po ja nij
 Ma lujti trunin fotoja e profilit ton
 mos ma keqperdorni miresjelljen
 Se e kapi mirsjelljen e ju shti me ni qosh jau boj shpinen ma but se barkun
 Pom dhimesh kaq e re me mar kit smundje kaq tran ishalla bon ma mir ajajajeee
 Lulo pak mos e rruj krejt hahahahahahahaha
 Merre kerko veq pak se sbon nat e madhe, hahahahahaha
 Tu prisht adapteri qe sma bon back
  Mu mka rrok tuberkulozi tu menu me kon jom kon
 U qyqe a e pe qa i boni heke heke kuku e myti hajt le edhe pak te kqyrum a po pshton jo jo heke heke se llom e boni.
 U dhezke nshminka, merrke hygjym nLajner, Midis shpis para lavaborit ta kom hek kejt makeupin pusyyyy.
  Hahahahahahahahahahhahah o qija ropt
  Mos fol kaq paqt se tmarrin msysh hahahahahaha
 Qa tkarit sma ke kthy ti mu se hahahahahahahahah
 Kom besu qe nese marr nota t'mira jom i mequm
 Mu pom mungon ata Taxit si orbita qija ropt shum bile
 I ka rrok zhegi gjynahit hahahaha
 Edhe kur ju shajn duhet me ju than bab hahahahaha
   Me kan si ky haveri i kisha pre venat sakic hahahahahahah
 Qita ausllanderat tash qe vin veres pak me dasht na bin ka ni iphone X kishe si dhurat edhe pse meritojna ma shum ama per…
 I kacavirrna' menimit ton me dy durt
  Shoqet si t'bojn frajera sti njohin as tabelat e kerrit mo
 Tu e nxeh karriken per afatin e provimev. 
 Kejt si n'komun ktyneher kur pritshum 2 - 3 dit per ni qertifikat, kaja nanen nostalgji a?
  Sen nuk ke bo nese sja mshon telefon *gup gup* nkry edhe mi gjujt uj qe mos me ju dit g… 
 Po uromna ditlindjen nanen ja kajsha
 Valla deep ke boll hahaha
 Epo fmija per nan hjek mas shumti
 Jo e kqyra, amo dashta me hjek kit seriozitet pak mos mu prek njerzt qe e marrin ngat zemres✋
 + Qka ki tkryme?- Muabetin me ty.
 "Me pas dit qe del ti kisha vnu kondom"A ka met najkush pa e thon hala?
===