 🤣 I fitoj Stupcat me ftu ket njeri dhe me ba pjes te grupit Stupcat. Ky eshte aktor i lindur ky e ka profesion ahahah.
 Ka than e do te thom prap! Gabimin mat madh e ka ba populli i Kosoves qe nuk ja ka dhan voten Ramushit. Pë… 
Edhe une i Bojkotoj 
BOJKOTO PRODUKTET E SERBIS 
   Sipas  Bashkimi vjen permjet Serbis. O  shko stopoj asimilimet… 
 Edhe Daut Haradinaj kish ba pun ma tmir se kta dy. Per fat te keq njerzit ne Kosovo po paragjykojn.
  Jo qe kan lufue dhe kan bere vrasje po edhe sot jan ka bojn. Une e di qe Talibanet luft ju… 
 Po e kuptoj ama per qka shteti ka opozit vetem per kto raste si kto.Une ju kisha lut te gjith opozi… 
 Kta budallenje nuk e din ende kush eshte mbreti. Nje Sali ka ba nana. Edi I ka gjitha mundsit sot dhe… 
 Muhamet eshte pak marr edhe prej juve me i leju njerzit matrapaza me marr gjera kaq te rendesishem p… 
  Nuk e di qka quan ti intelligence. Veq General a pa intelligence nuk ka. Shko veti serbet te… 
 Ma bre qishtu edhe ti Berat se sbon…  Ujku ndryshon se le ma Bini. Jo more bini veq qimet i ndryshon s… 
  Qaq din qaq flet… Tmerri i tmerrave kur i prishuri ne kry te prish edhe ty. Po qka kish bo S… 
 Pse more burra kshtu….. Jan ka ja bojn me qellim. Mos rasisht ky ka naj secret te LVVse ose Kurtit dhe jan… 
  Qysh nuk te vjen marre me shkru Serbish Kosovo. Ti je tradhtar e jo kta djem qe lan mi… 
 Jo vllezerit se u kan si luft at dit prej Policis se  ky ish budall o burr. Me dit qe jan kan z… 
 A jena kat Abazi dhe Jeta me at aferen e milionshit. Ktyve te LVV edhe helum me ju qit zyrtart e tyre kta… 
 Zotri mos bo desinformata.Tentimi dhe e bemja jan dy gjera krejt ndryshe. Pse burr gjith kur po mengjohet… 
  Erion ti je e vetmja shpres ku mund te ket diqka ma konkrete sa i perket Kosoves e Shqipris.… 
 Thi zoti ma ka ba… sidoms kur po i ndegjoj do ish deklarata te tij. Ama superman u kan me goj… Tash u ba d… 
  Edhe sa njerz duhet te vdesin qe te shkarkohet Arben Vitin. Marre kur tja kerkosh dikujt tjeter dmt… 
 Qysh po hec Albini don me ra nen ligen e dyt…
 Tregonja  se ai po mendon qe Serbia ka ndryshu. Serbet jan si dhelpna kimen e ndryshon a zana… 
      Bukureshte u kan kryqendra e… 
 Pas gjith ketyre crimeve e kan liru prap. Po tja kishin dhan 5-10 vjet burg ma heret për kto krime nu… 
 O vllau Kanun e ligj thjesht eshte tmerri i tmerrit me ja marr dikuj jeten. Thjesht e papranushme. Gj… 
 Veton pak a shum po e kutoj  po nuk e di pse pa vepra e veq me fjal po ju beson serbve .… 
 Oj Moter po kerkush nuk e zan vendin e vllaut zoti e ka lan ket pun keshtu e zoti Rama let te shkon m… 
 Jam mase i sigurt se kurr tani. Edi Rama ka frik Ramush Haradinaj. Ai Rama e din qe te tjert i mashtr… 
 O Luli ta keni te qart ju gjith politikanet se populli Shqiptare kurr sdo te ndahet. Nuk ka mujtur… 
 Për bese marr po me vjen. Edi thojke Sali Berishes je tradhtar i kombit se ju ke shitur serbve naft gjat l… 
Shqipet e bojn mas miri…. 
Bojkotone kriminelin dhe perkrahesit te kriminelave…. 
 Kur populli eshte bashk qdo sen eshte e mundur pa marr parasysh peshen . Ktu te kjo ftes ka gisht politika… 
   shiko qka po sjell politika jote .
A Shqiptaret e Lugines se Presheves luftojn neper gjykata vetem e vetem pse kan shfalos flamurin e tyre kombetar.… 
 Edhe po te ishim te njohur nga Serbia do duhej refuzuar. Bashkimi Europian sa do pak te kthen disa… 
 Kta nuk po pytin ama bash hiq.Pranoj idet tona ti, nifar menyre te dhunshme. Nuk bon me leju Kosova vet… 
 Nuk ju afrohen ngat Kosoves. Tjeter eshte politika e fliqt ama per Balkan Kosovart jan Mbretrit. Si mu… 
 Abit Kosova nuk eshte kunder kesaj inciative por Kosova po thot eshte heret sidoms para se me arrit marr… 
  qohu burr edhe ni her pastroh Shqiptarin prej ktyre tradhtarve.  fale detin Grek… 
===