 Hajde more perhajr, a ka naj kafe?
 Shko bre me kon dush..ajo qe kena pas na dy, s'ekziston mo, ka met nt'kalumen! Harrom!! Un as spo t'njoh… 
 E gzofsh Eli :)
 Edhe pjesen e fundit e thojn a?!
 Lena qaty se mir jemi hahahahahhahahah
 Hahahahahahah okej..qe tduhen ndihms, boma ni zo
 Shkruj be kaja nanen, s'kerset kjameti
 Si jeni e nderuar?
 Kah i gjen kto fjal se hahahahahahahhahah, ma qiti gazin nkit zheg
 Pse? Bash kinge je tybe
 Sherim te shpejte vlla
 Amo veq "Familja" stka thon me postu
 U kry boss? Najsen tjeter? Le be mos na shit fore allahile
 Fuadi a? Jo ishalla!  kogja nifar burri dokesh bre shoq hahahahahahahah
 I kom do ide, po asnjana hajr so
 Hajde Urime urime :). Respekte Ushtar
 E per qeta e urren a? Hahahah kadal be njeri..se ki Amerik ktu, ajo dihet
 Gugu bal, e lumja ti
 Me ja "kire mamane" hahahhahahahahhah
  Qa spo bohesh rehat me kta twittera pash Zotin?
 Hahahahahahahah hjg ke be njeri, bon qka dush, smuj met tregu a me bo skandal a jo
 T'lutem mos bon skandal
  Bash, futja gjum llaqko qr
  gugu bal, qfar femne
  Shyqyr heheheheh..nejse te shukum tash se e bonem bajat
  Kryesorja mu kuptu bre shoqe
  Nejse de, qaty dikun afer e paskna pas hahahahahhahahahahah
  Pak ata pak na, ata ma shum se na
 Thuja atij, jo neve hahahhahahahahhah
 Hahahahahhhahah qysh spo priton gjith kta tweeta se..eu babanit be
 Hajde urime urime..suksese kinge :). Sokin pine ti hahahahahahah
 .. mvjen mir qe qenka sheru, e ske nevoj per operim!
 Pse ke pas mu operu, nese muj me pyt?
 Hahahahahahahah e bre Nare
  Hahahahahhahahah..nale bre burr veq pak se sbohet nami
 Pasha shpirtin e nans e kalli atuhen
 Ruv, allahile mos bo zhurm shum po qu hec bonu gati se ecum hahahahahahahahahh
  Un sdita sen tybe hahahahahahahahh
  Lena edhe neve tjerve najsen bre bij hahahahahahahahahh
  HAHAHAHAHAHAHAHAHH mir de t'tregoj ky jarani
 Durim be, krejt bohen hahahahahah
 Definitivisht ni njeri qe so mir nkry..un dje porosita qaj, jo kafe
  Ngom, se qitu o fitimi HAHAHAHAHAHAHAH
  Vllaqko, jeta tndryshon..si dihet..njeri ma i mir vlon kaniher. Edhe ksaj i vjen reni nashta… 
 Mem ngu mu, tash e tutje pa heker mos dil, po qe ski heker, bile ni kith babik e ban me veti
 Mu qysh mkan thon, esht per shkak se ki njerz rreth vetes qe sta dojn tmiren..apo me ni fjal i ki hasem… 
  Hajde de bro mos prito veq qit her..
 Ti kisha qito probleme be qr🤦‍♂️
  Le Lul, le king se tkom myt HAHAHAHAHAHAHAHAHAHAHAHH..Qe Shqiptari, shkon han mut, tani kur ja kthejn njejt i dhem.
  Qe njeri qe u provu, din qa tkallxon
 Kallxom ku, dalum meniher tybe Ruv..kush ta prish ty
 Qa me fol be cheeja nanen e nans
 Shih kah tqon aj jarani ndermjetsues🤦‍♂️
 Ani le pra hahahahah, as anej as knej..daje menen bre bij
 Shkruj atij Benit, ma mir ta qet
 Po hajde bre hajde hajdeee
 Ti the kush e din PER qka ke kesh..jo ME qka ke kesh..kshtu qe, ke kesh veq pse tu ka kesh! Qiti paret bre bij
 Perdore "juve" pra..jo "ju"..
 Atij po i duhet, jo neve..
 Ani pra..Meda - Vdis ooo vdis
 Meda - Jeto ti jeto
 Qka kena me kan bre zotnije? 
 Po ulna 2 kafshata
 HAHAHAHAHAHAHAH a ka met buk?
 Hajt se shpejt tbohet bajat
 Mos e thuj mo, se spo mujsha me ardh mdul ni pun hahahahahahahah..jo be tblej diqka mos ta nin
 Tkryme e ki, veq mos prito mtregon nqfar veni edhe qfar date edhe aty jem
 Imma hit you with "me i pas msu msimet qysh po i mson kangt, e para e shoqeve ishe"..hehe
 Qysh kurr sen t'hajrit stniva tu fol bre sdi qa tkoft
 Boni be, niher mpat dhez
 Qe Nare, shuki hejterat 
   Mos u mer me to i nderum, sja vlen me kta qobana
 HAHAHAHAHAHAHAHAH ta qet gazin nkit vakt..qysh spo priton me shkru se
  Ishin mush venat a..haj be familjen..thojsha shkoj man
  Ishin mush venat a..haj be familjen..thojsha shkoj man
 Vallai po..sot bash folsha me ni dost..thash e kisha pru ligjin femnat me bajt arm..kush te lyp, m… 
 Meda - Mos gabo
 Dy sene jon ktu..Meda - Vdis o vdisOseMeda - Jeto ti jetoTash zgjidhMeda - A me vdek a me jetu
 Tybe jo shpesh, se di..a ni dit njeri, mka ik, ooo vallai 5 metra sjom kon ma larg me hyp ne stacion, n… 
 Pse se thirrshe policin me ja q* familjen ati muti..
 Politika kshtu e ka..fatkeqsisht..se kta e din qe drejtsia so kjo
 Sen se kom vallai, nejse nejse, grahni, veq qone deri nfund kit pun pra, jo me lon n'gjyst..se me i d… 
 Ehhh tash..i njejti rast esht me juve..mos me bo sen ata ma tnalt se drejtoresha, as drejtoresha s'pe… 
 Eh qitash ta ka kap
 Moter tkom, lexo qysh duhet e mos fol palidhje..nuk thash qe ajo qika e ka lyp..thjesht po thom, mos… 
 Me kan parlamentart, kush sdel, 400mi sene ma tposhtra i kan bo, kush nprotest sdel, kush peticione s… 
 I bindun jom qe 90% mos ma shum e qatyne qe e kan nenshkru at peticion, as se kan pa at lajm, edhe jo… 
 Dergoma qat video ta shoh bre qysh u kon rasti tamon, tanaj vendosim..jo veq hajt po thot dikush e ti… 
 Ani bre..ishalla ke pushu mir bile..qa me than bre bij
 ..shyqyr s'erdhen se isha bo hor me i qit jasht
   Qe tash kjo menon..a me ngu Niten a Niten🤔
 Urime, edhe 100 pranvera t'lumtura🤩
 Urime e nderuar, suksese.
 Mir ja paske bo
 Qysh e ke permledh? I re a?
 Naah, e pata lexu qka dmth, amo sem kujtohet..si shprehje kshtu e di per shkak se e kom perdor tu kodu shum her!
  Ani mos ju kap per tina tash ti boss, se sen ty ste tha
 Prej krejt tweetav qa i kom pa sot, edhe dje tash po i bjen.. qeky mka bo me kesh..HAHAHAHAHAHAHAHAHHAHAH..sje mir
 Jo se thojn sbon nkit vakt
 Tdul pun edhe me kto a?
 Hajt be se sbohet nami se sje kumwdit qka jo..shaka shaka njeri
 Qa naj ke mar inati se
 Rt ti boj 500 fllw se spo rrihet 
 Jo se se ke dit
 Qysh be harron njeri me honger e me pi
 A jom i ftum? Heheheh
 HAHAHAHAHAHHAHAH ani de i ke pelqy🤦‍♂️
 HAHAHAHAHAHAHAHHe phort je Erza
 Dil moreee, qysh po mun me nejt se🤦‍♂️
  a mundesh me konfirmu kit sen?
 HAHAHAHAHAHAHAHAHAHAHAH haj medet haj
 Ti a...heheheh..le be mos lsho shtosa
 Ooooooooo..e ke regj qetu
 Ska dert..ndodhin kto gjana..hahahahahhahahah
 Qe bre po ta heki qee..bash sot ta dergova followin
 Support njerz me nje like 🥺 
 HAHAHAHAHAHAHAHAH ani de..rrenat per njerz jon
 Mos u ban pis hajde dujem 🥰 
 Ska faj, qfar storje esht..trishtim vuQaK..qysh jon vra e sene..
 Video qe ma knaq zemren❤️ 
 Ne kod, kur e qet "!" perpara diqka..dmth e kunderta e qasaj..shembull nese thu!mir = keqOse!ke… 
  Oo ishalla bre smet kurr vet maspari broke..e as aj jarani qe e gjen..se kogja probleme t… 
===