I paste bo mire? 
 Vec Shyhretit po i del problem me krejt. Qeshtu edhe me motrat Mustafa. S'po di tash🤔
Wait, sot s'eshte e shtune a!?
 Mos me vesh farmerka kurre 
Une 5 min masi thashe "hajt se shkojme ne kembe, s'kemi nevoje me shku me veture"  
Interesant ish bo me e jap Atletiko nje gol qetash..
S'paska permend numra, vec perqindje. Noice! 
Qysh me i rregullu notifications n'Twitter!? S'po me vijne shumica e njoftimeve..
 Keta s'e dijne cka eshte kripa
 Une e merrsha gati gjith buken me veti kur kom punu ne Kosove. Nuk ka pase asnje paragjykim. Per kom… 
Bollni mo me qeto pls 
 Qokollata sounds good. Une gjith kom ngajt neper zyre☹️ Amo ketu as ne zyre s'po t'lojne me hi🥲 Ne thelb p… 
Sa here e kom kqyr kete video?- 700. 
S'pata plan me mbet qut deri kaq vone, vec nejse. 
Vetem nje vend e quaj shtepi, shtepine ku jetojne prinderit e mi. Cdo vend tjeter eshte thjeshte ne banese. Te pakt… 
Deri tash jom perkujdes vetem per bime si aloe vera apo kaktuset, per shkak se s'kane nevoje per shume perkujdesje.… 
Gjithashtu, lexova shume pak rreth propozimeve per tatimin ne te ardhura. A e dijme me te vertete se qysh tatohen pagat tona?
a eshte vendimi per keto 100€ i drejte apo i gabuar. Sidoqofte, lexova mendime, por jo arsyetime. Nese mendon qe es… 
Dmth, cdo dite po vertetohet sa shabllon ka qene menyra e qeverisjes deri tash; me shume pak vendime qe nxisin disk… 
  Qysh s'po ndodh naj qesi gabimi kur po blej une bileta🥲
  Ahh, e kuptova. Keshtu pra asnje lende nuk zgjidhet. Ketu tash del edhe nje problem tj… 
  Ndoshta funksionon, por nuk e kemi provu.. s'po di. Vecse kjo eshte e tmerrshme. E kupt… 
 Rrotat e autobusit sillen rrumbullak, rrumbullak, rrumbullak
Pa dashte me u ndal ne individ qe e kane diskutu kete teme koheve te fundit, pajtohem plotesisht. Te pakten ne  m… 
 Ju jap perpresi krejtve kur s'di cka me bo hahah
 Deri tash po me pelqen. Te shohim ne vazhdim
Patente shoferat e Ks po njihen ne De. Shume mire. Tash na ka mbet vec me pase nerva edhe kohe me u marre me paperw… 
 Kur ki tesha po s'ki outfits
Mire ish kon me e organizu nje peticion ose dicka te ngjashme per testim te mesimdhenesve :). Fatkeqesisht keto re… 
 Edhe ne Kosove i kane heq disa prej produkteve Kinder 
Llogaritmni edhe mu per Po :/E per ata qe kane thone jo - Bravo, bravo, bravo!  
 S'e kom mendu kurre qeshtu me thone te drejten sounds bad hahah 
 Hahah ahh cka s'ka n'dite t'sotit
 Well, qe 3 jave s'ka pase ne asnje market- sot kishin pru edhe 5€ haha so yeah, do it. Vec jo me bl… 
Oh edhe btw, s'po e kuptoj pse po "gezohemi" qe Zvicrra ka me lujt kunder Serbise. Para 3-4 dite s'lame send pa tho… 
Me pase llogari ne Twitter nuk dmth qe ki te drejte me e gjyku cdo person ne kete planet. Grow up please! Edhe mund… 
Shume persona ne Twitter mundohen me u dok si njerezit ma open minded ne bote. Ne te njejten kohe, po keta persona… 
 Ato qe dojke me honger ne shpi. Thojke nata e Ramazanit, duhet me honger ne shpi 
 Varet ku jeton. Cdo shtet/qytet e ka ndryshe.
 Qysh po mendon? S'e kuptova :/
 Gjate Ramazanit ma s'largu ku shkoj eshte ne pune, masi s'bon pa shku
  Hajde Zvicrra ma gjalle, ma gjalle!! 
Qysh po mendon "bon edhe pa pyet"? Keto jane pyetjet me te rendesishme qe na iu bojme njerezve. Diqysh, po s'i dijt… 
Cfare pytje e veshtire  
 Ky mot eshte mot ideal per mu ftofe
 Absolutisht. Nuk po them pse i kane denu keta, po them pse s'po i denojne edhe ata qe po dhunojne e vrajne.
 Ata e kane nje armik te perbashket: Ty. 
 U kuptua shume qarte edhe nga titulli qe po flitet per totalin e viteve. Sidoqofte, une nuk po them… 
Bre cka jemi krejt kaq te lodhur sot ne pune, kur na u kujtu qe u ndrru ora edhe s'kemi flejt si zakonisht 
Ma mire i lenduar, se me nejt rezerve 🥲 
Qe qetu tu i diskutu problemet e botes🤣 
 Ndoshta per me e "ngushellu" personin qe eshte single? 
Dita e 3 e karantines, shpresoj se neser e fundit perndryshe jam ne prag te cmendjes
Qysh me i tregu komentatorit qe nuk lexohet RashiKa, se me kopi!
 Une e kuptova ndryshe. Nje person qe ka mall per vellain qe jeton larg tij.
  a na vec dojshim me i krahasu disa detyra. As 10min pune 
Sapo m'u kujtu qysh njehere ne Prishtine nuk na paten lon me i perdor laptopat ne nje lokal. Pa asnje arsye, vec s'… 
 Bash hahaha vaji ka perparesi, se makaronat po gjenden hala
Dmth n'5 markete shkova, te asnjoni nuk gjeta vaj luledielli.
Shume interesante keto fotot e fundit 
Pas nje analize te bere kam ardhe ne perfundim se sa here te ha mengjes, gjate gjithe dites jam me e uritur
S'paska atmosfere pune sot
Me shkru idk kur me te vertete don me shkru idc 
 Shume jo fer a :/ Edhe kur nuk ka pushime ose dicka prape jane shume shtrenjte. Plus, jom tu fol per keto… 
 Me tregu se ti ke te drejte
 Me tregu se ti ke te drejte
 Dmth po blejme bazuar ne frike e jo ne arsye. Po besoj se ky nxitim per blerje i ndikuar nga rritj… 
Sa litra vaj i perdor nje familje per nje muaj? A po blejne vaj per nje vit apo qysh eshte puna, se s'po i kuptoj.
Modric eshte tjeter nivel!!
Mbappe mos te kthehet hiq ne Paris me humb kohe :)
8 marsi nuk eshte dita (vetem) e nenes.8 marsi nuk eshte dita (vetem) e nenes.8 marsi nuk eshte dita (vetem) e nenes.
Me rendesi folderi u kriju 
Kaniher mundohesh me kon person i sjellshem, po tani shqiptari mundohet me t'bo budalle. E kur iu flet shume direkt… 
 Shendeti i qytetareve para cdo gjeje tjeter ☺️
A bon me i shtu edhe vizat ne hashtag? 
Une nuk e mbaj mend luften, por jam rrite tu i pa pasojat e saj ne gjendjen fizike, mendore, dhe jo vetem, te njere… 
Nja 2-3 dite me i mbyll rrjetet sociale deri sa te qetesohet kjo ceshtja e marteses mes gjinise se njejte. Prape p… 
Une sa here te shoh ndonje harte, tu e kqyr a eshte edhe Kosova 
 E kom cdo 3 muaj, e kur po me vjen njoftimi i bankes po ma rikujton 🥲
 Vec vonim, se pshtim s'kishAshtu e kam edhe une, por kur po vjen njoftimi prej bankes po ma rikujton
 Rekordi jem eshte +-1min 
Me u mundu me flejt kur eshte tu pase fryme te madhe eshte goxha sfiduese. Po m'doket don me i thy dritaret🥲
Ai boshlleku qe ndjen kur kthehesh nga nje shtepi plot, ne nje banese te zbrazet..
Kg te shtuar gjate pushimit? 2 
Edhe kamarieri m'tha "Ke hup krejt" 
Po ha buke ne Prishtine te nje vend ku hajsha shpesh kur jom kon ne studime. Po ndihem cuditshem 
 Aa ato jane nivel i larte pas disa muajsh e provoj!
 Indeed. Edhe mendoj qe duhet me i jap me shume minuta. Por, me keto minutat qe i ka nuk po mundet me p… 
 Ne kete rast per keta qe hyne
Shqipet qe m'folin shqip ne aeroport &gt;&gt;&gt;&gt;&gt; Shqipet qe m'folin gjermanisht ne aeroport
 Po pra. Keta shumica kane qene deputet edhe ne mandatet e kaluara, por kurre nuk jane anku per kete keq… 
Kur mediat e bejne punen e tyre ashtu sic duhet  
 Mendoj se njejte qysh kerkojme qe mos me u gjyku personat qe jane pro abortit, nuk duhemi me i gjy… 
 Po Krusha e Madhe eshte ne komune te Rahovecit. Ndoshta vetem me e nderru Orahovac ne Rahovec? Nese vec e kuptova drejt postimin
Bullizmi nuk luftohet me bullizem.
 Vec sa e shkrujta daten me nje dokument, edhe u ndala disa sekonda me mendu a eshte sakte 30.01.22 🥲
 I nderuar Besnik, e di. Kjo foto qe e kam postu eshte ne Gjermani.
 E di, kjo foto qe e kam postu eshte ne Gjermani.
 cka eshte ky asfallt keshtu!? Ne Evrope nuk sheh rruge ne gjendje te tille.  
 Me kqyr keshtu joarsyeshem, neve na bjen ma mire perderisa realisht ne jemi tu pagu per ataPerndryshe, s'di ...
Ne fund te javes ☺️ 
Une nuk e njoh asnje familje te ciles i vjen fatura e rrymes "vec" 18€. As veres, se dimrit hiq se hiq.
Pak konkurrence per Messi-n ne lige 🤪 
 Fatkeqesisht ☹️Edhe kur po behen publike, nuk kom pa qe eshte ndermarre dicka qe me u zvogelu rastet e tilla :/
 IdkKerkova ne google per kuptimin e emrit, e edhe ne translate, kerku s'ma perkthejke qeshtu
Oh Zot, cka po ndodh more keshtu  
===