Kush pom bjen buk
 Jepni dashni personave qe i keni afer se kur si keni n'jeten tane mo, e kot osht qdo sen qka ndjeni per to
 Mos u lidh shumë me njerzt se t'gjith kan me t'lan nji dit.
 Kerkush spom don :(
 Besom se kom mu kon aty per ty kur krejt shpinen kon me ta kthy
 O fleni se kerkush sju don
 Vetmin kurr se kom dasht amo tash veq qajo s'pom len vet
 pse duhet me dasht dikon qe sja nin per ty?
 Krejt gabojna ama un e teproj
 shoqata e personave qe nuk po mujn mo
Po du me flejttttt
 Hahaha kur tki qef
Po du gjiro me motorrrrrr
 mjalt per mi qit krejt senet n'vi
 qysh i ki punt? 
 Duhet mu bo i pashpirt najher
 Kurr mos e lejoni gjarprin e njejte me t'kafshu dy here
 Personi qe kom mendu se s'muj me jetu pa to, m'ka msu me jetu pa kerkon
 shpejt zavendsohesh pse po menon se ti nuk ndrrohesh?
 Urime vitin e ri sa ma pak njerz fake ❤✌
 Kemi mbet me nji bote ku besnikria osht veq ni fjal
Shum urime per mu 🥂 
Qka me bo bre qr
dmth spomuj me flejt as sonte
Qfar bajatizmi sot pheee
  U kry masi Po thu ti
 Mos u lidh shume me njerzt, se t'gjith kan me t'lan nji dit
 Nese smunesh me nidhmu financiarisht jepi rt mujm me ndihmu shokun tone 
Ku meten tash fjalt e tua , bashk me premtime tmijaaaaa
Njerzve ju rritet menja nga rrespekti tepert
 Nji perqafim i heshtun osht sa nji mije fjale per nji zemer t'thyme
Pse po vuni me mengjes
 Sa ja nis mu msu me dikon,largohet
 Snapi im per momentin  
Qfar bussii i lodhttt
Kush more qohet n6
Mu prish krejt nata
Qka boni ju kur jeni vet nshpi
Problem o me flejt
Du me dek prej nervozes
Veq po du me flejt sen tjeterrrrr
Pse lyna mamir kur skom me dal kerka se sa kur dal 
Dit ma palidhje skom pa
A idhnohet more njeri per qdo sen
 Te na ngjys nates thirret veq kur dek dikush.
 Qka je tu bo more 
Per ty un nuk muj me bo kthes
 Kur dikon qe nuk e njeh tbon add nclose friends
Me bo najsen se lujta
Mos e moho qe me doooo
 Mu sum don kerkush.
Po provoj me nejt nshpi sonte
Nmoment kur tvyn dikush afer , bash qato se ki
 un tu munu mi msu krejt msimet ni nat para provimit
Qysh mos mu nervozu
 Mengjesi pa kafe, so mengjes!
E du qet fustan 
Ma palidhje mooo sdiiii
 e kalon 1 problem tjetri meniher
Spodu mu qu prej shtratit
Qfar ngjyre mi bo thojt bre
Tu menu qe sot e hane
Me nejt deri nmengjes palidhjeee
Sa idiota po man kjo tok
A o ftoft jasht a
 sa mire mu qu heret sa punen e kom kry
===