 Kqyri be ti punt e tua. Llugski jan tut shku
T’premte ma palidhje spasna pa
 kush po fol ahahahahaa
Mos t’ja llogaritim kto masi pa meze 
 E di bee thjesht ka me mu tek mja bo kuklles qeto
 Ja kan qi kta me vjet po le
 Po bre mos qofsha 
 Cka po kesh be ejjj 
Un fitnessit ishalla amin  
Thash t’hi me kqyr qysh i thojn shqip. Whuadafak 🤦‍♀️ 
 Kerkohet gjak A Negativ urgjent. Ju lutem shperndani ose nese dikush e ka kete grup te gjakut te lajmerohet ne numrin me p…
Masi ntfiter ju kom anku gjith per ni provim thash tju kallxoj qe e kom kalu.Puc e ki 
O kush o ky edhe qka ka pi para se me dal n’emision? 
Jeni tu kesh po veq kur ti shihni familjart tu qel twitter ju kallxoj
 Kom provim neser duhet te mesoj 
  Aa thankuu edhe nihere 
Shume urime per mu ❤️ 
  More dyt jan boshnjak ncnc
 Dino Merlin edhe Lepa Brena jon kon n’top list gjate udhtimeve me ker.Veq thash tkallxoj qe ja di kangt
 Ti je qajo 1 prej 10ve o king qetcoU
Ja du t’folmin e Glaukit. Diqysh goja mjalt edhe fakte i qet ;)
  Kesh busy tu fol me dikon tjeter.Po rrej
Do qytetar ma kan prish foton qaty mrapa po rroft fotoshopi  
E pyti sot ni tipk shoqen per lokacion t’butikut:-Mfal ku e keni destinacionin?+ nijeti per n’xhennet po ta kshyrmi kismetin hehe
A e dinit se Berati pa Albinin do ishte  si peshku pa ujë? 
Si tja ni emrin e tij mu mdoket mdesin edhe qato dy flutra nbark, qe mezi gjall i maj
T’hanen i kom 2 provime, tmarten edhe tmerkuren ka 1.Krejt prej 1 profi qe o shum dashamires
Tlutna a bon meniher ni pergjigje se sot e Praemte e javen tjeter smirrna me ket Case 
  Mendova qe po punon aty e skan tentu me kontribu sadopak.  Mfal se keqkuptova.
 A nuk mujtet mi thon per ksi heri mujm me bo diqka e me ja pagu ju masi aq shum tu ka dhimt?!
Dove jau kisha marr lejen e mos mja jap kurre njet mo.
 Prej dashnis e pata o yll, e dish ti
Afati i shtatorit ka mu kon njo nder afatet qe ka me u deshpru mas shumti.I can feel it prej tash!!!
Ska termine t’lira per vaksinim nPZ thash tju informoj
 mshele deren se ka me tkap promaja o rrush
 Qka merr vesh be ti otor numrende
 Hahaahahaha o hajt se shum nxet o ma falin gjithqysh
 Nope mkan rra msysh a mfryn?
N’Prizren na vyn ni Servis urgjent
 Hahahahaahah provokim ke qetsohu
 E dii po ma mir se hiq be
Sot si mu kon e hane sjan tu kalu ort kurrqysh
 Godet ai qe ka majt 5 muj Schulung
Kur po o npun tripi i mir po kalojka koha teper cpejt
Mpaska marr malli per qikat e mija
 E heka qafe ni Case qe e kisha tullusum 
  Un hala jam tu kesh mos mshqetso
Prej tash pom kap nifar sikleti kur pe di t hanen ka me ja nis punes
 Go simp se postova
 Hajt se ti ki boll o QM
Edhe me dal prej grupit t’fk
Para se me mrri nShqipni puna e par o me i fshi do apps ku mvin mesazhe prej punes
Kush pot thot qe mun me e refuzu noten?
E urrej kur mi qojn nsnep notat e provimeve. Ani qka qe ki marr 10she o AABist
Shum vshtir ke mu koncentru e me msu po tash nket far nxeti u bo pothuajse e pamundur.
Jam teper unt edhe mu kujtu qe ka pite sot omajgad.
Nuk ka sen ma tmir se me pas ket pamje tu rave. 
Po teper po pritoj me hyp tash deri n’kala po masi techno it’s a must!
 Smka bo vaki. A pot bohen flutrat nbark?
Shkrim artistik nga gazetari BB 
 Jo more 1 her nmuj veq 
 Ska mool shum vone hahahahahaah
Qe sa su pasna pi qeshtuuu uuuhaa
Bile pak ma skej ta kishit lon se shume n’sy po bjen.
Se kane shkru “mbeturina” qato nuk e kane marr parasysh tabelen. Perndryshe njerz te kuptushem jemi. 
 Tash ti vuj vuj vuj, kqyri datat edhe luj luj luj
 Ani more qysh jo
 Po du me pi sok npllazh
Mezi po pres bre me e pushu kryt nja 10 dite tmiraaa
Future eshte shume scary kur ta menoj daten e rezervimit edhe te provimit tnjejten dite. Po ne te njejten kohe eshte edhe misterioze shume.
Un mezi marr pushim prej pune haverat qohen e shtyn provimin
 Qesaj i thom Allah ndor tone
Dikush e percjell ritmin, dikush rreshtat e slideve e kshtu me rradhë.
Thu ti kesh n’Unum a. Na keni myt me story.
 Ska perse loqk taman puna
Un jam hala nen efektin e afatit tPrillit, Qershor who? Qershor what?
Kesh tu dhon shpirt pa e jap at far provim tmallkum
Cfare naf*cke pasna pas edhe un qr
Profi lajmron qe do mbahen konsultimet.Na len me prit tan diten.Nfund na le pa pergjigje edhe i anulon konsultime… 
Istg do ngjarje qe as nfilma si shoh dalin pi qaty
Kurilla npz so mahall po o shtet nveti
Me fat Bajramiiin 🤍
Cfare kohe me i kap ndegjuset e me u nis per n‘kala
Qebapat spi llogaris a
2 tmdhaja edhe ni paa paa paa paplum - qeshtu porosit meritoni mjekiqi
 a hypim neser na dyja n’anije pliijzhh?!!
A shkojm be te lojnat rrokum me kerrraaa?! 
 O mos u tut be se shtrafat jan shliru garant 
 Le be se mrat nsysh qr
sot tu koksha nqef mër
Para 30 min u qova prej gjumi. Spom besohet qe e pash veten nParlament ne ulse ngat Albin Kurtit. E ai tu ma bo dil… 
 Uuu a mpe nanderr ti a
 O ty tkom engjell o dreq tdsh
 HAHAHAHA e paske vrejt aaa 
Ni shoqe e jemja edhe kur ulet mrapa e qet rrypin e sigurimit
Se llogaris diten nese se pi ni kafe n’qytet qaq
Veq edhe nCV qite qat foto edhe🤌
Far fakulteti be un po menoj me qel ni call center temin se qaty kish pare po thojn
Nutella me vajkrem nbuk tzez ok tung 
Ni prof i motres ja paska bo krejt klases:-Shkruni cka keni me shkrujt nfleten e par perpara se mrapa sju kontrolloj.What the actual ...
O Prizren o ma i miri ven’  
 Kjo ke per me kajt aver
Sot me mengjes kam hi me stalk veten n 
Ku o logjika si kafe ose restorant me e majt accountin privat bre?
Mirmengjes juve qe keni flejt e jeni qu. Cfar ndjenje ke me ju zo gjumi allahile?
Nuk u dasht mi dhon aq vemendje postit t’Vucicit. Me shum gjasa tipi edhe ka orgazmu me reagimin tone.
Jom kon 9.9 tash jom llet llet
Qetu mshkun nja 2% 🤡
Sdu me harxhu mo as  5% tenergjis ne njerz qe spo ja vlejka.
 Mir kishe bo ti zonjushÉ. Te Albulena hin veq per qefi 
Fav profja jem nfund t’ores tu fol per te drejtat e grave tha: - Msohuni me thon JO, se nfund keni me bertit po s… 
Engjujt tu mi llogarit tmirat se kom shum hehe 
Cfar dite me shku me ec nGermi
Gjith kom pas qef 
Tu maq stres per sot
Te na npz so qeshtu
Qe edhe une njo;Qka i thojn qelit kur hyp nre?Reqel. 
Pun fk servis repeat 
Gzimi jem neser jam masdite 
Njerzt qe i don i nguc be ska ktu zemer shpirt loqk... O roasting o hiq
Qysh bre Kresh na shtin deepit me ni pytje :/ 
Pse spo kallxon sa jom vonu hë??? 5 min istg 
Gjermanisht pi thojshin Fræitag. Flm ntm! 
Qekjo mdul tu e ngu Buten - FAKT phee far rastesiee 
Kosova nuk osht tu flirtovat me Rusin tha ejj mlujtii  
Nuk po muj mo valla jo
Sot dermatologu im me tha: terminin ta kom lon n3 po ty tkam thon n2 se e di qe vonohesh AHAHAHAHAH
 Hahahahahah lele se tnjofimmm
 Kjo ke dmth un i kom buzt e mdhaja edhe deshta mu lazdru pak aaaa?
Sot nqet dit tbukur deri n2 kam flejt 
Pe ni zanin e kusherikes tem tum thon:Te na nGjermani denohesh me bo qetoooo 
 A u preke ti pak a ahahahahahahah
Ni pytje vet, njo nGoogle, dy ni tezake edhe do i gjen nsllajde edhe perhajr more 9sheeeee...
Shum afer jam edhe pak ka me kalu nprivat
 Hahahahaha e nemun perjet
One more reason per me e dasht qet banes ku jam perveq lledave esht qe  n e kam kojshi 🥰❤️
Oo Allahh pom kujtohen shikimet e tyne kur i thash ntel mthat ken gati
I thirr ntel tthojn gati jan. Kur shkon m’i marr naah prit edhe nja 10 min (30 min*)
Sdi veq na nbanes kemi LLE DA
 Ose mos me dal prej dhomes hiq qr
Pse porosis tesha tu e dit qe o smrin mir o smbohet?
 Jo kalova nbanes per me mujt me kalu provimin te Naimi hahahhahaahahahah
Hajde perhajer na koft 
Ca tjeter kish mujt sot me ma ndreq disponimin sdi
Sot po shkojm me BLACK se lujta. 
Sa sene bre po mujshin me ndru per ni dit
 Nmars po thojn po se di tash a o sigurt (i mean it )
Nqet kang un e gjej veten.
 Sdi pse mshkoj menja noverdoze 
Tisha kon ngjyr isha kon blue blue blue
Ju po a une jo. Ja valla jo spo muj! 
Kush o i afte let kopjon kush jo let msohet 
Ferizaj na ke jap material per bajagi do jav tmira*
Mezi skeni prit me lu koqe me najsen
Po afrohen provimet un edhe pak bi ndepresion dmth.
Kur po ma bojn 2021-ta ka me kalu mir po du me lujt
===