 plus alienat kane lajmru qe po vijne...
mshefni paret ma mire njq
  ketu i marr zakonisht e nderuar
 sot i ka acaru dy pale 
 buspanceri i madh, buspanceri i vogel
mos e qel dritaren se veq po hin pluhun
a ju kujtohet qysh e patum marr ngat zemres kur u paten bo 79 raste me covid n'dite, kah prilli qateher? lol
  kqyre bre, n’Mirushe s’ka uje, ktu ku s’duhet ka 
 Shume. Kerrdi kisha ba...
 veq ni telefon mu ka prish se i gatshum jam
Hajde pak ma gjalle 
 deri p'i kalon rete: legendary, permi re: stupid 
 jo qfar, cell e merr, s'o viktime ai 
 njani qe e kish pas 3500, hala m'ka borxh qija robt 
 e kom pa se ju kom kthy pak TV-se qito dit 
   Brendi i mire baboooo
A bon me dit kush ja ka kallxu Unikkatilit Zhutat? 
 Po m'pelqen Petriti qe i ka ble ma shume shefit se per veti.. :P
    Sen s'o kjo pa hyp n'bus per Istog e me e ni Rinen 36161627373 her..  
qitu ka ma pak futboll se n'facebook si me hi n'fushe
 S'ka pas ksi bllokada si pram insta 
 Hahahahaha... tu e shty
Per cfaredo problemi qe munesh me pas, ekziston dikun ni mjalte qe i jep zgjidhje. Vetem 9.99!
 I mire po mun ma mire. Mun vlla mun
 hahaha naaah, ty ti qoj kangt para se mi publiku, pllizz TuTTs
 kshtuqe pe mledhim veten edhe po punojm... spo nalemi... me ransi qajo e tjerat vijne
 n vikend shkoj i marr do kang n studio e ti qoj mi ngu se jena tu e pergatit ni mixtape kadal dale...
 faleminderit ty zonjushe :)  
 Burri burrit nuk ja bone poke!
 okej, po jane do fore ma t'mira se qajo ke palidhjeeee
  s'paske shume sens per humor se kom ni ma t'mira per drenice. gjyna. shqipthash merr  :)
 vallai njeri qishtu tu e shty n'Kosove veq sot mu ka kujtu refreni qart qaty njeri. dashni njeri.
  asht qka na vyn 
 shume shpejt do te te angazhoj
 skom qysh nihere veq per nja 1 vjet 2 atje mki :P
 qek pra qysh sje ardh
 veq sa ta pash plakun qitu nmetro. A je ardh ti?
 hahaha mire se spo dojshe me qu fort larg
 jasht vetedijes :P kur do vish?
 poj tybe me efekte dejsa e pruna pak nveti kit foto se ske qysh po doket :P
 neser n2 te fakulteti
 kur dush e hekim veq fol :P
 shpejt shpejt do tja mbajm varrimin e ndonje beati :(
   valla ma ka hek ameriken pi qefit qikjo . Femen mooo :P
  ju thirra po sju nijta kur u pergjigjt 
 po veq po ju shkojm naten se diten na kall dilli
 veq n'tuiter po rrin
 jo qaq tri valla :P
 ani a fitonn naj shperblim fitusi :P
 thojn qe s't'ka marr gjumi
 mu mdoket koxha hip hop Khalifa. Ma shum osht 
 urime me vones nkompjuter po qitash mra nmen qe ntviter tkom 
 ev bes bes qka mke bo
 jo kullerat i du se tbut jan hahaha
 nskenderaj jom se spata as un lek ntel
 eh qitash je najs.
 urime ditlindja man  ka jena sonte :P
 urime ditlindja man  ka jena sonte :P
 nsk jom sonte bbrrrahhh
 ju duhet me ardh nprishtin. Ti e zhagi
 do te vi do te vi. deri kur jeni ktu ju Pajtimat?
 unikkatili osht tu i nxeh tupangjit se po dojke me bo ni remix
 valla mkishit pshtu qashtu me ardh mem marr. A n5 masdite vjen ti a?
 kur vjen ti edhe kur vjen zhagi
 besoj qe ka e premtja jom anej sipas disa planeve. Zhagi a u ardh a e din?
 poget duhet me kon edhe bita sick vet. :P. kujdesu per naj beat t'mir edhe 
 op op motiiii. cka ka ferizaj?
 haha pse sje shku ti n'bazen?
 jo me denmark jom un :P
 haha eh mire pra 
 op ksi une kryesore per veti e do qe di ato veq numra jon 
 eh mire se edhe nfakultet po tlypin profat me tdhon 10she qata hahahaha
 haha une sen sjom met mdoket :P. Cka je ti?
 ku je hup ti :P
 jo dola me lyp valla, ishalla e gjej. i uroj  vetes
 hala rrezet e dillit se kan rrok banesen tem valla 
Enteri shum ngat me backspace.
===