•Nuk ka faj Majmuni qe u bo njeri!
Hahahahaha jo bre po shpif ky ktu,sndodhin sot kto gjanaaa 󾌳󾌳󾆔 
●Miqesia eshte dashuri!Asniher mos i thuaj dikujt behu miku im.Por,thuaji un jam miku yt
Greta Koçi - S'jena ni moti - (Official Video) 
●Kur perballesh me njerez te veshur me pantolona te punuara nga rrenat ,bluzen nga imoraliteti,fytyra e ndertuar... 
●...Ma perpara e ha vet sa qe ja nguli temit.../Pshtyje e lepije se mki pa behone sa i perket ktij tipi  per... 
Un jom si ju si çdo njeri tjeter por ama nuk mund te ndihmoj per njerzit ne nevoj aq sa te tjeret.Por ,kam nje... 
T'lumt zemer Taulant A. 󾍛󾌧 
Pot etiketoj n'kit postim me e majt men diten,daten dhe gjithqka t'bukur qe kan pas kto minuta 󾌵󾬏
Urimeee Gjysmaa imee 󾔑󾔐󾔗󾆯󾍔󾬒 
Albert Radi - Mbete gjalle 
Se a ka 'vip-a' te na n'Ks a ska e qysh e tek secili e koncepton n'mnyren e vet.Po tu marr shum me kit pjesen per... 
Urime festen e Kurban Bajramit te gjith juve o dashamiresit e mi Mysliman. Qifshin te mbushura tavolinat tuaja me... 
Diqka e mir po vjen 
Aty ku floki rregullohet bukur ,natyral dhe me profesionalizem 
Met numrume prej 1 Deri 31 ja pasken bo 󾌴󾍁 
=Momente t'bukra me shoqni t'mir  
Vajzat jon ilaq i shpirtit ^_^ . 
Jemi ne jemiii neee SHQIPERI E MADHEEE — ndjehet i/e bekuar
Neve as Eklipsi so pun me n'a zo :p le mo diqka tjeter.
Naim dhonderr urime ditlindjen festofsh edhe shum vite tjera t'lumtura perkrah me motrein time ,e gzofshi... 
O tregomni qfar ngjyre pe shihni ju se m'tranoi.UN ZI ME T'KALTERT EDHE . 
Hamdi i shtrejti im Bab,sot ti regjistron 1 vit me shum ne jetesen tende dhe pse ke disa rrudha me shum ne fytyr... 
Risi risiiii u happp super lokali me i madh n;Kosov qe ishte per ca koh ne renovim e siper :P Dafina Morina... 
 e vertet qe I premtoi 200.000 vende pune edhe pi realizon po jo n'Kosov ka po mun... 
Shoh, shume njerez qe puthen, por nuk perputhen !!Mirmengjes.
Se jap NDERIN pa e dhon SHPIRTIN. 
Qe dori me dafin picirruke hahahahhahahahhahahah. 
U preft ne paqe shpirti i njeriu te madh ashtu si i axhes Mazllum.(Mazllum Kabashi).
Gezuar kte vit te ri.Me zemer ju uroj shendet dhe begati neper familjet tuaja.Festojeni me familjet tuaja kte... 
^2fotott naltt paraa,, kto posht passs bllokimit te instagramit.. Eehh tash respektt per atoo ...... 
Rapoort block ju lutnaaa ... Qa smann kjoo tok. 
Kush ka material ose diqka n'lidhje me ´Strategjit e markrtingut´ t'mqon n'inbox se kom nevoj per material. — ndjehet Kerkuese
E ndjej qe AI do jet i imi sado e pamuundur qe te jet sado qe do vuaj sado qe do me dhembi por i IMI do jet..nuk... 
^Thuaj cfare te duash kunder meje,meqe heshtja ime ndaj idiotit ne te vertete eshte nje pergjigje..Jo sepse mua... 
Gjithmon na Shqiptart e kem ka 1problem I ngatrroim senet.Ngatrrohem  edhe kur bohet fjal te kshilla edhe... 
MOMENT KUR T'VYN DIKUSH AFER BASH QATO SE KI.
===