 t'lutem mos thirr neper emisione qesi pleq matufa, seksiste, te frustume seksualisht e tona te zezat se na pelciti truni
 njo 8 vjet e ka pas Prishtinen pronari i Filikaqes, tash ne gare Pronari i Bon Vivantit. Une jau kisha jep ktyne te MIQVE ni ma…
  T'dytat ma te mirat ne bote, mas Napolit 
Heeelp, kom ushtru shume e kom mbete ne parking t'fitnesit s'po muj mu çu me ece  
 Shume bre doket si pediater.
 Kam lajme te mira per ty!
A pO Mi kQYrE qETo aNaLiZa 
 Me dimija EDHE ME FMI!
 23 per ni vere hahahahaha 🤢
"Sherbimi mjekesor ne Kosove shume i keq, tmerr!"*shkon ne Sistine, i pagun 15 mije euro*"O Zot çfare sherbimi i mire"
  Hahahahahahaha SAME DAY PLUS
 E pse qato dozat e Astra Zeneces a i kane gjujte a i ka marre popullata?
 Kom mu duru deri me 1 maj kur ta marr rrogen hahaha, oseee eventualisht deri me 20 prill se njo 10 dite… 
 une vllaut per beben qe i ka linde sot: qysh tu dok si person? a po tu rrike me to? vllau per beben e tij qe i ka lind sot…
 Tani mbeta i vetmuar, vetem ne te mendoj...
Enderroj me m'dashte mami najhere qysh e don Enver Robellin.
@ koktelli i Somes 
Koka koha me kqyre edhe nihere se gati qe ni jave s'kom kajte me naj film. 
 Edhe une thojsha qeshtu, mandej heren e pare qe e kom provu kemi bo ndeshje me ni kerr edhe na ka lon… 
Falenderoj pandemine qe na ka liru nga perdorimi i buzekuqit  
 ato dy kunatat e mdhaja t'Rosafatit kur kan pas me ja qu buken burrave:
 S'i vjen Kosoves. Pike.
 S'ka perse qe t'kom lajmeru!
 Hahahahahaahah interneti i ka pase fajet!!!
 Bash qashtu! Faleminderit shume, shume!
 Tash ne konsultim me mjeket e tij kadale fillon procesin e rehabilitimit, faleminderit shume per kujdesin!
 A din ku muj me bo hijama dika ka rruga B?
 I kom shkru Ismail Lutollit edhe Halil Kastratit po ma kane lane seen :(
  E granola vegane ku muj me gjete? kA pAsE nE RoSsmAn pO s'pO shKoj Mo sE shUme KApitAliSta :(
 A e din a shkon naj bus te Day to Day??
Paramendoj se ende dore e huaj, floket e leshuar ende s'ti ka prekeee 
  Nuk paska tweet prej tetorit, dyshoj qe na jep pergjigje :(
 Teper, amo sidomos qeky lloj shkrimi don me m'plase
Po e manifestoj: kete vit mu mbajte festivali Za, edhe une me shku ne Theth (ma ne fund) edhe me kendu prape Vlashe… 
A KA MA PRETENTIOUS SE QEKY PERSON QE JA BON SOMES MARKETINGUN? NUK KA! 
 Aha, I see. Per sa kohe je kon vegane?
 kur t'vjen marre per kon ki me votu, thu "vota osht e fshehte"...
===