 qele tu qelt vorri idjot 
Uu me asi topi tvogel a ?Aa na skemi nerva me asi ellemente
Osht njona qetu fort e kisha qeth 1sh a
 Une koka kolle e ti pepsi. Habibi. Rrrrrrr.
Besnik Viktor simbolizon fitoren e sinqert
2po2 feat Unikkatil - Fitore e sinqert  via 
 Party sa dush veq doku
 Ktu npej pu dalin shum njeri a
Praktika u kry falenderimi i takon vetem Allahut
Jem tu festu per send tkarit
AGO - KURRE  via 
5 euro i kom ngjep 1 pi ndali per buk 4 pi qoj
Kom provu mu gjujt pi tretit kat me qader 
Yhaaaa o kom thon bre
Sha’Carri ki bo more budallic 
Jo loqk smuj me dal sonte *e lshon albumin e azetit per 18 her*
Lai ve-lah qa kom paaaa
Ku shtyhet go karti me F1 ? 
GJESTI - HMM  via  U UUUUUU
Vuvuzella tkarit na paten blu trut 
Hallelujah gjendja qija robt 
QITNA TO VADKAAAA DO REDBULLA
Italia o maca zez ktu
Highlight of the match o kon gjesti tu kndu prom veq
Neser do bej ekstremin
2 K-jat ma tmdhaja 
Jo be nuk o fer nuk o fer
 Ooo lipo je tu ja ndill mu lendu prap amo neeejse ti e din
Bir kurve o kon boll amo njeri kultures hats off
 Urime ma king edhe  &lt;3
Oo se din budallica qe ja ha ftyren kejt 
 Une ty ta ha zemren tem 🥺
Se din budallica qe jom i istogit se nvend e kish kthy
Kshyr tmajt kshyr djathtKejt jon tajt kejt jon tajtKejt jon taaaajt Kejt jon tajtajtajtajt-Ever B, poet
Pruna chelsean dikush sa jem tnxem qe na kan nguc baben perez
 Okej amo TI NALUUU ME ME MENOOOO 
 PHU JA QIFSHA NONEN QYRE QA MKA VEEEESH 
 A o tut kndu hoxha edhe ty a veq mu
Okuku okuku edhe i bjen tfikt
Ky me allti o shpetimi tu kesh
Qa sblehet me pare blehet me ma shum pare maaami
Koxha kollomoq je ka dokesh ishalla ki bo gjo mbreti jem 
AJO PO DON TESHA TSHTREJTA I PAGUN ME SHPIIIIIND
 Amo pernime un sjom problemi kurr ju ishi t smuta bre
Po qija nonen Hala Madrid del ku del
Njet ski ekip ma quditshme 
  Qite jegen tash mos rrej si Carti
  Ani boma hallall ej brudali
 Po veq ti shkojshe nklube debatit bir ky shkon me myt beaten
Na lujte mami shen perendimit 
 Brratan kjo ncopa del rey a 
Baba jem tu kallxu qysh o shku nshkoll ktyneher 
Urime 8 marsi dita e seksit
Ahh bebi ahh beba ahh bebi
ME ME ME MENOOOO
 Topp osht a NOBRI TULT KA PARREGULLSIEN
Ooo u kon jarani ja kan votu voten ja kan qiten
Edheeee seee niiij aaaaaa
 Neser n’10 mundeni me na ndi edhe n’kasetofon t’gjyshes. Llov
Rini e flliqt mötren ja qifsha 
Mihrije Braha - Djadja (Official Video HD)  via  hala ngohet doe
Gocat e bukra duan muziken Trap
AKTUALITET KUPTON TI !!! 
 Per kedo qe ka mundesi. 
Ndoshta ndoshta coveri ma i fort nshqiptari
Keshi me zor mos mendo qe mki shok
Cfar albumi pa skip ky fmia Cudi ya rab!
Shkurta don mem flex amo 
Ndoshta ta kom shajt Trejvis Kotin amo I make u laugh sometimes 🥺
Veq tflej edhe 5 minuta 
Po duhet me flejt diqysh bre nonen  
Jo qe najsend po veq me thy rak tu pi shisha kamos edhe me fillit JuLin
I lutna zotit ka tcillna ishalla boten tjeter mbon shaci
 Mos ma permend ket lojtar tmallkum 
Juicy J osht eternal mood
 ki pas me qit album oj prostitutk
 Aint got shit tbh veq kur msheh me sandrin e dastidin nmahall tu mbaru qfar shpie tdrunit a tu fol… 
 Shum po du po po kthehet 1shi po ma bon ku je nissss morrrre tarrrzaaan 
Edhe dy sahat kom mu qu pi gjumit me ndigu besa gacaferin tu mfol per diametrin e fibrave tndoni muskuli tlemuar o alla spo mpritet 
 Ska hajr aty ooo filan ktheu ka kibla smuj osht ajo
Eh luje luje luje me 1mishe
KU MBETE BEJBI BEJBIII  
Pare me pas se shneta shkon e vjen
Ik bir ti ishe dhip 
Tu i kallxu njerit qe tka ec vakti u aint got the sauce anymoe jeezy ski qa lyp ktu
dheze njo pije njo qoje njo 
Dikush kta klloshar duhet mi udhzu  
 sot keni me ndi njo prej versave ma t'fort oat 🥰
 “Ramses” prej Boyard Bes (ft. Jolle) del neser n’7 t’mbramjes. Mos harroni me ja nxir yndyren tu e ndigu bashke me hitet tj…
 Ja more skallxojshin qe dojn me lujt me penalla na punun
Poget qe benzi o shem i fort a
Mossi - Psikopat 🥰 
Sh flm sh sh flm 
Ku je asistente e shendetit mendor pha qfar vendi mallkum 
Mi mblu me sauce padyshim fitorja osht sekondare 🤧
Ku je qa po bon coco mama
Kmish t’kaltert me lule jom Vercetti n’Vice City
Qe ni jetE skom flejt
 AHHAHAHAHA rrraaa pa paa prrrrrr lshas bertas
Dulla ballin si Ermali n2010 
Qa kari jom tu lyp qut ket vakt jojosedi
  A nxire gjo rib
 HAHAHAHAHHAHAH o coftit coftit coftit
Mos mi besu kerkujt 
Me takat shkojn kto pun ski qka se ski qka 2x
Qeky Rrahmani gjethqka osht veq mbrojts jo allah ndor tonde
Fero - Kom me Mrri   via  
Jolle poppin veq me demo, sjeni tu e diiiiit
 a ka mbet far pidhi zoj ktu a krejt kurva po keni qef me kon
Qy ky sa mir e dissirat veten hahah 
===