hapa te tille qe kom prit per krejt kto vjet mas-lufte; zemra mal. ❤ 
 i mire je me te lidh ne fyt
 hiii o dekaaa, edhe une veq pak e di HAAHAHAHAHAHAH
   Pa pike dyshimi ky mundet me perfaqesu ate qe e thote; eshte predikues edh… 
 prit prit per te kan ky djali e ka ni point qitu
 beso gjyshi jem u kan hoxhe; ama u kan bash hoxhe (jo qe osht kan gjyshi jem) ama qka u kan u kan. Kurr,… 
this pic of the PR; kurgjo tjeter ma shume 
 bashh; ama at least ne CV e shkrun "kandidat per President" lol
 jo nji here; po tri lol
... e rinia si Dardani na e bojn zemren mal ❤ 
shoqnia tu munu mem nal mos me ju dhan dashni njerzve palidhje :) 
sa here e shoh kjo foto ma bon zemren mal ❤. 
... Leonat Shehu; Prishtinë. 
Lurani na ka dhane shume; aq shume per me mbet gjalle gjithmone ne mes neve . 
 Ngushllime Edon. Shpirti saj u prehte ne paqe; dhimbja juaj qofte e lehte.
  nuk po muj me vrejt kete pjesen e ✨parody✨ ktu; tbh eshte pak neveritse me u perqesh per theksin ... :/
do uj dikush se e ka djeg keq ... 
 kishe nifar gjys-historiani ktu: Clement / 1: inclined to be merciful : exm. "a clement judge". qe ni fac… 
 ja sdi; he qysh
 po voton ... ushtroje te drejten tane! 
 Masi qe jemi te keto meme-t, qe 1 prej meje  
 not me qe e ka marr inspirimin qaty lol
nuk jena te dite na qka o tu bo KQZ, nuk jeni te dite ju qka o tu bo KQZ, nuk osht tu e dite KQZ qka o tu bo KQZ :/ tf man.
trishtim, trishtim ... niveli se ku jemi si shoqni; eshte per me u trishtu :/ eshte nje nene, nje grua, kryetare e… 
dizajnera nalne doren, pash zotin nalne doren :/ 
tu e prite ne anex Ajhanin me ardhe ne ligjerata :) 
 kur i qitke msusja dy nxansat ma tmire mi kontrollu testet 
Veq ni thread me trinity'n e 2020-es;
 A e lojme krejt qit punen e shtatoreve? S'po dime, nuk jemi ka dime.
 jo nuk jane se mu njeri prej mrena me ka kallxu
 Bile me qato pare majm naj parade per PresiMretin ...
 Me fol ka t'del shpirti, valla bre eshnat e deshmoreve e martireve ju keni livrite me qita cetnika e shovenista ne Qeveri.…
Ne Tetor pyeta KM  ; tre arsye pse une si i ri duhet besoj qe qendrimi ne vend eshte nje alternative ne… 
   tbh ma mire se ne do programe lol.
===