Albinit pi gutet se ka me shku me hAnger pasul me mish 
 Albin Kurti ne mbledhjen e qeverise pasi u vaksinua: Vaksina nuk e ka as edhe nje efekt anesor te vetem 
Nje pseudo feministe si Alma Lama nuk duhet te konsiderohet fare, e cila deklarohet kunder te drejtave dhe lirise s… 
 Ja kshu bohet! Dashni nga Tirana!  ❤️ 
Kurti kaloj sfiden e pare me sukses. Shofim qka po ndodh me Presidentin apo Presidenten 🤷‍♂️
Valdete Daka, nder personat me te kritikuar keto javet e fundit, ka sjell performance te jashtezakonshme.
Nga me shume se 44 mije vota te vlefshme ne Gjilan, LVV prine me 63.23%. As me suplimente per fitnes nuk arrihen kto rezultate 
 Valla prej tparit te vetshpallur e deri te kanditati ma i panjohur, duhet me ju ardh marre qe promovojn… 
Nese votohet estetika, propozoj te votohet  per Kryeministre 
Tubime po, dasma jo! Ska faj Labi qe thojke "Ska Virus" 
Qysh nuk i kapi gerqi nkembe njerzve ne emision te Jeta 
 Ku po mbet IPK-ja ? 
Ore Gimo, Policia jote u tranu! 
Paskan me i blloku rrjetet sociale tu i investu paret ne "sponzored" edhe "bustë"! 
 Doren n'zemer, osht "kllasë" 
Krejt drejte per rimekembje me bo shtetin shtet. Sloganet ne vitin 2021, e meritojne me ju thone bravo si magarit kur del prej lloqit
Kurti: "Jemi partia me a madhe ne vend"Hoxhaj:"Do ta formojme qeverine e re"Mustafa:"Nuk ka zgjidhje pa LDK"Lima… 
 Pyti fshataret e tu, ata ta tregojne historine 
 Nuk e ofendoj kurre vendlindjen e Car Lazarit 
Akoma nuk kam has ne nje postim me te mire se ky i Shpendit  
Pernime na dul lope kjo police virale 
Glauk Konjufca, per mendimin tim, kishte nje paraqitje te dobet te Ermali. Ne mungese te argumenteve dhe racionalit… 
Ka politikan qe japin "auto goll" argumentativ, mirepo kemi edhe te llojit qe asiston kundershtarin per goll! Shume… 
Me humbjen e Podujeves, a i bjen qe Gima i Llapit ka humb aksione ne LDK ? 
  zhedhje zhidhje, u bo hallakam! Veshtir me i dallu 
Gastronomet e Kosoves e shpallen qeverine "non grata". Pleqt nuk paten faj kur thojshin "me shtet 'sun shtyhesh!"
Ka pe krahasoj Kadri Veselin me (Pierce Brosnan), po filloj mu bind me rrefimet e Batonit  … 
 Tirana eshte afer !
 Nje shkrim kogja, kogja i mire nga  qe ja vlen te lexohet ne kete dite t'bukur e t'xehte 
===