 mos me mujt njeri as me kajt kur don 
e kom ni orar tkomplikum 
no one:...absolutely no one :...une:Ishallah hajr (per qdo sen tmir qe e nij se sjom msu)
 as if ke pagu ti
 Veq ta ka nreq qefin ‍
 e di qe smunesh 
 Kurr mo skom met besu kur tthush "e la une alarmin" 
 kushtet tona lejn per te deshiruar se as un me qef se kom bo ‍
 tbh u aint got no taste learta dreshaj sdin qka o mir
so puna mir diqka kur learta bon thoj tshkurt
 jau gjuj nberllog dyve :)
 nejse se me kan qe mnigon i kishe pas punt ma mir se sa me lyp signs palidhje
 Edhe e kom dit qe diqka sosht nrregull
 edhe learta sdin me kontrollu veten n'ato momente 
 nejse veq dashta met kallzu se nuk shtyhet...se nuk po kom koh un
 Spo flej hiq puna qe kur tvish mad tjom flejt mos tperballna me ty
 Nejse delum jasht tash se je tum pengu spo muj me flejt
 jo se shum rehat jom,del prej dhome ti
 hajt se ta thom naj her per me ta nreq qefin dw
 edhe e disha qe smth isn't right  
 a po me degjoni?
 qmimi:me marrveshje (vetem per familjar,jo studenta)
 edhe pse se ka afer liqenin artificial prap ka avantazh shum tmadh se sheshi tlidh me krejt
 Amo ska lidhje Marigon se tan per her tpar qeshtu e kan
 krejt fajet i ka maska e belgjikes
 qysh sdite diqka ka un me ga veq ku osht mrapsht
 ku gave mas keqti e mozomokeq per mu
 Oooo ma bofsh ma mir ti mu qe ta instaloj
 kryj qato ankesat tua ti niher
 N'5 ki mu qu :)
 Ruje prej qati llaptopi 🥱
 op se i kishe pas rezervu biletat veq me zgjedh filmin
 Niher qeto faktura,toni kshyrim per asi
 isha ba nese ishin kan qysh duhet 
 bilem tishe kan qe je tu socialize me njerz qysh duhet..
 veq edhe ma shpesh masanej :)
 Qysh pi premtojne milionat, ta merr menja prej xhepit i qesin. Faleminderit.
 Ne fund te historise te gjithe do te vdesim. Keshtu qe sa pa mbaruar historia, beni pak qef.  Por jo ne kurriz te te tjere…
 Te pagesa ne hymje te Prishtines: mfal a ki kartele t'Vives.
 Nuk ka za qe bertet ma shume se ai zani qe su degju kurre! 
 Pasha nanen gjysa e estrades e qita hiphop “artista” jon t’fundit me fol per gra e t’drejtat te tyne. Cdo 2 jave qesin k…
 Nashta edhe e kam gabim, po pse mos me shkru. Mendoj qe me 4 Maj Kosova duhet me fillu hapjen, kthim ne pune e jete norma…
 Dikush: ne 2020 Shqiperia do jete pjese e BE, do kete makina fluturuese dhe nje kure per kancerin.Shqiperia ne 2020:…
 Nese ish dasht me prezantu ni femen kosoven per bukuri edhe menquri e kisha nominu qeto for real ❤️
 Oj mam sosht...Kqyr mir se me bo me gjet un tkallxojMe:
===