 Do me thane ne mes Bedri Hamzes e Agim Bahtirit, ne mesin tone ka banore qe e votojne te dytin. Mandej cuditmi pse do nuk marr…
 live o per momentin
 “Shakira ka pasEn me ardhEn me propzim t’nderkUmbTorve, po taj m’bllokuEn. SUgUrisht qï pô. Qutetari i Mitrovicës e din…
Ja qiva ropt marketit
Qijaa ropt as golles mos me mujt me ja qellu 🤯
Skan faj Ministria e Shendetesise se osht tu i habit djali i agjes te Haxhi Avdylit me muzike
 Ju lutem ngriteni doren kush mendoni qe duhet t'ua paguajme serbeve te veriut borxhet e rrymes? 
 Moti kam qene tuj mendu. Me kete foto, vec i qoj durt prej kesaj shoqnie. TE VERBUAR NGA INATET E POLITIKAVE DITORE. Te p…
 Nga nje mik: Po thojne tha qe Albini rruges per Bruksel i ka grah aeroplanit nja 40 min. Tha e kapshin kryt pilotat. 
 as ti se din ku i bjen Mitrovica, po ti mundesh me honger mut ✌️
 Dilni pak n’publik more, mos punoni msheft se marut 
 baba i opozites :P
lol IKSHPK-ja mpaska bo ban ne faqe te tynve veq se e kritikova Albinin 
 po i pergaditi letrat me terhjek tweettin e djeshit per kete pjese 
Fuck qysh i kena hup dy pike te vlefshme dje 
HAHAHAHAHAHA per lesh babooo 
 po mdhimet nderimi qe menojke qe kan me fitu chl sivjet rip 
Qysh me i jep Salah goll ekipit tvet se 🤪
Qysh e komplikon Salahu 🤯
  dikun e kom lexu qe startus osht
 veq goll veti jo tjerat qysh te don le te jep veq a osht qe jep se
  Keta zakonisht kur po ju bjen morali po bijn down krejt, tjetren sezone i ki 
  po bash dy lojtarve mujke me ja pasu po vetijaka
 hehehe se ma bojshe racist ti me metin
 kuku po i dopt hahahaha qka e ka gjet more kshtu
 apet e kish rrok shtyllen 
Ma shume u ra Mane prej forme se Win e BTT
Me ja pas jep Fergusonit 9 drunje Zidanin edhe Manen ju kishin bo 10 drunje edhe Zidani
 lene Manen qatje, veq jepjani edhe do pare Realit nashta pranojne 
mos ja gjuni topin Manes, po lun kunder neve
Ku eshte Sadio Mane ?
Ne pjese te dyte ishalla lujn Mane edhe Salah
 jo bre ska kari bon as ai kqyri kta hala dy pasime bo si kan
Veq me i bo lojt me ja nis veq pjesen e dyte me lujt
 Eshte e nevojshme qe reagimin e njejte me e pase edhe per bullizimin e Ganimete Musliut mbi dukjen e saj. Pa marre parasysh a e…
Ardian Kastrati me nje status te gerrditshem, kur ta kujtojme qe eshte prof
Urime, tash ska arsyetime ma krejt bashk me punu per kete popull.
 Aha se kur u votu qeveria i ka pas 68 vota per qata e mendova
Nese VV i ka 68 vota plus 12 te LDK-se edhe Albena ketu po i bjen qe jane 81 vota, dikush o ka rren 🤪
Qeky ngjehet dy golla 
o Zot kjo ke magji prej Zenelit
 Shume i lumtur qe Hajrulla Ceku eshte minister, besoj qe i takon politikaneve te se ardhmes.
 qysh kom ndegju arsyeja pse eshte refuzu kjo logo eshte se kane than qe nuk bon me pas simbole dardane ne logo aso kohe
Sa gabimi ne pasim 
 Shume e vertet, Thiago fenomenal prameno nuk ka marr karton hic sonte  se Fabinho u merrke me ato pune… 
 Gol i mire ekipor ke, mpelqej Jota qe su tregu vetijak
gjynah cka i qoj posht Thiagos ky Salahi
 Shpresoj ta kalosh sa ma lehte vella❤️
Cka me bo Arnoldi more tjeter atu
 ndryshim si prej ktynve si prej meje :P
  hahaha bile une spo i fshij deklaratat 
  paj veq le te vjen bre qysh jena ne krize spo zgjedhim 
 veq me na tranu kapak e kan qeshtu
 Urime ditelindja vlla, jetofsh gjate me shendet te mire e te gjitha te mirat. ❤️
 Shume gjana i ka gabim qe spajtohem as une me te, por njoni prej gazetareve me lehte te kuptueshem p… 
 Valon Syla me nje shprehje interesante " te hanem te ejte" kishe shume shpesh
u ra Liverpool si LDK- ja 
Qija ropt po lloma
OX paska harru me lujt babo 
 Koha e fushates tash me shume gjase ky as nuk e din qe e ka postu keta ne FB, kur interesi partiak v… 
 Nje lagje pa uje e ky merret me oren policore e cila eshte vene me nje qellim te mire, nentori larg po me doket.
Qysh lun koqe Salah ta merr menja 7-0 tu fitu jena
 as edhe keni qka me qit
  bro ska najfar intesiteti te Keita, rrall lun e aq ma rralle i kompleton 90 min, edhe pse… 
 Faleminderit shume care ❤️
 Faleminderit shume Loni ❤️
 me kandidu per deputet nuk ka drejt e me u bo kryeminister po, only in Kosova
Ti mundesh po pastaj smundesh
As Rugova ska bo qka munet me ndodh mas 40 dite 
U shkymen  si me i hjek prej rrymes 🤦‍♂️
 njejt e ki sikur me Wolves
 Edhe Salah kaniher e ka ni periudh qeshtu si ky se Mane on his day osht beast
Mane so kerkah qr
veq mos me shitu drejt ne portier goll o gjith 🤦‍♂️
Cfare super lojtari Jones 
Shtine Firminon, Jota jep goll
 ma te mire ka kohe qe skom pa 
Pasha Kuranin e pasha musafin dojne me fitu ne Llap
 Ministri tha qe neser merret vendimi nuk perjashtohet mbyllja totale
Si me kon tu lujt ne akull
ani perpak e kom bo triple  
===