 Je kategori ZHGLË nese i drejtohesh ni punetorit ‘per qeta paguhesh’ 🤯
Keq mu shpreh po ski qare, tja kom qi ropt qati qe thot Bashkim Kombetare.
 Fmi i pergazt koke kan
A ma mir o me ta dasht a me dit?
Mishin e mir e pat qiky Kurban 
Nuk u shkru mu ba rehat me IG un, khee 
 Ti ja paske dhan t’mrapshten hahahahahaKeq na ke
 Bravo bir hahahahahah, tmerr ky a khee mka lu 
Phu ropt ti qifsha 
 Kamarier jom, nja dy her mka ra me i qu deri neper shpia hahahaha
 nuk osht ka mvjen nxet qa osht tu mardh inati qe s'jam ke plazhi n'kto momente po midis rruges, pluhnit, asfalltit..
Mir po merr Janari
 Besoni ose jo, sot nje i ri nuk din me apliku per pozite te punes. E dergojne CV-ne pa emer, nuk shenojne asgje ne "subject"…
Kjo shkon per       … 
Po qysh jo hahahah 
A lindi najkush merr hale ahahhahaha.Urime urime.
Ketu ne Kosove masi nje % e madhe e rinis punon kamarier/e, ma e mira kishe qene me ba Sindikaten e Kamarierave, nu… 
0.50 po i nali per tost, tjerat po i qoj per Thacin. 
Kurva e Grenellit heheh 
 Hahahahahahaha, Isa po thu i ri a hahahaha
 Mos u lidh shume me njerzt, se t'gjith kan me t'lan nji dit
 Nja 20 ore t’mira qaty hahahahah
Deri kur doni me duru oj shoqni e dashtun?
Si te kursesh dezinfektues?Hahahaha 
29 hektar toke babik, heheheh 
Qysh ish lu ktu CS GO ide skeni.Hahahahahah 
 Uhh qik qa te koke ti
 Garant vetit ja ke qit kit tweet hhahahaa
Qe nje karrik per Grenellin masi sot qenka nisur per ne Kosove, hehehhe. 
 Kaj her e kom bindjen qe bota e ka kriju Kosoven per me bo eksperimente.1) Na kan izolu, smujm me dal kerkah pa viza.2) Ed…
Boll mir e paska parku more huti,e ka dit qe ja bajn vijat tani dreq e gjys, hahahahaha. 
M lujti qiky sen a, shifsha ropt 
Mos vendosni maska, se Bill Gates ja u ngjet qipin nepermjet tyneve.Hhahahahhhhhahahah. 
Dashni milionshe e shacit ehehhe 
Tu pi Heineken tipi bani Bos bima ni qaj brusnice
Urime martesa kojshi u trashegofshi, oborrin salle dasmash kit vere a.P.S. Do do nuk i ka nal Serbia e po ti nal… 
Nuk ja ka ngjit bile nderruesit t’shpejtsive hehehe 
Disa personave kurre sju kisha than me e hjek masken, spo vrehen edhe qe nuk i lajne dhembet kurre se perpara u vrejshin hahahahahah
PARLA (ju dalshin) MENT 
Dita e 4 qe skom pi kafe.Kurre s’kom menu qe e la kafen najher, hahahahahha. 
A jon mir more qita t’fk o vlla krejt provimet prej ores 09:00 phu familjen
Masi veq fitoj naten e kalume ky super ekip, qe ni foto e jemja para 12-13 vjete ahhahahahahah 
A o ka lun qoke more hhhahahaha 
 Me ma t’fortit e shehrit volla hehehhe
 Sdin njeri a u dal me nejt me shok a telefon ncncncnnc
Shqipnia ne fb.        Vs.    Kur t’shkojsh 
E thirren n’Hage u bo djal i mir u kthy ka feja u bo musliman qdo dit po falet ninon ramazan 
Ec shkojme i prejm floket tash 
A i mir o ky me i qi nanen kolica t’ETC, moler 
Qrrrr, dikush nuk o mir qitu po spo di hahahaha 
Eh nanen ja shifsha hahahahahah 
Shifsha provimet e nons
 Krejt postet ne fb tu scroll qe i kqyrsha krejt qit teme e kishin pas hhahaha
I paska tradhtu Thacin e Ramen hahahahah 
 I bjen i bjen, mos fullirat
I ka hi n’beth hahahahahahhahahahahahhaah 
 2021 po flitet, mund ndodh del hahaha
Jon ba bashk muti e kaka heheheheh 
 Edhe interesant veq naten e nin dhimten shum hhahhh
Smun me dek ni her pa e shty ambulancen haahhahaha 
Kush ka me qi Avdullahun ma shume?
 E a blen a gatun ti tash?Hahahaha
A ka diller ma t’fort se Hasan Ramadani 
Kta garant tu e mashtru kur u kan e vogel e kan gju nalt e se kan prit tani hiq.Interesant puna e saj! 
 Auuu edhe Emines e Xhafes hehehe
Gazetari:A mendoni qe ne shqiptaret jem racista?Shqiptari:Jo be se na si popull kena hjek e sene sjem na racista.… 
 1 per qudi hahaha
 Shkojm kurs te ermal mallteri hhahaha
 ✌ama rrezik o me ty hahaha
 Kur thot populli: "Je ba per 5 pare edhe ti", qr.
 T pagume jon ato qim nane
Qr, ni her me fry era e fort t’nalet rryma, ncnncncn.Qifsha shtetin e nans .
U nxeh babikaaa hahahahah 
Hahahahaha ma mir me kan e musht me speca turshi e sene se qiky kombinim 
Snapchati lyp mja qr
Linja per emergjenca hahahahahahahahaha 
Kinezt e nans ja u qifsha 
Hahahahaa ky moleri qe ndjehet si Luan  
 Kush o Gjakovar le t’lajmrohet te recepsioni hahahahahaha
Mir e kish pas ai qe e kish pas vet babin, gjyshin, babegjyshin, a ka mu ba mir najher se po mdoket kurre jo hhahah… 
 Qe per ty nja hahaha 
 Hhahahahahah te kish pas bile emrin Respirator e kisha shit kit far krize po frymemarrja hahahaha
 Veq pe presum edhe najkon hhahaha
Spo kan qa me ba njerzt, kojshite e mi jon mledh n’mahall po flasin per çmime t’naftes a kan mu rrit edhe pse i ka… 
 Ti gabo une fal.Ku ke pa kshtu
 Hahahahaahahhahaha s shkon oj e qim nane Eroni tha pikes i ke ra
 T mytin sorrat kit pjes hahahahaah
U gjet baba i COVID-19 
Mem thirr dikush qishtu ja kisha qi nanen e kisha hup telefonin qr 
Para nja 8-9 vjete kur lujsha Texas Hold'em Poker i bojsha ka 500-600 milion thojsha me mujt mi kthy realitet qito… 
 Ruju po t’mallkon Donika hahahahaha
 Kujdes po, Avdullah jo
 Hahahahaha sdi sja kom pa
Qe i shoh Avengers ne anderr kishe jom nis me ta me shku n’Jal, kurre se kisha prit hahahhahahahaha.Sdi qysh e nxa… 
 Hahahahahaha shum babik o
 Me kta ma shum hahhahah 
Neser nisna per ne Korene e Veriut, ne varrimin e te ndjerit Kim Jong Un, kam vend edhe per tre veta ne kerr.Rri d… 
 Hahahahahha spo don se mun hhahahah
Khaa, kush spo thirr per me dal n’Centrum e Door mas iftari hheheh
Shum jom ka menoj qe Shefqet Krasniqi e kish prish agjerimin per ta hahahhah 
 A tu kan rrit flokt o nenqim hahaha
Qe dy vjet e pasna qel ni account n’TikTok, a dje thojsha kurre se qeli me qi nanen hahhahahahaha
 Qu more dalum prashitum najsen, po qfart "take final steps" ti ej. 
 Sa i perket eres su kan kurre bir hhahahahahaha
Kom la tepiha qe nj tri or qaty qr hahahahah.
Kush mos te past pun fund ketij vitit, veq  qe ka me OOPS boll eshte, ani ma kur te na e kujton edhe… 
Per qe ju vjen puna njerzve mu zhvall ne 7 te sabahit kurre se kom menu hhahaha
 Qata "mos" po m'doket hahahahahahha
Podujeva per momentin nuk e ka asnje rast, kush nuk e ka pas me i mbyll krejt hyrjet e daljet e komunes, loqk ish kan.
 Hahahhahaha pak para se me na nxan ajo fjala "nata ska ispat".
Shihmi nihmi prej ores 19:00-20:30. 
79 raste t’reja, rash me flejt se mos po shkon mendja najkah ma von, ska qe flen tani hahahahhah
Qysh po e kalojme ditenParadite:N’katun me t’shpisMasdite:Ludo King me t’shpis
Fort lyp qiky Snapchat-i kajher mja qi ropt
 snapchati snapchati instagrami twitteri tap tiktoku e lshut bajrakun
E se mos ja u qi nanen kishe na hajna sene normale,a deri dje koqet e qenit e  kraht e lakuriqit i kan hanger,chan… 
A e ka qi more Grenelli para emisioni Beratin?
 Ta cifcin nanen,ta cifcin nanen
 A po lun ludo o nenqimo
 hajdeee ja qifsha hajde
 Gabim je bir ne Maj po vishin kta haahahahha 
Qr as me flejt ma spo flehet,karantine e leshit.T qifsha kinezt e nans
Cilin kat eshte qikjo salle bre hahahahah 
Kina duke e kompenzu humbjen hahahah 
Kush o per Ludo heheh
 Donald Trumpi i tha Albinit bo qa dush spo ta prishi masi po te perkrah Arbi hahahhh
 Hahahahha qata un ne qit afat t prillit hi per her t 7 qr hahaha
 Hahahahahaa cilen land se nja ne vit par alamet land e ka qr
So fest e jemja ajo heheh  
===