 Qfar lajmi kete mengjese para ne ranglisten boterore te xhudos  
 Edhe ma shum bile kta hahahah, juridikun edhe arkitekturen perniher 
Kriteri kryesor me marre burse ne MASHT (per studentet jashte vendit): personat qe kane nje burse paraprake, MASHT… 
Rule of thumb: kaloje rrugen jashte vijave vetem nese asnje veture nuk duhet me frenu per ty.
Nese i ki ne trust ma pak se 10k, nuk je tu i nxerre paret e tua, po ndihme prej shtetit
Ra google per ni kohe shume te shkurte, e e vrejta sa jemi te varun prej googles edhe çfare monopoli ka kriju. Para… 
 Op. Per mu qe nuk marr vesh fort ne loje, kogjo performanca e mir ke
 Kur te m’thot dikush “nuk kafshon”, gjith ja kthej “nuk ka kafshu hala*” hahaha
 Hahaha me sa po shihet kta nuk pe perdorshin metoden e koses naper tendera
Na multiple choice questions i thojme pytje me ja qellu. Dmth nuk ki nevoje me dite, krejt problemi osht sa pytjev po ja qellon.
 Super ja paskan ba se shum tweet real u dokke sidomos prej mr beast
 Bash a, vyn per jet ky film
  Mkish ra ne fije dika 
M’kujtohet n’klas te 7 n’ore te edukates qytetare arsimtarja tu tregu per shperndarjen e popullsise naper bote pat… 
Nese ish shpernda virusi prej mjekrres, asni rast i covid nuk ish kan ne kosove
Ish kan mir me qet rrug me nal testin kombetar edhe testin e arritshmerise per nja 5 vjet, deri sa te krijohet kult… 
Duhesh me u kyq ne ujesjelles edhe kanalizim para se me u shtru asfallti, jo dy dit masi te shtrohet. Se pom doket… 
 Problem u kan na mos me kan bashk per ditlindje
 Veq une me mask e dorza nqytet, mi hapke syt ajo policja, kishe cka ki ti kshtu si budall
Jom shum afer momentit kur e boj Brave default browser
Krejt shqiptart e kan bindjen qe po ja vjedh paret ipko, a qe e kan tlshume mobile data pa pagu asni pako men nuk e bajn
Super proud qe  kupton edhe flet shqip ma mir se shumica komentusve naper rrjete sociale
Shum gzohna saher tju bllokohet naj rrjet social dikujt, e sja din passwordin e emailit me kthy 
 Hahahaha sja dijn vleren, se dijn qfar performanca marrin me pak pare
 telefoni ma i forti nbot, mas 
 nje foto me reale 
Nuk pe di cilin hap prej  &amp;  nuk jan te kuptu shumica e ktyne qe po paraqiten me kamer n TV.
Hala paska njerz qe postojne "Mos harroni neser fillon rregulli i ri i facebook ku mund te perdoren fotot tuaja pa… 
  hahahahahah o po kjut🥰
 Je ba ekspert i qEshtjes politike hahahaha
Nuk muj mi kuptu njerzt qe e qesin location Brezovica, Serbia. Eej a jeni normal?
  edhe tkom than 100 her temen e diplomes perdore veq per qeshtje te shkolles hahahah 
Ma ne fund e kemi ni qeveri qe e din anglishten edhe din me perdor microsoft officen
 As vete nuk jam kah e kuptoj pse po i jap zor per kete koalicion. Kryte e thefshin, se kurrgjo n’xhep as nuk po me hyn as nuk…
Perderisa Gjermania bahet marak qe 1/5 e nxansave nuk arrijn me kuptu/reflektu plotesisht thelbin e teksteve te kom… 
Ose nashti pernime jem fucking retarded
Kaniher menoj qe qeta nxansa qe marrin pjese ne  me vetdeshire nuk dojn me tregu rezultat  
Nuk o vakti per ylbera po per ngjyrat e ushtris
Ma monoton se adele ssss
Punen e sotit bane dje
Sjena rus po pijna vodk se dimri na sos
Jo qe jom i keq, jo qe besoj ndreq po melaqja qe duhet mem fol ka qellu shurdh memec
Jetojm me ni ven ku pederave ju thojn artista
Rusia e ka ni arm berthamore shum tfort ama amerika nuk e din
O e thjesht ama shum e komplikume
Nuk o ka mintereson a o tu tu martu djali i agjes a kusherini tu ka ba synet, spo du me ni fishllima tkerreve, ncuk, sjam tu dasht
I zant me pun tkota
Sigurt ska me postu foton e panos vitin e ardhshem, siguuurt
Evribadi knojm me zooo veri hepi jena na oooo
Shum danger njeri kaprrolli met gic
 itube po ama problemi o qe e kan fshi at app prej krejt venev tmunshme, qe 1or jam tu provu sun pe gjaj kerkun
Pe du ni update tyoutubes qe edhe kur ta jeksh app mos me tu nal kanga
Viber wcp edhe fbmsn patjeter duhet me ba si nsnap met kallxu kur ta ban sc convz, sosht etike
Gjimnazi i shkencave shoqerore hahahahahhaha jo shkolla e mesme e shkencave te muzikes hahaha
   qka ka ndodh me mulin 
Gabim ma i vogel osht nven t' "ç" me shkru "q" se "c". Po ma ikni trunin cysh je cka je tu ba dafuq
Pse jetojm nasni liber tshkolles sshkrun
Pare jap me dit qfar profesioni ka bleona qerreti
Qohna e ja nisi me pritu, pritoj me u munu me ba diqka qe sdu pritoj dikush diqka mem obligu, veq me ma permen ja nisi me pritu
I kom shti me u kthy prej shipnis dje prinducat veq me zan nejen te gjoni une, se u kan not to be missed nej
Nkosov sguxon me fol qka tmenojsh
Sa fansi i P$G koka nkosov kurr se pasna dit
Sot morra vesh qe fjala fitnes koka FITness
Ma mir me ta ba bajat se mos me ta rras hiq 
 edhe etnikun e pasna harru hahahaha
Mas leonit, gjellusha dhe arsimi jan dy nxanat e ri nklasen ton
Folim ma mir anglisht se shqip po nuk jena amerikan
Sjena rus po pijna vodk se dimri na sos
Edhe varikin qojna eks veq a o belesh bre vlla
Skom rape 0.0cent ngjep, po kom ajfon edhe aftsi per shmek, tan diten baj llafe kafe tu pi se me profesion jom badihavG  
Agnostik besoj nfakte veq qka shoh
Kodra e diellit, 8ove 
Qysh thojn qka ki mas tullusumti ta bjen zoti, pfff qka pi kam tullusum nja 500euro qetasht
Himnit t'kosoves tekstin ja paskan ba prej ma tmirve qe eshte i mundun, hallall 
Skom dal nqytet sot hiq, mthirren ntelefon dritarja tum vet mos kum shku me naj subotic
Nese per dikon tham si foli ma, u kry kjo pun ma
": Me  i adore it
Oooo tup a je kan more ti sot nshkoll
 o bir ndrysh tkom than hahahahaha prej ma anash mem rrok
Do njerz se meritojn me pas gopro
  mue kjo ma shum hahah
 deshtimi eshte vetem nje pushimore e suksesit ahahahhahahaha
I hinen playlistes tsystem of a down te gjoni, koka shkru me nejt dej neser
 thot ni fjal e urt skoceze qe kur nuk ngon hjek
...perveq ati qe e ka kry
Le pash zotin kush ja ka pa hajrin shkolles...
Çtash o shum shtir me dal tan natn e me kon qik e mir
 Qaq shum her e kom pa taken1 qaq ma permensh i kom msu hahaha p.s a e ke pa taken3 qetasht
15 her e kom pjestu ni numer ngara, 15 rezultate tndryshme mkan dal prej stresit, zoti hajr e baft
Si po bahet ora 7 ma zoti tlasht shnosh se ska msim ma
Nje her e n'nje kohe endriti u kan koordonator i punes vullnetare t'derades, hala jam tu kesh
 snapat sbesoj qe ti kan qel, per tjeter so gajle
 hohoho ti kan hi edhe dms krejt mesazhat hagahahah
 ma nfund ni tweet qe se lidhe me mue, sdi qka hamami paske
Pare mem dhan me qeta tullusumat e vv sbahna
Mosha ime me sjelljet e mia jan ne perpjestim te zhdtejt
Kem vendos neser me i nejt urt biologjis qaq shum tu nau dhimt qe ja kam hanger shpirtin
Vin do polic n2tnates e lshojn sirenen e policis veq me i thirr do shok tvet me ni kafe qetu te une, das is ajne katastrofén
I kam do foto per  ama ato pernime i will never post
 i 2t* po menoj hahahahahhaha
Qaj shkupi i 8t mka trullav pak
 Zine qe ta kom ba rt se spo mujsha
  pff dalin veq fjal i ki se nfund me pesqe apet del hahaha
Pseudenimi qe ma ka lan gjuha 
Qysh thirret sistemi ku njerzt s'guxojn me than ata qe po menojn
===