 Veq pe ha do buk vit tmarr
 Nuk m'doket qe pate bo zo kur ish ministrja e Puneve te Jashtme Meliza Haradinaj na ka bo block gati krejte rinise t'Kosoves…
 “Krejt me ty qka pata i shkruva me nje leter, ti pate veq fjale a une pata veper” uffff
 Tu ka mush cache i telit
 Normal nese kish dasht kjo
  Gullashi o ngjyr..... gullashi
 Me gullashin.  At termokiss 
 ika ti pys prindt qfar sheje nhoroskop jon edhe ta lypi ngoogle a kan mardhenie tmir sheja jem me shejen e tynve, qe skan po…
  Tuna o pidh o jaran ajo o.... kriz
 Jau ka qi farefisin
 na spo kem uj me pi ju po derdhni
  Tash hin ky ntw e sheh qe e kena nguc e bjen ndepresion
  2 hektar trotuar qel mnalet ktu bon poza
 A rrin tash me neve qe je bo i famshem
  Valla jo krejt bonen
 Me diqka duhet me ja nis
 Na ishte njehere nje kohe qe e shitsha per 0.04€ 
 O kuku o kuku edhe i bjen tfikt
 Po bre po duhet
  qoja cvn i nderum
 Tu i mujt fmin e hallkut
  Zanen e malev ?
 Tash qe ta bona llajk a dmth qe jom femna jote
 Gjema ata majka terežovič
 Kosova qe 13 vjet shtet—dy gra presidente. A qe Amerika hala s'po munet. ELL-O-ELL!
 Spash najsen tu me shkije
Veq pa perfshirjen e Shkavit amo dove ju doket njejt 
 A pi bjen qe  kena fitu ? 
 Veq i mush me uj tvlum
 Hajde tqoj te aj haveri nPub flen nja 3-4 muj
 Kerkuj sja jep zoti tonat
 Busat jo kombit po
 Edhe kto qikat doken si mi pas ka 12-13 vjet
 Pas nje dite tdeshtume qohet lazi ta ushqen egon
 Kosto osht ekstra plus posta vjen nesra
 kush po tjep ksi lajme tzeza
 Pidhin e ti kejt jarania e kem pas crush
 Jo provimet ja nisin mas 2 jave
 java tjeter ka mu bo mir
 Shreku me prejardhje nga Kçiqi 
 Supporti im per jete ❤
 Ma i miri i dekades. 
 Ramizi o baba ju analistat veq muni me ja rru bolet
 Duhet mi than cengit me na qel ni dit e nat
 Hajde sot gjethqysh se kena me shfaq ni super film
 Qin qin, per me shume info:
 Ne ambasade te RKS ne shtetin ku jetoni.
 Lezbike tu u pshty ngoj
 E piva ni smoothie qitash po bohna gati me dal nprotest me u ndal asfalltimi i zhabarit se po prishet ekosistemi i zhabav gh…
 E prek njo temin i joti u preht npaqe
 Mu dhi ka dy or po ec ma shpejt at nan ta qifsha
 Bablok nese e ke kry t9 kto tjerat jon ka 2 rreshta GOGOGO
 Tdul pidhi lezbike a
 Me thirr shumaherin ntel
 Mi bo gati kerret
 Mfal mos je ti 
 Thi hajvan koke qa spo dishe
Ja me na qit flamurin ja me na i kthy bijat 
 Himni kombtar o identitet jo muzik me bo remixa motren ta qifsha
 Cka cka, tkan lendu a?
  Prsh  cka eshte basketbolli ?
  a bon mos me ma permen motren
 Sa thika aty qy qa merr khaa
  qa po thu ti bir a o mason kjo
 Neser n12 e kena terminin te fiziatri me trajtu skoliozen
  Qdo loj ka njo e ki
Milaim zeka neser koka nT7 te babika 
 Veren e kalume gjizi e ka regjistru cdo shpi tmitrovices nmaps nemer tpronarit. Tash u met veq kush pe f… 
 Hizer motren ta qifsha
 Ishalla sbjen Trepca nlig tdyt
 Skom faj un qe mshtin me peshku me tul tpitalkes
 Robt npidh ja qifsha ati qe e ka lon
 Mas do vjete ja bojm perhajr villat nhajvali
  Shkrum pej snapit ton o mangup
 Qishtu jon votat per qdo mandat bir
U kry G mos ta nin 
 Qysh ka than qimi at nat nPub pa prevarit pak sun gjallnon
 Ma heret sbon a
 Albini o i lidh me shkij e me rus Hashimi o baba i kosoves
 Votat jon hala tu u numru per qdo te re jemi ne kontakt 
  Kush o qaj sakatii huehue
 Perhajr maraklee e gzofsh
 Qekjo ka me na pshtu prej jexhuxhav
  Thuj  e kom bo push indexin let hin me review
 Mos ju kallxo krejtve qe je i pa dalt
 Tu paska qi nana
 Ncncncncn far njerzsh qrqr
  Jau qifsha anglezt e nans
 Jon per 2 nengrupet e ushtrimev vlla
 Shpejt po rritesh be nanrn
 Perhajr per fitoren e nates
 Kerrin manual edhe me jetu ne Prishtine, ski nevoje per leg day ne gym. 
 A e ka najkush kongen e butes testom
 ta gjej ni ven ndogan
===