Faleminderit ekipes per punen e fleksibilitetin ne kohe pandemie e gjitha ne baza vullnetare!Faleminderit ORCA dhe… 
Kater ligjerata, te gjitha online, duke biseduar per teknologji e duke degjuar mendime te eksperteve te kesaj fushe… 
U CERTIFIKUAN RRETH 150 PJESEMARRES NGA PROJEKTI I CILI KA TE BEJE ME TEKNOLOGJI, TECHUP.Ani pse ne kushte pandem… 
 Kjo per qytetar t zakonshem hahaahah
 Nuk munden me pase seriozisht🤦‍♂️Cdo dite jo veç ulset, po njeri as n’kam ska pas ven me nejt po leni kto fore 
Sot KOSOVA voton, shfrytezo te drejten e votes!Kon doni, qysh doni, vec dilni!Ne listen time do te jene:3 nga… 
Drejtesi per Leotrimin!Kerkojme drejtesi per Leotrimin, kerkojme denim per policin dhunues dhe te gjithe bashkepu… 
 Une kisha luftu per dyjat!
Qe nje storie qe duhesh me lexu e me tu kthy shpresat per KOSOVËËËË 
I lumtur me faktin qe nga ky trajnim do te zhvillohen 20 iniciativa ane e mbare Kosoves me qellim te ngritjes se ci… 
 A osht e vertet Drilon a veq hajgare?
 5 emisione live momentalisht per Gjykaten Speciale ne kanale te Kosoves: asnje grua - moderatore apo mysafire. Sepse pol…
Cdo here te gatshem per vullnetarizem lokal.Se bashku me Rinorin, Polici, Zyrtare komunale, Keshillin e Nxenesve t… 
 Fejtoni ne te ardhmen!
andrren tem ti mu sun ma mer 
   ma mire vone se kurr, po ka shume gjasa qe nese kish me kon  nuk kishin me… 
Ne njeren nga shkollat fillore kampione te Kosoves, se bashku me Keshillin e Nxenesve te Shkolles "Zija Shemsiu" di… 
Personat te cilet kalojne neper Keshillin e Nxenesve te Kosoves me shume gjase do te behen elite e njerzve ne te ar… 
 Po mi zgjidhke detyrat vet pa i thon
 Hahahahahahaah e fort qekjo
i pashqetsuar prej jetes 
 Paret e shpejta edhe paret e maja
 Qysh e kish hahahahha
 Sa vjet i ki pash Zotin?
 Nuk osht puna qe nuk e respektojn festen osht puna qe nuk ki ti respekt prej tjerve edhe sta rras kerkush… 
 Google hahahahahahhahaha shum mu keshka me qeto 
 Qe ni muj jom ndiet, jom ka ha veq
 Per qeto sna ha kari
 I tell u qe e paske myt me qeto
 Shum i mir koka si loqk
 Nono je knaq veq meno pozitiv, senet e mira qe tkan ndodh
 Un ta kom bo qeto kallxoju njerzve
 Jo se nuk ju llogaritet qe jon kon
 Qkas mun me ndodh
 Qka i bjen foool
 Duhet mu kon arkatar i klases
 Garant ta ka pa fero qeto qe e ka qit kangen
 Ahhhahahahahahahhhahahaha mu ni tost
 O mil ti sje i trash, ashtin e ki tgjon ahhahahahaah
 Qe perveti i paske 11
 Rritnu plz e kuptone 
 A osht driloni hahahahahaha
 Mami jem n'ora 7: qu quuu quuuu se ora 8 
  Nje djalosh nuk e beri retweet dhe brenda 5 dite i ndodhi diqka e keqe ne familje, retweet… 
  Hahahahahahahahahahha erdhii qaji , qaj kamelice, qaj rusi , qaj tlulav, qaj tnonav hahaha… 
 Si ti shifsh me tepsi , mos u qudit ... bakllaven per bajram jon tu e qit
 Hahahahaahahhahahahahahaha qfarti more ka ble fletore me spiderman
 HAHAHHAAHAHAAHAAHAHAHA O qajo e fundit kejt mlujti
 Kshyrja fotot ninsta kejt me ni maic tbardh i ka
 Po more ka kur qohesh e dhez driten e myt tani tamon e shuk e nin edhe njo hahahahaah
 Mu ma qite diss a
 A e din qka o ma e mir se ni kurv?!
 Kur sdin me perdor nfillim be like... 
ala me tnjejtit shok 
 ncncncncnnc ani ushtro a spo ki qka me a
 kape mso se qet jav i ki testet ren more bal
===