 Po te isha kryeminister, sot Driton Selmanajn jo qe e kisha shkarku nga detyra, por e kisha perzene prej objekti. Me tha…
 Kosova nuk po ndahet. Thika nuk ka. Presioni eshte mbi palen serbe per njohje. Mundesh me qene kryeminister i mire i vendit e…
 Eshte pak ironike me u anku per situaten ne Kosove ju qe i keni votu te njejtit njerez te cilet qe 20 vite nuk kane bo kurgja…
 Vendim i mire e shembull per pergjegjshmeri nga ana e BIK. 
  E ka fjalen per korrupcion?
 Ne 20 vite pas luftes, dy Ambasadore te shteteve mike europiane i mbaje ne mend per lidhje te veqante me popullin, energji…
 Prej Flutarakes se Behgjet Pacollit tek vota Haxhi Shales, prej miqesise me SHBA-te tek feminizmi i Pal Lekaj, prej Xhavit Uk…
 Budallakia shkall shkall veq ,  i ka hyp liftit 
 Me ka mbete RTK lshut prej kohes se Kuvendit.Ridvani, edhe ky sozia e Gezim Kelmendit, sikur po shtyhen cili po ben ma shu…
 Kur don me nise biznes por nuk ke aftesi. 
 Pasi kom rezultu pozitive me COVID19, komuna e Prishtines m’ka telefonu 2 here me ma percjelle gjendjen edhe me me pyte a…
 Erdha ne purfundim se edhe nana natyre po mundohet me ndihmu popullin tone t’vujtun. 
 Mbajeni Lulin, se japim armatimin ❤️ 
 Driton Selmanaj tha se Qeveria po e konsideron te panevojshem Projektligjin per Pandemine, a une po e konsideroj shume te…
 Te dashur Popull do te perballemi me sfidat se bashku paska thane Dhelpra   E paska shti tash krejt Popullin me ni…
  Ardian._Istrefi e kom pas ni kojshi ne Mitrovice e kom ne instagram, eshte i bajgores. Me siguri kusheri e ka
 Qeveria i ka 60 vota n'parlament edhe njo n'burg...
Si p. sh.    komplet etj etj 
 Sa kunderthenes e te pa pergjegjshem, tash masat e reja zbatohen prej neser, si duket dikush i afert me qeverine ka naj ndej…
 Kur te thote "te dua, ama vec si shok" 
 Qfar dallimi mes njeriut te shkolluar edhe ati te paditurit,ky frajeri tu majt ymyt qe e pshton US, jem falenderus e zot…
 Ooo . Zyrtare. Kemi nje Berat Buzhala re ri tashme 🥂. 
 I thojke Xhavit Haliti i ki ti 2-3 miljon...ska pas faje se mesiguri vet i ka pagu!
Any bahet nervoz kure ju thojn populli  
 Kosova me Qeverine Kurti vs Qeveria Koti.Pra, Kosova munet, po qe 20 vjet osht keq menagju prej hajnave, aMkademikave, kUma…
Jane msu me kafshata te huja keta... and company   
 Ky i pa ngimi, ja ka msy me u bo President.A dini kur o boll o hajna? 
  ndalojeni kete keqtrajtim te tmerrshem te gjallesave ne "pazarin e kerreve" tash e 20 vjet.
 Pse bre djale sa t'harrum pak po ja thirr vetes zullumin 🤣 
 Mos u fsheh mas UQK’s o Burr, ska gjykata pun me UQK, veq me ty personalisht! Qyqarë! 
 Mos u fsheh mas UQK’s o Burr, ska gjykata pun me UQK, veq me ty personalisht! Qyqarë! 
  tha doreheqje dy here?? po mshefet mas embemës...
 duhet me thane doreheqje nga posti i presidentit!!!Mos te shkon ne Hage si president por si njeri… 
  U kan rruge pa kry qe prej fillimit! Kjo verteton se ky njeri eshte vetem vegel!
 Pa prind nuk e paskan lon.Avdullah KOTI. I dopt. 
 Rexhep Selimi per Gjykaten Speciale. Nuk ka gjykate qe e ndote luften per liri. 
Thaqi dhe Veseli te akuzuar per me shume se 100 vrajse, permi  90% me etnicitet shqiptare! Shumica absolute e tyre… 
 tu e parashiku te ardhmen!  
- Profesor! Ja ama ni 10:she ja te perjashtoje prej pune!    
 Po te mos te ish kane tipi i  me ju ndihemu ketyre kelbesirave neper kaffeteria me:n… 
 Prej 1 deri 17, me shume gjase jon tu lyp viza pune ne Gjermani.E ky i fundit, osht bo zv.Minister. Hala student, mesatar…
 Behgjet Pacolli si aj fmija qe e thirin me lujt qe me mar topin 
 Lehte demaskohet dicka ne interes personal kur testohet dashnia pa perfitim. Anetaret e LDK-se qe jane kunder Vjoses nuk e d…
 Shkarkimi i Vjoses nga kryesia e LDK-se eshte pos hajr, sepse  nuk e ka vendin n’ate Ode me burra jo parimor…
 A pom doket a i paska ngjyrose flokt mu dokt ma intelektual....mos harro se edhe ky ka PhD mas lufte...🤷
 Shqipet besojne se i ka ik kthiza ama nuk besojne se COVID-19 ekziston lmao
 Shqipet besojne qe nese keni lemze "osht duke te permend dikush", ama nuk besojne se Covid-19 ekziston!
 Dil pije ni kaffe me :n nashta te kallxon aje cka me ba ti twittra...
  Kure budallakija ska fund ne ks....
 Pse spo folni per 5 qe kokan sheru po per 500 qe jon aktive 
 Kur po e mendoj qe Labinot Tahiri ka qene deputet per rreth 3 vite, po me humbet deshira per me mendu tutje. 
 Kuku bre cfare terrnakopa marrin vemendje publike. Kush na ka nem' more kaq keq. 
 Sa budalla han buke...
 Pal Lekaj garant menon qe Seksizmi nenkupton me qi shume
 Sot jemi me te lirePor edhe me te varfer.Kemi shume deshira per te ardhmenPor edhe shume ankth.Prandaj sfida jone, 21 vit…
 A ka najkush foto prej naj droni???
Ku mos me dal tani ne protesta! 
 "kta si dine dy fjale anglisht" Spo dine shqip le ma anglisht!🤯 
 Ka momente si keto kur s’ka nevoje njeri me shtu asgje. Vec me kqyr videon edhe me mendu per kend e kunder kujt jemi. Kaq!
 Protesta osht niveli ma i nalt i vetedijesShihem neser ne Tubimin e madh te Vetevendosjes.Sheshi Skenderbeu, Ora 17:00. h…
 Vet fakti se ke pranu nje detyre prej  tregon shume per karakterine tone...
  E pa besushme per mu qysh ni intelektual si prof. Qendrim Gashi, amb. i RKS ne France, osht pjese e…
 Po mdoket me nje gote te qajit po pijne krejt Vushtria
 me zgjedhjen e padrejte te avdullah hotit per kryeminister, thaci munet me u sjelle automatikisht si minister i shendetsise, si…
Krejt e dina se per karrika e kane.  
 Shtrejt e ka çmimin Kosova jone!Nje vizite naten te nje deputet, nje kalim me minzi i pragut n’shkembim t’votes, nje mini…
 Facebook-u e njeh shume mire -n. :) 
 Ne Amerike per nje viktime e kallen shtetin, na edhe 4 vjet burgim edhe as nje demostrate se bajme
 U shit per nje terminal..
 Kuku per juve qe jeni mete aty...
 Me fol ka t'del shpirti, valla bre eshnat e deshmoreve e martireve ju keni livrite me qita cetnika e shovenista ne Qeveri.…
===