 Qka mundem me ndimu?
  Tu paska prish boti
  Po se KURTI e OSMANI ju kane faje qe i kane bo 30 Parti per 30.000 votuese!
  Ja valla tjert spo kan me kan lujn qo**, se un t'gjeta tu me lujt qo**.
 baba jem n’2000-ten t’u u kthy n’Kosove se bohet mire
   Cilin kusht duhet me e plotesu? Me e pas emrin Agim Ademi?
 "qeveria kurti ka deshtu"
 Mos e njell allahile o burr, edhe na najher duhet mu knaq, qe 3 sezona jeni ka na muni.
  Nese ki naj argument tmir me than, thuje, ose mos ha mut palidhje.
 Buk kesh tu hanger o vlla, pse?
 Se di kush ka nevoje me degju ama bon edhe mos me i dite krejt, e mos me jap mendim per bash secilin send.
 Jaaa na jem shtet progresiv, pro europjan. A kur vjen puna mu kallxu qe jem, qy qka bajm.Nuk kena mu an… 
 Mfal bro, po shum epic mos me postu
  Kur ka punu familja Gervalla per pamvarsine e Kosoves, ju dhe shum tjere keni lujt me klikera me kojshit…
  Pse esht ora policore nfaj se po ikin mjekt nga kosova?
   Kam lind mas lufte edhe apet jam I tmerrun
 Me and my boys tu i prit rezultatet e Janarit n’Kiev: 
 Ja, sante kur duhet ska
 Per tkuq ke qajo, boll mir e pat referi
Veq edhe kundër bombardimeve t'NATO's nkosov keni met me dal kundër ju t'expressit qr 
  Shum djal I mir
 Me asi topi t'1 euro e 50 qe ta thejke krejt ftyrën me ba met rrok
 pse e ka ni njeri tu u dhi nball
 Derisa pjesa me e madhe e punetorve te gastronomis, nuk kane kontrata, nuk i paguhet trusti, nuk i respektohet orari(8 o…
 Ajo veq I kurtalis, qekjo ma e mir 
   Rryma shtrejt o burr, spo kem pare me ble libra 
Pse Kush me marr? Fredi a 
 Ismail qemaili e ka qu, isa boletini e Ka puth
 Ta kisha pas vetbesimin e Nisma
  kta direkt n'botnor, maqedonia n'play off, na me tupana n'shesh per kryetare t'komunave qe premtojne kanaliz…
Jaaaa hor u banum 
 Bureki 1€ e kiflet me ajrokrem 40¢, kshtu rroga 1000€ duhet me kan
 Paj fush ma, qka po do tjeter
 Me qfar sistemi edukativ jemi, Pak osht tu than kjo
   Kta edhe vet qka Kan ba kqyrin me ja gju VV-s
 Ne rregull qe e  kritikoni Bahtirin e meriton, ama qysh te njejtit po mundeni me ju gzu fitores se Lushtakut, qe osht…
 Fitues moral mbetet Bekim Jashari ne Skenderaj. Keta qe sot festojne, ishin edhe 2 dekada me pare kunder kesaj familje heroik…
 Si dush debatojm Nisma Vs PSD
 asi qifti qe dalin n ora 5 me vrapu bashk, kthehen n shpijn hajn oatmeal me fruta per mengjes ose vo me avokado ne buk, bojn y…
 Edhe u qu e ka dhez kerrin ka shku n barnatore ti ka ble 4 oki
  Ah osht Baba I kejtve ktu
Familja po vjen n'twitter, duhet me kqyr mir çka po postoj lol
    Ku me I marr, po duhet me pagu borxhin nihere
 Para nje muaji te gjithe ishin infektologe, javen e kaluar u bonen eksperte te taktikave ushtarake ndersa nga sot te gj…
  "Nuk kordinuan dot takimin me ramush haradinaj"Njeri Ka than hajde n10, insani Ka shku n9 edh… 
 Kush Kari je ti?
===