 Çfare skandali. Ganimete Musliu duke bo thirrje mos te ndihmohet shteti i Kosoves. Kjo ndodhe kur partia (PDK) e she Koso…
 Ganimete Musliu ne nje tubim te PDK-se ne Gjermani e fton mergaten mos iu pergjigje fondit per ushtri te Kosoves. Hajnave…
 Op, qashtu qysh jane ndertu kur i ke pase celesat e qeverise ne dore. Budalla jam une, me falni, budalla je ti. 
 Ndryshimi brina s'ka. 🤗 
 Nder kritikat ma te pakuptimta per kete pakon 100 milion osht kjo nga ojq "qika", se kjo pako e fundit sipas tyne nuk osht…
 Veç te na bohet thirrje per normalizim te hajnis.
 ai qe ne detyre zyrtare ti merr pese euro qaj ta vjedh milionin kur osht ne pozite ma te mire. ky far hajni ju paska dal ne mbr…
 Refuzimi i Thaqit-Veselit per takim me ministren e drejtesise te Kosoves tregon qka mendojne ata per shtetin tone! 
 Presidenti i Ukraines nuk po pranon Shqiptar te Kosoves me ju bashku luftes ne Ukrain. Presidenti tha qe; njo vjen e 20 veteran…
 Ne Arbitrazh shtetit 20 milion, e 500 mije shtetit bakshish. 
 M'falni ne shprehje....Po ma pjelle te flliqta se doportale tona nuk prodhon kush. Fsha gazetaret e sodit, qe njehere nuk…
 pro-serbizmi  buzhales nuk po munet me i nejt mo ne bark ka nise me i dal per veshve. e verteta e buzhales osht ajo qe e godet…
''Gazetaria'' me ''M'the e t'thash''. P.s Nacionale nuk eshte fjale e gjuhes shqipe. 
 Tash, a pe mshelin T7 e Gazeten Express a qysh?
 Sipas ktyne sanksioneve ndaj Rusise a i bjen qe duhen me i mbylle koxha do portale e media ne Kosove?
 Nje praktikant paska me fluturu nga puna sic duket  
 Kur pe meson nje shkurtese per me ik Veternikut, nuk po bon me nda me tjere. Me mire me mbajte vec per veti. Se duke i tr…
Fajin ma t'madh, ama..🤒🤮 
  Haha sa funny. Kqyre more çka keni bo asfallt mbi lloq. Qr as marre skishi.
 Deputetja e PDK-se me nje nder deklaratat me skandaloze ne historine e Kuvendit te Kosoves, e quan "terrorist" Komandant Malis…
 Nuk e ka ndeshku populli se gati 50% i morri vet, e ka ndeshku fakti qe partite tjera(hajnat) u bene bashk edhe e fitun,…
 Jemi nje popull qe votojme ni njeri qe nuk jeton ne qytet qe 25 vite, veq mos mi ja dhan voten ni njeri tjeter qe nuk ko…
 Kaja nanen ton diten te lodhin tu anku na myti korrupcioni na myten hajnat, kur vjen puna shkojn ja qesin voten.Eshte p…
 Kroacia pjese e Kampionatit Boteror, trajneri ne lot pas ndeshjes. Pak deshmi se qysh duhet veni e qysh luhet per to. ht…
 Vendosja e maskes brenda vendvotimeve eshte obligative per te gjithe qytetaret. KQZ-ja e ka komuniku kete vazhdimisht. 
 Qysh e mundshme qe arsimin e Kosoves me i perfaqesu nje sindikate e cila kurre nuk ka kerku pergjegjesi e reforma ne ar…
 Mundem mi bo "cancel" qeta "analista". Thjesht mos i shikoni dhe diskutoni programet e tyre per njo dy dite. Keta vuajn m…
 Qfar populli jem, para nji jave dul ne fush qe Grenelli paguhet nga Serbia per lobim kunder , sonte ka hapesire ne tel…
 Nuk mundet Prishtina as Londa me ja sheru komplekset Perparimit. Zoti ja boft qaren zoteriut.Prishtina ec tutje me Benin.
 Eshte mire me shpernda numra te infektimeve edhe kur del mire Kosova. Nuk eshte marre, por po shpresoj qe nuk do te na…
 A i bjen qe Expressi punon per shkije? 🤔
 - Arben, qu se 7 koka bo.+ Kush Grenelli a?
 Kjo eshte Kosova! Kjo eshte pasuria jone e botes se eger!Shikoni disa nga kafshet e egra qe kane rene ne kameran time k…
 Per Helloween me t’hy ne zyre te Expressit i maskum si Albin Kurti.
 Hape pas hapi Kosova e para ne rajon do behet per gjithcka ♥️ 
 Cifti yt na merr ne qafe bre! Shqiponja nuk eshte simbol urrejtjeje e per tre gishtat, meso pak histori bazike, ti edhe missat..
 dmth po paska qene ashtu qysh ka pretendu albin kurti, se ne washington thaci e vucici vec paska qene pernime me “Thika mbi har…
 Kur ju kemi thane qe Pronto Ambas. Vlora Çitaku e ka shty perpara coptimin e Kosoves, Prontistja thojke qe JO. Lexoni me pos…
 + Alo, shef. - Pronto Vlora, hehe.+ Shef, u kry puna, po i shkembejm territoret me serbin. - Urime. E kum dit qe ti mkry…
 Dmth ish Ambasadorja e Kosoves Vlora Citaku ka lobu per ndarjen e Kosoves. Kjo eshte shkelje e rende e kushtetuse.
 Osht normale me u sulmu qeveria ne cdo televizion e emision, qe shumica jon te Devollve e oligarkeve si ata. Milionat qe di…
 Sdi a me kajt a me kesh! Qikaq sa i perket PDK-s 
 Fushate shembullore po i referohesh nderhyrjes ne prona publike apo me disa llaqe e sprays? Ky ishte v… 
 Me qen si ju te PSD’s qe ngajtet mas pareve te Ramushit edhe Devollve, sa her ish permend VV e kisha ul kryt edhe isha k…
 Loja e ardhshme osht mos me ba be pasha Kuranin mrena 1 oret’podujeves : 
 Te njejtit analiste qe aksionet ne veri i konsiderojshin si fushate, e qysh kjo ka me ndiku VV me fitu komuna, te njejtit so…
 Ne fakt kjo eshte veq nje plp ndaj njerzve si ti. Qe tregon qe nuk ka militant po ka qytetare qe din me votu qysh duhet edhe…
 Dje e lexova nje lajm te vertete te gazeta Express
 vota osht e msheft, a budallakia jo
===