 Me kujtohet para nja 30-35 viteve e pagujsha 10 DM litren e Benzinit ( en t’zeze) Po me duket se po kthe… 
 Ti ndoshta jeton ne Shkup po ndoshta e ke leshu shtepine me qera se sa e di une rryma paguhet ne baz… 
 Shpellaret mbesin shpellar si cdo dite Edhe diten e pavaresise
 Valla folni keq sa te doni per policine e Ks vetem une po ju tregoj pervojen time. Nja 10 here me k… 
 Bash hiq a , nuk di pse askush nuk po punon me fjalorin e gjuhes shqipe. Ne Holande cdo vit i fusin me… 
 Valla te dy faktet shume shokuese. Kur ti sheh keto gabimet drejtshkrimore mos vet halli per ne.
  hahhaah valla bash qashtu, isha en Gjakove para 2 dite e e mata disa here shpejtesine , i… 
 Ndoshta jane kon tu mendu per Walk of fame e kane thone po ka fillojme ketu.
 Gima hec vet tani se e din qe VV ska cka me bo me te.
Kosova ne shekullin 21, qe 6 ore pa rryme disa lagje te Gjakoves !!! Kjo eshte hera e dyte ne kete jave.
  po ate pi kuptoj po tani me kandidu ky si kandidat i VV ka me pas pasoja negative per VV ne perg… 
  Besnik Dardani, boll bukur e paske pershkru kete verzionin e ahmakut. Edhe per votuesit eshte pl… 
 Per kete po vlejka ajo thenja e vjeter: 100 vjet zagar e mos me mujte mi zone nje lepur 
 Hahahah , ne Holande para disa viteve jane ngulur me dhjetra persona ne kesi lloji email te derguar… 
 Marrja e mendeve eshte nje shenj  pozitiv.
 Si ka mundesi more me qene kaq te mbrapsht?? Nuk i kuptoj kete lloj te njerezve. Ne vend qe mi parku… 
 Eh, ne shqiptaret dyshojme ne vakcinen per te cilen kane punuar mjeket/shkencetaret ma te mire te krej… 
 Paramendo cfare shteti, per te tentim vrasje qe 8 vjet i lire. Tani tha diku ne shtator 2021 eshte caktu data e seances.
 Hahahah, ne boten e civilizuar trotuari eshte per kalimin e kembesoreve, dmth nuk ka nevoje per te sh… 
  Besa Edhe nja 5 a 6 Urime te tjera qe nganjehere po kalojne  ne  perulesi
 Po ku mos mu bo nervoz se e myten shkelma e grushta . Ata te Bilbao’s si mu kone drupreres.
 Ehh keta e kane nje arsye te forte qe e bejne kete gje. Shiqo Trumpit cfare „ lufte“ eshte ka bene… 
 Mos u tallni me kete zoteriun, ky nuk ka genjy. Te shkolluar , ka deshte me thene se edhe nje vit i shko… 
 Ja ka fike dritat shpejt , 
 Ndoshta me te vertete ka qene e suksesshme , krejt varet se cka ka qene qellimi i Ldk/weverijen.
 Sipas levizjeve te gishtave po me duket se 10% e trustit pi kerkon
 Leni more njerin rehat, ky keshtu e ka mesu ne shkolle. Ky i ka kry studimet ne Micro ekonomi. Ata… 
 Ndoshta ne nuk po e kuptojme kete more, duhet hulumtuar se cka ka 1.83 m me Kibernetiken. Se ky eshte ka q… 
 Hahahaha , duhesh mi ble Edhe nje top tjeter , si perpara qe kundershtaret e Barcelones kerkojshin Ed… 
 E cka mendon per mbajtjen e maskes ne rruge ( ambient i hapur) e hyn mbrenda ne kafe e aty e hjek mask… 
  Hahahah, te pameshirshem jane bo. po te pyes se une erdha nga Holanda ne Tirane e ne Gjk a… 
  Shpend Lila, a per mosmbajtjen e Maskes a qe nuk ke guxuar me dale ne rruge ne ate kohe?
 Disa here po e shiqoj kete foto akoma nuk po e kuptoj se cka eshte problemi ketu. A ka ndonje vi te bard… 
 Sa degjova une ky ish personi ish denuar per shkak qe nuk e ka mbajte masken/ dmth distancen me pre… 
 Si po duket kjo eshte semundje kronike e Ldk. Vetem numra treshifrore ju qet goja, si te kalon treshin ate… 
 Varet se cfare kerrin ke, Fiqa e paraluftes u niske me te treten e menjehere u duhke mi qite ne te katerte… 
 Shiqo, nuk eshte per tu quditur.krejt cka behet masovikisht behet normale. Atehere neqoftese dikush… 
 Nuk di se per cfare institucione e ke fjalen!! ?? Nuk di ku po i sheh ato qe egzistojne ne Ks. A mos e k… 
 A thua a e lexon/kontrollon dikush keto publikime para se te publikohen. A ka ndonje gabim drejshkrimi… 
 Me pas qene ashtu atehere nuk kishim pas nevoje as per polici as per shenja te kumunikacionit e as per shume ligje te tjera.
 Zoteri Muja, koheve te fundit po e percjelli pak me shume politiken ne Ks. E deshta me te Komplimentu p… 
A ke mundesi kete fjalen decizive me na perkthy ne shqip 
 Na shkoj jeta duke ju  perkulur gati te gjithe botes.
 Rrypana ( thojin ne Gjakove) shin keta Meksikanet.
===