 Edhe une e menova qeshtu, po eshte edhe ana qe kane deshtu ne Kupe e dojne me pas nje sukses ne lige s… 
 Qysh po e shoh te dyte kane me perfundu me ma shume GS se Roger.
, , Glauk Konjufca. Perfaqesuesit ma t'mire prej qe mbaj mend! 
 Po. Barazimi me gola ish kon nice.
 Ja sbesoj. Cka me la pershtypje qajo presja gabim ne mesazhin qe e ki pranu.
  Po qaj 1 Gb tu ka harxhu... se edhe une e kam pas te njejtin sen
Sa here po rrezohet naj lojtar per shkak te naj nderhyrje, une pe kom ka ni mini heart attack.
 Hahaha kushtet nuk jane bash..
 Ketu u kon finalja e kupes me Juventuesit, e une tu e marr afer zemres qe ky u dal i pari ne fushe para nxemjeve.
Kedo qe e kam taku ja kam tregu kete video. 
 Se ke lshu frontin hala krejt lol
 Po po kqyre ja vlen
  Ki permiresime te dukshme, i nderuar
Une jam rrit me ni qytet ku ma shume se cdo i dyti e ka pas pjese te identitetit partine e LDK-se. Sonte po ndryshon kjo mendesi. ❤️
 Calhanoglu ish dasht mi shutu, sdi pse lehet anash n'kete aspekt.
 Lejohet me dal ne qytetin e karantines, po jo me dal jashte qatij qytetit
Ma myti blocka njerin 
Shqetesuese kjo performance. Nuk eshte qe lojtaret qe po mungojne jane larg ma t'mire se kta sot, perjashto Muriqin.
  Russ aty, u cudita me qet tweet
 Nuk po e kuptoj. A nuk luhet ndeshja ne Parma te Italise?
 Urime ditelindja Arlind, sh shendet e suksese!
Paraqitje e mire e Gjilanit, marre parasysh qe APOEL ka fitu brenda kunder fituesit te Europa League, Sevillas.
 I qajte regjistrimet ne Expert a hahaha
Me lujti, cfare niveli. 
 Mos harro qe ne Serie A ka me ardh me lujt.
Qe 8 min tu e sill topin ne mbrojtje, normal qe te ndeshkon. Hehe.
Edhe 18 min kohe per t'u percaktuar cilen loje kam me kqyr.60% me 40% po prin  deri tash.
Ta hangsha zemren, cfare cmimi astronomik 
 Price sh nice, me lujti
 Ilicicin pom doket i bjen me pas kundershtar me Atalanten. Pom doket pe shoh tu lujt hajgare ai me kto.
 Bash e menova, ky far lojtari ktynehere ne Genoa u kon top mbrojtesi i krahut te majte. Krejt kane… 
 Kam degju nese del ne 90hz nihere, mo nuk mundesh mu kthy ne 60hz thjesht syte te mesohen. E per kete p… 
I kqyr lojtaret e Lazios, i kqyr lojtaret e Milanos. E kqyr renditjen tabelare edhe diferencen ne pike.
How? What the fuck? Nese eshte naj numer qe nuk duhet me qene i plotpjesetueshem eshte 51. 
Nuk eshte puna te t'nxehtit, eshte te paranoja e te djerst.
  tu i parapri diskutimeve ne twitter.
Nuk jam nervoz sot, jam nervoz me penalltine e lojes te kalume.
E niva njonin tu fol shqip edhe nder te tjera tha 'lokdovn'. Lockdown.
 Sa ironike qe shoqeria jone, po e lufton racizmin ne Amerike  virtualisht, ndersa ketu ku po jetojme ende perdoret ter…
Mbaj kontakt me shoke/shoqe nga Shqiperia veç per shkak te dialektit. Me pelqen me sfidu veten ne dialekt te tyne.… 
Bre thojsha pse s'pom bohet mu 
 Problem valla pa pru lojtare shume te forte qe me luftu per Scudetto. Veq mos t'keqkuptohna qe tash si… 
Qellimi i ketij tweeti eshte qe nese dikush ka deshire me rrit kete numrin e familjeve edhe me dhuru para, ju lutem… 
Me disa shoke e kemi fillu para disa diteve mbledhjen e nje shume te parave per ndihmen e disa familjeve me pako us… 
Prej mengjesit tu e kqyr qeto. Kurre s'mundesh pa kesh. 
===