  Nuk u lidha me deklaraten po me qendrimet qe po shprehen, ne nderkohe deklarata qendron por… 
 Paj po bre nashta edhe kane qene tu na izolu, ja qe sja kane arrite. Tash ne kontekstin politik e hi… 
 Pse more ky mllef per Zvicrren?- Graniti e Xherdani shqiptare jane, e perfaqesojne komunitetin i cil… 
 Ti e kqyr Arsenalin🤪
 Pse kjo deshire per te mbet Zvicra jashte ?
 Ehhh ashtu po :-), nejse edhe na(disa) po i shajme tont ketu :-)
 Eiii, le ti shan tash masi e kane qit Zvicrren ne harte tfutbollit :-).. tash keta  a duhet me kthy nbaushtell a qysh?
  Ose Zemajn ose Vitine :-)
 Arber, me cka e kane shantazhu Pacollin?
   Une jam robot sjam popull. Hajr ishalla. Shnet.
   Qekjo demokraci ku Albini i ka fitu 400k vota, ku pe ndjen tnevojshme me i bo 600… 
   Per 21 vjet u ndertu shteti e demokracia, e ky djaloshi per 2 pranvera don me pri… 
I jaaaaashtezakonshem, got to love the boy. Nje big up edhe per Mergimin sot  
 Celines duhet me ja nderru rolin me Muriqin se nuk ka topa per Celinen ( at least Vedati shkep top… 
 Kah mi nis aksionet, 4 here u nis ka Hadergjonaj u tutke me majt top drejt ne out. Halimi?-njejte si Hader… 
 Hadergjonaj nuk eshte kerkah edhe Halimi eshte dobet, Kololli ne kete formacion ka dual role patjete… 
 Spo doket keq, smenoj qe Zeneli u sakrifiku, po hin ne loje me mend sipas meje trajneri, e ka Kolollin ne… 
 , e ketu muj me u pajtu me ty
 Sdi pse po thu ama shume seksi po doket n’kete foto
  Mjafton me ja dhon 3 golla sikur Anglise
 Mendoj qe duhet te merret si barometer deshira, energjia, vullneti edhe loja e menqme qe e bonen dje… 
 Ka kohe qe nuk kemi qene komplet keshtu , bon me pas nje 45 minutshe dritherues edhe pse miqesore 
 Sdi pse po e shihni tragjike kete fare pune, kemi pas deklarata mbi familjen edhe nga VV per pushtet… 
 Me jete te gjate, u rrit me shendet me prind e shume gezime :-)
  Kur pe pina kafen ? 
 Votuesi Kosovar eshte fort i menqun, kjo tregon qysh ka votu keto 20 vjet. Ama kesaj here u tregu pak m… 
 Se lypin qN :-)
 Ishalla gabohem, po kam nje pershtypje qe kemi me lyp Hashimin e Grenellin, tpakten keta dy e kane njoh… 
  Me pergadit zgjedhje te jashtezakonshme ne nje kohe pandemije, me minimum leshime, ne harmon… 
  Cka eshte obligative?-vendimi thote nese nuk ki test, shkon ne vetizolim( a shkon a nuk… 
  Prej Nentorit eshte i njejti vendim sdi pse u bo lajm tash  vendimi me 12 Nentor 
  Tash a duhet a nuk duhet me pas masa?
    Cdo vendim qe eshte marr ne 3 muajt e fundit ne raport me masat anti… 
 1.Arti/Kultura2.Sporti3.LigjiAs ma shume e as ma pak nuk na duhet si strategji qe Kosova me pas te ar… 
  Pse po fol palidhje?
 Edhe une, me bokall 🥳
 Me Anton Çeten ke e gabume, me Rugoven nuk duket shume e gabushme, katedralja aty ku eshte sot, ka qene… 
  Mendojshin qe na ligeshohet kapiteni :-)
  Nuk dyshoj, e di nivelin, ama po besoj qe nje gazetar qe ne prime time eshte 3 prej 5 neteve… 
 Si duket kushes nuk i kishin qellu lule , se edhe une per veti mendoj qe i kisha dhuru naj puthje :-)
 Gjithmone. Edhe hipokrizia duhet te jete e papranueshme per me pas shoqni te shnosh. Valonit, keta q… 
  Per marre jemi, a ne nderkohe plazma-t edhe srce-t spo i nalim, po Muriqi sbon me fol :-(
  Edhe une po du me besu qe nuk eshte kunxh :-)
 Nuk eshte kur individi fyen e ofendon, opinioni e kritika eshte ne rregull por jo edhe fyerja e ofen… 
 Perfekt ideja, edhe Dafina me Ramos-in me knu La Reina ne mes pjeseve, do i kishte hije kesaj super sfide
 80% e deputet’ve do te jene te njejte, sdi pse po shpresojme qe ka me qene ndryshe. Ndoshta duhet te v… 
 Nje sygjerim te vogel kryetar,meqenese jam tu marr trajtim n’qendren e shendetit n’Kalabri,nese mundesh me… 
 Ndersa me Moldavine nuk tentoj hiq me u bashku, megjitheate Lirimi shkoj e perqafi mas grumbullimit… 
 Po ma ngucin loqken kapak, du me i prish punet me Vedatin edhe Valonin, te realizimi i gollit te Ve… 
Lirim u gezofsh qun  
Ta ha zemren ty, une po quditna me Gattuson qysh po munet me t’majt rezerv ty :-) 
 Une po mendoj qe duhet ndoshta shkaku i kartonit edhe ai edhe Rashkaj :-)
 Bernardi ka ndihmu mbrapa, nuk mundet Florenti vet me Iliqiqin, gjynah qe ka karton, se perndryshe e… 
 Per qata e pata fjalen, ne te dy rastet i bonen fjale, lene djalin le te lun futboll.
 A e lojme futbollin edhe nja 2 vjet deri sa te rriten keta , po keta me loje, humbje e presion rriten… 
Taman djali jem i bon 9 vjet me gezu keshtu per kampionatin evropian te rradhes me dres te Rashices 
 Knej me sport e seks ma shume, edhe pak me qeverine amerikane🤪
   Ne rregull me kete pjese, ama kjo pune i don nja 4 muaj minimum. Edhe sipas gj… 
 Paj pse po vajtojme spo kuptoj :-), te zgjedhurit tane jane ata :-)
 Shyqyr qe i dijme me emna kush po shkon e kush nuk po shkon ne salle, nuk po besoj qe jane votu mos me shku ne seanca :-)
 Fine. Para se me ardh Muriqi nuk e kam percjell Lazion nuk e di ama mendoj qe duhet me pershtat loj… 
 Me t’jau q. mo.... lopqe ketyne eshte pak.
 Po edhe taktika e trajnerit eshte kritiku, se nuk pat problem veq Lirimi, krejt ekipa ke pak a shume pa zgjedhje, pa kontroll.
 Krejt ekipi i Dinamos pati problem me pozicionim, t’njejtin minute dul prej lojes edhe Gavranovic,gola… 
 E ka flladit shpirtin loqka 
 Djema, jau ha zemren Nje per krejt, krejt per nje!Me shume mungesa e probleme, por  treguat sa e doni kete fanelle.Koso…
 Mundet me qene e vertete. Po paramendo me pas Muriqin qender e me pas dikon qe vlon me pasu ne zone si Kastrati?
 Lirimi e ka dobesi pasimin para gollit, njejte ka vepru vazhdimisht edhe Lokomotiv. Ndersa angazhimi… 
 Djali mu dhimt edhe na la keq, ishalla nuk e ka lendimin serioz, keto komentet tjera zbuten me kohe ;-)
 Kush o ma e mira..? 
  Shaqa, Ronaldo etj etj. Happy birthday per ma t’mirin nder shqiptaret
 Loje e bukur ke,barazimi ke rezultat ma real, sdi pse, po prita ma shume prej Daku-t :-)
  O loqkan, skemi pas tjere per kete loje. Sa per gjak e zemer une nuk pashe qe u kurs… 
   Nuk kisha me thone per Alioski-n, a per Bardhin edhe Ademi-n respekt pa fun… 
  Jo jo, spo i kapna, po me bon nervoz qe eshte super talent e nuk po vrapon sa duhet. Spo du me pa tu u shu.
  Paj loqk ti bonu qysh dush, une se kam njet me ndryshu menim. Nese kemi pa andrra es… 
 Perjashto Zhegroven (per mos angazhim) krejt loqkana kane qene. Ky idhnimi bajat qe na e kem eshte… 
Edhe une vet e kqyri si baci, nuk jam mire me krye 
  E di qe se shtin, me Hadergjonaj lun ne krah, a per Nuhiun mos ma harro golin me Çekt 
Benji eshte llokum,Kush e nguc Benji-nKurrë mos boft lum. knaqu me lojen loqkan, kangen bashke na n… 
 Pse e presim na padurim lojen te tjeret as qe e dijne qe ka loje :-( , keshtu qe deri te Enjten ne 20:15 mos prit me pa diqka 
  Patjeter. E njoh regjionin mire edhe po ja’u kuptoj dhimten, se ne fund te fundit Qendronin e… 
  Ketu pajtona, pjesa tjeter e opozites atje po e shfrytezon kete reforme si teme politike, e q… 
  Ka mujt lehtesishte me lobu sbashku me qytetaret qe i menaxhon me bo ma shume per me ndal shp… 
  Se kerkush as atje nuk eshte kunder reformes nese shohin ne dobi ne to. Per ma shume me u lid… 
  Nuk jane bo te tjerat man, po komunat tjera si kane hin ketij ekesperimenti se nese ti i zvog… 
  Nuk eshte pajise me laboratore shtese, me salla sportive shtese, me sherbim mjeksor brenda sh… 
  Eshte eksperiment nuk eshte reforme, nuk qohet fmija 6 vjet 10km larg me autobus te kosovatra… 
 Khaaa nona e konspiracionit jemi, nese nuk don/nuk dojne, merret vesh po besoj mos tash, ne Nentor,… 
 Dmth Kosovo national team e keni emeru veten edhe boni kesi postime :-(, djem/qika kushdo qe jeni Blen… 
  Paj na tash po flasim per zgjidhje t3-ta, Muriqi pa loje, Nuhiu so-so, Kollollin e provu… 
 Mundet Rashani ne qender, pse jo me thirr edhe Mirlind Daku-n, djali eshte ne top forme  :-)
 Ahahahahahh, qysh ja keni shtru zullumin me keto shtigjet e bicikletave, naten ka me dal me i prish Shpendi 🤣
 Kur t'm'vesin najsen per t'kalumen- 
  nje espresso te mire ja kisha bo edhe ka nje raki skrapari per me ju qel humori
 Te njejten e kam mendu, perveq Ibros ne vend te Fidanit ( edhe pse e di qe Challandes nuk do ta bej)… 
  Dicipline, pune, dicipline. Edhe mos me thirr hiq ma Bernardin nuk merzitna.
  Pse e ka marr njohjen, tash e hap ambasaden 
   Se duhet me qu thoben me punu e jo me nejt t’u kajt, prej qe eshte politike ve… 
  More atehere ska pas funksion, tash eshte Kryetare e Kuvendit, spo i ka hije :-(
  Perveq patetike, ka nis me u bo e pa takt, e neveritshme🤮
 Shpend keto s’jane qudi, na baben si mos te na jep pare nuk e dojna, e le mo kombetaren ose shtetin… 
 Ndoshta ma mire Celina ne vend te Valonit ( shume nalt eshte tu lujt Valoni edhe krejt pak t’u vrap… 
 Ahahhaahhahhahaahaahahahha, me gishta e kallxoj taman, 5 santin, qe ke pak e quditshme ne cka e kish zatet zoti 
  keq kryeminster, shume keq :-)
 Nuk kisha me thone, ata jane testu, njo ka dal pozitiv, tjeret jo, plus asaj si rast me i fresket ke skuad… 
 Theze cigaren se me doket e ke lone 
  Po bre, pazarxhi te keqij si me fol per doner, e kuptoj andrren e Vedatit me lujt ne Fener,… 
 Eshte e vetmja onderr qe me jep shprese e gezim gjate ketyne diteve te veshtira, kthimi ne forme i… 
 Maju edhe veres man, se keto krizat qe i ke permend jane sene te zorit qe kalohen, birra e ftohte n… 
===