 Vec edhe me kerku dikon qe i ploteson 100% kerkesat, sidomos kur ato jone kogja specifike, merr shum… 
  Eger ju kane hi a
Mos me dijte shqip ne qender te Munich po hupshe.
 [3/3] Problemi osht ktu qe njerzit levizin prej nje qyteti ne tjetrin e as nuk ç'regjistrohen prej komun… 
 [2/3] Une vet kom jetu ne Prishtine dikun 7 vjet, adresen kom vazhdu me pas ne Gjilan, dmth. sahere qe m… 
 [1/3] Kerkush nuk i krahasoj hajnite, se njeri rast ka aktakuze, dmth. nuk dihet ende, e tjetri rast esh… 
 E çarte, po sidoqofte, ne cfaredo kohe e vendi qe ish arrestu, kish me marre ksi kahje si "skenar". P… 
  per ni moment, kesh tu mendu qe u normalizu me shku me i hi shuplake policit edhe me end… 
  Hahaha njejte edhe une
A mundet dikush prej  me na tregu se cili ka me qene procesi per konvertimin e patent shoferit te Kosove… 
Nderkohe hala ka njerez neper timeline qe m'dalin me asi perfundimi "s'i une i vaksinum, si ai tjetri i pavaksinum"… 
E gjitha merite e Qeverise Hoti, se cka ka arrite me bo per 1 muaj e gjysem, prej 1 janarit deri 14 shkurt 2021. Pj… 
  Hahaha a hala je tu cicërru a. Nejse, pe perfundoj une, e ti mire e ki, une keq e kom, v… 
  Jo busulla te paska hup ty, qe koke qerru. Me shtine babes me ja kerku raportin per 12 m… 
  O garant, nja 68% jone te zbrazeta hahaha. Skandaloz je. Mos hi ma fell. "Sipas eksperte… 
ku armend eshte zemaj - 
  Hjeke lugen e makiatos hahaha. Fakti qe diskutimin ma nalt e sheh si pikpamje te nje ult… 
  Iha, as ti s'koke met me bo i ndrru dy llafe, koke qerru. Une foli per racionalizem te s… 
  Per muajt e dimrit, varet qysh vendos me u nxe. Nese vendos me u nxe me drunje, dallimi… 
 lol, nime e ki qe hargjohet ma shume se 600kWh ne muj a? Kogja shume mu doka!
Nuk muj me marre seriozisht kete Real ne kete sezon, derisa kjo Barçe e qoj ne vazhdime.
Foto qe tmerron qytetaret ne Kosove! 
 Ehh, po mendojne per popull edhe KEDS-i 
I vetmi perparim i Kosoves ne sektorin energjetik per kto 21 vjet mas luftes osht qe tash po t'kallxojne qe ka me p… 
Ti mundesh mos me i dijte ama gjysa e Kosoves i din kto sene ;) 
 Ani i erdhen nja dy bashklojtare me i ndihmu me hjek lloqin e me ndreq pak vendin . Krimi tjeter, referi… 
 Plus, s'ke problemi qe hupi Barqa, po qe fitoj Benfika 
 ha, kur po vjen knej?
 Ama vec s'po ka sens lokali mos me ta njoft kur shteti permes kufirit tokesor apo ajror ta ka njofte. S… 
 E pata qe tha me u end, te posht-e-nalt, e kjo ktu s'po ndodhe. Nese nji shtet te len me hy me certifik… 
msyshi e kish pas rrok’ 🧿 
Qeveria, bashke me bizneset, duhet sa ma shpejt me shtrengu implementimin e kerkeses per certifikate te vaksines ap… 
Me renien e numrit te te infektuarve, ka rene edhe numri i te interesuarve per te u vaksinuar. Gjate gjithe javes s… 
   Mundesh mos me pagu per ulese, thjesht mos e prano rekomandimin e tyne, kliko… 
 krejt Gjermania koka anti-amerikan! hehe
 a po na e ndreqni faqen? BOT is sad. :/ 
  sepse, nuk mundesh me marr dozen e dyte, pa e marre te pare, mirepo mundesh me marr dozen… 
 ncuk. po flas qysh eshte e implementume, si zhvillues i bot-it.
Per me hjek dore prej shtetesise se Kosoves sot, dikush duhet me kone tu jetu ne nje shtet tjeter se paku 5 vjet e… 
po vaksinohet edhe sot, go go go... 
Kshyre more bot-i tu ju pershtat ndryshimeve 🤣 
 edhe ti po don mu bo e famshme 🤪 
Une s'di pse po ia japin mundesine me zgjedh, psh. njerezve qe influencohen prej shpifjeve te Armend Zemajt e co. 🤮 
Sot, qytetareve te Kosoves nuk ju njihen patentat e shofereve, nderkohe, per me marr pasaporten gjermane duhesh me… 
Perndryshe, kjo kishte me qene baze per lirimin e masave per personat e vaksinum, sepse kontrolla ish kon super ma… 
hej , pse s'po e krijoni nji pasaporte digjitale te vaksinimit kunder COVID-19, edhe ne qofte vetem per p… 
 ahh, per kta qe refuzojne me marr vaksinen e aprovume prej krejt instituteve shendetsore te krejt botes… 
 duhet me mendu per me shkru o bir... qr aaa
 i mean, qysh ke mujt me shkru qr 
 qysh ju tha ashtu o bir?! khuu
 eshte mshel me muaj, ama me ju thone doktorave qashtu, shume shameless...
 u lost it bir, e niva kah i tha edhe doktorave qashtu, qr
 hej btw. kshyre more qysh po e dijne edhe po i lojne me vdeke?!!!! ncncncccAlpin Kurti i ka fajet ❤️ 
E qYSh MOrE S'pO MuJnE mE i NdaLE????? NcCNCNCc  
Perndryshe, nastradamusat e Kosoves hala besojne qe kishin mujt me nal rritjen e rasteve. 
Rekorde te zeza po thehen gjithandej botes. Perballja me variantin Delta jau ka prish krejtve matematikat per nje k… 
AstraZeneca e ka efektshmerine pothuajse te njejte me Pfizer, per mos me thone komplet te njejte. 
 Termin s'ka, vaksina ka. S'ka kapacitete ma shume per termine, jo per vaksina, o militant i Armend Zema… 
 Cfare anulimi more hahaha? qysh mundesh me anulu dicka qe s'ka ekzistu . Vaksinat jone tu ardh direkt… 
 ama, na jemi ku jemi sepse ishin ca as*holes ne qeveri qe kur krejt bota bojke porosia per vaksina ne 2… 
Ne Kosove tu u anku per mungesa te qendrave te vaksinimit sikur me pas Kosova siperfaqe prej 200,000km2.
Qe edhe nje unpopular opinion: as Gjermania s'ka pas mundesi me vaksinu ma shume se 1-1.5% te popullsise ne dite, n… 
Keto fonde jone subvencione per OJQ te vogla dhe te mesme, po menoj biznese. 
me ne fund po vaksinojne edhe te shtunevee...mos prit, go  
 Urime, i erdh fundi lajmeve! 
Bone mandatory, dhe jo vetem te mesimdhenesit, po te doktoret e ne shume institucione tjera publike. 
Ky vendimi i ri i qeverise nifar kopje e lodhet, pa guxim e me plot mangesi. 
 Prap gabim, ku po mbesin kafiterite/restaurantet? Edhe ato u duft me i shti ne liste per me mujt me hy ve… 
Doktori: Mas vaksines mos bo aktivitete sportive per 2 dite!Une: ***qe s'kom bo aktivitete sportive qe 1 vjet*** 
Ne Gjermani, prej vjeshtes kane me vlejte:1. I vaksinum (plotesisht), i testum (negativ) ose i sherum prej Covid (… 
Pfizer edhe Moderna ktu! 2/2 ✅  
 Bile edhe nja dy golla fore hahahaha 
Prej "Me pre peme e me ndertu villa n'Badovc" te "Prishtina e Gjelbert" too quick! 
Ani me jau permend naj plan per naj kerr elektrik, ne qaf te jesin, kryesisht per shkak te mungeses se "asaj zhurmes kur ta mledhsh".
"Ani, a ke ble naj kerr, tash qe je ne Gjermani?!!!!" - pytja qe komplet farefisi ma bon e kurr nuk harrojne prej q… 
 - ndoshta me pas nje portal te vogel, te thjeshte, informativ per ecurine e vaksinimit s'kishte me qene… 
Kuku, po gerrditshem, kishe pe dekonstruktoj rolin e trajnerit. Kjo i bje sikur me i uru vec aktoret e asnjiher reg… 
Vaksinimi shpeton jete, mos-vaksinimi e rrite numrin e vdekjeve - ne fund te fundit, zgjedhja mes ketyne dyjave osh… 
khu, ne vend qe me u kthy e me ndal ujin, vershimet edhe me i shpetu njerezit. ncnc. 
 A mos po dihet cili kanal e qet lojen?
- edhe e kisha bo me ligj deri 150 persona max. 
Prej qe nuk e lexoj GE edhe mentalisht jom ma mire. GE shkakton ankth, panike, urrejtje e militantizem. 
 ps. se ja paske bo vetes like reply po du me besu qe gabim a pahiri hahahahaha
 Cili lider suprem? Ky osht vec kandidat per KM, qaq. Ky mundet me zgjedh si kandidat ne fushate edhe ci… 
I have a dream qe nji dite shqiptaret kane me msu qysh me hy e me dal prej rrethit ne komunikacion!
 oh bankomati u hargju dicka s'qitke pare hauhauahau
allo, shqipe, me qel 1 parti nji kanal ne YT osht si me qel nji faqe ne FB. 
Trump tu e lujt Labin ne Amerike. 
Paska dal nje nivel i ri i idiotllekut: Armend Zemaj- Sa idiot je?+ Sa Armend Zemaj- Nivelin ma te nalt kokshe 
 Qe qysh u ni Labi n’ato momente... 
 op, asi qe s'kryhet kurr!
 deep, a po be  ?
 Qeky osht shqiptari tipik, kurre i knaqun. Mos harroni qe karantinimi o bo per mos me perhap infeksionin prej t'cilit kishin m…
- cka ke studiu+ shkenca kompjuterike- a mundesh me thy passa t'fbs 🤔 
 hahahah e ka tepruee
 o bir po te lo mu g'zu edhe pak heheheeh
 me mjekerr? qe banon ne Berlin bashk me Ferron?
 me fal per kete nguti, po ndjehem shume keq qe ia kam huq ketij teksti kaq fillozofik, veper arti me te vertete
 m'ka marr malli me t'mujt n'sony 
Ja nisa me msu gjermanisht, ligjerata e pare: "sie, sie, Sie", krejt njejt vec krejt ndryshe. Vec ligjerata e pare...
 ja kush me bindi mua 
 ku e paska ble maicen? shume real po doket...
  me u bo ti me ore te apple heheh
 ktyne te UP-s ka mujt me ju gjet vec naj punim shkencor, tek-tuk naj foto te naj laboratorit 🧪🧲⚖
===