    Fort po tutshi prej luftes ju trat e vv. Veq kembet po ja u rren… 
         A doni me d… 
   A mendove se je tuj fol me electoratin e VVse. Kan nis krejt rrenat me ju dal ne shes
 A ju kujtohet kur debat plus &amp; co e sulmonin qeverine e kaluar, ju te VV per cdo dite i keni pas debatet… 
 Z Mehaj, ne qutetaret gjithmon kemi bere me shume se ju politikanet, ama seriozisht, nuk i kerkohet N… 
  Me te thene kafshe eshte ofendim.per kafshet
   Ama  kogja shume ju kapshin gurbetqareve gjate veres
   A po e shifninqe num qenkan vetem gurbetqart qe po parkohen keq. Thjesht ky e… 
 Pse a qe 14 vite koka shtet Kosova a? Na lodhet duke na tregu qe vetem qe 1 vite u cliru Kosova. Ngadal ngadal krejt po i pranoni
 Po bre se kryeministri i Kosoves eshte vetem i qytetareve te VV. More turpi ska me ju mbulu ju qe jeni ver… 
 Tu oaska perzi pak puna si duket, sepse burri i Vjoses po merret me te tjeret. Ne fakt statusi yt d… 
  Po a ju dukeshin te mkre keat gazetaret kur i kritikonin ata theret? Fundja ti munde… 
  Dmth Berati qenka pakmme i forte se krejt keta bashk? Te pakten ata hajnat e rrencat tjere u b… 
 Sikur keta tuajt qe kan luftu per shtet social e po dalin me kapitalist se te tjert
 Ky po ban hajgare me ju qe jeni tuj i besu verberisht, sepse per ne te tjeret ky vetem brockulla eshte tuj… 
 E rendesishme eshte sa ke me pagu rrymen ti dhe une sot.
 Po keyeministri i ka pas te gjitha kompetencat per me ndalu referendumin. Te gjithe dlen dhe i thane jemi… 
 Ju edhe lista serbe keni qene kunder pavaresise. A po i bie qe keni qene tradhetare?
 Me unkthy mergimtart ty as qeni ste han more idiot. Une aspak nuk e perkrahi Albinin, ama vetem se mergi… 
 Ti del e shet mend shoesh ketu, ama vet qenke paragjykues, ofendues (bullist qe i thone ata anej kufirit… 
  Nuk po te kuptoj a duhet ta mbyll goje. Sepse e don Edin apo Albinin? Nese po e mbron Edin… 
 Varet a pranon z. Kurti kete ndihme nga nje "tradhetare"?
    ka pas shume te keqija nga qeverite e kaluara, por sinqeresht nuk i kan sh… 
  Hashimi e kish pas lene te kurdisur KEK para se me shku ne Hage.
 Dhezi dritat e burre, nuk i ndihmom dot Kosoves prej USA. Gjithsesi urime krishtlindjet
 Me keqardhje, mirepo shume prej gjerave te kqija jan zbulu prej gazetareve, e qe nje pjese e popullit po… 
  I respektoje njerezit kur i shohin gjerat me koke te ftohte. Ndoshta duhet kerkuar arsye pers… 
   A nuk e paske lexu derinne fund ku e kam cek qe edhe hajn e milioner i quani… 
   Me keta horra, ne moment qe dikush i kritikon, behen ose tradhetar ose hajna e milionera.
  Si duket ka dasht me thene se ka me u bo minister i shendetaise ne Gjermani
 Kerkoje falje nese je ndier i fyer. Une nuk i perkas asnjeres parti dhe nuk jetoje ne Kosove, por k… 
 E perse nuk mendojshit keshtu edhe per Perparim Ramen? Per bese njerez me dy fytyra jeni.
 E qysh thojshit per Perparim Ramen? A po e shihni sa te pa fytyre jeni ju te VV? Verem juve kur ju… 
 E Perparim Ramen qe e kritikojshi para 2-3 dite? A i harruat standarded qe i keni bere vet?
 Nuk te thashe ty qe e kritikove. Po cuditem me qasjen e VV.
 E qysh po bajka VV me i pru prej diaspores, e Perparimi qe mungese e njohjes se rrethanave vendore. Standard i dyfishte
  E pse nuk ka rendesi? A po dalin me votu te njejtit qytetar a jo? Vetem nje fakt po e harroni q… 
 I keni fitu trasht e sules. Urime
 Tash del  ne konference e thote qe kemi fitu, e militantet gjithashtu thone qe VV prape ka fitu… 
 Ne muzike shijen shume te mire ne politike pak me pak.  Urime fitoren (me mire pak se hiq)
 Kjo eshte me ju tregu juve qe populli ju dha shance, por ju me arrogance e keni merituar kete debakel. P… 
 Na morre ne qaf
 Cka u bo bre? Urime VV fitorja hahah
 Si duket televizioni i VVse e paska transmetu versionin e shkurtuar, sepse per debatet qe kan qene ne… 
   A diasporen ju vetem per vota po e dojshi a? Ketu shihet jo sinqeriteti.u VV d… 
 Eshte fakt qe ne nuk i kuptojme synimet e VV, sepse duhet te shperlajne trurin per me i kuptu. Cka ne ku… 
Z Vitia po thote qe duhet me fitu ky sepse qeveria e perkrah me shume z Vitia. Perse u dashka me qene keshtu? A nuk… 
 Te dyjat jane te demshme, prandaj nuk duhet vkersu ceo gje e keqe
   Askush nuk po thote qe nuk ka pas korrupsion e shume te kqija tjera, mirepo tash… 
   Megjithate prap te tjeret kane te drejte me vetvendos a i pelqen apo jo kryemini… 
  Nuk mundesh ti me me thene se eshte e drejte qe dikush qe ka fitu aq pak vota nga njerezi… 
  Ki tema shume, prandaj po te them. P.s. edhe une jetoj jasht Kosoves sikur ti, por nuk nd… 
  Une i permenda partite, me ta kujtu ty edhe shume te tjereve se si po mundoheni me ia shp… 
  Sepse votat i kemi te lidhura me emocionet, sepse duhet ndeshkuar ata qe sipas Flamurit j… 
  Shume mire e ke, ama te njejtat standarde eshte dasht me i perdor Albini edhe kur i kritikojk… 
 Garant edhe gazin lotsjelles e ka gati ky veq me i pengu qytetaret. Keta nuk dijne tjeter gje veq bojkot… 
 A ban me e dite se ne cilen komun po kandidojne Vjosa e Albini tja qoj edhe une voten time. O trushperla… 
   Gjithcka per nje grusht vota
 Per cfare fitore po flet?
  Kjo i bie si me i thene perse Kosovo e jo Kosova. Sepse Pristina eshte ne cdo gjuhe te… 
  Njerezit si ti e kan pru Kosoven ne kete pike mjerimi. Nuk mundesh me e dasht Kosoven m… 
  Bile eshte mire me fitu ky Mitrovucen. Le te dihet qe cfare populli qe vertet ngrihemi ng… 
    E pra sipas asaj qe thua ti, tash edhe synimun e ka harru. Seri… 
     vetem nje prej shume videove ku z Kurti… 
    Ndoshta eshte me mire me u pajtu qe njeri prej nesh nuk po mund… 
    Po me dukesh pak jo serioz me kete. Ni… 
    qenke i keq informuar
   Me jep nje fakt se cfare ka bere ky sa i perket bashkimit kombetar, e jo te m… 
   Arsyeja perse jam ne kete grup eshte se nuk bej pjese ne grupin e arroganteve… 
   E perse eshte genjyer populli me vite qe kur te vijne keta do te ndodh bashki… 
  Stoicismi ne demokraci nuk vlen me shume se te berit politike. Ky tipi duhet te mesohet si te b… 
  1. A ban nej link (kredibil) per kete qe po thua,2. Kush duhet te ta mbush mendjen ty qe ajo ck… 
 Sepse kur i lene shkollat mbyllur kan arsye me i shty edhe zgjedhjet. Keta e kan formulen me te mire se… 
  TV i ketij na ka tesh duke e perkrah edhe VV sa ska qene ne pushtet. Mendimin kritik sdo te… 
 Kur e shef se cfare komente kan keta njerez neper portale dhe media sociale te mbushet mendja se jemi… 
  Me faktet si tuat krejt shqiptaret kan mbet pa u vaksinu, se krejt po e njohin dikend qe e… 
  Edhe njoni qe e njoh kish pas jetu 100 vjet e tuj pi duhan, po kjo sdo te thote qe duhani… 
 Eshte e thjeshte hu duhet vaksinimi jo ore policore
 Tash i ke ra ne fije, se kur po e jep opinion tend po te shajn, keshtuqe me mire veq riposto cka kan thene… 
 Po keta spo din ndryshe vetem me i mshel komplet ose me i qel komplet. Ndoshta duhet ti sygjeroni ketyre qe… 
 E keni bo bajat. Qe psh jane raste shume te shpeshta te nejrezve te papergjegjshem. Ka shume mijra ra… 
 A e parkon keshtu ne vendin ku jeton ne diaspore? Turp. 
 Jo qe nuk deshiron ky, por thjesht po pritojne. Kosova eshte vendi i vetem ne bote per momentin ku pushtet… 
 Per ate duhet ta ngrisni zerin Ju aty ku e keni mundesin a jo te fshiheni mbrapa aryre qe nuk kan desh… 
   Ne shume raste spajtohem me Beratin, por VV eshte e forte per dy arsye, pse ka… 
   me njerz sikur puna jote VV veq qka bahet me e fort, edhe 5,000 raste ne dite nese jon ky prap jet…
 Per bese mundoheni kot ju qe jeni kunder qeverise, pa e qit populli budallallakun qe i ka hy ne krye kot… 
 Vetem se nese ik Amerika, vjen Serbia e jo talebanet tane
 Kete shorese po ia sjell qeveria e tanishme, ndersa qeverine e tanishme e keni sjell ju me keqqeverisjen tuaj
 Mire ke ba qe po mundohesh me i sqaru disa gjera, por te njejten kohe eshte shume e kote ti flashesh diku… 
 Bojkoto produkte serbe ka qene vetem fushat elektorale. Perpara i rrezojahim kamionet e serbis, tani i p… 
  Zgjedhje elektorale!!!! Election=zgjedhje, prandaj edhe e voton partine pa marr parasysh cilin kandidate.
   Pse more zoteri po ia fut kot. Ne vend se te krenohesh dhenlavderosh Duan per… 
 Po leje more burr  le te mendojn si te dojn. Per momentin ja u ka bo zoti krejt drite me Albinin, keshtuqe… 
  Fatkeqesisht qe ka shume njerez ne Kosove qe e kan pas enderr me i pa njerezit e UÇK ne burg.… 
  Edhe pse ka raste kur Berati i ekzagjeron gjerat, mos harro se Albini tere karieren e vet p… 
 Keta edhe kur ti uron kqn me te sulmu, keshtuqe behu gati per nje etuhi sharjes nga "ndryshimi"
 E perqeshnin Hashen, e keta!!!!! Katastrof
  Po mendojne se jan tuj lyp vota prej popullit te kosoves qe veq me fjale mashtrohen, kan ha… 
 Ne duhemi gjenerata te tera me u eduku. Perderisa meshkujt i hapin syte si huti kur e xhohin nje feme… 
  Sjam i sigurt per sa i perket termit bllezer per keta te dyte. Me mujt e zhdukin njeri tjetrin
 Te vetmin postim tendin qe ke thene dicka qe ja vlen me e lexu. Kjo eshte fatkeqesia e jone, i lejojme TV… 
  Eshte tuj u nxeh, se ka me ja nis edhe me punu
  Une besoj qe nuk eshte ka na fton askush me u rreshtu, me mire eshte me evmajt ne vete… 
   Ky si Hyra me dy fytyre. Kur po i bjen mire po i lavdron, kur sponi bjen poni shan… 
   Jo gabim e ke, une as nuk kam prit e as juk pres qe Kurti me bo Zvicer, ama nje mena… 
  Mlfort mire paske than. Se seriozisht me i thene qe edhe fluturon Albini njerezit besojn tash… 
  E nuk i sheh gjanat tjera qe nuk jan kerka. Pra me keq nuk ka ku shkon. Te dh*** ndryshimin qe es… 
  Jo Albinit kan ku inkapen gjithka, se absolut sen nuk eshte ka ban. A e dini sa njeri ne Kosove e… 
   Mendimin tend, nuk kam problem pse po mendon ndryshe ti, edhe nuk e k problem qe… 
   O shoq, nuk kam nevoj me te tregu ty cka kam ba, se te garantoj qe kam ba shume m… 
   Hajt bre se na lodhet. Seriozisht bajat e keni bo. Pikerisht kjo eshte arsyeaja p… 
   Hajt bre se na lodht me patriotizem. E kam.kry moti obligimin e patriotit. Gjiths… 
 Problemi me i madh per Valonin sa inperket mendimit tim ka qene se ka shume Valona ne KS, e ai fatkeqesi… 
   Hahah, a nuk po e sheh qe se ka gajlen e nje kombi ma ky a?
 Eshte per keqardhje qasja e  . Une gjithmon kam mendu se ka probleme psiqike, por kam shpresu q… 
 Axha nuk eshte kusheri ama, eshte njeri i shpis. Leji keta rehat tash le ti punesojn te vet se jan me te b… 
 Po dojket nej taksiratli me hjek, se e krej Kosova e din qe e keni punesu axhen e Glaukut
  E ka kiptu qe me tregti jemi shembullor, keshtuqe kish nevoj per me shume tregtar
 Flamuri i LDKs do te ishte shume me i mire se ky qe kemi sot, mirepo Vjosa duhet perfaqesuar Kosoven, e… 
 Po keta e kan mbjelle kete gjuhe te urrejtjes e tani po mundohen me la m** me sh**. P.s. ne asnje menyre… 
 Ndihem shume i privilegjun qe une si pjesetar i mergates, kam marr kaq prioritet te larte per qeverin e… 
 Ti vet i ke shku mbrapa ketij psikopati, e ja ke mundesu me u ngrit kaq shume, tash duro. Bile eshte mire… 
 Fajat i keni plot do anslista neper tv, qe na keni lodh tuj na tregu per ndryshim, duroni tash. Me qe… 
 Fajat i keni plot do anslista neper tv, qe na keni lodh tuj na tregu per ndryshim, duroni tash. Me qe… 
   Askush nuk po e mohon te drejten per vote, ky ligj duhet te mendohet mire, e… 
 Kishe shku te varri i Rugoves prap, ka fillu me tu bo si rruge me i henger fjalt e tua, hipokrit je per bese
 A po e kupton cfare kualiteti na ke servu me Mr Rronin. E ke pas dhene nje spjegim njehere, amo prap smujs… 
   He more  mendojshe qe veq me ja fut kote neper fushata. Ishal… 
  Paragrafi 2 eshte teori, sepse plan ose fakt akoma nuk ka shtjellu se si do ti realizon ket… 
  Mos u mundo me i amnestu askend. Ata qe i rrezuan me ligjet qe i bene vet per pandemin, mba… 
 Z Ahmeti, me gjithe perpjekjet e vogla qe i ke bere per ndalimin e tubimeve, fatkeqesisht ky eshte realite… 
  E respektoj kundershtimim e  sa ka qene ne ipozit, por tani duhet te na perfaqe… 
 Referendim i rreneva tua. Me pas qene shteti i kapun qysh ke thene deri tash, nuk e kishe pa me sy me i… 
 O ska sen prej teje. Ti ke me mbet deshtuesi me i madh ne historine Shqipetare. Deri tash vetem gabim e… 
 "veq nese kan perputhje respektive", pikerisht kjo nuk perputhet me VV. Eshte mekat qe Kosova do te u… 
      E para flisni shqip bre se ketyne te huaj… 
  Jam i sigurt qe shume prej jush qe po e kritikoni Vedatin i shperlani dhembt me fol ne se… 
 Nese we'll minka qene te perqeshesh autored e librit, ndoshta ke te drejte, gjithkushi eshte bere… 
 Me gjithe keqardhjen per familjen e viktimes, kjo nuk eshte menyre per te bere ndryshime ne shtet. Perderi… 
  ju lutem qe mos te ftoni Andi Bushatin per debate qe kan te bejn me Kosoven. Qi mund te jete cfaredo… 
 Askush nuk na ka faj qe nuk kemi talent. Ka shume njerez te biznesit qe nuk i kan as dy dite shkolle… 
 Ju jeni e jeqja me e madhe e ketij vendi. Turp per egon e pacipe tuajen. I thyet rregullat qe ju vet… 
  A po e shikoni se kunder kujt ju qe keni kundershtuar eshte dasht me qene, shikoje cdo… 
===