Gjendjen rende e paska ky.. 
 Nuk je e vetmja :p
 Nje arsye ma shume qe me nderru operatorin. 
Ja nga kane shkuar 60 Mln eurot te ndara nga BE gjate Qeverise Hoti. Keto jane kompanite qe kane fituar nga pakoja… 
Tash, a duhet te mbaje pergjegjesi dikush ne rast se deshton kontrata?
Phuu..Cka kane more keta njerez keshtu?!  
 Ende jo. Mirepo, mundesh me lexu lajmin per vendimet e Qeverise ne daten e sotit. Aty ki goxha detaje se… 
Urime muaji i shenjte i Ramazanit te gjithe besimtareve mysliman!
Koka perzgjedhur fotografia e Presidentes Vjosa Osmani, ne te cilen duhet qe te gjitha komunat dhe institucionet pu… 
 Taaap.. ne emision Ramushin! 🤔
 E rendesishme se ka masa. Fort te nevojshme dhe te vonuara!Jeta e njerezve te ketij vendi duhet me kane primare.
Vjosa Osmani - Presidente e Republikes se Kosoves!
Sigurt...drejt rundit te trete!
Avdullah Hoti, Agim Veliu dhe Driton Selmanaj kane ardhe ne seance vetem per meditje.
 Verejtje me vend. Faleminderit! 
 Jo hic mos e ki kete frike. Presidenti votohet.
 Nuk ka cka perdoret. Ligji i dyte eshte konfiskimi i pasurise. Mendoj se problemi kryesor eshte ketu.
 Jo nuk eshte gabim. Albini po hin sigurt ne zgjedhjen e presidentes. Dmth deshiron siguri qe Vjosa b… 
Deputetet e LVV jane betuar se ligjin e pare do ta votojne Ligjin per Zgjedhje. Ja kane borgj Mergates kete vendim. 
Gjerat qe kane ndodhur keto 20 vjet i gjen ne romane te kriminalistikes, e jo ne libra te ekonomise.Albin Kurti
Miratohen 14 komisionet parlamentare.
Lajm teper i mire per shkak se vlera reale pa objekt ekzistues ka qene tek 5mln ndersa objekti ka qene ekzistues. U… 
Kurti: Do krijohet qasje e re ndaj prodhuesve vendor 
LDK do te marre pjese ne votimin e Vjoses presidente.Dmth po kompletohet vullneti i qytetareve me 14 shkurt. 
Eshte arrestu edhe ish keshilltari i Agim Veliut. 
Njeri nga te arrestuarit sot ne Telekom paska qene keshilltar i ish Ministrit Selim Selimi.
 Me poshte e gjeni vertetimin e asaj se cka kam thene me larte. Perndryshe, Liburni po akuzohet per rua… 
Enver Dugolli zevendesminister i Mbrojtjes. 
Pra, Gjykata nuk e paska lajmeru Liburnin per aktakuzen!Gjykata tregon se a iu dha aktakuza Liburn Aliut apo jo? 
Albin Kurti kryeminister i Republikes se Kosoves.Urime!❤
Sot nje shokut tim  i ndodhi nje cudi. Gjate kohes kur ishte duke me pritur ne kafen Kadare, ky e mer… 
 Ki te drejte sa i perket ministrise tash se qysh eshte, mirepo une duke u bazu ne ate se cka tha Alb… 
Qeveria e re duhet te kerkoj llogari nga Krimet Ekonomike se pse nuk i kane bere keto arrestime me heret? P.s. cdo… 
 Vote ne kuti munden me qene edhe ma pak se 80, mirepo duhet me qene mbi 80 deputet ne salle gjate vo… 
6000 EUR per 600 vota. Dmth 10 EUR vota. Te gjithe komisioneret qe jane paguar per te bere kete veper penale duhe… 
L. Serbe ka bo dy krime te medha ne kete proces zgjedhor:1. Votat e Levizjes VV dhe disave nga minoritetet i kane… 
Pasi qe rinumerimi ka perfundu, atehere pse nuk futen te dhenat ne sistem nga rinumerimi?! Tabela ne faqe te KQZ-s… 
Urime ditelindja Astrit! Perjetesisht ne zemrat tona!
Isa Mustafa: Nuk do te rrijme ne kuvend per t'ja bere kuorumin Vjoses per Presidente. Asnje nga subjektet tjera p… 
Qeveria ne ikje, Qeveria Koti, kane shpallur tendera me vlera marramendese. Ne baze te ligjit per prokurim publik… 
 Nuk je i vetmi.
 Jane edhe votat me kusht pa numeru. Edhe ato vota mund te shtojne nje deputet.
Asnje komune nuk e ka fituar LDK.LDK nuk ka me bastione te saj.
Ne Istog, Levizja VV, ka dale subjekti pare. Qytetaret e Istog-ut po i thojne Levizjes VV ne Istog, gjeni kandidat… 
 Faleminderit shume kojshi, urime edhe ty. Na prifte e mbara 
Levizja VETEVENDOSJE! eshte subjekti i pare ne histori te Kosoves qe ka marre me se shumti vota, pa diasporen dhe votat me kusht.
Kandidatet burra te Levizjes bejne fushate dhe thirrje qe te votohen grate kandidate te Levizjes VV sa me shume!
 Na po krijojme standard te ri ne Kosove.
Shkruani keto pika dhe pas mandatit te  lypni llogari per keto pika. Sipas meje, do te dalim pertej… 
Komplet nje shtet kunder nje njeri! Albin Kurti ❤
 Nese populli na voton qe LVV me pas edhe presidentin(duke i perfshire 10 deputet minoritar pa listen… 
 Sa i perket pikave me larte: 1. Shpresoj se Gjykata Supreme do te vendos ne favor qe te gjithe te k… 
 Ne fakt, kur po i referona listes serbe po nenkuptoj Vucicin mbrapa. Vucici e ka vegel Hashimin and… 
===