Sa her qe dal ne pushim te shkolles thom, a qit ver kom me u knaq. Po e dini tash se qysh shkon pernime pushimi.
Seni ma i keqi qe prinderit munen me ja bo fmis tyne osht KRAHASIMI me femijet e tjer.
 Ashtin e zojes e ka kjo qika!
Ps. Fansat e GoT e din shka bohet fjal ktu ma mire.
Mdoket ktyne te jashtit, si te hin ne Kosove diqysh i’u zvoglohet inteligjenca, diqysh trullaven krejt, nashta puna e klimes a ku me dite.
Sa here qe po del ni variant i ri i Covid-19 pom doket po del edhe ni variant i ri i te nxehtit. U kallem!
 Ma shume sa qe e menon, para se me ja nis kom paragjyku edhe kom thon kurr se nisi, ama sdi thash hajt… 
Me ne fund me ni darsem
 Ti ke pa veq 10% tem jo ma shume, se din qfare shoku gjeni ki
 Jom msu me to, se shoh mo si problem
 Ka edhe ma keq, mu kon i sterlodhen edhe me pas vullnet me i bo ato 
 Urime edhe ty, a ki ...?
Nese priton me e shkrujt 1 fjali per urime, as foto spo du mem qu hiq!
Sot osht KURBAN Bajrami dhe duhet me marr foto te re me qit e jo ata te Bajramit te kalun, sosht njejt
 AHAHAHAHAHAHAHAHA DEKA, duhet pa qare smarrin vesh ndryshe. Po me i vedisu munesh me bo retweet 
Qitash vlla ke Bajram
A e keni naj ide se qysh bohet “ø” ne tastier ne pc?
  Nuk permeni kush emer i nderuar!
 E din fort mire ai njoni, qata edhe e pata injoru
 boma dikush dhurate fanellen e dyte tRealit
E nxjerri tosterin 12 t’nates edhe i ni do zona-hajt boma njo-edhe mu njo-hajt me qit ren bomi edhe mu dy se jom… 
Tayna masi te lahet 
 Dallon insoni prej insonit
 Osht njoni prej aplikacionevr qe e perdori me se shumti
 Pas cdo emocioni qe perjeton ti trupi prodhon hormone per ate gjendje emocionale qe e ke. Psh kur je e lu… 
Saka dihet qe osht lojtar i Arsenalit, se hek medaljen hiq
Ju shka jetoni ne Angli shkoni fleni se nes keni me u qu heret me shku ne pun. HAAHHAHHAHAHAHAHAH
Nuk e di a osht e shkrune mire a keq kryesorja Italia fitoj
Itali ju e dini qysh fitoni
Kur musafirt qohen per me shku ne shpi.Mama nderkoh tu mos i lon me shku pa pi caj: 
 Veteranii veq per inat te Anglis
Bravoo bre qishtu duhet 
Qysh me dite qe eshte e diele pa me tregu qe eshte e diele? —&gt;&gt; 
 Hajde kysmet, me emen t’Zotit
 Hajt, veq skishe bo keq edhe me na qit najnjo ne ig
Shi i madh ka ra pahh
 Se kan krejt kit nafak
 Une sjom kon kurr edhe spo bohet nomi
 Po hupke shume nga jeta
Veq vari i PermierL e pranon qata si penalti
 Ehh Morata valla, pat qef me shyt pak, skem shka me i bo.
Masi edhe bimet pasken stres shka kom une qe mos me pas , qy 
 Po Mister dhe Krim osht nga Agatha Christie, cdo liber i saj ja vlen te lexohet
 Vrasje ne Orient ekspres
Tash qe majm snapstreaks s’don me thon qe duhesh me i qu ka 30 snapa ne dite
 Qata dy lojtar te vetem te Realit na paten met ne evropian edhe qata dy na eleminoj Italia
 Me zemer te thyer e shohim kit foto
 Hahahaha ke te drejte, e fiton lojen kshtu pa i kushtuar vemendje
 Po paske te drejte nuk e analizova shume, po me ket levizje kishe dal shume ne avantazh
Na jasht kishe me u flladit.Mickojat nderkohe:  
A po i kallxoni Andin Lokaj qe lojtari e ka mbiemrin Mehmedi e jo MehmeTi!
 Une qdo sabah e falenderoj zotin qe benzema edhe valverde lujn per realin
Shka thojn me pa naj yll tu ra? Mos po kapi najsen pahiri
Mos gaboni me dal vec me ni maic, ja dy ja asnjo, se ndryshe spo bon
 Osht i vetmi serial qe me pelqen edhe nuk po hec, kurr sme ka ndodh qe me met ne sezonen e dyt edhe pse me pelqen
 E kemi perballu PLAN-in qe 20 vite, e s'po e perballojme zhegun per dy muaj!  n'40 
 I sakt ne menyre vertikale e horizontale
Falemderimi i takon  qe nuk ja huq llajkave 
Tybe mdoket skish faj Linda Morina qe hike ne frigorifer me honger buk, cfare nxehti edhe na qitash vec te bohemi gati.
 E une spo muj e i boj 500 
 Nese e ki kalu covid, ka pas shume persona qe kan te njejtin problem
Qellimi ne jete:——&gt;&gt; me dal naj tweet i jemi ne ig, sic osht deshira e shume personave ne twitter 
Pahhh qfare nxehti edhe spo ka diell e paramendo shka jish kon me pas diell🥵
From virusit afrikan to i nxehti afrikan real quick
 Qitash pernime u bone e famshme
 Se jon te mushun me acc fake
Po thojn qe sot dita ma e nxeht e vitit ka me u kon, kshtuqe:
Me pas naj klim afer vetes ne kto dite vere, tjeter nivel jish kon
 Cfare jeni duke bere me jeten tuaj
  qata ky Gendry osht i fort
En hall edhe Zoti me neve kur te osht ftoft lypin nxeht kur te osht nxeht lypin ftoft sdi sdi.
  Ne asnje fe nuk konsiderohet mashkull e as femer. Nuk eshte person apo gjallese per tu perc… 
A osht najkush ktu qe ka Tv Time? 
 Caj kamomili para gjumit
Mos paq pune me shqiptar se vec te thojne spo ka pune bre
 Percjelli lajmet ma mire heren tjeter
 Ka pas, ama vet ska pranu me lujt
 Sa ma lerg ksi llojsh njerzish 
Na fansat e Realit kshtu e kem te natyrshme me suportu Spanjen
 I ki qit ne dilem krejt hoxhallart
 Lupin po me mban zgjuar
 Cka behet fjal ne pika te shkurtra?
 Te dyjat ama ma shume me pelqen te shkruaj
Sa her qe e degjoj kengen e Italis ne eurovision 2021 bindem cdo here me shume qe e ka merituar fitoren.
 A e din se cka eshte kur nje person eshte bipolar?
 Vrasje ne orient ekspres 
 Kqyre Dark nuk ke me u zhgenjy
 Bile njetin e paske, qajo kryesorja
Ooo s’din bre me ngu muzik te mire, jon msu berlloga tu ngu🤮 
 My favorite game e kom pas
Qfare dite e mire me shiku serialin Lucifer.
Urime festa e Fiter Bajramit! 
 Ti shtike ethet kjo
 Dekaa,, hala mdoket i kom do
Kur tum qel naj zog ne lukth tu honger cdo syfyr veq vo
Oscar ma palidhje se ne kete vite qe kan jap cmime te filmave pa nevoj s’ka, diqysh shume do filma overrated kan qit aty!
Ty t’ka mujt nje djal i Hajdarovicve t’ka sos! 
Dhe Albin kurti ne intervist thote:Sot nje dite me dielle ne diten te Diele dhe keshtu do te jete deri ne mbremje.… 
  Ecc bre bohen kishe interesant na qishtu
 Nuk ka veshje provokative por personi qe provokon me ate veshje. Kshtuqe ne kete rast mendoj qe pers… 
Qitni shka te doni tash, kem bo iftar!
 Po e tu e pa tshkon leng prej goje, edhete dokey kishe je tu honger
 Nese e len ne tavolin dhe e shikon me sy jo, e nese e merr e han po valla
A osht ka ju dhem kryt?
Shka keni per syfyr?
 PASH 1 ZOTMOS NA MSHELNI XHAMIAT NRAMAZANMOS NA MSHELNI XHAMIAT NRAMAZANMOS NA MSHELNI XHAMIAT NRAMAZANMOS NA M…
  Look, jeta e juaj eshte nuk na intereson neve, po diqysh ju keni lind kshtu nuk jeni kthy… 
  Sosht qe i suportoj ama masi eshte dicka e lindur por jo e krijuar duhet me i pa me nje p… 
 Ata lindin ne kete forme jo qe behen me deshire. Keshtu qe duhet me shume rrespekt. Nuk eshte qe i perkr… 
 Hala bre skom pas, hera e pare qe po pretendoje me pas
 Des tu kesh sa her qe ja shoh emrin
 Gjete gur, hupe diamant
 Motra e asej qe ja morre mantillin at dit
Emrin Qershore e lindur ne Korrik 
 Kush e mban mend kte? 
-Cka ka najsen t’re?? 
 Fort e paska vra kerrin
VV e ka bo 3 ne 1.
Urime Kosove, urime Drenice!
Urime Pashket per te githe besimtaret katolik!
 I mir osht ama jo ma i miri! Pra i bje overrated
Nuk osht qe flej gjum shum po vec flej von
 Ne cfare aspekti po mendon qe Noizy osht ma i mire se Mc Kresha? Per mu Noizy as ne top 10 me te… 
Pas dy javesh karantinim sot i lire! 
Njeri vec sherrin ja sheh Kosoves 
A keni provu najher me shkrujte poezi te mirfillet?
Nermal qe fiton Spanja kur te lujn ata me Ramosin
 Se paske pa GoT nashta se skishe menu qe osht ma i forti najher!
Hajt rt se edhe 20 i boj 100 followers
Hajt se qitash hin luani edhe i trem kta lojtart e Suedis
Vaksinat erdhen por ti kur do te vish?
-A pe sheh njeri sheh me men!Arsytimi ma i shpesht kur nuk e sheh nje person.
 E ke serialin qe ka dal tash.
 -Alo+Alo shpirt-Une nuk te dua me, e dua tjerter ke+Jo shpirt -Tyt tyt tyt
 Krejt playlisten tem pa dallime
 Çfare jeni duke bere me jeten tuaj?
Po e kujtoj kohen kur u tranoshin njerzt per Azetin. Kishe shka mke ai
A jom i vetmi qe kurr nuk i kqyri storyt ne Twitter?
Cfare ministri osht ky qe ni dit aty e hala se murr as nje mas!!!
Kujt i themi mirmengjes
Shka bohet nese ma boni naj tweet retweet?
Erdh baba per here te dyte.
-Cilen gjuhe te huj deshironi te mesoni?+Gjuhen e Albin Kurtit se kur po fol sen spo e marrim vesh!
Nese doni me u kon njerez pozitiv ejani tek une!
Shoku jem kur t’blen zingjir te trash t’qafes edhe del me u fry; 
 U duft me bo aty +18 se paska skena te renda!!
 Me u angazhu ne disa gjera qe i pata lone jasht dore.
   Hajt mos u vono, se me suits kat pres jom
   Mfal sa kg i ki? 
 Shi e bore e krejt
Si te qohesh edhe e sheh qe osht ka bje shi, vec rrotullo ne krahin tjeter mos ta nin, se qashtu krejt ja bojm.
 Kenget e Don xhonit, Mossi etj.
Ej parameno ata t’klases teme ne fillore u perlashin per ne cilin vend me shku me pastru kur na shtishin ata te shk… 
 A na huazon pak bile?
Sigurt vec fmit ka 3-4 vjec i kan pyt 
Me kon i ra Barcelones ne Chl?
===