Wait... what? Njerezit po smuhet se spo mbajne maska, po ne te njejten kohe thote qe virusi o ren. Qfare rrjedhe te… 
Nuk do ndalemi deri ta bejme Adidas'in sponzor te dresave  
 Paska vërshu 'burrnimi' me statuse e analiza. Duhet me shty diqysh kohen deri te shtrohet tavolina, te pjeket mishi, te se…
Sensibilizimi me artistet e Kosoves nuk behet vetem me mbeshtetje per rritje rrogash, por behet edhe duke shkuar ne teater. 
Komentet e shqiptareve ne YouTube jane te jashtzakonshme...  
Sidoqoftë, askush nga futbollistet e tjere nuk arriti ti bej reklam birres me shume se Mavraj.
 Kjo far peme qe u dal ktu, dhe paska lulu, ja paska prish bukurine keti berllogu te bukur! 
 besoj kta njerez kane probleme serioze me menyren e te menduarit. Kjo cfare po bejne eshte banale dhe fyese per popullin.
Te frikshem jane ata njerez qe nuk e kuptojne ironine....
Fal transmetimeve Live Stream e msova kuvendin n'gishta.
Pak para festes mos te harrojme: patriot eshte ai qe paguan taksa dhe nuk hedh mbeturina, jo ai me flamur ne supe...
Ku po e marrin kta protestues te drejten per ta shakterruar pronen publike. Ajo prone sa e atij eshte edhe e imja. Turp.
 Serbia ime, spitali im! Per Kosoven, vendin ku as vdekja nuk ia vlen    
Sa shpejte harrojne qytetaret e Kosoves, ata e harrojne dhimbjen qe kane, dhe dalin ne rruge per te kerkuar me shume dhimbje...
Opozita ne KS po lyp "qiqra ne hell" per MSA'n... Dojn me u bo ma iracional se opozita ne Shqiperi. Ne rruge te drejte jeni...
 autori nje perkthyes i bukur plot plagjiatur, ky shrim egziston ne anglisht prej shume vitesh vetem e ka perkthyer...
 kallashi osht valltare "profesioniste" edhe nuk ka kry asnji krim :P
 po dua t'ja bej te qart popullit se pastaj mos te ken pritshmeri te medha nga te zgjedhurit e tyre...
 Populli i ka votu ata, une me shume e kam me popullin, populli mund te zgjedhi ke te deshiroj pavarsisht profesionit.
Presim qe dizajneri grafik te na japi mendime per asociacionin...
 Disa pijne Sheqer me Espresso ;)
 Gazetari: A je merzit per humbjen kunder Serbis?Cana: Jo sepse gjithsesi Serbia do t'na shikoj nga televizori duke luajtur …
 ndoshta... po nji send osht e sigurt, asnji fakt ne shkrim nuk eshte e vertet plotesisht...
 populli nuk paguan kurfare tatimi per shtetin?? hahahaha too good to be true...
Vetem nje fitore me Armenine kaq... une akoma besoj... sonte fitoi sporti... 
Per ata qe nuk kan mundesi ta shohin ndeshjen ne TV, ja ku e keni linkun per ta shikuar online ALB vs SRB 
Studentet nuk e dijn se per cfare protestojne... Mendoj se nje forme proteste mund te jete debati ne klasat e tyre bazuar ne argumente...
Te enjten uroj qe te tregojme integritet karshi serbeve, se ne te kundert nuk do kemi asnje dallim nga ata...
Pak shqisa, shume ndjenja...
 mendoj qe shenja duhet te ishte ne anen tjeter...
Atehere kur ti e pret me se paku, bash atehere asgje nuk ndodh...
Parlamentaret ne Kosove, i per gjigjen pyetjes me disa pyetje te tjera...
Urime festa e kurban Bajramit te gjithe besimtareve musliman...
Sugjero Twitterin per ata qe flasin me shume se sa qe duhet...
Shume shkrime, pak gazetar...
... kryevepra "Liri ne Bremen"... drame e bukur... komplimente aktoreve 
Dhe keshtu u pergjigj Rothschild 
  sta jep peshkun, po tmson qysh me gjujt peshk me dinamit  
 kto ikjet qe po bohen nga Kosova, njesoj si me ja vesh qenit kpucat...
Te Dielen nje gote çaji eshte kafja ime e mengjesit...
 nuk pe disha ket comand... cka eshte kjo?
Ne jeten reale Minus edhe Minus nuk bejne Plus, por nje Supernegativ...
 ka mujt me thon edhe numrin e telefonit e kam t'vales qe fillon me 1 :A
Me fal por passwordi duhet te permbaj nje pyetje egzistencialiste pa pergjigje...
Tirana ne keto caste... 
 Kam kohe qe e kam mbyll facebookun, besoj qe inspirimi i fundvitit me ben aktiv. :)
 mire shume, besoj se edhe ti mir i ki?
 iylik edhe ka une :D
 sepse mendon qe di :)
 mire se erdhe ne twitter.
 ktu i ki krejt ato qe nuk i ki ne facebook. Shijoje :)
 hade mirese erdhe ne Twitter :P
===