 Bash du me dit a ju blloku najkujt snapi qe sja  ka qu qatynve 50 vetave 
Nuk i besoj kurkujt qe nuk pin.. ata qe nuk pin kan frik ta shfaqin vetveten.
 Veq cillja ti se e han
Veq po sigurona qe je mir edhe menihere po largona.
 HAHAHAHAHAHAHAH o sa e fort koke 
Qysh mos mu vonu per pun gugell serq.
 Qysh ki qef ti me lepi ka qef edhe ajo.
Shoqen mat miren e ki qe edhe kur e mendon me nxon thu qija ropt qa mendoj palidhje kaniher edhe une. 
 As aklla se pi hup shija :)
 Qe po ta shkruj ni tiket tvyn per mavon loqkan.
 Jo babes une veq konsumus jom ski qa mbon ti mu 
Nuk mvyn ndihma jote, mjafton forca jeme.
Mundesh mu tregu pozitiv edhe pse je depresiv.
 Sa mir e qet llajnerin rita edhe vetllat mat mira i ki :p
 Shijet e mira i paske si vet :p
 Kta per mu dmth jon grupi ma i mir nkosov.
 2/ ato tmoralshmet edhe ato tpa moralshmet 
 sa kurva ka nket bot?
 shqipet be like "zot mos mshti ngjynah" edhe e vazhdojn qa kan me thon
Ma hesap e boj me hek keq se mem bo mir dikush qe ma permend.
 Fokusohu me shume ne formen e mendjes sesa ne formen e trupit.
Pom vyn dikush qe mjep vullnet me dal npun..
 Lajm i keq per njerzit me gojë t'shtremt... maskat po heken.
 kto t'suna sportit me ti jep edhe modelet me qat cmim tkompleteve si kisha ble HAHAHAHAHAHAHA
 tu thon qa ma heki fllowin, ajo kish bo fr
 Kqyre edhe niher neser kur t qohesh :)
Normal qe foli me veten, kom nevoj per kshill profesionale
 Tha ni fanse e akrepit
Lidhja serioze vrehet kur ni qift ja nisin me fol nViber.
Pse ndrrojn do sende, e do tjera gjeth po mbesin njejt?
Ta ngjoh reagimin nese ma ndin emrin..
Injoranti injorantit po ja bon injorant, i pa ftyri ska ftyr dyftyrshi ja ka mar garant.
 a ka naj rt per neve 
 pom mungon koha kur rrishim deri nsyfyr nkafiqa tu lujt zhol
 Sa mir llajneri :p
Kta e mbytem zemer tjetrin a pe dhezim?
 kaniher thom shyqyr qe jom i pejes
Hajde per benzin krejt paret mi qit
 kur ta bon dikush mute a i bjen qe e ki bo mut?
Qka o ni nat so qdo nat...qeshtu shokt mthojn qdo nat
Duhna me pas vullnet per me hi ntest qe mem rrzu  
Shum zonin e ombel e paske per me fol kaq palidhje
 Yooo i gjeta kurvat e pejes 
Dikush din po nuk ka guximDikush e dhin shum se ka vetbesim
Dikush tutet prej qenve si ti shohin ngajn, dikush nuk tutet se as qent se hajn.
Me ta shti pa dashni, si birr pa alkohol me pi.
Qija jeten e nones njeri 30 vjet e qon femen npark mu zhvall
Pot vjen era gojes sa mutin e hongre
 per dhom te paster dhe te bardh mos hani mut
Ne maj te deges ne maj te vidhit pusho i qet o merakli i dhipit  
Pom vyn shok/shoqe ose femen qe kur ti thom ka po shkojm ma bon ku tdush.
 Vyn koh me hi nto
 mtha kom fr, i thash nese tvyn burr lajmrohu
Kush po lyp qi nonen se un po lypi non me qi 
 Urime qeveria kurti 2
 Mi pas syt e tu me sy qel kisha flejt 🤣
Afrohu ngat gjethkujt po mos e le kurkond ngat teje
 kndejna ka peja ta bojn kryt bisteka full me pejna
 Un po rri i qet
Ka fryn era po shkojn njerzt
 Hekja musteqet and BOOM my ex 
“Tash je rrit, duhesh me gjet ni nuse”- exactly mom 
Sa her pllugi thirr na festojna
  Prap pot thot veq pse je shum cute t lejsha me fitu :p
  Kur t lejsha me fitu se u bojshe nervoz :p
  Hahahhahahahaha ma e forta je mbas meje oj jetë
As une skom faj qe jom kaq fly.
 Se as shokt e mi sdojn tjert mu perzi
Hajde terlatma veq pak 
Ti mundesh mi pas krejt po si ki shokt e mi 
 paramendo mi ndjek qeni qeshtu tlidhun hahahahahahahahahaha
 Nat mnyren shoqrore po mendoj hahahaha
 Mendoj qe po se shum jom chill edhe sja prishi kurkujt per kurgjo :D i need people like me in my life 
 Mvjen keq per shijet e tuja qe i paske kaq tkqija 
 Ti mendon mu feju a un hala mendoj a ma i fort osht goku a vegjita 🤒🤒
Naah bitch sma kupton anatomin ti
 Ne nje bot paralele
A t’pengoj me mbaru njo?
 Veq jem ntwitter se tkisha thon diqka...
Nese bona nervoz nty dije qe ki shum vlera te une.
 Leter kom po skom bari 
Harro qe gjen ma baksuz se une
 njerzt thojn sja din vleren pa e hup dikond amo une ja kom dit vleren qata se kom mo
We can fuck edhe pa u kon nlidhje 🤨 
llafet nkafe jon mat smutat
 Ja pasna huq nfund 
Ka europa je tu shku aa?Ku karin je nis pa dit mi kqyr punt e tuja
Ma i lodhshem po qona se kur po flej
 qysh ju kam dok krejt botes:            motres tem: 
Kape njonin, mshoj tjetrit
 qa kan tperbashkt jelekt edhe qipsat, dyjat kur ti qel dalin gjys tshprazta hahahahahahhaahqhahahahahahhahahahahahaha
 sinjali i par qe so ka don me fol me ty osht kur ta vonon msg
Spo ma mbush synin
 osht nifar deshprimi kur gjen farmerka tmira amo nuk tbin
 Kur ta shoh pending nsnap pa i bo sen 
 osht ajo pritesa qe po pritoj mu njoftu prej fillimit
 Qysh se ski send more e ki EX 
Paska pas pun me fmi. 
Osht tradit pa pi kafe s’niset puna kur te pij tparen edhe tjetren duhna e treten me refuzu s’muna kurgjo per merakli so gjys ore qe vonona
 A i ndrrojm galjet?
 Edhe un ja qifsha asej qe sta jep ty
 Se ki prek hunden ti 
 Veq edhe njo 15 cm tishe kon ma e gat FUNDI 🥰
 Kumedit o tu i thon fr vet gjeth kem mu kon bashk dej tdesim  te lojm t bon qef edhe pak
 Shanc ska qdo send qe e kom lyp njet kur smka ardh kshtuqe veq pe pres 
 Sosht send qe sbohet veq duhet mu gjet personi 🤣🤣
 Edhe nprovoshin mu kthy sjau jepim mundsin 
 Sna ka qellu ajo hiq 
 harroj se jo qe diqka
 Hahahahaha duhesh me insistu me ta tregu meniher se harroj mavon 
Une jom prej atynve personave qe t thot ko met kallxu diqka mavon e stkallxon hiq.
Ishte koha kur te gjith kishin problem me nerva 
Loqka thot qe per ty shkoj deri nferr po loqka nuk shkon pa kerr
Kur tja bon dikujt ni tmir edhe ja permend.. ajo e mire nuk ngjihet.. dashnia pa kusht osht kulmi i vetdijes.
E rendishmja me pas ftyren e bukur se per trup e ndreq me crossfit
Qfardo lloj mendimi une supportoj ndoshta qe me debatu une nuk provoj
Mos mshti mu ngut se vonona
Sa her ti thom dikujt mos ta ndin svanona gjeth mdel ni pun
 T voglit a tmadhit se vrehesh qe bineq ki me bo 
Prit se bohet mir 
 une nuk foli veq shkoj tu u distancu prej njerzve
Ishalla zhytesh kur ki me dal me dikond tjeter
Krejt qe pom thojn une sjom si tjert pom dalin edhe mat zi
Nese sje mberdhi me mu mos mthuj broskii
Qa ki mem jep ti mu afer teje muj veq me ja fut gjum se ti sdin as mu puth lemo mashum
 Po ma fusin bllok se pi hupi flakat 
 Meniher mbas teje une
Ka asi qe sfolin me asnjo 
 8% ju ka mbush per 2 minuta, moter a pom tregon ku e ki ble qet adapter
Un jom prej atynve personave qe kur tmbon alarmi nmengjes qohet e ndal edhe e vazhdon gjumin apet
 shum interesant qysh spo ka kurgjo interesanr
 Nkto dit edhe cigarja mos mu kon kush kallet per neve?
Kom nevoj edhe per ni tatto tjeter 🥺
 krejt kur ndahen hin ntw hahahahahahahaahahha
Per cilin ex po vun o loqk se tu kan bo shum
 Me kond pasna hup koh   gjyna a
Kom ndi qe jom njeri mir po pak injorant me kqyr veten npasqyre nuk e ngjoh garant
 Ma fort gzona me pa 1 cent ntok sa met tpa ty.
Duhet me kesh me fore t lodhta se preken
Mos mle me prek kurgjo se qka preki thej
Mos mi le qipsit me ti mbajt se ti ha
Nese st shkruj s’osht pse mbaj inat po ti e ki bo mut
Nrrug ka mashkuj kurv edhe lloj lloj tipaa veq mos me tpa mir kqyrin met bo tripa
 ja ka nis me "a bohem shok" edhe o kry me "a mundem me mbet shok"
E tash po pret un me kon i njejti kur ti po sillesh sikur tjetra e nuk je mo vetja
Niher ju kapercej qaty nvend jau ndali rriten
Qdo plan m ec mir deri nmomentin qe jau tregoj tjerve
 Jo nuk mka honger ida amo pom doket shum palidhje mu mbledh qeshtu e n10 ora mu mshel gastronomia
E per kto tubime spaska virus a 
Po bre gjeth jom kthy, po mo joo
 the eyes chico they never lie amo ajo i ka syt e k*rves chico
 Ti ki vler qaq sa e vlerson veten
Ndoshta per ty sjom kurkushi veq per veten tem jom KING
Du me gzu nonen ko me mbrri veq haku saj
 Un kur sdi per qka po kesh ti 
Perqafimet nuk shiten po meritohen  
 I kesh m keshi ju afrova te veshi pom doket qe tkom pa tu e rrok boksin te sheshi 
Qe dora vlla mut e ki bo
 Mos t ish kon per qeto lek per jet skisha pas vullnet
Shum shpejt kem me pa te it’s my love 
  hala scorpio ugly smujta me gjet qka o puna juve hahahhaa
 kaniher tmungon dikush me fol me to amo jo gjethkush mundet me mbush qat zbrazti
Jom shembull i keq nuk msoj nuk punoj se pritoj
 Nisja barit t qetson
A din me lexu? hajt lexomi syt
 Haram o me thon fjet
 Burri o si rrypi po se shtrengove mir shkon tjetren bir
 E ti hala vun per njeri tmartum 
 "tdu shum" ka shum vler per mu qata se perdori gati kurr
Crushi jem ma e mir se e jotja
 fminija jote osht si me kon i pit, krejt e mbajn mend perveq teje
Shumicen e kohes e kaloj tu mendu qysh me kalu kohen
Spajtona me kurkond se krejt po prishen rrugve e dhezi veq nese osht i shishem
 King ski qka aty
Shoki jem e ka emrin ATM
 Shum urime per ty 
 shoqni kom po shpesh ndihna i vetmum
 Nuk e ndali deri sa t mnxen pijaaa
Nton ket zemer tmadhe smujte me bo vend nto qka temin je ka don hala.
 Kontrolloj mendimet e mengjes edhe dita jote ko me vazhdu qysh don ti
Pom doket qe tkom pa tu e rrok boksin te sheshi
Mos jep mendime se kurkujt si han k per mendime tuja
 vi prej vendit ku i sigurt so asnjoni
Njerzit jon bo shum t poshter ditve tsodit 
 Kan mi ra pishmon kur t rriten
===