Te kokan tu e ANALizu puthjen.
Me vaksine ta shtijne qipin veq nese je lope, qe me te dal cmimi online.
Kur te nxen shoki pa pregadite! 
Ajo: Zemer qka han ti mas seksit?Une: Ushqimin e burgut. 
Bota po shkaterrohet pershkak ndotjes se ajrit dhe problemeve tjera.Feministet: A mu dok a niva perdhunim diqka?!
   Kena deshtu, ska pas ritual, qeshtu me vullnetarizem po sbojke.
 Qellimi eshte me te shku planet aq mire qe mos me pas nevoje me jetu aq shume.
Nese me pak te dhana nuk je ne gjendje me kuptu qka bon kompania ne raport me vleren e saj, dije qe eshte e dyshimt.
Tash ne kete moment, nji kapitalist eshte tu menu qysh me shfrytezu suksesin e shqiptarve ne Tokyo per me i bo rekl… 
 A ka mundsi me shfrytzu diqysh ne vend te anestezionit me pi komplet trupin?!
Pse nuk e kemi shfrytzu na energjine e promajes per me prodhu rryme?
  Eshte arme psikologjike kunder luftes.
Sa je i ri mendon qe dashnia eshte baze per paqe ne bote. Tu u pjeke gjate jetes, e kupton qe kontribuesi ma i madh… 
Mesharin e Gjon Buzukut e ka shkru Marin Barleti.
Eshte normale me ma bo mu unfollow neper rrjete sociale, per me rujt shendetin mendor, koft deluziv apo bindje, pat… 
 Eshte teper hipotetike, nuk reflekton anen praktike deri ne ate ekstrem.
 Kjo ska kurfar sensi.
  Pershkak se tema ketu ska te boj me njerez qe nuk i besojne shkences, perkundrazi, ka te boj me ras… 
  Sapo dolem prej temes!
 Pak a shume njejt si COVID, pak a shume.
  Per qato jom vaksionu ne mesin e te parve ne Kosove.
 Edhe une besoj qe ska side efekt tjeter, e sa per mbyllje, menzi po pritet me u bo ndeshkim i ri per… 
  Ajo eshte qka po na ushqehet neper media. Pa kurfar sensi. Ose me sens, po pa kurfar randesie.
Ky eshte nji shembull i cili tregon se lansi i barnave e vaksinave nuk eshte proces i leht, me kohe ka mujt me u av… 
ne baze te asaj se sa po i respekton keto rregulla apo ligje.Ata qe nuk dojn me mar vaksinen munden dhe kan te dre… 
Na jemi kon prezent ne nji prej ngjarjeve ku u shperfaq budallakia ma e madhe e jetes tone, se paku deri tash, me m… 
Ata qe nuk vaksinohen nuk paraqesin kurfar problemi per ata qe vaksinohen, paraqesin problem vetem per ata qe shesi… 
Une jom i vaksinum dhe i respektoj ata qe dojn mos me u vaksinu. Nese shkojme me kete logjike, une kom drejt me i s… 
Vaksinimi kunder COVID nuk tregon qe ti je ma i dijshem ose ma i privilegjum si njeri, vetem tregon nje zgjedhje in… 
  Po tingllon interesant, tash lypi nejsen ma shume gjej. Flm njeri.
  Ne jete jemi te lire me bo gjethqka, mirepo nuk do te thot qe gjethqka do te ket sens. Ke… 
 Qysh e ceka, eshte feste e pushtuesve tane. E nese e mbron, dmth qe asimilimi ka funksionu.
Festat e pushtuesve te popullit tem, jon ditet kur une ndihem krenar qe jom shqiptar, po edhe ne te njejten kohe nd… 
  Oh qysh jeni ka ngulni hahahah!
 Eshte interesant, nji vajze qe me ka kundershtu shume per shkrimin, ne nji prej tweets te saj e kish p… 
  Awww me ka dal zoni qe jom Alfa. Tash ko me sos tu qi.
 Pills jane zgjidhje e perkoheshme me shume pasoja. RedPill eshte kure per kancer.
 Eksperienca e profesorve tu nuk nderlidhet kurgjo me temen ne fjale. E vetmja qe nderlidhet eshte tema vet… 
 Edhe po te paralajmroj, ne rast se tenton me qele kete teme me naj staff akademik, ki me i pa reagimet, bi… 
 Kjo eshte teme qe univerzitetet me cdo kusht mundohen me evitu pershkak te implikimeve, sidomos me levizje… 
 Je munu mu mbrojte me sulm, e paske bo berllog si krejt opozita.
 Jo, as nuk egziston si plan.
 Nuk eshte fenomen qe leht observohet.
Ish djal i mire, amo marihuanes po i thojke droge.
 Nese ki nevoje mi thon mshele gojen, njoni prej juve ne ate lidhje eshte asshole, ska te boj me temen ne fjale.
  Spo thom nejsen se muj me ta shatter your cute lovely world qe e ki ne mendje.
  Falemnderit, do te zgjedhi nje jete te re, sepse ne kete jame turperuar aq shume qe nuk ka kthim mbrapa.
 Jo sbon, se femra jote derdhet mandej per nji mashkull real.
 Arsyja pse jom tu repliku me ty, eshte me ta reverse engineer qasjen tonde. Thjesht fun per mu eshte… 
 Hajde ta shohim repliken tonde tjeter me nji etikete te re …
 Qysh edhe e pata dyshimin prej fillimit, mendja jote eshte e mbushun me etiketa, jo me naj perceptim… 
 Po edhe me kuptu, eshte teme qe nuk te konvenon, se ne baze te replikave mujta me kriju nji profil to… 
 Sa per info, jom kon fmia i pare mas shume kohe, edhe kom pas mas shumti vemendje. Menyren e bisedes… 
Nji loje interesante prej fminise. Nese e sheh driten e vetimes, ja nis numron, 1, 2, 3 … me idene qe numrimi jane… 
 Mizogjini, “neglizhence emocionale”, dajak … qka ki tjeter ne menu, se nuk jon ka ma zgjojne apetitin… 
 Ska pas nevoje mem rreh baba, me ka rreh society me ka dermu e crash pertoke me lies, qe prodhojne nj… 
 Mizogjini guardian. Me fal, kur del 2.1 se me padurim po du me dit qka ka te reja ne to?
 Nuk me pelqen Shapiro, e preferoj ma shume Jordan Peterson, mirepo, eshte nji grup tjeter i njerzve qe… 
 Cila pjese e fjalise po thot qe kom kunder?
 Veq nese shtrihna ne spital e ti je moter medicinale aty.
 Ose kosi, po ajo ma shume te freskon perkohesisht se sa qe te nimon, qeshtu edhe ne jete, mundesh me gjet… 
 E mson kadal dale qe ska shume dallim, veq jemi ma te maskum. Po njerzit e msojn tu u djeg, ose djegen pe… 
 Per ate arsyje e kom ceke effortless. Inner child eshte i inkorporum ne karakter tone, e dominant nu… 
 Gjithashtu, po edhe anasjelltas, une e kom rrit vet.
 Gjuhe e rrezikshme, amo ja vlen.
 Gjuhe e rrezikshme, amo ja vlen.
O babiiiii hajde te piaaaaa. - Opozita.
 Frustrimi seksual manifestohet ne forma shume te egra.
Me duhet mu kon shume strikt me kandidatet, pershkak se ai qe e fiton punen eshte edhe ambasador i vendit, e duhet… 
Diploma nuk tregon qe ti i ke perfundu studimet, i ke perfundu provimet. Studimet nuk perfundojne.
 Krejt jena kurva kapak
Kete lloj te vaksinave e kemi mar qysh prej fminise.mRNA vaksinat si Pfizer, eshte kod gjenetik qe i jep instruks… 
mRNA teknologjia, edhe pse e re e pa verifikume sa duhet, jashta COVID ka mu kon zanafille per sherimin e semundjev… 
 Nashta ka menu sje serioz per lidhje me to, ka harru qe per mace o fjala, e ti ke kqyr veq me qi.
Nese je i perjetshem nuk je i gjalle.
Kom bo pare prej tutes mos po me jep banka kredi.
 Kapitalizmi luftohet veq me kapitalizem, e gjat kohes qe je tu e luftu, e kupton qe ajo lufte ska sens fh… 
Qka je ti?Vampir.Qka jon kta dhom kshtu?Dhomt e vampirave.Po ti dhompir te koke.
Kristofer Kolombo tu u kthy prej Amerikes: Mire qe e zbulum edhe Evropen se patem me dek ne uje.
 Se pe di qe je ka mundohesh me deviju temen me qu ne drejtim ka po te konvenon, amo edhe ne at drejtim,… 
 Une jom indiferent edhe ndaj parades, mem pengu nuk me pengon, homofob sjom. E nese e don opinionin tem… 
 Kurti jo, na veq po bojm hajgare me meme te quajtun PSD.
 Jemi astronomikisht ma te fuqishem e ma te arsyjshem se sa PSD me mujt me na pengu.Ne kete rast parade… 
PSD del per her te pare ne parade pa baben.
 Per hir te korrektesise, e verteta eshte ma e fuqishme se botht e tyne.
Me qit foto zhvesh ne Instagram edhe me thon jom blogere, eshte njejt si une mi hyp magarit e me thon jom kalores.
 Ne fakt jom ekspert ne ketfar drejtimi, se jom arch enemy i tyne.
 Skom cheat. Mudnesh pa problem, veq kryp duhesh me mar kohe pas kohe.
Qetniku serb eshte armik, kurse komandanto-ratni-profiteri eshte kancer, per ate arsyje ma leht gjen sherim per qet… 
E per kete arsyje une mentalitetin e komandanto-ratni-profiterit smuj e dalloj ne logjiken tem prej qetnikve serb,… 
Pra, mentaliteti komandanto-ratni-profiter eshte kunder jetes, sepse eshte kunder te ardhmes. Ne praktike eshte ne… 
Ndodhemi ne nji tranzicion te eger nga mentaliteti komandanto-ratni-profiter, ne mentalitetin i cili na lejon me ku… 
 Ko menu qe o pak ma e komplikume vodka.
 Qysh me jau shpjegu njerzve qe me lage asfaltin edhe betonin me uje kur temperatura eshte mbi 25, e ben veq ma keq.
A e dini qysh u shkep COVID-19 ne Kosove?Nji tip tu kqyr porno ktu, i ka dal reklame "Kliko ketu per femra hot ne… 
Ne Rusi, nese lyp vodke pa alkohol, te qesin Qaj Rusi. Qe i bjen, leng me lotet e nji rusi.
Mos tja u nin se ne kete jete ska gjynahe. Ka pas ne at tjetren ma heret, para se me na pru ktu ne ferr.
Paracetamolli a ja zbret temperaturen veres?
   Trileqja ka qene gjithmone e gerditshme, mirepo ka lezet.
Talpiot programi eshte arsyja pse Izraeli eshte nji prej shteteve ma te organizume ne bote. Shkurt e thjesht, ident… 
Veq deshta me ju tregu qe mas lufte kete muzike te na e kan lshu neper restorane. Me kujtohen bisedat serioze me ba… 
Nuk jom njeri i keq, jo pershkak qe jom i mire, po definicionin e te keqes e kom te zbehte.
Prindi qe te ka lind, duhet me ceke edhe linjen, a per bothe a qysh?
 Polict jon ndrru shume, cdo dit po vazhdojne mu ndrru edhe bashk me gjyqtare. Sjellja e veteranve eshte e… 
    Nuk bon mu ngut, po edhe nese ngutesh, ngutu kadale, e kadal kadale mandej ngutesh.
    Kadal, mos u ngut, prit le te zbutet pak. Durimi eshte virtyt i n… 
   Fakti qe kemi lindur, dikush eshte ngute!
   Nuk bon mu ngut, po edhe nese ngutesh, ngutu kadale, e kadal kadale mandej ngutesh.
  Ma mire o mu vonu 10 min, bile une preferoj edhe ma shume, punen e sotit mos e le per neser, shtyje per masneser.
Takimi me arkitektin - llogaritet si nji prej skenave ma komplekse ne aspekt fillozofik ne histori te kinematografi… 
 Nuk besoj, ma shume kisha thon prej Lindjes Mesme ose Afrikes.
  Ose sabotimi i municionit qysh bohet tash ne kohe moderne, ne 100 pluma qe ja shet nji org… 
  Sakt, edhe ne aspektin moral, mire eshte me i mar paret e flliqta e mi persor per me vazhdu me bo sene te mira.
   Une perveti i kom mar 4 denime, si shenje proteste se kom refuzu me mbajt maske per rek… 
   Pershkak se gjendja ne te cilen jemi kon eshte pandemi, e pandemine e shkakton virusi,… 
  Kjo ka sens edhe ma shume, bile gjobat jon dhon qytetarve rruges se ju ka ardh ma leht, e kan di… 
 E vertet. Nuk i kisha fal denimet, mirepo edhe duhet mu bo fer me pranu qe shumica prej masava kan lyp r… 
 E vertete, edhe pse ne jete e preferoj shume pjesen e nentokes, me doket bote ma reale.
 Mi bo skip te te njofshmit.
Sot kom fol ne telefon me njerzit e nji partie politike ne Kenya, per mi target njerzit politikisht atje para zgjed… 
A po shkon ne UNUM?smUNUM.
Me thiken e njejte qe e ka pre mishin bashk me vendin e njejte, e pregaditi sallaten me perime qe nuk kan mu pjeke!… 
 Bash, tan kohen ne mendje e pasna pas qeto!
Nese te ka “tradhtu” femna ne lidhje, eshte gabimi jot si mashkull, per dy arsyje, e para qe aktin e ke definu si t… 
Nese e mer nji kime floku edhe e pren, ne siperfaqen e prere te saj mundesh per momentin mi vendos rreth 300 Mije t… 
 Nji kohe te gjate ki mem pa veq ne dy rrota edhe ne kater mu. Mos me gut, kadal kadale.
      Falemnderit i nderuar, ti je Nikola Tesla i Twitter.
DJI eshte prodhuesi ma i madhi ne bote i dronave sportiv. Nji prej kontrollerve te fundit qe e ka bo eshte DJI Moti… 
Tekste shkollore te formulune prej balave! Na ka myt balizmi 20 vite bre rrobt. 
===