 Tash 'kritikojne' pa argumente, vec me inate e xhelozi te pakontrollume. Ta merr mendja sikur t'ishin te afte sic pretendojn…
 Nuk ke nevoje me kerku falje. Vec duke diskutu e bashkepunu mundemi me ba dicka kualitative. Tamam puna… 
 Faton flm per komentin. FYI, takimet ne kete faze jam duke i mbajt ne lidhje me mbledhjen e dokumentaci… 
2/2 te cilet palodhshem vazhdojne te punojne per kete vend, te prire vec nga ideali per dite me te mira.… 
Takimet e para qe po mbaj pas marrjes se detyres sime si keshilltare e KM Kurti jane me persona qe kane bere shume… 
  Ndersa ne qytetaret e Republikes se Kosoves falemderojme te gjithe juve qe na keni kthyer cdo shprese te h…
Pos nje koment per kete koncertin e Armendit e kam: TEPER I SHKURTE! 
  Falemnderit Kushtrim. Me e kqyr holle e holle krejt kjo eshte per shkak se ti si asistent ne F… 
    Hajde tash bashke me  per dore e apet me bo at' ekipin e Kurti 1 ❤
   Hahahahahhaa zemra jeme ♥️
Une e vendosa masken.E mora kafen. E votova. Kjo bore simbolizon fillim te mbare, andaj mos e leni me ju ndal’.… 
Demonizimi i studiuesve qe kthehen nga jashte ka fillu me heret e kohe pas kohe rishfaqet zeshem. Me teper se ckado… 
 Yeah ke te drejte ti. Patriarkalizem/Demokraci - pak (per te mos thane hiq) dallim per Dullen! S’di… 
   As une s’kam facebook por linku po me ben. Kliko ketu: 
 Bravo bre! Sinqerisht bravo. Me te rinjte si ti ky vend ka shprese.
 Nese voton fizikisht s’ka nevoje me pas emrin ne listat e mergates. 
  SOLVED: fletevotimi nuk shpallet i pavlefshem nese votohet kandidati qe nuk eshte ne liste. Th… 
      you and me both. se reforma do shume pune, e besa edhe kohe.
     Gani, shih njoftimin e Germinit te lutem.… 
  do te jete kryeminister per te gjithe qytetaret e  Kosoves prandaj edhe do t'i takoje ata ne secilin cep te Ko…
  Te falemnderit qe e ke pranu ftesen Jeta. Ashtu sic edhe te kam thene, mendoj qe kemi nev… 
 Aaaaa hahaha sa e mire qekjo ♥️
 Edhe ti lexo drejt e mos keqinterpreto. Askund s’thashe najsen me te cilen ti s’qenke duke u pajtu. Kr… 
 Po thu s’ka Kurti II a? Eu eu 🤦‍♀️
 Dy opsione: kerkoje emrin ne listen e votuesve nga diaspora, ndodh qe ka dale. Nese jo - kontakto direkt ne telefon KQZ.
Oooo bre hiq s’ka lidhje çfare pengesa vazhdoni me na i vendos ne rruge - KREJT kemi me i kalu. Me buzeqeshje e zem… 
 Opsione ke sa te duash 
 Sepse kam procese te tjera qe me duhet me i cu perpara, e smundem nga pozita e deputetes. Te falendero… 
 Mos i merr kaq bukfalisht sendet bre. 1. Ka 110 kandidat’ i ke pas gjithe, po asnjihere cilesine qe e ke t… 
Kurre ma shume opsione s’kemi pase. Duhet me dale me votu - qe mandej mos me u anku!  ♥️ 
  Nese nuk ju marrin ne telefon nuk mund t’ju mohohet e drejta per vote. Keni parasysh qe sip… 
Edhe une jam duke pranu shqetesime te njejta. Cka po ndodh KQZ? 
  More ti e din ma mire, ama me rendesi PLOT accounts ne dite 
  Absolutely, une jam shume PER debat publik dhe kritika konstruktive. Edhe prej gjanave me te… 
 Ashtu ja kam ba deri tash, por jo me. Nuk eshte poenta mos me e pa UNE cka shkrujne ata. Ideja eshte mos… 
   Hyna vec me e gjet kete pytje se si ne mjegull mu kujtu qe e ke ba dikund. Edio… 
 Jo, vetem personat e familjes se ngushte me mbiemer te njejte.Edhe nje cift me dy mbiemra te ndrysh… 
 Po, per anetaret e te njejtes familje lejohet dergimi i zarfeve bashke ne nje pako. Pa problem.
Attention diaspora!!! Meposhte i keni formularet per regjistrim.Formulari 1 (e plotesojne ata qe KANE shtetesi t… 
 Falemnderit shume. Po shoh nese i gjej online. Nese jo - te shkruaj.
 Minister, a mundemi me i gjet’ diku keto propozime ne te shkruar? Po me intereson me e dite si jane i… 
  Jo jo vetem ata qe votojne me poste.
Edhe mos me pas HIQ dallim ne zona kohore, sa prej jush mundeni me u pergjigj’ ne telefon kurdo 24/7? Edhe vec vike… 
 E jemja m’i hjek. Poget prej gajles qe po mes pa u martu e rahatu! 🤷‍♀️
 Ne raste te tilla ben nje certifikate e lindjes, ose ekstrakt, ose edhe ndonje dokument tjeter i i… 
  Absolutely. Ideja eshte qe MUNDEN me votu. S’ka lidhje a ka skadu dokumenti!
ATTENTION DIASPORA. Per krejt juve qe po pytni a mund te votoni nese ju ka skadu ID dhe pasaporta. PO!!! Mund… 
  Ili ili kon te rroki a?  Edhepse po dihet per cka e ki!
Ai: A jeni bo gati per FUSHAT?Une: Cilat FUSHA?Ai: Une:Ai:Une:Ai: Fushat de fushat te zgjedhjeve.Une: Aaaaa… 
 Mu s’po me befason ky. Po me befasojne disa tanet qe pajtohen me te. 
 Shume shpresova qe je tuj ba hajgare! 
 A je tuj ba hajgare a je ka parafrazon ndonje interviste pernime? 
 Plus ASNJERI prej krejt ketyre nuk eshte i thirrur profesionalisht me fol per Specialen! Hiq! 🤦‍♀️
 Me shume qejf e dashni ♥️
 Patjeter qe ju tregoj, vetem po me intereson nje here me e pa sa eshte i njohur si koncept, se e kam me rendesi.
 Jo. E kam per tjetercka momentalisht. Me vone nuk i dihet 
 Hmm ka dicka te sakte ketu, por jo teresisht. Sdq flm per pergjigjen.
===