 Te lumte Uta. Krenari e Kombit 
 Dujet me ja gjet naj Berber kti! Shqiptar mundesisht, e kish rahatu me 1-sh:)
 Kjo si ajo thanja popullore: Me la m** me s*****
Gjate zjedhjeve: Sovrani, sovrani. Pas-zgjedhjeve: Opozite konstruktive, opozite konstruktive..! Zhglë, zhglë!!!
   Edhe me dasht kaq bukur sen e kisha bo:)
 + Lika qe Kosova duhet ta hape Ambasaden ne Jerusalem 
 ju kisha ftu me i ec malet e Lugines. Kufiri i trojeve  shqiptare.    
 Bon edhe ka rruga Bedri Shala me u dok.
Ne cdo vend te botes lejeqendrimi ti jep te gjitha te drejtat pervec votimit.   Ne Kosove  vetem per statistike eshte lejeqendrimi!
Si qytetar i Lugines me banim te perhershem ne Kosove, sosht pune njeher me u ndi i barabarte ne kete vend.  11 vit… 
 Mendoj se kemi probleme shume me bazike ne gjuhe sot qe duhen me u permiresu. Psh. 90% e Shqiptareve t… 
Nese dikush ka info ju lutemi na njohtoni.  
 Nje deputete e PDK-se, lideri i se ciles, Hashim Thaci kishte premtuar liberalizim prej vitit 2010, sapo e pyeti Albin K…
 + mbindertimet  e pasluftes.
 . Pezullojeni taksen e Rruges se Kombit te pakten ne kete kohe tragjedie. Nuk ka logjike te taksohen ndihmat humanit…
 Edhe ne Prishtine ka qene mjaft i forte. Nje pjese e banoreve jasht kan dale.
 Ka me dul ky tweet bash ne dreke!
 Spo di as cka me bo ma shume. Po kqyri rrugeve kah po sillna. Shpresoj qe gjindet shpejt kjo nene Ta ndihmojme familjen.…
   Kur pritet fillimi i punes?
Per nje gje jam i sigurte. Ky person se shpejti me sulm ne zemer do jete!    
 Kjo foto eshte nje ilustrim i mire i gjithe asaj qe perfaqesojne qeverite e 20 viteve te fundit: oligarku, pa fije turpi, dikt…
 Hahahhaha. E fort kjo!
 Vijne po si breshka :)
Prishtina jone e bukur!  
   doli qe e vertete kjo!
  Mir do ishte "ra Shaqiri iku Mourinjo"
 Ta bejme njejer 28 Nentorin e pastaj tjerat!
  Najss.. e kom favourite ket mix!
 Sbesoj qe ka lidhje me person nga Presheva!
 Si person nga Presheva, jam shume kunder ketij plani. Nuk ka asnje gje qe tingellon mire!
  Me jua pasteu sheshin!
 Z. Kryetar, a keni dal ma frik ne shesh! Ngjason si ne Lunapark!! 
   Jaaa be.. render eshte:P
   Jo un e di qe vet e kam nderru edhw menjwher ma boni pagesen.provo krijo new profile
   Edhe bash sakt kete problem e kam pas!
 E lexova sot lajmin. Spo dallon shum prej kti tonit :)
  Verehet ne raport me shpejtesine po jo me stabilitet edhe support.
  Mos ju beso shum numrave!
 Skish naj ndryshim te madh
 Hahaha. ma mer mendja
 Hahahhaha.  ka e gjete bre. Hahah
 tash e jom tu e pa reprizen. Mjerim! ma mjerim do ishte me mar postin e kryetarit!!
 Nese provon me i nxjer te bje me humb shum.  i tatimojn edhe diku 20-25% shkojn taxa!
 Hahhaha.  i madh je :)
 Z.  Kryetar, a ka komuna ndonje plan investimi per  L. Muhaxhireve. Infrastruktura me e dobet ne qytet sidomos rruget!?
 Ne ver te fundit jam.  e ka edhe html5 mirepo i mungojne features
===