Gjithqka ka ma lezet kur e bon msheft
Nese del nshesh edhe i thu dikuj - Oj Lop, krejt e kthejn kryt
Po kthehna kajher ntw mju kallxu qe jam BABA
Thojn pe dojme ndryshimin a nfakt rrijn ton diten nshpi edhe menojne qysh me ba pare. Nese paret vijn tu e pordh k… 
Pse njeri qohet me sabah edhe kqyr mja keqinterpretu deklaratat shefqet krasniqit
Qka ka shteti, kallxon mileti osht ni fjal. 
un jam mir kur heket pandemia...- Isa Boletini
Ardian Kastrati osht njeri me deklaratat maaa tbudallme najher.Osht profesor,cv-n e tij munesh me gjet npc,ntelefo… 
E prit e prit e pritPrita per me na kallzu qe neser votohet Vjollca
Imagjinoni nje situate te tille ne Koren Veriore - femnat nuk guxojne me vozit biciklet veq pse shala e bicikletes… 
Pom mungon ajo koha e applikacioneve kur ke hi si boss pa te dale asnje reklam
Shkurtesa ntv e Kosoves si-  KOSna identifikon shum neve si shtet 
 Anija ne Suez dul, e s'po ia del ti 🤍.
Mdhimet laptopi jem se kurr slyp sen, as me pi as me honger.Sot u kallxova shum i mir ja qita ni kafe, qaq i kish… 
Hajde rini tju kapum per politika tbrendshme zhvillimore, premtimet qe i ka ba. Leni kto mos bëni filma 
Pe citoj edhe presidentin Rugova: Pavarsia osht kompromis. Veq qe e kane nenshkru Thaqi e Rugova ket marreveshje sd… 
U ringjallën shpresat diploma ime e dashur
Qishtu tu u gut kta i shkrujn gabim4 jane ndrru prej 2015 
Klluq kan me qel qeta deputet dej nvitin 2025
Jemi msu me pa Hashimin nskene politike, dicka spomm sssss Po kom qef me ni tu akuzu najsen me fjalor t veçante komik
   Hajt po hi po ta boj ni view 
Ma  nfund nje qeveri stabile po formohet  
Porno diten - porno natenPorno diten - porno natenPorno porno porno porno 
Ajo cka pritet me ndodh prej opozites osht kjo:Nese Kosova antarsohet nBE, Okb, Nato etj etj, kta tipat kan me tha… 
Zor o me pshtu nkit jet pa u korit
A t kandidoj per kryetar tprishtines bre
Me kap revolen me dore edhe me shenjestru dikon nuk osht dicka aksidentale bre.Mos bre se kaq tpadijshum sjem sa mi… 
Akame Ga Kill ❤ 
 op, edhe ntwitter jon msu me hi
A pe vreni qe jon qu peshe polict, nuk o rasti par qiky per mask t qenit.Marrezia e tyre osht e kahmotshme.
 Jo bro sjom militant, jom analizues. Edhe nese isha kan, ma mire militant sesa oportunist. 
po ma nin mrena dyqysh qe Meliza osht e pafajshme. Nket rast osht viktim e partis t vet.dmth pe dini kush o fajtor
Moj ministre e diaspores...
I keqqq osht 🤣🤣 
Fort zor osht mja mush synin ni profit tem, mja mush synin qe pernime din, ki bagazh, ki njohuri.
 Po bre, qe boni naj antarsim du me kunkurru edhe une.
shko ndrro mbiemrin, mandej bohesh deputet.
Qishtu sshkon veq hajt dej ntaksirat 
Viti 2021 edhe  hala ka manipulime me vota, ku tjeter pos n'Kosovë.
 shuejj se pot nin maj militant
 Teper e leht o ajo per neve
Mas 5 vitesh kur tbohna far ministri, kane mem akuzu per qito tw
Ldk osht fort parti liberale edhe demokratike.Lejohet fjala e lire, mendimi ndryshe, nuk rroken mrena partis per p… 
Shum quazi - njerz pom bjen me pa kohve tfundit
 Emertimi ma i sakte 'katastrofë'
Qysh pe bojn femnat hunen mikroskopike nfoto.Me ta thy tu kesh
 Qysh dush kur dush T nxo
Nese doni me kuptu duhet me Rilexu
Po shtyhum cili qet tweeta ma shum 
Kam ardhur ne nje moment kur - nuk e di se cka dua, nuk e di si ndjehemAhhahahahahahahahhahahahahahaha
Pdk u duft me perdor argumentin qe komuniteti serb nkuvend ua ka blloku politikat e tyne.Ndaqin me mbijetu politikisht edhe 1 mandat. 
ajde po bojm bashkim kombtar, amo i kem do "probleme tvogla" qe duhet mi rregullu.
Sdi a pe vreni qe ofendimet jan ba dicka shume normale Nkosovë. Nese din mi sjell mire 2-3 rreshta ofendues per dikon dmth ti je baba.
A ka kuptim e pakuptimta?Dje ke than publikisht qe duhet mi respektu masat anticovid e neser nmengjes ke dal me ba fushat  
I zakonshmi un me tema joaktuale
Rugovizem dmth jo nenshtrim apo josubordinim. Pjesen ku Diplomati Rugova e kundershton Ameriken 2 here, qito sene j… 
Nji diktator sa ma shum  me nejt npushtet bohet si kameleon, qe tdoket ty qe pernime o tu bo mir
Ku jeni mer juuu
 tha nji student i AAB-s 
Studentav t UP ju kallet bicepsi tu shkru nprovim 🤣
 Zoti djemve t kqi jau rrit cicat
Analistit mi thon dash osht ofendim 
Fjalen dash une e perdori te dostat psh sinonim i trullanit ose atij qe ju kerrleshaven flokt
Du me shti vllaun me apliku nits my love, let bon fam edhe nashti ja shoh hajrin najsen
 tha njana me ni foto tprofilit katastrof
Jo se jem nxon tu u merr me emisione t shqipnis 🤮 
Pse more mos meu qu nprotesta na rinija per qet punen e policit??
What’s happening? Far fmijaqi qaj polici qr, krejt po dihet qe nkohe t panit e ka siguru at ven tpunes.
  E ke pa edhe ti, krejt kapak e kem kqyr
Teze skem qysh me perparu , kur veq pak mja nis me kajt beba shkoni i bani rituale tkripes aty. 🧂
Decision making process in Eu osht ni procedur koqeluajtje. Qysh i teratum fmit her anej her knej , njejt.
 Parameno met bo sehire mos me tu qu
Jepe mor naj goll o gjytyrym 
 shoku i mir ndit t vshtir
   thuni qa doni, fansat e napolit edhe arsenalit si marr seriozisht fort 
Veq sigurohna 100% qe asnjoni prej shoqnis ska msu edhe ja fus gjum
 ma qon mallin e Ujkit t’ cerrikut
 Une e kum qu pesh ni klin nifar vakti, ti je piun ok
 Mos mthuj ti mu boss
 Qfar po ndodh me ty shoku im
Kreativitet osht kur e tshko menja me shkru emrin Dogdrim
Quditna me kta qe si dijn 2/3 fjale anglisht
tri nana mani. Kush po bohet njerka jem 
Vesht llapoq edhe met than 2-3 her Aa? Qysh the? Jo spot ni tybe
 Sidomos kur veshen zi
Ma hanger fshisa rrymes masken sot
Ajo hunen e madhe une hunen e madhe, kurr skem mujt mu puth
Ky u lind me shurrë t sabahit, asi e kuqe qe tdel 
Qe qitu me ni gjyzllyk 
 spo vrehesh, shkrujum anej nashti mun mlen pershtypje 
Ma nfund dul dikush me roast  Mr kika 
Maska ngjitet mu ru prej virusi jo prej milicis
You speak rubbish edhe pret prej fmijes tan mu kan i kulturun.kadal kadal mos u ngut
Hajde follow shokut tim 
Hajde hajna buk e kryp e zemer
Tutu prej babeTutu prej naneTutu prej koronedej kur kshtu , kur kur, kjoo noo kjoo o hajgare
Qaj emer nbio tem shqiptohet  donkihote, nrast se ju ka ardh zor
Qetesi nshpi sa miza u nijkeBabi: Aaali paaaaasha pe hap defterin nnn
Ska me mujt me gjet si un etc etc 
  Dmth nty ata mos me llogarit 
I thash qe m pelqen donxhoni sa mja maru qefin 🤦‍♂️
 Tha nje fans i arsenalit
Femnes t krehne rriji ngat
 ka nis pi doken t forta qitash 
Tka rrit nana per met marr un me tupana
Veq mos me ju thon sen se fill pju rritet morri
Far postimi kish qit baba nfb, mka befasu.Challenge accepted naz
Besoni qe semestrin e pare  e pata marr fort seriozisht edhe msojsha si i trent. Semestrin e dyt lujsha koqe.Nbaze… 
Sa fukaraja osht nkosove qe kan qel facebook qe 1 muj, e i hajn kto foret qe i qesin kishe qfar shkronje e ki i mer… 
Ha djath djali jem ha se krejt gjak osht.Gjak i bardh
Lesh perfuni lesh permi qoe kamen me ta shti.Qorapa
Mi thon dikuj nshqipni “ a do dru “ , ta qin token trreh tsos
Menzi spo pres mem than dikush:Faji eshte tek studentet jo tek mesimdhenia!E me te rre dajak
o vlla o maj ligjeratat qysh ka than i lumi zot, ose vetë-shkarkohu. Studentat dojn mu ba tabullarasa me kto papergjegjsi
Une e kom at aftsin qe e nali alarmin, ja krisi edhe10 min gjume edhe mandej mdel vet gjumi.🤥
Jom qu heret sot amo spo di kah me ja majt
 amo nqat moment ske tull kerre
sipas gjyshes teme, djemt qe jan t shtir urtohen veq prej grave
Ku tdush tqoj, veq qitma naftin
Pak po ju del 1 here mjau punu temen profave. Jem tu lu koqe me Word
Politiken mundeni me analizu shume leht, qe ni shembullPalet kontraktuese shteti qe spo du mja permen emrin edhe K… 
Nese dikush thot qe ligjeratat online jan efektive e rrehi hu gardhi
Nihere pat bo pazar baba me ni tugjar, dmth u vendos me ble lopen.O skem dit gjo kur ja ka kap doren mja bo perhaj… 
Pasha tyrbe e xhamiBeja e ni tugjari shqiptar qe kqyr me ta shit lopen ma shtrejt
Bised e zakonshme me mbesen -erz a ki orbita+Jo-Eeee une kamm, a pot vje inati + crying 
Po ma kputni shpirtin me do quotes, ashiqare po dokni qe po vuni
Un lek edhe fam i du bashk pa mu bo mjekrra trash 
Ni profesoreshe nihere mpat thon -Une e kam inqizimin ku ti ke fol keq per mu 
Qysh spritojn njerzt mu marr me ksi fanpages
 kong ma palidhje moo sdi sdi 
Pasha qit dit, pasha qito gaca u djegsha nto 
Mallboro e kuqe osht full  shtaga/ cunga mrena 
 Sja kom nis me punu nministri hala , avash
Kurre njete teme si kom marr 13 retweets
Qa pom kapni more neper tweeta , a jeni normal ju
 Sille ka te sillsh, si nshkoll tmesme ski me thy kerkun.
Qa kan hek vesht e mi tu qu ronQo masken, qo cigaren
kta njerzt bajata mdoket jan nis me shurr tsabahit
 Kom pa njerz 40 vjet me mentalitet si mi pas 14, kom pa 15 vjet t meqem si mi pas 60.Mosha o numer
Gjyshe bima qat mask bre- smajna mac na djali jem qka je tranu
: e pse bre gjuk t hongt dreqi pe pin).Sa her ka pas nevoje dicka mi ndihmu gjithmon paraprakisht mka vet “gjuk a… 
Respektin qe ja km dhon u kan respekt ma i veqant se u kon njoni prej njerzve mat dashtun per mu.Ka ndodh qe rrafs… 
Do sene ndodhin qysh ndodhin edhe smunesh hala me besu qe kane ndodh. Ni kojshi ktu i katunit besa mi thon kojshi s… 
Kush e din qka dmth fjala Koqabash, lypni cka tdoni prej meje.Sosht ashtu qa po menoni ju calma
Sdi a e keni provu at ndjenjen , kur tlexojsh 1-2 or edhe del e dhez ni cigare
Hajt masi krejt , tboj qef edhe un
Veq me dit sa lloma ka n UP na e kishin lujt ko*** dit per dit
Shifti sbon n3 tnates kur qohna me honger buk
Edhe morrat nau paten dashuru 
 Me vozit jo fort , mi grah ma shume
Tamon mheket vesvesja e lejes tkerrit del dikush ma qet nermen 
O Sdu me hek mjekrren vlla du me dek prej leshi qka ki ti kunder
Kulmi osht kur thot: e qysh me dit une qe sum myt aja krejt 
Qajo vaksina qe po thojn sheruse , gjyshen teme mos e llogaritni qe e merr. Pi fryn ❤️
Kunder disave i kisha shti nfuksion ligjet e hamurabit
Pom dhem kokordhoku i synit
 Qa hamami ki bablok
matematika tnjek kudo qe je, tej edhe nshkenca politike so tu mu nda 🤡
 O ta qifsha langarecin e nanes ❤️
Ska ma keq kur insoni rrehet me fjale
Mu tut njeri qfar termesh me perdor nligjerata, filll tshtijn me hulumtu per to
 O veq kthiza mos t hup 
  qa jeni mes veti 
Haqa Paqa osht nji emer i ni krijese mitologiike
  Spot pritet dej t hanen tash a
  Paj paguj bre qija nanen 
Qfar perle ej ky tipi 
 Date diten e hane , mja nis javes me dicka qe ja vlen 
 Teper e fort veq edhe e vertet t ish kon
Sja ka vlejt qe e bana ket tw, dej e gjeta deren 
+a e ki librezen partiake-jo veq kto shkollore, diplom kam burr+... 
Kaqiki jem me nxon ksi femen 
 Edhe nte paqa gabim une ti ngjihum, jena shok a din perkrahum pak
Hajt kallxomna ni gajle t13 vjeqarve
 O garant mas buke
Ajo: mpelqejn senet e gata-une i pasherr 
 Niher qite bone qef, amon mos qit mo
Llapjont defenitivisht e meritojn nji kryetar tmire ❤️
Un qe sjom npune as kurrfare posti nuk kom fort kqyri qa po foli vlla A me kan far zyrtari politik a najsen edhe m… 
Babat e ktij sporti 
Shum ndihna i nderum kur dikush mthot : Migjen, ja per ty ja per kerkon
 Mos bo pytje palidhje
Po pres t honen mem roast ni prof qe se kom bo punimin me fjalet e hashes:“Pse bash ti migjen prej 40 kolegve tjer… 
Bursa sosht per ty e as ti sje per burse 
Veq pe paramenoj tum bo hor Besnik Berisha ndebat lidhur me çështje juridike najsen 
Ndaq histori, ndaq akte ligjore Fort t gjithanshem jemi
Tamon ja nisi mem pelqy twitteri
+Cka ki , po çan a ?-jojo vetem me hyri pak fake ne sy  🤮
 Edhe ti nese e kishe pas emrin BIRAT ish duft met thirr shkurt Bir heheheheh ❤️
Duhet me bo twitteri kit opsionin qe nuk mundesh me komentu pa e bo llajk
 Nuk e ki karakterin si ai HAHAHAHAHHAHAHAHAHAHAHHAHAHAHAHAMarre per ty e per mu bab 
 E t hongt dreqi me mut
qysh e menoni kur dikush ju thot -shume i kollomojt je-i kojshum koke bre djale
Veq  munet me kan deshtimar se kush o baba per leksikologji,letersi se pom bje me livdu veten shum ehehe
Pom doket vetja ekspert i gjuhes shqipe masi ja kreva mbeses do detyra tklases 6
  HHhahahahahahahahah auuu tu vujt jom qe skom ardh
  Sa foton e kom kurr ni rt sma ke bo
Njeri g per ni njeri g ❤️ 
 Nqat kohe tshkrujta edhe une mdoket, mos po keqkuptohum 
Temen e mire per hulumtim  po gjynah kush ka me hulumtu per to
Lind pytja a jom edhe une njoni prej atyne qe si te marr diplomen kom me apliku nambasad per Gjermani?Mjeret na
Marre per nxansin, marre per profin qe spe fshin shpulla  
Nese doni me dit qa o njeri p9 search nyoutube - Coyote Peterson
  Ashiqare pot vje inati
 Ec more mos mlodh
  bir qy qikjo ma han eheheheh 
 kem arsye pse mu bind na ahhahaha
Kqyrni more naj film a naj serial tfort sa harxhoni koh me Perpjthen
Sot e mora vesh qe ka pas femna diktatore 
  Dhive nto bir , Ksaj i pata thon i prishtines jom 
 O mkruhet trupi mos me permenn
Po bojn drifta njerzt nklin
  Po e fort koka 🤥
Parameno me t hi centipede nvesh
Qohet njeri me sabah sdin kah me ja majt qa me ba? Hajt tshkoj ta kalli banerin “ Liria ka emër” 
 Sjom tip qe boj garrgarr
 demokracia ta lejon me bo qit post , kshtu qe trus mos gjoj fjale 
  Po ashiqare qat synim e kaaa
  Hahahahhahahahahahhahah a pe bojm lidere t organizates
 E mora nqaf veten me kit tw 
Fisnike me mu ki me pas shpesh broke date kshu qe boji llogarit 
  Mi dhon publicitet a ?
Nice osht me ni njeri qe se ke pa kurr live veq e ke njoft prej social networks  edhe e ki ni komunikim teper tmire… 
 Tybe smu rrike tani thash haaaajtt
Ky tw meriton ma shum llajka ahhahahahahahaha 
 Se mshkrun gjith nprivat , bomi bomi
qysh ja shtojn do njerz do shkronja ekstra fjalve.Nuk guxon me kalunenkum shkunen nshkoll Jam kanen nklin
Kha nkatun i kem ekstrem do fore a metafora tlodhta Psh. E ves nji burr perafersisht 50-60 vjeq qysh je a je mire,… 
Ska lidhje qe je bo kryetar partie, ti je profesor maj ligjeratat i nderum 
E nese ooo bichhhh bonu pi najn
Gjith jadeci mbjen, kurr kaqik skom honger 
Njerzt ma dallavergji jon kto dyja 
Jo rren e as mesele veq me sinqeritet ju thom qe ma shum msoj prej ni kolegu se sa prej ni profi
kur mthot dikush qe shoqnia nfakultet krejt jan interesgji, fort mvjen nifar lezeti me te fshi shpulla.Po si dihet… 
  Po bre ama pom vjen keq mi thon 
  Qato qe ma ke kallxu mu ja ke kallxu edhe ksaj a , btw as un hala se kom pa 
Baben tem veq duhesh me ngu se stlen me fol.Tamon tja nissh me fol dicka ta kput 
Shprehja e nji demeli:O une e kom problem dej tja nisi punes , se mja nis ska kush qe mnal
Pse mdoket qe ky Besnik Berisha menon qe veq ky ka kry shkolle.-Pot kallxoj une se e kom bo do shkolle-une kom kr… 
Ka varfëri tskajshme te na, qata ish kon mir mos mi gjyku cka punojne.Nese i njerset balli tu e bo qat pune, hallall e ka ❤️
Mu kujtu albini kur thojke “ vec dy parti jane ne Kosove VV-PDKKto tjerat veq sillen 🥴 
 Ahahahahahahhahaha qishtu e kom nja nfakultet Cdo tdyten fjale e permen “ pirjen e duhanit “ 🤦‍♂️
Dallavergjia ma i madh n’amerike 
 Flm shum per supportin, pa followersat e mi sidomos pa ty nuk do t isha ktu ku jam
===