 Dmha, zgjedhjet me 31 janar a? ‍♀️ 
 Virusit nuk i besojme, ama me kalu perfuni banderit nuk bon  
     Perqindje e perfaqesimit te interesave personale… 
 A e pa dokumentarin 🤗
 Doni mu tranu, ndersa harroni qe kete karantine grate shqiptare e kane perjetu me shekuj. Rutina pastro, gatuj, ha, flej, ka q…
 Heke taksen, ktheje Agimin, kerko falje, pa lakën, edhe ni ajron.
Bac, cika jone Rita e kalli Prishtinen &lt;3 
Urime Kosove 10 vjetori i pavarsise!10 vjetori i vazhdimesise se nepotizmit, korrupsionit e plotesimit te interesa… 
 Kerri i pare ne hapsire nga Elon Musk 
 Edhe une e du, qita po ankona se kam qef mi pa ma mire :p
 Op shume vend i mire osht mi vizitu kshtu :p ketu fillon edhe mbaron e mira rn 
 Pom vjen shume keq qe e ke pas kete eksperience, ama nuk pom doket dicka e papritshme ne vendin tone.… 
 Dje nuk ishin kon dicka ne disponim.Te njajtin problem e pat shoqja per ne Austri. Ka pagu hotel e b… 
 Elon Musk e qon veturen e vet ne hapsire, na n’Kosove hala lypim viza
 Rebelizmi jot karshi nji kritike le shume per te deshiruar. Sido me qene puna, pa e paragjyku situaten, tweeti jot nuk osht OK.
 Kollokfium, kollokvium, kollokium, kollekfium, kollekvium, ismet, etj
 A pe dilni me maska :p
 O ka folet Gjakova kryeqytet :p hajde kthehu se o ka bohet mire knej 
 U nxiva tu kesh morre 
 Postim i *nobelueshem*. E nominoj per cmimin Nobel per Postime.( 
 "A e pa qika mervetit u rahatu, u martu me ate djalin e skenderit. I ka bo 2 fmi si drrita. E qysh… 
 Hahahaha thash mos ta hacken twitterin 
 Hmm.. A e ki seriozisht a?
 Klasike: Ramushi premtoi liberalizim ne 90 ditet e para te qeverise se tij, tash vet detyrohet me apliku per pasaporte te Shqi…
 A provove me thirr sherbimin per klient?
  Mendova mos eshte adoptu. Hmm, po kqyri.
Paska shprese per Kosoven.Flm Bill  
 Ani diqysh smu dok njiher fort cudi, i besova :p
 Ku me pas pervoj pune ku ju vet nuk m'pranoni n'pune qe un me pas pervoj t'punes?
  hahaha ma qon kur t'disturbi kur t'je tu lexu 
 Yaaaas!Ma mire se n'Finland, apo bre? 
 Disa korporata qe na lodhen me urime sponsored per Vitin e Ri e reklama neper tv, ma mire le ti respektojne pak me shume p…
 Aww!Familje, pite, barazi, feste :p Nuk ka ku shkon ma mire &lt;3
 Qika : Mami, nuk po me merr gjumi. Mami : Mbylli syte edhe numero zv.ministra. 
Alternativa me 4 perfaqesuse gra dhe 2 burra ne kuvendin e komunes Gjakove :D
U qova sot ne mengjes 30 her tu bo alarmi derisa u qova. Kur po kqyri ne dritare ja 30 fmi para deres tu lujt.... 
Mos u anko!Dil voto! 
Faturen e deshtimit te nje qeverie, per fat te keq, duhet ta paguaje populli. Prandaj jini syçele me 19 nentor.... 
Marre me i pa tu ndodh keto gjana, e le ma me qene pjese e tyne.Nuk ka kthim, nuk ka alternative tjeter, Mimoza... 
Dil e voto. Percakto vet fatin tond per 4 vitet e ardhshme!
Me kete post po e perfundoj fushaten time, per te filluar heshtjen zgjedhore, duke e pritur te diellen diten... 
Pa autobusa, pa manipulime, pa dhune. Kjo eshte Mimoza !! 
Gra dhe vajza, per nder te muajit nderkombetar te luftes kunder kancerit te gjirit, QDT (Qendra Diagnostike... 
Bravo Buna!E re me shume potencial :) 
Te vertetat "puro" te pretendentit per kryetar.. 
Dicka per barazine gjinore? Jo vetem fjale! 
Gjakova e ka kryetaren.Gjakova ka nevoje per te.Kemi nevoje per nji person te pakorruptuar qe me te vertet... 
Pranvera Hyseni qendroi per gati kater muaj ne SHBA, ne vizite shkencore per lemine e astronomise, ku nder te... 
===