Kaloj Kariimi ne tjeter dimenzion !!
 Benzema osht sulmuesi ma underrated, me gjase osht ma i miri ever  
  Zakonisht ata qe sdin per futboll thojn so gjo puna e tina.  Besom qeto qe e the sot ja thash vllaut
 hahahahahhhaha e rond kjo vlla
Veper arti prej Karimit, salutee! 
  hahaahahahha sdi qysh tu pasna kujtu vec shume i eger jom kundra ksej levizje qe na cenon burrerine :P
N'kete dynja garib jon ashikat e tu, afer vetit bonju vend
  Hahah pe shkrin organizmi shpejt 'spo na len shej' buka :p
   So qe nuk e predikon edhe ti toni ket far lloje casje, vec qe ti e ki kuptu ma heret :p
  Hahah po me mu je taku ne grand
  Hahahaha emo broo,  ky o ma baby face :p
   sdi gjo une vec Cod  luj, po dmth  lun edhe CoD ti  ?
 A vjen ne shprehje CoD mobile si zavendsim i pubg?
 Saber vlla, mos e nxirr malcolmin :p
 hahaha ti e bone montazh prej slackit a ?
Pasioni per jeten dhe per gjanat qe i du me zemer. Siempre la pasion ! 
 Vllacko me ket tweet ma kujtove  gjyshin tan e Allahu e past meshiru me xhennet ya Rab.
 kah e pave vlla ?
 Nejse vlla vec paska super moves
 Te msheft jon suk :p
 Edhe keta bejn hajgare me ket pensionist edhe po iu doket hajgare, dmth ata me krejt mujn me bo hajgare por ti kur thush…
 Mos e lesho veten vlla, no sugar...
 far skene epike kjo
 mire o tash mos e tepro
Karimi ty na kthy nostalgjin e gollave te  soni 2-shit.
  Hahahah po me doket u keqkuptu, qellimi jem ke qe khabibi su impresionu me veten se nuk i… 
 Spp di cka me t thon varet prej preferencave t libravi qe i ki. Ky liber o pak vullgar edhe jo shume 'paqsor'..
 Hahhah kurqysh mu pajtu a
Spe mbrijm hala fundin 
 Man e rond qekjo, pe qon cashtjen shume nelt
 ahh soft boy bree
  Hahahah po po shume
Benzema kah sa pret.. gjeth underdog, gjeth.
   mos thuj qe ski honger ?
 hahahha a dashte me qit veten n pah pak po.. ok po ta vlersojm foton :P
 hala sjena komercializu full
 sna vyn shume mu rrjek
 aha ti pe kqyr qe osht i imt, mire o more cfar teknike t hatashme me ni qetsi totale
 hahahaha duhet me ardh te ti me bike pak me t convince :p
 ✅   XI  🆚 .  VAMOS!   
===