Veq sa e pash njanin duke pirë espreso me RedBull 
Me fat Kurban Bajrami 
Barist - Ai qe e pren barin
  Ne dyqanet e mia kur e kishim polimarkin ne raft u shitke pa problem saqe lloje e tjera skish… 
 jo more tamam puna jaro, spata per qellim kend me ofendu veqse, perkrahja nuk ka sens ne kete forme, te pakten mendoj ashtu.
Me dal neser e met zon policia, thunju mka thon Hashimi dilni shlire se Albini e ka shkel kushtetuten.  
Take away osht me marr kafen, pijen ose ushqimin me vete edhe me konsumu ne shtepi apo ne ambient te mbyllur e jo m… 
 naj tweet per gjendjen e krijuar politike ?  
Dokumentar i cili ja vlen te shikohet, ku shpreh torturat me mizore te shqiptareve ne burgun e Spaqit shkaktuar nga… 
Hashimi ktynehere me qit gisht  i fitojke zgjedhjet diqysh, Kadria u nxeh me kto gishta 🤟 edhe poget i 3ti po del… 
Panairi i librit, Prishtina 2019  
DURO !Por,MOS U DORËZO !
Se kom tepru tu e shty por e kom tepru tu e pagu e tu mos shku hiq ! 
 Sepse Ne populli flejmë...
Përderisa edhe Fellini sweets ja ka nis me pregadit ushqime fast food, qa po pret ma mire ne kit shtet 
 Miqesore, mos u nxej!
 a je ti i ditur ? 🤙
Eksperta plako, Eksperta gjithandej! 
Tash a me i fyejt gjermanet si turqit apo si?!
Jaa edhe qita e niva??Kamarier boma ni kafe amerikane me qumesht te ftoft edhe qiti qokollate permi.. 
 Jaa bash per ty se kisha besu qe e ke ne mendje kete veprim  🤔
Kur u bo bre Shkodran Hoti me kritiku politiken e Albin Kurtit hajt kur? Plesht hesapi...
 Se rrok babik se rrok 
Qa o ka ndodh bre?  
Ai momenti kur te suprizon Babi, pa prit e pa kujtu   :) 
  Duhna me lexu edhe une, veqse e kom ne gjuhe angleze nga Alex Haley.
 A pritet te dalin ne shitje?!
Filluan urimet zyrtarisht per Bajram, ende pa u fale namazi i Bajramit.  
Shum fitne e kom punen se ku me dal me pi kafe kah mahalla    Menaxherat/Kamarierat be lik… 
  A mundeni me plasu planin tuaj politik si aplikacion per android dhe ios ne menyre qe te kemi me lehte mu informu
Zoti na mundesofte me agjeru kete muaj te bekuar me adhurime te sinqerta ndaj Zotit te Plotfuqishem. 
Tung,   a do te transmetohet Zona Express sonte apo jo per shkak se nuk pashe ndonje promo ne youtube,ende? Ju flm.
===