Qaq monoton sot dita, sa qe e nxuna veten tu lexu horoskop 
+ po du mi pas 3milion€-- pse bash 3milion?+ 1 milion per mamin, 1 milion per motrat e vellezerit edhe 1 milion p… 
Nese mendon se e perfundove 1 pune komplet nKS pa t'u shkaterru nervat, numero deri n3 edhe e sheh qe je gabim 🤕...
Ende e kam kete bindje  
Sdi per juve, amo une mendoj qe lajmet nuk ndegjohen me volume normal (veq volume +40), ose ose nuk je shqipetare 🤔.
Diqysh edhe une sjam per me pas 1 dasem EXTRA tmadhe, por si me shku pa dasem vetem  "mu rras" ashtu nshtepi"hello… 
Kurs te gjuhes gjermane niveli B1 .
Tpremten mvjen DETI .
Kur Sinan Vllasaliu thote:"Hajt moj jete mos te qofsha fale, sa shume te dhash ehhh sa pak kam marre" 🤕.
 Po diskutohet edhe eshte shume normale, se nuk kemi industri nKs as skemi per tpas asnjehere sa kemi Kafiteri/Restaurante/Klube 🤔
E kisha pi 1 kafe neser nPr, se po mduket se u çliruam per te dyten here .
Per te gjithe ju qe jeni te interesuar per kurs te MATEMATIKES ose MESIM PLOTESUES, mund te me kontaktoni ne meseng… 
+ I thojne shqiptarit: "ta falim gjysen e botes nese smerresh mo me pune te huaja"- Edhe ky pajtohet (Kur e merr… 
Ishalla se shoh veten me ndonje memes, se foooort o tu ma dashte me bo budallakia koheve tfundit 
Kur e bene mendjemadhin/en, mvjen nje ze nga mbrendesia e shpirtit me i thane:Nks vella/motro nKs Sta njeh kerkus… 
Si vjeshta iku dashuria jone, gjithmone me shi, dhimbje, e lot...
Gjuha shqipe eshte gjuhe ku theksimi i shkronjave per cdo fjale behet njejte sikurse thuhen edhe ne alfabet… 
"Gjuha reagon donjehere me rende sesa shpata"
Plaget tuaja jane force, vetem duhet te gjesh shpirtin qe lufton per mbijetese te fshehur diku ne mbrendesine tuaj....
Ne lokale (kafe/restaurante) myshterite lejohen te rrijne pa maska, ndersa punetoret e kane patjeter te rrijne me m… 
 A po sheh dicka normale nKs a?!
 Hyp nBus me naj rrugetim tgjate, aty i ndegjon krejt muziket vajtuse  Sot me mengjes "e urrej diten e diel.... Meda"
 Veç mos tshkon me gjate 
Po dojsha mu perla me dikan sotPATJETER e kam 
 Presidenti nKosove: nuk pajtohet me faktin qe nuk eshte me president, deri ne inagurimin e te riut bene… 
Mka marr malli per shopping 
Une: nTaxiTruni: mos e thujMos e thujMos e thujMos e thujMos e thujMos e thuj...Une: tash kur tbohet hyrj… 
Tash kur tfillon sezona e shallave, a duhet me mbajt masken tani shallin a? 🤔
Kisha hy nje here "Live" ne instagram vetem e vetem me e pa reagimin e motrave edhe vellaut 🤔
Mood: a bene 15 eKspreso he he he he edhe qa jeni qu me kaq disponim vlla nalja zanin muzikes pak se mkupi kryet ...Me: 🤔
Sot VETEM 4 kafe i kam pi 
- Nbarnatore a keni barna kunder dhimbjeve?+ mfalni, cfare dhimbje? (Ku ju dhemb?)- shpirti, shpirti po mdhem 
Me: breathingMom: o Zoti tknaqt, paq nafak e krejt tmirat e botes
...edhe 1 tjeter ne proces  
Nje here gabon, e dyta eshte zakon 🤔
Pandemia ka shkaterru gjithcka 
Nsemafora cka ssheh njeri 
Sme erdh mire valla, po as keq jo 
Une: jam vesh me fustan amo koka ftohte (i thash shoqes)Shoqja: Qe don ta bi ni trenerk ama ti ma mall e ban mu merdhi...
Me sa njerin ka me u taku neser, duhet te zgjatet dita ne +48h 
Kur e postojne 2 here foton e njejte ne te njejtin postim, me duket se thone "ej shiko mire, e sheh sa bukur jam dal?" 
Gjate nje bisede para prezantimit te temes se diplomes me shoqen tem, ajo po lutet qe komisioni te mos kete kohe me… 
 Cfare profesioni duhet me qene? 
Nganjehere zemra qan me rend se syri qe loton 
 Me fat Kurban Bajrami 
Para pak kohe testi i njejte per alergji ka kushtu 15€, ndersa sot 50€. Na jane bere edhe mjeket si sallon ondulimi… 
 Ehhh mo BASH kqyr se edhe online i kryn punet administrative (prej pervojes e kam, sot veq i perfundova 50% te tyne )
Ne temen se "cka mungon ne shkolle" +20 vjet pasluftes, ende flitet per "tualete brenda shkolles, bibloteke, paisje… 
Kolla nrruge, njerezit qe mpane nrruge ecshin 10m larg meje 🤔
Qeshtja eshte mos me u dorezuEdhe nese shkon zhaaaaaag sosesh krejt, diku kah fundi i rruges(me 1 udhekryq) e merr… 
Normal qe sban viberi bile shume ka bo, cfare muhabete bohen e sa shume e perdorim 
Ma shpianike se une, so as ai/ajo qe e ka zbulu shpien 
Me kaloi e gjithe jeta para syve Mos posto nese sjane rezultatePLEASE Mos luj me ndjenja 
+cka do me bo tashMe: me dek 🤔
....Amo sot mduhet 1 mrekulli 
  Ani njerezore, po profesionale ku bre?🤔 
 Profat nGjeodezi jane tjeter nivel Jane shume IN me kohen edhe hajgaret 🤘
Ish kane sot 1 prof. n'disponimE takova nkoridor n'FK edhe deshta me pyt dickaveq kur mtha"mfal prof a ban me tpy… 
Jeten mund te ma merrni, por jo edhe zemren 
 Me mngu mu se hap kete bisede hiq me ato shoke, besom qe sdoket mire 
 Politike eshte krejt kjo Ti nisu per Ks sigurt se sen ska
"Guri i ran peshon nvend tvete te paret kane thane..."
 A qe BASH qeky Oxygen ssssss 
 Vazhdo me radio, se lajmet na shpifen 
 Me fol ka t'del shpirti, valla bre eshnat e deshmoreve e martireve ju keni livrite me qita cetnika e shovenista ne Qeveri.…
Me tesha tskijimit po shkojme sivjet ndeti, si po shihet moti sdo mu kfill 
So pune mi hjek teshat e dimrit prej dollapit khuuuu
Me fat Fiter Bajramin 
Eshte shekulli XXI, per disa qe ju ka hup numerimi prej  shk. V.
 Nuk eshte qe sju pelqen edhe juve, se ka edhe asi qe reklamojne trurin amo sjane rangu i do doooove (pa ofendime MAN) 
Si i japim ne vlera Shqiperise (gje qe eshte e mire kjo), ato per Kosove cka?🤔 (Po tham thash)
 Une sen spo dijsha 
 Jane bo "hor", spo ju shkrujn mo 
 Per kohen ne te cilen kam jetu "pa gajle" 
Shume mpelqen bre basketbolli Veq sa tndreqet qekjo atmosfere nderplanetare, kam me u angazhu me shume ne kete sport 
 Ai ta ka ndreq kerrin, ti kompjuterin tash mos u anko 
Cka kishin me thane nlajme nese skish me ekzistu covid19 edhe qeveria?🤔🤔🤔🤔
 Si pse?!!Sa muaj skane punu? Duhet me nxjerr fitimin diqysh 
Paramendoni masi t'hapen lokalet/kafet, ti shkon si loqk e shijon kafen edhe nfund kur ta kqyrsh faturen 3€ expresso 
Pse hi live nkerr tu nejt si pasagjer i rendomt????!!!! WHYYY 🤔
Une cka i bona tash?!!!!! 
E merrni me mend, kjo me na perfaqesu neve si shtet  
Me: 2020 OMG e kam 1 hamer me plane e me deshira per kete vit + kam me dal mu knaqCOVID19: trus nshpiMe: OK 
Per ditlindje t'tem po hapen kafet 
Paramendoni me u bo tw me story🤔...atehere kujtonmani me mbyll tw-n(llogarine me te preferuar t'timen)
Nese ndjehesh rehat me veten Dokesh edhe me mire 
Emisionet e tij i kisha ndalu mu shfaq nTV.Ky e paska TEPRU. 
Une sahere qe prind mthojne ka mu bo mire tash  
 Sorry,amo M** e ke bo 
 Me ma bo bajatSe tani kam arsye mju kap per fjale edhe mu rrok  
 Pse spo hi npune?Like WTF
 Ska kuptim jeta pas grilavebtw as ty stka myt kerkush hala 
 Jo, amo a ki cka i bon tjeter pos me fal?
Te jesh i/e forte para njerezimit eshte e lehte, provo te ndeshesh me veten, shpirtin tend dhe do te shohesh se kus… 
  po thuhet, edhe? 🤔
  tani kalo nshkalle pa u rrezu 
 so gabim, amo nana e tij sdel me tpa kurre (ajo e do katolike rejen) (per Kosove po foli)*i ka ndodh dikujt qe e njoh* 
sezona ku vajzat e kane nmode rrethin nkry, ju pershtat ose jo duhet me qit se o "MODE" 🤔
 hala ske dal me mu nshopping 
mtha: cka do me bo tash?me: me shku nbanese me kajt 1 ore edhe mu kthy prape nFk se kam provim n12 
 me rendesi po e kuptojme ne 
===