 Ssss sosht e mjaftueshme
 Qu n 5 kinge, me pula ki me fjet
 3 provime qet jave 
Si kur lajna tepija 
Qysh s folin, se krejt tu e thy jon bre nanen 
  Qok shykyr, Allahem bismilah
A KA MET NAJKUSH PA SHKU N UNUM BRE HEEEEEEJ
Kerkush n bote sma rrite konfidencen ma shume se puntort e baushtelles. Respect for my kings 🤍
shume BIZI BIZI hehehe 
 Nuk kokna e vetmja??? 
 Mfal kush je ti?
 Vetes ju referova dmth
Qikjo ka me ma pru deken n modelim 
Prej sot une sjom mo shok me , per arsye se sma ka qel telin. It was nice knowing u buddy!
 Haha n ice e kom rroke ne qata
Qysh me punu me vereion t’ri te instagramit google serq
Pse moj spo m bon StagrAmi?????!!!!????!!!!?
 Kto mendime are killin me
A din sa shpesh menoj psh kto clothes qe i veshim me shkrime anglisht me kon shqip
 Kam qene e pire
 Spo muj me kry mekaniken goj KUPTOOOM
Kom me vra veten  
Kom me vra vete 
Kurre sja u boj hallall mos me bo 
Secilen qelize ma shkatrron kjo qenie njerzore 
 Kuku e para edhe e tretaa
  A mke bo ti mu a t kom bo une ty
A pe nalni dikush a lujta 
 O tu thon kesh pa e lexu sa e kisha bo
Urime festa t nderum
Edhe fotelet e kojshis mu kan zvoglu 
Edhe qikjo m vyjti 
 Do uje t zemzemit ta kom porosite
 cdo kat ka 1 ere iftari  ndryshe mmmm
Hahahaahahhahahahaaahahahahahhaha o e du 
 "Grate e kan venin n'kuzhine" 
Ju thash qe i ka bo 
Bash po m intereson diqysh
A i ka bo kida cicat a?
Hala skom ardhe n veti prej ksaj vidjo ncnc 
Pasha zotin qisi konfidence kom 
Hahaha *ja rras bllok* 
 Kesh te behari me ble limona hehehehe
 Mos u gut se na re msysh
Krejt juve qe sju intereson thash tju kallxoj qe i kom ly flokt
 Uhh jo nime pushim paskem se e kom ditlindjen
 Hiq skena me fjet tash
Ja paskan ngjit qipin 
   qka ka moj? Qka na e gjet bashkvendasin?
 Komge po m duhet diqka me ma pak followers, pak ma pertoke
 Jush se t shkoj te faruku, ta hupi faren
Ajo gruja sosht njeri hahahah
Kqyre ni njeri me ni gru
 Oj biq ama ni dite
   qe ky muza jote
Qka heka me lexu 
 Lej mUri hallKIN me t duhen
 Po t paki ty sonte 
 O budall bre o zot
===