 Cilin e don ma shume :)?
 Edhe na i kemi 1 ne dite ne pune. Per ata thash qe munden me i maru ne shtepi. Mire ka vende qe edhe… 
  Per pjesen e dyte gabim je. Nuk eshte qe pajtohna sepse munden… 
 Sot pata pervoje personale me te afert. Nese nuk ndermarrin dicka shpejt, javen tjeter kan me vdek n… 
 Gruan rome, per te cilen disa portale raportuan se kinse po vjedh femije (informate e paverifikuar dhe e demantuar nga vet…
 prej t'hanes kur radio kosova 1 dhe 2 ju skadon licenca, Kosova ma n'fund do te jete e lire nga mediume qe shperndajne prop…
 me pas KOS experta ne krejt fushat si Nora e Majlinda ne Judo, ndryshe i kishim pas punt. Po Shqip. pa medale si mushet syni.
 edhe urime per fillimin btw. Shpresoj ka me pas projekte te mira :)
 degjova ne , MCC 1 prej sectorve shendeti + 2 GOALS te UN jane shndt. Mos e anashkaloni plz. 
 Kosova ne syte e Nentor Oseku. Magjepese!   
 Me shku me apliku per vize edhe n'intervist me ju thon 'po du me dal jasht se spo mi qel videot n'youtube n'shtet tem'. Kog…
 Te kujdesemi qe t'i ruajme, qyteti e mire e trajton pronen publike me respekt e kujdes - bashke me shume ne 2016 
 a duhet me lujt apet a llogaritet qajo :p?
 hë bal ki kihe te lire qe ju ktheve twitter a :p
 BiH edhe Kroacia kan edhe nje shance, Kroacia nashta direkt.
 Edhe? Janari 2016 me apo pa Viza?
 po bre e verejta, me hi krejt komunat tabi me shperbe me 2/3 e votave :p
Pacientja:"Dok a munesh me ma lshu nje leter qe me ja qu une ne Zvicerr se du me nejt edhe nje jave ketu".A ma mire ketu a atje?  
 lexoje artikullin. Nuk e ka fajsu per rezultat por konkret per nje rast gjat lojes. 
I tham X mjekut: "tjeter here vendose vulen e nenshkrimin tan kur shkrun terapi" Ai: "a spe sheh logon e amb nalt a, a ki sy, boll eshte."
 ajo po. Ama ky backup. Shpresojme Costa mos me u lendu shume sivjet ose me dhez fort El Tigre :p.
Ka mujt edhe ma mire. Me dal e 3ta ne fund sukses kish me qene. 
Tkish mi ra grupi B Shqiperise ish kan super. 
 Vallahin sukses osht me lujt kunder Portugalis, Frances, Italis, Danimarkes edhe mi pranu veq 3 golla.
   cili nen i kushtetutes flet per koalicione parazgjedhore?
 sa e sigurte? Ku ndegjove?
 Qysh u nxe fushata, edhe gjeneves kemi mi premtu stadion te ri
 ku i ke marr te dhanat? Gjithmone mka interesu sa paguhen. Mos ki te dhena edhe pse nuk jan pagu pjesa tjeter?
 hajde n'Kosove rahatohesh :p
 hahahhaha le tja tregojn foton Januzajt nashta bindet ma shpejt. Btw gazetare eshte :p 
Lajmi i fundit: Edita Tahiri eshte nominuar per cmimin Nobel per optimizem. 
 po mungon 1 farmacist e ky emision ish kty moti. Veq deshperuese tana anet :(
 ne fakt, spo di kush eshte ky gazetari, po e mjer Tribuna qe e paska.
 mdoket edhe batterine e ka diqka "pak" ma te mire :p 
 nime kqyrne a nuk ish atje ne kino a?
65,000 € komuna e PR per drita e zbukurime per festat e fund-viti. Mos e keni tepru pak bre?
 garant, ama tash hala ma shume me shkon nerva ViDiq
 edhe ata i takojna njones prej atyne (shumica).
 gabim, nje ishte autogol.
 niva qe kish dal ne pazar per ajvar. 
 Kosova eshte ne Europe dhe mundesh mu ndi europian nese don:-) Kushtet tjeter storje. “: Edhe une dua te jem Qyt…
  tani eshte pytja tjeter Evrope a Europe. 
 Edhe 2 dit shi edhe Isa Mustafen e votojn veq Familja e ngusht 
 cka eshte more kjo? "Shpallje te vogla" a? Shkruni more artikuj si duhet mos u boni hor me kto cukla.
Qeta njerzia qe bojn tweet-a per dashni fort sun pi duroj. O djal, kerkush sti lexon thanjet e perkthyme me google.
Tha "Me bo fmi eshte bo luks". Nese menon qishtu, ma mire mos u bo prind hiq, per hater te femise.
 n1. Shume edhe mu mpat pelqy edhe pse fundi u pat kon diqka mind fuck :p.
"Po bie shi horizontalosht" hajt shqype hajt. 
"Po bie shi horizontalosht" hajt shqype hajt. 
 Te na, fatekeqsisht, egziston realitet tjeter (i prapte) :(
Me qeta semaforat e tepert ne Prishtine fort na ka lodh komuna.
 hahhaha n1 (mu kujtu vali). Ma shume po me dhem qe po jan ne pozita, se sa per qesi "15 min of fame" krejt le ti kan.
 krejt poenta eshte qaty, me i perqeshe partite tjera. Gjithcka e tyne duhet me u marr si e kundert.
Lajmi i fundit: Real Madrid e ka pagu Bale me StarCard per 36 këste.  
Bravo per krejt ata qe kan dal me e prite Majlinda -n. Shpresoj qe kjo medalja e pare prej shume.tjerave ne te ardhmen.
Mami jem: Spe shtine Shaqirin, ai meniher e jep gol.
 a e kan shkarku kryetarin e prlm ? Kogja menyre e padrejt mu dok. Si me pas kan parti politike!
 mkalli, veq po pres me pershendet najkan ne tribuna. Pe tepron :p
 cka po ndodhe me BIK? Don me pas fund te keq kjo pune :(
 me 1/2 e ekipit qe e kan pas vjet. Gjithmone MUTD po ka fat ne grup :p
 hahaha komentet ti tregova, po garant ka me u blloku :p
 op de ttregova :p
 ah, qata se sma rroki.
 kqyuri do tjera teper te qarta i paskan qite si paskna pa :P
 cka tkish ndodhe ashtu ne OFM? :p dopsira
Shoqeruesit e mi te mire gjate udhetimit neper EU :). 
Khuu deri kur duhet me duru Labin ( e 21), qe 10 vjet 1 anglishte sun e msoj.
 veq e kishin lujt sot dreqnit :p. Pritsha bile 1-0 jo 4 :@
 bash menojsha me dal ne piknik ne Gërmi neser, ama po shkojsha ne autostrade. 
Krejt Ferizaji n'spital kokan sot. 15 min parking deri sa gjeta.
 shume mpengoj se askush nuk permendi kete fakt, tpakten jo  si duhet. Jo qe me kualitet arsimi jena mire. cc/ 
 super, tu vo qef o njeri ku po don ma mire :p. Hajt se kur shkoj atje ti gjej do ti qoj me poste qe ski kry pune hala :p
 Hej nime qysh po kalon? A gjete cimera a me ti qu do prej KS?
 pse po menon qe nuk eshte e jotja? Btw me te motres (ma e re se une) hyna edhe ken nja 10 email prej google groups.
 poget veq gjeneratat ma te reja, plot sa une i provova as nje spo ben.  :p
 sesht ka punon ashtu kshtu, provova disa here
 po ndrron modemat e internetit? Prej kurit?
 katastrof bre. 1 certifikate hej. Parameno me lyp azil nKosove :p, a thu cka te duhet.
1 dokument me nxerr ne Prishtine te duhen 2 dite edhe 1 krah dokumentave tjere. Ishalla Prof.Isa nuk m'thot me lshu Prishtinen :S.
 haha nono, this is your year :p. Qashtu po shpresojna, bile do golla ma shume mu dhane, fort ka me kan, 6 te forta sivjet.
 sdi a e ki ngu qet sen,  veq per qeta po xhelozoj qe e murr  :P
 Ka me qene interesant me e pa tranzicionin e  prej ni mediumi n'opozite/ n'pozite.   etj po kalo…
 ata me "fire god", vllaun e ish mbretit qe e murren bastardin.
 parameno sa shqipetarve i ik ky serial. Nejse e kan Hyremin, close enough. Btw prmbldhj e mire, po mdoket e ki harru 1 mbret :p.
 ... Mediat teper te dobeta, po me quditin. Hala as 1 infornate zyrtare.
 une qetë nuk kom prite, po tpakten jo ksi incidente te mdhaja. Tash lajmet po thojn qe nuk ka vdek por gjendje kritike ...
Partia komuniste (e punes) pro legalizimit te hashashit ne Shqiperi.  
 Libri tani = Book Now   
 Besoj qe ka mjaftueshem kerkesa per ato linja. Ndoshta me liberalizim+pista e re ka me nxite ma shume operatore me punu.
 ama sdi sa ka kerkesa per afer. Ktu duhet diqysh per CH edhe DE me i liru. Qysh mi nxite EasyJet WizzAir me operu kto linja.
 po qato taxa kush i cakton? A nuk munet sheti me i zvgl. e rrjedhimisht cmimet ulen sadopak. 
  normalisht duhet me u liru biletat (nese e marrim nen kontrolle), a po?
Pse therrasin "Duam fitore", kurr nuk kam me i kuptu.   Forca Albania!
 1 emision per Maturen me te ftuar nga ministria te lutem. Pyetjet e testit jane tashme online!
  Hormonet jane vetem faktore ndihmues. 
  Ramja e flokeve bartet si gjen recesiv ne kromozomin X. Mashkuje jon XY per ata nese e kan gjenin, kan mi ra floket.
 edhe ne Kosove mundesh me be te njejten.
 qysh je bre? :p
 Me kane me punu komuna e  per 4 vjet, si qysh po punon edhe per qito muje para zgjedhjeve, kishim lulzue prej t…
 Qashtu qysh pat fole at'her per marrveshjen e zarfit ;).
 Nuk e di sa ja kisha 'shite' posten naj kompanise qe nuk mundesh me gjete ne Wikipedia!
 burdushi, hoxhallaret edhe doktorrat krejt 1 po te doken a?
 a je gjalle o njeri!? A je ksajde 1 kafe ket weekend moti skena dal :p
 1 hajn jo shume i kfillt ka vjedhe me 1 shpi, nese e njeh dikush le t'lajmeron! 
Burdushi per kryeminister te KS!
Ku kena mrri kur ne tv i ipet kohe, ne emision mjekesor, Burdushit!? Mjer na. 
 op, preblem ne Kosove se sdin mu shpreh, me Ultraze sguxon mi thon qe ki kancer, veq dyshon. Po ec e spjegoja doc shqiptar.
 i ka "dal" kancer a kan dyshu per kacer?
 bal ne sa e keni neser nisjen? edhe apo prej Geneves ?
 hahaha, hipster :p. Une 90 edhe wind 3.1 di (te pakten kom dite :P), heren tjeter e qes ne CV :)
 ma merr menja qe ma pak njerz ka qe dine 95 se 7.  :p
 a ki me u dok ksajde me 2 edhe ti?
 prap ne twitter a :p
 Hahahhaa  :P. A je vra najsen ? Babi tha qe kerri ka shku :P
 o bal anki bo ndeshje me polo a?
 Tha, u bo ma shtrenjte me mbushe telefonin me rryme se me impulsa!
 Kta jone gjujt me karriga live, po ju shaheni me nona n'telefon. Lenani rahat allahile, mu kon mos mju njoft.  ...
 Gezim Kelmendi. E ki ne status te tina nese e ki friend ne FB.
 e niva prej 1 deputeti te parlamentit te Kosoves.
 realizimi? Bravo i koft!
===