Qebesa dojm me jau pa sherrin kinezve ni dite. A e ke pa sa tvogjel e sa shume jon diqysh… bojn najsen ata nuk ju dihet 🧐
 I ka thon hajt bir se ti po din ship mire 
Info eshte prej krijuesit te flamurit
Sot per here te pare e morra veshe qe yjet ne flamurin e Kosoves dmth 'KOSOVA' e skan tbaj me minoritete... 
Neve duhet me pranu realitetin edhe me hece perpara, a serbt nuk duhet me pranu realitetin per cka kan bo edhe duhe… 
Pernime jom tu mendu na si shtet secili individ i sheh zgjedhjet veq si mundesi me perfitu dicka ne fushate zgjedho… 
 Moti skom pa qeshtu kaq thjeshte edhe mire . (Se tani po ankohesh jo anej knej) 
Tash AAK e merr kryeministrin per me mbrojt token apo?
Ekonomistat mos te ankohen se skan me cka me u marr tash e mas. Kallxone veten.
 Nuk kemi shije cka do na 🤤
Si me kqyr titanikun tu u fundosè hahahahaha 
 Edhe ne dukje osht si kros, si me 'fellc'.. hahaha
Boll rralle udhetoj me autobus, veç kur udhetoj gjith m'qellojne do ksi qifte qe pickohen.. gjithe rrugen une duhet me i ngu 
Hajde me lshu far programi festiv ne kanalet tona, ma shume rreklama se najsen te hajrit me kqyr 
 Ironikisht te na ne armature kursejne "vjedhin" inxhinierat... tani vuajme pasojat
Qysh me hidhet me i shkel kta njerzit qe mundohen me kalu autostraden 
 Se shumica sdime me dashte veten, mundohemi me kon si tjeter kush.. masnej ngjulemi 
Shume 33-sh osht qeky Nuhiu "" (ne thojza)
Qajo bre me gjithe zemer po lujnè 
 Edhe ni version se pse stpelqejne?
4 vjet po harrohen per 4 jave marketing.. hapni syte o popull 
A mund te jete kjo nje mundesi triumfi per Kosoven 
Valle pse kto partite politike po livdohen se cfar partive me lula jon, ku ne fakt duhet te tregojne sene konkrete… 
Kqyra rezultatin i heka syt 2 minuta i ktheva syt 4-0 per liverpoolin ?? 
1 kg fara, hala pjesa e pare 🤯
Shkallet e nenkalimit ne sezonen e dimnit jon te tmerrshme
Athu pse i kom macat simpati 🤔
Krejt trullohen per festa neper hipermarketa 
Spanja po i merr kupat, na po i prijm me muzike..
 Ose Mentor Kurtishin haha
 Ja be kuesh shume po lyp..
===