  para dy ditesh paralajmeroi ate qe po thote sot zevendesministri i financave. 
 Terheqja e parave nga Trusti Pensional nuk eshte ndihme nga qeveria. Ato jane parate tona :)Ska perse :)
 Faleminderit per vleresimin, Flamur 
 Faleminderit i nderuar Fisnik 
 Sherim te shpejte, Agron.
Faleminderit per vleresimin Eroll  
 Faleminderit i nderuar Suad.
 ke te drejte, por mund te jete edhe mekanizem ballafaqimi.
   "une kujdesem me perdorimin e termave te pergjithshem te cilet nese analizohen del ne shkence, si shembull paranoj…
 mend per tjera here :))
 Cfare autogoli nga Ministria e Shendetesise. Po thojne eshte e vertete qe Kosova eshte e para ne bote me vdekje per koke ban…
 Nese vazhdon trendi i muajit korrik 2020 (5.6 persona te vdekur per cdo dite), deri ne fund te vitit edhe 760 persona mund…
 Ke te drejte, te kuptoj. Keta mund te jete gjithcka pos akademike.
  Te gjitha detajet e punes se Komisionit do te behen publike, pervec rasteve specifike te rr… 
 Faleminderit Flamur, eshte saktesisht qysh e ke shkru. Puna e ketij Komisioni do t'i ve ne levizje te tj… 
 Faleminderit per mbeshtetjen, jemi bashke ne kete beteje✌
 Do te bejme me te miren, te pakten per anetaret e Levizjes kete mund te garantoj. Faleminderit per sugjerimin Çelik.
 Faleminderit Alba, e lehte ose e rende, kete pune duhet ta bejme si duhet.
 Mergata gjithmone me ❤
  Dakord me cka ke shkru, verejtje me vend.
  Mbase kjo do te ishte menyre me e mire.
  Per bese jo, nuk bej hajgare me ceshtje serioze. Te gjithe kemi qene max te angazhuar pe… 
  Sakte, ndoshta kemi mujt mos me e mbajte. As une nuk jam i bindun qe ka qene veprim i… 
  Dakord. Pajtohem me kritiken per tubimin, nuk po e mbroj me cdo kusht. Por ligj nuk kem… 
  Qeverine Kurti nuk e ka votuar Lista Srpska. Vetem nje numer i deputeteve te komunitete… 
  thashe mos pate ndonje koment per lajmin qe e publikova, por ncuk :)
 je t'u sharu thelle e ma thelle. miqesisht po te lutem ta ndalim ketu. nuk eshte faj qe nuk i ke i… 
 nuk eshte e vertere. te lutem mos genje.
 nuk eshte e vertete. po dezinformon.
 kaq eshte takati yt?
 ende se ke kuptu qe faturen e paguajne qytetaret.
 Natyrisht qe i perserisim, a mos deshet me jau ba hallall hajnine. Si cakalla e mullinit, cdo dite do… 
 Ajnshtajn eshte valla :))
 Ka ndarje qe sjellin rritje, si ajo e Levizjes. Por ndarja e Kosoves sjelle vetem humbje, per te gjithe ne.
 Boll ma me dallavere, hajni dhe korrupcion! Stop ndarjen e   ✌ 
===