 kur t'thojn gabim teknik si  atehere
  mos rrej se ska dyfishim t'çmimit e energjiseper 4 militanta ne KEK eshte fjala jo pe… 
    Shume prej tyre nuk kan nevoj per to ?Ti dhe rrethi i yt i paskan punt mir.
 'Me pak vota per te' haha
   oooooo boll se sun flen aj ma haha
 kshyre kush ja bon like hahaha 
per futboll o e mir diaspora hehe 
  po de bash tutes edhe rrenc je dmth. shkavell heheku eshte dokumenti, trueShkavell? 
  a e ki dokumentin? veq ta lexoj
   Nope nuk eshte po ti e hangre kit titull
   'Pak jashte kontekstit'Amo pa e dit kontekstin e ke hanger foren me kit pos… 
   e ka kuptue shum mir po ky aq eshte perkrahes i AAKs qe nje kritik me ja ba AA… 
   o kti albanit veq mos ja permend AAK'n se qartet krejtveq kshyrne kete tweet… 
 Ngushllime familjes dhe ty per mikun tend
      bllok m'ka ba po me mu gjashte jeniqka t'shkrun aj kunder jam
   po veq thash mos abit e ka infon prej ksaj faqe
   kta veq ja kan nis hahaha
kur thojshe nonstop 'u prishum me amerikant' ose 'kan mu largu amerikant' a e ke bo men mos dikush n'kosove ka me p… 
Si atehere kur i mashtrojshe njerzit? Big shkavell energy 
   As une nuk besojMa merre mendja qe per shkak konkursit ose projektit boratit 
  Konkurs po m'doket Thojsha kishe diaspora e keqe per beratin
 urime arjanit per ket bukurosh me shendet e me jete t'gjat
Te devollt kjo interviste a ? 
  N'kohen kur ja kan nis me stikersat me i ngjit tek tabelat e kerreve, ky pytke kush jon ata… 
 Ska as nevoj per ftese
O qata thom shkavella jeniKrejt me plan Kshtu edhe shkijet e kan pas I inskenojshin senet e u bonen viktim 
  Ky tipi ka daddy issues I mungon dashnija e albinit kti Shkavell o ky, qka s'bon njeri prej inatit
 'lem veq pak t'hypi nalt se s'pom shohin kamerat'
 paska hala ma poshte 
Po se veq me pare e shantazhon njerinMore shkavell qe je bre 
 shkavell je bre Normal qe nuk bon qjum kshtu Per kshtu kot e ki trajtimin  
 'S'po guxoni edhe ju ka manipulu albinit' e thot manipuluesi haha Gjith jon do n'jet si Berati qe mundo… 
 Anglisht Dmth prite edhe pak reagimin e grenellit
 bashk me kriminelin hehe 
 Ti problem ki me gjum biro Ti vet ki nevoj hehe
  100% pa ballotazh Visari ta thot troq qysh o puna
   Kshtu krejt e kan kta qe skan mujt mu kyq n'vv
Bujar Musa dhe Akan Ismaili kush ken more kta ?  
 Pash zotin a je kan te mjeku per at problemin e gjumit ?
Perparim Rama - LDK 
 Qysh ke takimi me grenellin dumbo ?
70€ per femij hahahahaO dumbo haha 
Kta veq thirrin per me u arsyetu 
Shkavellat ja kan nis me teoriat konspirative 
HAHAHAHALajmi kryesor: arsyetimi i grenellitKta shkavella sa shpejt e arsyetojne haha 
Ke pase deshire me pa n'burg e jo n'pension 
  Promovim t'portalit t'ri Ska ma insajderi Duhet me bo boom me ksi sene
   Ka nevoj me promovu portalin e ri
   + plus n'prill i kan rritAmo harrojn shume shpejt 
 Hajde biro ma gjalle ma gjalle propaganden
Shkavellat per 100€ shtes: 'per fushate e kan bo' 'cka jon 100'Eu nanen juve, kan harru qe prej janarit deri n'mar… 
 Veq me ngu  nt7 U bo ma i smut se Berati Moti nuk e kam ndegju, po ka lujt krejt ky njeri
Qe  qe hongshe mut Anulimin e shpronsimeve as qe u permend heheKa pare per gjithcka nese nuk vidhen he… 
 Bir, paska lujt edhe Leo E ka dhez motorin
 pensionet prej marsit i kan rrit po ke harru dhe keni rrejt qe i kan zbrit bilePse more je bo jshtu Lleo
VV keq LDK mire eeeuuu LleoHahahaha
Narrative e re T7'shit:'VV krejt si Thaqi'
 tasht per podujeven ?Inatin me shti njerezve per me votu ldk'n atje?Folni per gjilanin lene podujeven
 Luta aty per me dhane ligjerata ?Veq gjun me fjal + pa emer pa as nje informacion tjeter
 Thojshin kta t'ldks ' kan vra kta t'pdks njerezit' e bojshin marreveshje üa problem
A bon edhe naj pyetje ky Dardan Gashi a jo ?
 Joooooo sbon me bo memes joooSe mendojn qe o e vertet
'Pse po boni meme, njerzit menojn qe eshte e vertet, moossss, po ma prekni palin 'Shkavell
Qe ktu ni shkavell qe merr seriozisht ni memeÇka bon ?Kercnon 
   Oooooo kurr mos u nal Veq per inati kti bone edhe njo se is smut oSa r… 
     A pe nin more veten lopooo?A ta ka sha baben e nanen a… 
Kta shkavellat pa pas kontakt tbojn bllok haha
 Tash kshyre 2017 edhe krahasoj numrat heheSurprise surprise
  Pse more tash paparaci? Ku insajderi ? Hehe
   Jo skam nevoj me deshmu se e din krejt Flm
   Haha kush kari je ti une me deshmu diçka?Krejt e din qe e kan perdor familjen… 
   Haver paske probleme me lexim edhe me degjim hahahaE kan perdor cdo here, po edhe qorr te kukshe haha
   Ani thote nuk e kan perdor HAHAHA
   Nuk e kan perdor? hahaJashart me kan kunder pdk's nuk e deshmon qe pdk'ja nuk… 
 po de, shok tngusht e ki samin sami 'vrasesi' lushtaku
   pdk'ja nuk e perdore a ? hahaha
  Ky u kan militant i smut i VVs (kta qe jan tash me PSDn)Nkete Foto e ki kit qenin, sot e ka… 
   Hajde  jepi Te ti kta te  reagojshin nsekond
Aaaa more  veq vazhdo kshtu Prap gabim teknik a? 
   Mbroje ti shkaun mbroje bravo
 He bre kurv qe je 
   Mos prit pergjigje prej kti, kot e ki
   Po po bash ky
Kuuuuu Beri tu rrejt prap hahaKur e tha more?O Perparimi ska me fitu Pse more nuk e ka lan gazetarin tan me bo… 
Beri pa tjeter don qe mos me fitu vv prishtinen jeppiii 
 Qite bile krejtKshyrum neser 
 Qite bile krejtKshyrum neser 
   demagogji po mdoket pak e tepert :D
   ka pase shume prind qe jan anku per shkollet qe i kan mshelnkrejt kto katune ke… 
   veq pe shoh qe n2020 her ia kan dhane te drejt kryetarit her prinderve
   a ma dergon nje link nese mundesh ?
 Amo plaka e ka mireVeq deri n'mars kan marrë shtesa
 A s'eshte e vertet qe veq deri n'mars I kan marrë paret?
   Bash kurgjo ska bo
   Çka je ka fol ?Urani mut e ka bo, bash kurgjo hiq ska bo.Bravo masken se ka hek uaaaaaa
    Qfare spini citoje t'lutna. Edhe krejt t'gjallt me i pas jashte vendi… 
    Çka ka t'keqe me pagu qira n'vendin qe e udheheq? Gruja e tij e ka ble… 
Aty dihet qe istogu ndjen frymen rugoviane tek vjosa
 Imer pershkak vjoses e ka hup istogun LDKja
  O ti Shumica jan kthy nkosove Kush fol si ti, s'eshte patriot
   Dmth krejt qe kan ik jasht ose ne kampe spaskan kontribu?Se per qejf kan nejt ne… 
   Me i kshyr postimet qe i ke ba, shume po t'pengon qe po vijn me votu.
 Fokusoheni te korrupsionin qe e ka ba LDKjaSe Berati mundohet me e drejtu debatin kunder albinit ose vv'… 
 Blerimi qe thojke kush e ka nda Mitrovicen.
  90%shi i Selmanajt ke tema apo ?Fakte qe 90% e kishin kundershtu qysh po thote Selmanaj ?… 
  Mire e kam kuptu, por Harari nuk ka thene qe u 'detyru' Merkeli me bo kete… 
  Nuk u detyru, ska lidhje e para me te dyten. E kan kritiku Merkelin se u paraqit shume e ft… 
 Veq pak gabim e kaNuk eshte e ngjashme 
   une edhe tash shkoj "poshte"dhe nese nuk kisha shku i ndihmoj me dergesa si g… 
     Ky sdi cka eshte vaksin
 Mire e ki.Edhe prostituta i ndrron burrat.
===