 Labi osht me nje semundje,  e dje i kan fut ne liste esenciale barnat per at semundje....per te cilen Labi… 
 Nuk ka qe ju kfill sivjet, e boll keq. ☹️☹️☹️
 T'kom thAn per montellen, ne fillim t'sezones....o zoteri.
 Neser vec mire pritet prej tij hahahaha
 PAN-i s'i ka numrat as per kete pauzen dy oreshe a? 
 Nuk eshte muskuj, shiko golin e dyte...
Opel Astra e re :) 
Zeri Auto Test :) 
E more Visar Breznica, ton jeten tu t'perkrah... 
 mos u bo racist ti, se kinezt nuk jon krejt te njejte hahahahaha
   Miremengjesi te dashtun :D 
 faleminderit Lumir, edhe une menoj si ti :P
Hajt sot, hajt neser... 
Nuk osht per me u anku  
O krejt rekordet kena me I thy bre 󾌴󾌴󾌴 
Ky burri i mire :D 
Ky dosti jem Kushtrim Morrzy Kunushevci , ksi foto profi jo asi tallava :D 
kryesore pumat "Nike" ... :D 
 Kucka vec sa erdh, nuk eshte far lojtari apo talenti per te ardhmen...menim i jemi gjithmon :)
 suksese ne sigurimin e mbijeteses
 e kena ndrru "qata" :P, i mocmi.
 e kena ndrru "qata" :P, i mocmi.
  hahahhaha e mire ke kjo...
Dy, po dy per qefi :) 
 penallin nuk e pa e faulllin po :), referim i mire a ?
Elod Siqani   pershendesim grate te shpija. 
  Viso, kur e marr shperblimin :)
Don Kadri Corleone (Foto) - Aktuale - Zeri 
Diplomat me pedigre qe 3 gjenerata :) 
Lumir Abdixhiku kaniher mire e ka :D 
 e Pipo po don  me u bo Ferguson :)
 Gjithcka ne IPKO Menu! Aplikacioni me i ri per Android qe mund ta shkarkosh ne Play Store:  .  …
 Bravo Inter    edhe nojkon tjeter qe kom harru me e cuc ktu :)... pernime BRAVO!
 shume i forte je babush.. :D
 Ma shtrejt u bo me mush telefonin me rrym, se me impulsa. 
 "Status Update"- Rubrika e re ne . E nisa vet. Mendimet nga rrjetet sociale.   
  nuk po ju dhezin dicka 
  masi mourinho nuk ka mujt, allegri shanca s'ka :)
 Pamja e Prishtines per  jashtezakonisht e lodht! Shije dekorative kiçi. Jon bre do sene qe lypin pak pare ...
 I tmerruar e i trishtuar nga dhuna policore sot. Kam mendu qe policia e Kosoves eshte polici shteterore e jo partiake  ...
 se ky i nxeht nuj u ardh prej Kineee...
 je nifar papaku ti :)
 biroll qa ke ba ti
 ti i din mas miri, vec propozim ke hahahah
 tkisha thon ma mire terasen :D, se vec katunarte po i bojn dy kat
 jo joo, po ku je mo Dajo?
 burri jeeem loqka jeemmmmm   
 si jeni a jeni mire shpija juj
===