 Link per konferencen per media te Messit?
 Ma ardh me lujt per qytetin e vet levizje e keqe per to po tdoket ? Super i motivum osht per me fi… 
 Qka u bo o fansi ma i madh i Westbrookut qe e njoh?
Vetem 4 muaj ne pushtet, Kosova behet me detiFlm kryeminister 
Sonte nata e Leo Messit pa pike dyshimi. 
 Ka 3 golla qdo jave i hajna me kit formacion bal
 Maldini sbon asi blerje alla Bertolacci sma merr menja, nese e merr dikon dije qe e ka skautu moti
 A menon qe osht ma e fort superliga e kosoves a liga e maqedonis kshtu ne baze te cilesis tlojtarve edhe ekipeve?
Se du asni kuk nese nuk osht kuki i saj 
 Lukaku e ka meritu edhe best striker per mu
 Hahahahahaha n'kohen ma t'mireeeee
 Kosovari talent Gjon Muharremi sot u vleresua nga profesionistet e gjithe Evropes si me i miri ne Eurovision, ndersa shuuu…
 Fanny Naguesha, se mi qeli syt me mengjes 
ka ngjyra tjera po rahat jom zi
 Dhe te gjithe jetojme te lumtur si n'20 vitet e fundit a...
 Per shkak qe u qel ring malli sot u bo kshtu se sbohet normal
 N'zemren tane pergjithmone :$
 Per me ardh fillimit i mujit brooo
  Fol ma shpesh bre hahaha ☺ 
 Na ma n'fund po kualifikohem n'ucl edhe qe qka ndodhi hahahahaha
 Ska lezet pa e ngu himnin e championsit bre bal para lojes
 Kishe ku e keni gjet ju ket kontrate edhe pse e keni postu. Konfidenciale nashta osht per ministrin e jo… 
 Insajderi e ka publiku ni kontrate prej kompanise Pfizer per 500 mije vaksina qe Arben Vitia nuk e ka ne… 
"Mediat jane armiq te popullit".
Mue mos me llogarit 
 Po aj e ka than n'at aspektin qe smkan ftu me votu, po nejse
 Thjesht me u ule me ju bo thirrje me votu. A e pe qka tha Xhavit Haliti? Sjom kan ndijeni qe ka seance sont… 
 Albini ka faj per kete pune, se nuk u ule me fol me asni parti per kete pune. Folke veq me tweeta thojke ja… 
 E kan lluksin me bo qka tdojne
 Dy t'part jon shkarku prej Kurtit, te tretit ju ka lu koqja me tmadhe nkuvend prej Vjoses, ja ka jep e ja k… 
Na mungojne telefonatat e tij gjate pauzes t'kuvendit 
 Nese i arsyeton veprimet e fundit te VVse, je veq nje militant qe as VVse nuk i duhesh.Une nuk e votoj mo nje parti qe p…
 Edhe kur u kon n'vv n'mandatin e par u kan katastrof
 Urime edhe tjeraaaaa ❤
   Din me kon i mire kaniher bre qr
  Shko n'kar edhe ti 
Apapapa flamura t'Rugoves n'tubim t'Vetevendosjes 🤦‍♂️
 Po qashtu osht o burr, shko pak mbrapa n'histori hulumto per kete sen, mos fol veq n'vija t'trasha.
 E presim nji thread prej teje per kete fjali te Lumirit
Sa i bajatshem ky Rron Gjinovci
 Veq per veprimin po foli, osht' identik sikur kalimi i kd-s prej okc ne gsw pas humbjes drejt tyne k… 
Vjosa Osmani ka bo levizje gjarperore sikur Kevin Durant
 Qfar lojtari bre ejjjjjj gjynah me kon lun
===