  Sedi kush eshte ka te fton ty bre! Edhe me çfare kompetence fol ti per Kosoven, ose per… 
 Ti kritiko kur te duash, as qe pretendoj me ti ndal fjalet e sidomos ne twitter-in tend,  por s’eshte kri… 
 Mundesh me shkru çka ta don zemra, veç mos bo propagand koti. I kemi edhe experiencat e UK, kur ke mujt m… 
  z.Basha megjithese vjedhja e votes eshte evidente, por nuk duhet ti djegni mandatet per… 
 Nuk ka asgje te keqe me te pelqy nje qytet, deri ketu jemi shume OK, por,a ka mundesi najhere me  be n… 
 Çka eshte ka ndodh? A po vaksionohen grupmosha qe nuk jane ne listen me prioritet nga Ministria. Une perso… 
  Ti sem kallxon mu as kerkujt hiç çka kam bo per vend! Une nuk i shfytezojne taksat e taksapague… 
 Keto foret e Pro-Amerikan e Kunder-Amerikan nuk jav han kerkush more ma. Populli ju ka tregu vendin p… 
 A e keni lexu JU tweeting e Grenellit t’juaj a jo?!! A e dini ju çka keni nenshkru e me kend? Nuk po… 
 A ki naj reagim per Grenell-in oj ANAListe. Le Doniken se fantastike eshte. Sorry, ama KOT ishe!
Çfare matrapazi BB, ende mendon qe kryeministri i Kosoves duhet mu zgjedh prej ndonje ambasadori, e jo prej qytetar… 
 Marreveshja e Washington-it ka qene e ketij lloji qe ti per pershkruan. Veq edhe b*tha e Kardashian ç… 
 Çdo dite e me teper po vertetohet se ne Kosove ne 22 vjet ishin ndertu vetem kasta njerzish Servil, Infe… 
  Nese e ki parasysh per çka perdoret VK ne Shqiperi, ky bash VK gazetar eshte! :)
Paska mu deshperu shume  se na pat lodhe tu thane: Duhet me dhane diçka, duhet kompromise, ne tavoline… 
  Kur pe shoh ne sojin e kujt ka mbet LDK-ja e I. Rugoves. Kur pe shoh kush ka qene amn… 
  Z.Kryetar, ne qe nje kohe kemi lobuar e votuar per JU, folni me at lopen tuaj… 
   Buzhica m’ka blloku edhe mu si qytetar i thjesht veq pse s’eshte pajtu me mendimi… 
 E çka bete JU qe kete ne qeverin HUTI? E bete nje pako kinse “rimekembje ekonomike”, kurse ju shpernd… 
 Ma Hipokrit se ti, ma kot ambasador se ti kurre s’mundesh me gjet. Ik, se na keni marre ne qafe me s… 
 Me shume se 60% e Prishtines kane votu VV. Po mendoni JU, qe kthehen njerezit edhe e kthejne LDK-ne pra… 
 Eshte kogja progres i madh. Nga shkurtimi, coptimi, bosnizimi iKosoves ne shkurtim te tweet-ave.
  A jane nen kontroll rrjetet sociale te MFA?  A do te duhej nje gjuhe pak mediploma… 
===