 Le bre mos ha mi than. Se vetem ne qato 100 mil jeni met a. I kini vjedh e stervjedh e la e shperla… 
 Jepi per vitra e sadak.
 Deri at koh kur mas pari i nzirshin biletat e kthimit ma autobus gjashtve e u bojshin gati ni muj perpara per me ardh sheher.
 A tpafsha hajrin. Per kit mandat nuk po flasim se edhe per 2-tin e 3-tin jam shum I sigurt.
  Tka hi nkry qikjo 210 milon turqve. A k diqka tmir kjo qeveri a edhe kta po get hajna si hadhimi… 
 Do do henez i ki idhnushem qe ju kan shku pobratimat me votu ne shkini.
  A kemi drejt me shku vetem boxerica me ja kajt nanen.
  Referendum per mos me pas shami po edhe referundum mos me dal cullak.
 Deri dje nsna tona jan dal me kulen e shami se di qka hamin kini qe ju ka qu zoti pesh e jeni kap pe… 
  Ec zotni therja. Cullakun po na ekane. E kur te kem cullakun ather duher me ta kajt edhe… 
 Krejt irregullum tash jena per perqamje bravo ju koft. E ai qen qe e ka nis kit pun i pari me ba perq… 
   Boll i kemi do bija qe sillen neper  shum desh se ves… 
 Ky se din se si doket pes euro se si man nkulet kurr. Su msu ky me 5 euro. Vete per naj 500-she 1000 apo be… 
 Jam shum I sigurt qe qmimi I naftes do te jet me I lart se sot ne vijim
 U desht me pyet Albini se si ka ardh deri tek aj vend pune kjo zonja. Nese nuk e din se si e ka fitu a… 
 Kombi Kosovar kombi Gjakovar kombi pejon kombi llapjon e hajde hajde. Ska komb Kosovar po ka kom Shqiptar b… 
 Krejt kta qe jon ne sherbim te shkinis duhet me ju kajt nanen plum lul tballit. Mos e bir zot mu nis luft… 
 Ky nuk eshte shok i vuqiqit si kta tjert. Nuk kan me qka me shantazhu sikurse kta tjert. Ska perzi me shk… 
  E sa per koqe un Jam qaj pidh nane qe e ka nzjerr hakun e babes midis beogradit.
  Spo lypi respekt prej kerkujna qka kom bo skom bo veq per veti se lufta su kan vetem e imja.… 
  Dash me kuriz dash pa kuriz tre vllazni i kom dhon vet jom i plagosun kta e kemi ba per komb… 
 Un ti qi fet kur vjen puna te kombi  e per pedera sni hiq.
 As ni fe se lejon degjenerim e mos hani mut te paditur me ba perqamje. Kuj ti qihet le te qihet me kodo kus… 
 O kloshar juve qe boni perqamje mes feve pidha tnonen tregoni kujeni tja u hjeku flamen.
   Na e ke tesh vlla ungju nto
 Valle ja ke huq ku po e din ti. Mundesh me lind me dy gjini  po prap bulash nuk lind as lezbejk nuk lind.… 
 Le se ska kurgjo prej ksaj pune. Qelsi me qels nuk mshelet po mos tja fusion kot.
Mushni kerret se hypi prap 
 Lejen e blen prap kti duhehe me ja konfisku kerrin. Se kerri sesht per hajvanat
 Henez po I nihet zani ati. Idiotat skan ftyr
 Do dove henez ju ka met e do e kan me gjene qe pa ju fol serbisht si knaq.
 Edhe un kisha pas qef me pas baben komandat se kogja do pare naj kish lan edhe me pas shku nhag. Kta i k… 
 A qi kini qef me I mbledh per shkini i mledhim bre
 Nese e zhvillon shtetit e ki ndash gjihad ndash sadaka ndash vitra. Kur e ki shtetin e zhvillum ski nev… 
 Mos tjerrni lesh ndash me dhon jep mos dash mshilne gojn. Kosova as nuk eshte e Albinit as e ramushit a… 
   Kur I kena dhan per hajna e dollovergji e matrapaza edhe  tash kemi me kontribu… 
   Per sa dit mblidhen 10-15 miljon.
   Pse a ska Amerika e Britania buxhet per ushtrin i nderum. Tmujsh me kontribu kon… 
Vetem sot qmimi i nje fuqi eshte rritur afer 9%
Mushni kerret naft e benzin se ka me hyp me tmadhe 
 More vetem le te hin se edhe pa O e pa A bon vetem Kosov.
 Nuk po e di as kush je as tek je veq mos u mer me sene qe stakojn.
  Pse po thu qe prinderit e kan obligim e jo shkolla me ta efuku thmin. Shkolla e ka per obl… 
 O zotni a e din sa thmija kqyrin internet e shifin turli far masakre e turli ndertesa tu kall. Si t… 
  Thuj ktina qe ka than aj, qe ty me than qe ti mi than ktina qe ky mos me t'than ty qe ska Nato.
 Na kur skena me mledh men per do lajka tpshurt qohesh e shkarravit. Marre marre. Merru me diqka qe t… 
  Qitash e ke fliq.
 Nese krejt vllaznija jene kthy e kena luftu kthehemi prap qata qe jon gjall. Se nja 3 ja kemi fal Kosoves
 Mir hiq po qka me bo. Duhet me dal protest se dikujt spo I mushen xhepat.
 Ku I ki njerzt pa edukat edhe ne Paris me kan ta fliqin
 Qikjo as copy paste nuk eshte. Kjo esht edhe ma e poshter. A gezetart e sodit ti maj me karamela e lepistra.
 Po po veq qe edhe 20 vjet na kan  me nal hajnin e korrupcionin.
 Denimet jon per njerz e ktina qe I doket veta shtaz ather ka drejt. Se lopa komunikacion nuk denohet.
 Se di a je ne dijeni se Kosova ke ka coptohet prej ati djalit tpolarit per me arrit qellimin e shkinis t… 
 Valla na e ke tesh. Ti aktivist i kujna je bre? Se si po vjen puna  me ju pergjigje komenteve budallaki… 
 O kadl bre qfar zarzaveli e kini. Qka jeni qu pesh  bre. Hajt a po bahesh djal i mir e me kallzu s… 
 Krejt parlamenti i lvv koka. Spaska opozite hiq. Krejt hajna kta te VV qe 20 vjet e kan vjedh e mjel.… 
 Pom doket kta hajnat tjer pdk ldk aak e kan votu kit ligj para se me kan LVV ne pushtet. Tka dal mall i… 
  Fort i kan tavat e mira
 Ti Besnik deri dje sje ni po ku ke qen kur kta hajnat qe vjedhshin me laps e paushal. Ku jen kan deri dj… 
 Zoti jau dhasht ment shoqeris civili qe jon aq te padijshem dhe kan shpirt ti distancojn.
 Bash kisha pas qef me dit ju gazetart ka sa i mermi bre se jeni bo miljoner. Vetem orat ju kushtojn ka 3… 
  Shko ne protest edhi ti tasht. Kur po e lamj me dal. Vlla mos na bo perqamje fetare aman… 
 Arber vetem shtetin henez se kan bo pron private edhe ata kogja ngat ken po faleminderit Albinit dhe Zo… 
 Kishin me transmetu live prej stacionit policor
 Ky edhe mu tranu se kopje e Albinit smund bahet se Albini si ka shokt si qiftin e berat klosharit. Po kti h… 
  Krejt me pas kall nuk krahasohet me ata qe e ka dardan lopa me e  rreh policin flakaresh. Po… 
 Pom duket qe hasha ma shum paska nejt neper bordele e night clubave ku cocaina sherbehet si desert.… 
  Kur ta vjedh shtetin popullin ta ka qit ndy gujt. Mas pari e vjedh popullin e masandej e shkatron shtetin.
 Po normal qe nuk ka shtet me hajna mu per atë arsye ja kemi dhan hunve me vote. E kush u bo me fol per hajni o zagar o zagar.
  Se di kujna i ka hi veq ktune qe ju ka hi si ksajde.
 Une e jam  fotografu  me python qe ka qen i gjat nja 4,5 m. Qe don ta qoj foto. A pushimet 2018 kam qe… 
   Mir masi sja ka nis per golf apo fotboll apo basket.
  Besnik qka ke ba ti per Kosoven vetem ni rast un ti tregoj 100 e fiu.
 Noll a po ju duket veta Jesus me ba mrekullina apo qka? E per me kan Jesus duhet me pas nanen qik
   Besnik a ja kajm nanen Albinit se ky esht mu ai qe e ka pru Kosoven ne ket gjndj… 
  More ty tkom mar per djal tmir po mos u bo pis e me u ba ma I poshter se ramushi. Mare eshte.
 Paj spo lujna qaq sa keni lu koqe ju me ata qe e kan shkatru ket vend. Nime ku meter more. Do edhe jon hup krejt.
 E kush mi lexu 3 dit. Kta sti kan lexu edhe per ngjarje ma te rendesishme e po tlezojn per energji.… 
 Menova diku kah Libani se per qi ndodh te na 2022 me i shpal luft dasmorve kjo eshte katastrof
 Un i kam pagu krejt e su bo nami. Po trunin a mujt me ja çblloku se e ka pas me pin e i ka hup.
 Fort kan qef kta thacicat me thith.
 O mjer O I mjer. Kime nvo. Shko futja pordh.
 Jo se sprishen raportet me vella vucicin per pervjetorin e masakres se Reçakut. Turp turp.
 E bab he bir. Kur kish ndodh kjo me pas kan hasha presednik. Kurren e kurres. Ku shpirti mu knaq kur e pas… 
 Gajret berat se tu ka dhan mundesi me votu anej kufint te Kosoves
 Sot ata qe jon kunder shtetit lypin stupc. Ata jan fatkeqsia ma e madhe e kti veni qe ja kalojn edhe vucicit.
 Kush eshte dritoni selmanaj?
 Jo spo vim se se ska kurgjo ndobi shkinis.
 Eu qi smiledhem men kur. Kur mos me guzu me tregu qe Jam autokton token time. Po kush ju ka faj qe flen… 
  I nderum qka me bo Albin Kurti sipas teje. A me I thon shtet I pavarun e sovran apo pokrahina serbije
   Qka preferon ma teper taxhi apo detelin.
 Jebo vas krst terorista ludog naroda.
 Ky tipi e paske udhen te dy ant. Po sa kompani kan prodhu vakcina dhe vacinat sjan tegla me I mush tu… 
 Zvicer punon teleferiku por edhe populli nuk rrnon ne fukarrallak. Atje punon ligji si per tfortin edhe… 
  Qka u ba vlla per 8 muj. Po Keku stu ka shit para ni muje. Tjeter pun esht qe i kan met k… 
   A ki naj pun o vlla a nej obligim. Shko vlla vizito naj te aferm te familjes… 
 Kta me qu te psikiatra be pot boj qe prap ne  klasen e  par ta kthejn. Zot runaj met e runa prej qiftit tganes.
 E kur tqohet Peci ather bohet hendek qe ta rreh fundin.
 Fajet i kan gjakovart qe e lshun krejt. Se perpara sa e kan pas ndor gjakovart qiftja e sajna mas pari e… 
 Moter mos  tka hup marje ty e qe me gjet kta. Kta porno  as cullak sjon. Mu drogirat jo tenderar miljonsha… 
 Se di veq botoxin e fillerin shyhretja e kish blloku deti 2023. A shumica jan motra prej mjekut. Tona hune… 
 Jo kjo eshte katastrof. 2021 me I terhjek paret e trustit se kap truni e le ma me marr vendim. Eshte o… 
Shum e komandiri e ish kryeministri e politikani e servila  e pobratimi jon ne merzi qe Amerika ja paska shti dosta… 
 Medemek blena se na shitemi do ma lir e do ma shtrejt mvaret prej llomit. Ky tipi jena ba me hashen… 
  Gabim fatal shansat qe kerset shofershajma jan 98%
 Veten te na ndodh qe budallakija me u pagu 8500e nmujt.
 Shum Jam i sigurt qe t'ardhmen kemi me leviz pa viza naj dit
 Sedi cilit komandat po i drejtohesh. Po me kon ky rahmetlia gjall ty tkish njek me lagraqk E kta hajna… 
  Se paskem degju e as lexu se si percjellim ato pordhtale te perkthyera prej shkinishtes ne shqip.
 Poj se ka keq se edhe Maradona e ka pas qinis nje me dor 1986.
  Mos e bir zot me punu per ket tipin. Ky po te qitka penzi per 6 muaj.
 Ky pi lyp punen e 20 vetve me ja kry 4 vet. Ky paska rshit. Un mi gjet 4 vet qe i kryn krejt kto pun ja… 
 Me ne fund. Dy vjet na u deshten me luft me u thy kufirun me shkini e 22 vjet na u deshten per me largu… 
 O vlla ktyne duhet me ju dhan hendek se tybe kta nuk din e as nuk kan ni per kod etik. Kodi etik per… 
 Ec burr sa ma shpejt ne politik se shkum per lesh. As pulat spo bojn vo ma.
  Sali me pas dit nana jote  qe bohesh kaq gllup te kish lan spital. Ty po ta kthej srbisht se p… 
 Kadalni bre hora po ku leshit ishit ju trima kur u fal qakorri e  perpak u da Kosova e kur u formu gjykata.… 
 Ngushllime e zoti ju qoft gajretin.
 A ka turq ne Kosove? Mu ma mer mendja qe jan shqiptar te asimilum. Une turqive ju kisha dhan aq shum te… 
 Tjera her qitni njerz adekuat  n'dashi me ju votu. Me qiftin e agimi  ati gllupit te mitrovices edhe un… 
   Edhe ata pa koker bakshishi
  Nuk guzon deshmori, luftetari, invalidi, jetimi etj rtj te keqperdoren nga askush ata as nu… 
 Ksaj peles e shum servilave qe jan ne pdk veq 2 fjal ja kisha than . Me pas fol keshtu  nana apo baba j… 
 E vlkau i ti qojke njerz e mlypke haraq te kafet e vogla. Smujten me marr haraq ma prishen rrugen perpara… 
 Zotni ja paske huq me tmadhe. Familjärt e mi jetojn jasht po u paguajn rroga 250 familjeve, i mbajn ma s… 
 Nje Jam shum I sigurt qe Albin Kurti kur nu ka me shku e me u perkul para teroristave serb qe kan vara s… 
 Jo kta te ton i kan tkryme me fakulteta e me tema diplomet per 3000e po gjimnaz nuk e kan te krym.
 Katastrof. A ki more internet ti ajo. A je met tuj e prit vizen per Prishtine.
  Tlumt Donat kqyrin mi ndreq dhomt me 100 euro dhom e 5000 eurove.
  Ska pas nevoj per hemo hiq se i ka pas kta skenden dullen musteqen
 Mos luni me ndjenja tfamiljarve per shkaqe politike. Nese nji idiot lufton per per poena polike mos u boni… 
 Shiba u kall krejt. 230% edhe e krytem per sot.
   Paj neper xhepa tvet spo I shtin po ja dajn popullit nkrahasim me kta tjert.
 Vetem krejt diqysh ama qebapi sbohet prej krymave
 Qmimet jan duke u rrit ne te gjitha vendet e botes e jo vetem ne Kosove. Duke marr parasysh qe Kosova ma… 
  Se di a e din luta qe kto jon zgjedhje lokale e jo nacionale. Po fol e rruj vo i thojn ksaj pune.
 Paj tybe kogja do banalista e do parlamentar kan pas than. Ma shum e kan pas prej tute se po ju pri… 
 N7va qe dikush kush e kish propozu edhe ni park te dinosaurave, edhe bazenin  me lidh me detin e  Shqip… 
 Jo ministrit te shendetsis si ka met ma kurgjo tjeter vetem se me u marr me  Prishtinen te cilit i urojm sukses.
 Kur ma kollaj e kur si ne Kosove su kan me u ba miljoner. Un I kam tmit jasht qe 40 vite por kit kapit… 
 Prej gezimit qe I kan nenshkru ket marveshje as karriga skan pas me u ul. Po doket se per ket marveshje jan pajtu koridoreve.
 Lirisht merrne edhe ka nja prej meje. Meritojm shum e ma shum.
 Dhe per ne fund shum shtete ne bot  per shkak te interesave politike, ekonomike,strategjike ndonjeher p… 
 Eshte fakt qe qmimi eshte teper i lart ne krahasim me 2020 por eshte shume me I lir se ne vitin 2005. N… 
 I nderum Dimal. Spo e kuptoj nji gje. Interesant kishte me qen ta dim se sa eshte kostoja totale e furn… 
 E me qka me u fernizu teleferikat kur cdo dit ke problem me rrymen. Ma mir per toke se me met nhava.
 UÇK seshte e pdk UCK eshte e popullit.
Ramush zezaj 30 minuta zi e terr per Albini asnji fjal per vucicin
 Klikera moti se kom ni
  Kjo qelbesir se ka meritu ky tepihin e kuq,  kti ma teper se ni kese sja ka vle. Debill u desht me ta ndalu fjalimin.
 Pa ju kajt nanen dajak tybe kta skan me u nal tu mendu shkinisht e tuj fol shqip.
 A shitet me meter e me kg.
 Skan qare pa e kritiku se e kan tuten qe ju dalin  allash vereshat me me turlifar komandiri.
 Skan qare pa e kritiku se e kan tuten qe ju dalin  allash vereshat me me turlifar komandiri.
 Vlla ska marre nese je pasuru prej komandirave. Po nime ku met more u hup krejt ky njeri si mos me kan ne Kosov.
 Ky ferri tu ka instalu qe 20 vite i nderum. Se di a ske qen aktiv se qka ka ndodh apo ka fillu interesi… 
  Jo taman me bo liqe e mi pru bullicat e sami lushtakut mu la. Hajgare a.
 Mos ti kishin ba disa apo gati krejt marveshjet ne dam te kosoves kjo qe ka ndodh dje skishte me ndodh.… 
  Edhe na jemi qasi SHTET.
 Paj dy pashteta edhe mare eshte. Se tybe ata argat nuk jon po mu  ata po na e mbrojn kufirin. E po… 
   Deri med 15 shtator ska pas se si ta vendos se ka pas marveshje me pobratimat e vucicit.
 Ata qe jan kunder jo kan naj dollover me shki jo nuk jan shqiptar.
Disi po befasohem kur po i shof shkrimet e Kimete Berishes ne express. Po me duket qe kush shkrun kunder Albinit e ka vendin te expressi.
 Ti ne vend qe te miresh me ket problem aq serioz ti del e e shet mend. Shko e pyeti se pse hoqen dore. D… 
 Te paska qillu veza Lgbt
 Rama e kupton ket dhe eshte shum I vetedijshem po vetem ne duhet rritur koston. Perderisa kostoja e vuci… 
  Un kam drejt me u shpreh lirshem. Po lypka me ja ladru. Po ku ken deri dje qe 70% e… 
 Se din nheri se kujt duhet me i kajt nanen mas pari. Se na e kan lodh me ket shprehjen e lir. A qe e mer… 
 Te kush esht faji. Albini smundet me ju shku neper shpija me I vaksinu. Merre vaksin e run  vetet e run… 
 Nese UÇK ska pas arkiva skemi qka me u merzit. Po po tunna qe jon do pahiri dikun e dikujna ska me i… 
 Mjer familja per ty.
 Zot runa prej ksaj fare te felliqt.
 Ski qka me prit Kur te perzin fotbollin me shkenc. Mu sum bjen virusi se e dha goll.
 More mir eshte puna, po a e din sa zero i ka bilioni e sa zero miljarda.
   Ty tpaska lon covidi me pasoja.
 Niher mu dok si anakonda. Thash i paska honger lopt e mahalles.
 Po ku je bre bi qe sje ni deri dje. Po qita mjek kan punu edhe dje. Pse si thojshe bosit ton vjedh ma… 
 Qka dreqi kan kta burreca qe rrehen me gra. Daju more se nuk shkon jeta me zor e me dajak e per me pas b… 
 Mashkuj dhunues edhe pedofila eshte mekat  me I lan me jetu. Nuk kom facebook veq boll kisha pas qef me d… 
 Kti duhet me ja pre Karin e me tja ras ngoj.
 Vlla qiftin e tina duhet me eduku plum lul tballit
  Bac respekt. Fol bas e qite mllefin. Bac ky vend su nis mar prej 99. U nis shpija prej k… 
  Vetem mos harro se i ki edhe nja 800 000 -1milj qe jan ardh prej diaspores
  Vehbi ky shefi po don me tregu qe sa per pak jeni shit. Ai budall nuk eshte. Ai e ka… 
 Vehbi  a pe din ti cili eshte shefi i shefave. Se di veq mi than tezak kogja si ngat. Vehbi parja e k… 
  Vlla leshi perzihet gjithmon kur mafiozet zihen ndermjet veti
 Se kan hanger prej njejtes kalanic. Edheckto mediumet qe I kan publiku pergjimet duhet te denohen per ars… 
  Po nje po ta them ne mundemi te mos pajtohemi por asesi armiku im te behet miku yt. Me mir… 
  Po vlla se ne nuk mundemi me serb. Si te behem vlla me shkaun ku shka mi ka bra tre vllazn… 
    Vehbi mu tu permend emri e mos me reagu/demantu diqka spo shkon. Po nd… 
    Donat ja ke huq krejt. Prit edhe pak e i qesin nja trjetrin per me psh… 
  Jo bre vlla mos ja fut koti. Nuk ka urejtje nga ne po eshte ai qe ju e votuat qe po mbjell… 
 Vetem Albini po na bon zollum e po na prish me pobratima.  Demarkacioni, liberalizimi, gjykata speciale… 
 Paj nuk eshte hera e par qe ngohet ceca ne Shqiperi. Paj kam pas raste qe as shqip sna kan fol ja fu… 
 Po me çudit sa afer me Albinin Kurtin! E pse se ka perqafu vucicin?
 Vlla nese i bon kto propaganda per pare ather trego Çmimin e te paguaj une vetem mos shkreto. Vlla nuk… 
 E qfar zgjidhje me ba sipas teje. Me dhan krejt Mitrovicen apo qka. Ju ne vend qe me I dal zot kryemini… 
 Pse bre vlla nuk po bohesh fer e me than kta matrapazat e mahershem qaq kan ba dam saqe ja kan lan kamt… 
 Kto jan pasojat  e qeverive qe kan menu per xhep e jo per shtet.
   Pom doket fort ju ka mar malli me ni kajher me ju than cuti bre.
  Ma mir merru me hashimin se zoti nuk esht Mac me te grith por si dihet kur kah tvjen. Allahu alem.
  Moter me kan praktikuese e fes dhe me perkrah nji njeri qe eshte kunder vatanit vet is… 
 Dhasht zoti qe kjo te jet fatkeqsia e fundit. Ngushlime familjarve dhe zoti jau qoft gajretin. Te lendua… 
 E i lumshin durt kush e ka bo. E ju pas bo mir.
 Po bre po nese nuk fol si ka shan me dialogu. A me fol me gishta. E si duhet me dialog me shkinin duke I t… 
   I nderuar Besnik. Qka me bo sipas teje. Cdo her kur historia eshte haruar ajo eshte… 
 Se di a e ka pyt vucici Albinin se a din shkinisht
   E the ti si e thej un athere respekt per ty.
   Vlla sja futi paushall, ky esht fitimi brenda vitit 
  Un a.  J zotni une jepi. Un as ni cent se mar se shyqyr zotit nuk kan nevoj me u shit.… 
 Vlla nese e ke porosit hashim permes aliexpress ather ty ska ardh paket hiq jo tka  shku dika tjet… 
 Kjo eshte pip i gjenerates tvjeter
 A bre mjeran marut. E di qe keni deshir qe tish kan hashimi me pas shku ne Canne me vucicin perdore dhe… 
 Per mas lufte saher qe tbjen shi un dal per pershkim nkorz
 Po edhe kjo pjesa e Albinit e ka nifar marifeti eshte nder tparet qe e perfaqson Kosoven me familje as… 
 Kadal bre zotni se prej odave kurkushi kur si ka kesh se sa meshlizi u dal prej odave vetem historia f… 
  U desht nashta me marr leje prej beratit.
  Po berati nuk eshte kinez me e pas familjen gjys milioni votous. Po le mos ja fut najer edhe ti.
 Ktina qka dush thuj veq shqiptar jo, e fara e kti lloji te individave  hupt fare. Po men me than 500 genca… 
 A e kan pru sallaten prej Afrikes apo qka.
  Sjem fort larg . Shendet
 Jo kto i ka ble lamushi. Ska edhe pak se tyben ti ka ble ma nese shkon si u nis ky ka mi pas dit e numrume.
  Ne Gjermani i keni 3 korsi ndersa ne Kosove i kemi nga 2. Gjithsesi te del ma shtrej ne kosove se ne gjermani.
  E tash kqyre sa kushton ne rajonin e ballkani dhe krahaso me Kosoven. Dhe sa her mbrenda vi… 
  Ski qka me bo llogari o vlla. Sa pguhesht ti e sapaguht ni puntor ne Kosove. Sa pagun tatim… 
 Qartet por e perqafon asfalten me te du durt
  Ku je tu jetu ti bre djal. Po syt jon me e vesht me ni.  Paj si mundet me te kushtu 1 km as… 
 Ky e ka budallakin me vule. Vetem nje e di qe bone me I shku Albini ne tv7 edhe nji her ka me shku me… 
 Albin Kurti ka lind Nana vetem nje tjer ska. Imitimet e klosharve sqojn pesh shum. Vetem per me u habit ku… 
 Paj ste koka edhe aq shtrejt nkrahasim me   kravatat e lamushit
 Boll i hjeshen i zoti i menqur veq kush ja ka inati. Kjo foto me kit djalin ktu sken e filmit ?
  Mos I ofendo qent duke I krahasu me turli individi te lutem.
 Ciles opozit bre. Po krejt votusit e opozites jan  me Baben. Ska prej ksaj opozite kurgjo hiq kan me shku per lesh.
 Dit e numrume i ka edhe ky far matrapazi. Ky eshte nana e hajnis. Veq hashimi ja tejkalon ktifar sh… 
 Le bre se kloshar. Budallakija ma e madhe eshte mi pas kursimet e thmive ne krypto. Mirrem me shitje e b… 
 E moj zoj qe 22 vite kjo loket pret drejtesi e prijsi juv i shejt shkojke e u perkulkae para shkive. A… 
 Qajo gjykat tu ka votu ne parlamentin e Kosoves e nje prej tyne qe e ka ngrit doren dhe I ka obligu edh… 
 Jo bre UÇK ska vjedh po jon do kumundonta e disa antar te partiave  qe ja kan kajt nanen e kan gju fukarra… 
 Mos me pas brush te dhembve i kisha la me brush drrasave. As mumiet si kan gojen ne ket menyr.
 Urime dita e gjinis asnjajse
  A gjini asnjajse e fare dalshit. Po se ka lan as zoti e as natyra. Po hajde bre bir muno… 
 Tuj prit ne rend per vakcina a qka u bo kshtu.
 Veq lezet ka me qen kur ti fusin edhe do kumundata nquz.
 Mos koft sahi eshte e vertet.
 Qka je ka bon bre. Sasmuna me zhingirina aaaa? Aiii djal shkum per pushime ne Gjakove. Ju pas bo mir.
 Vlla vetem hasha e din se me qka ka kontribu tek ka arrit aty ku ka qen. Ne vlore u ngul shtiza e pare.
 Sagllam u kan I pit
 Paj une kta e kisha vet per botox e filler a e ka blloku tregun me kto bijat e mushtishtit.  Mjerr… 
   O shok ma kadale se ka njerzi qe ende trunin e kan ne pauz prej vitit 200… 
 Ky tipi su ra hunlesh se sja lyp mo kujna. Idiot pis individ se mi than burr eshte shum.
 Jo po valla all money ander kontroll. Ky ka me dek e sherin ka me ja pa edhe nja 3 gjenerata
 Aj po mendojka serbisht e po fliska shqip.
 Paj opozita e ka pru ne ket situat Kosoven skan qka thojn ma shum. E sa per disa  banalista po get po ju… 
 Vehbi mos po e nin veten te ofendum me kerkesat e Albin Kurtit. Dil bre burr gjuje me vo. Lidhi koqet… 
 A ki fakte o vlla e mos ja fut pordh.
  Kta sjon te gerrditshem po nisen prej asaj te tuti sa sna ka kap. Se kta tuten e kan ne palc prej Kutit 1.
  Jo be kta as klikera skan lujt jon kon zon tu thith lepisra
 Krejt fajet i ka Arben Vitia. Po kqyr me I shperla paret.
 fort mir e ki Vehbi se sheri i Arben Vitis edhe bitconi  ra sot gati 20%.
 Berat opozita ka kalu neper disa pordhtale tash kur ne parlament e kemi opoziten e coft. Nji duhet ta keni… 
 Shpirt i lodhur nga vuatja por shpirt i fort per ruajtjen e nje jete per ta shijuar lirin.
 Berat e je ne dijuni se si shkon puna e vaksinave. Kosova edhe me I pagu miljarda euro nuk mundet me mar v… 
 Po bash qashtu esht qysh po thi ti berat apo? Krejt sallat e mushta me krushqi ka 2-3000 vet. Se pom doket… 
 Urime Berat Presidentja e Kosoves
 Urime e suksese Presidentja e Kosoves.
 I fort je Donat.
 Apo mos kish perfundu edhe kjo ne vetvrasje si Dino Asanaj. Pse bre spo kapni aty ku jan vjedh milionat… 
 Rroft berati e vehbia po sdi qka kish bo Kosova pa ju dy. Po juve duhet me ua maru permendoret per se… 
  I ka kap tuta hajnat e matrapazat.
 Hajde bre mos na e lodhni prapanicen qka dreqi jeni tuj u tut. Mos me pas te drejt vote neper ambasada… 
 Berat qka ka tre, te hashimi a jeni kan ma frik a qka I ka punt . Spo vrehet mungesa e hashes. Se na lodht… 
 Berat ka dul ky skrim. As ne mediumet e shkinis nuk kam lezu kso krahasimi. Me pas pas Albini pushteti pre… 
 Qka leshi jeni kap per Palestines. Sa shtetet muslimane e rethekojn Israelin edhe sjan ne gjendje me bo di… 
 Berat si me kan i punsum ne gazeten Blic. Kajher po mdoket qe ma hije i ka me ta kthy ne at gjuhen e blicit.
 Po bre veq qaj 2milionshi po mdoket po jon ma shum
 Nat vakt ndertimet me leje
  O vlla a je tu e dit se qka ka ndodh ne at pjes a vetem po ja fut prej kornerit.
    Ti prej Kores po shkrun apo ?
 Edhe ata  me fshise.
 Ska me ko lun se me ata qe ka lu gugjaz e kan shti nquz
 Ne e festojme fitoren e VV, e festojme Baba Kryeminister, e festojme Vjosa Presidente dhe e festojme diten e dashnise.
  Le vlla se ska faj kurgjafi, temperaturen e ulta ja kan qit elektroniken ne off
 Berat sdi qka te te them. Ishalla zoti qon ilaq se kogja fshtir po doket gjendja.
 Dulla ke me voto per 127.
 Wow. Pirolla ju qoft. Ne qka vim neser po na shtikan nquz.
 Berat a sken qita drenicak qe ta rrasen baben burg nkoh lufte. A nashta eshte faji i Albinit.
   Fort jom shybeli qe berati ka hi tripa gjinis asnjajse
 Berat kur ski qka I bon magarit i mshon I mshon samarit. Nese dikush ka rehh e ka vjedh e ka ble e shperla… 
 Kursesi nuk po mundet te pajtohet me vendim qe e ka marr. Se di qfar jete eshte kur e ki idol Albinin dhe… 
Berati e vehbija mos mu pas kap per koqe te Albinit se di nkoqe tkujna ishin kap. Fort inati ja kan. Kta jo e dojn… 
 Ky ka ma shum qef me pas pun me exhel se me Albinin
 Njerin e kishin nis per ne Gjermani edhe shansat qe pshton jan shum te vogla.   Po I raset te hunt e po p… 
 Po a mundet me kan ma skandal 2 shpulla se tentim vrasja e sami lushtakut.  Puna e samis u ba lajm 5… 
Perhajr na koft fitorja. E urime Kosove. Shifemi me 14 Shkurt. 
 Fort hajgaregji I fort ky hoxha.
===