 nashta muj me tndihmu, per qka o fjala ?
 E, a ish cekt deri n'fell?
Spo di qa me bo me ton kit koh tlir
 harro qa thash ma heret 
Tuj e knue majlli sajrësin
Qe dy or jom tu dasht me flejt
 ka plot asi qe kur tfolin e prishin qaq shum sa qe stdoken tbukur ma
Po veq diqysh si m'e u kujtu
Pse po i len kto sende me tmundu ?
Hajde Dada Sale mledhna n'qysh t'qymezit, qit najsen me ngjy
Cfaree budalle, cka jam ka lypi ktu veq vet
 Tmerresisht i lumtur qe te gjithe shqiptaret i kane shpetuar termetit ne Nepal, pas frikes per pranine 1.8 milioneshe ne…
 budallaki ish me jau kthy fjalt menihere hin nyoutube kqyr naj film tani mas filmi nese ki koh
...mrena diqka pom mbyt, pom vran, ama jasht diqka ma e madhe, e pamposhtun gjall m'mban!
Sa pamje t'mire ka mar qielli, te ep shprese kur tnjajten ta vret. Kur nuk mund t'bash asgja nt'toke me sy lart zgjidhjen e pret.
Ka vdek njeri e kta shkojn i shkrujn nmuri 'ngushllime shoki ishalla nxhenet...'
 hic pa bised kaniher ndo raste mjafton mi pa do statusa tmahershem
 Se ki gjithqysh me sha ish fm/fr breee, thuj sna shkojke u prishum edhe kurgjo kerkujt
 what ? mi shtuuuu ?!! pse se kom qit problem unnn 
": Edhe kjo nsami hahahahahaha  hahahahahahahahah 
 nuk e pata per rrjet se un njoh plot njerz qe jetojn nprishtin edhe spagujn rrjet. Ama qe the si nkoh tgurit. Nejsee..
 o puthe niher per mu, far sy zoti e rujt ♥♥
 ku e ki migjen ti qe kokan kaq mbrapa :o
Moti pa hi ntwitter
 Qa po i boni bre  boz fotot e mbramjes 10000000 her spostohet
 aha :((( mendova qe e ke gjet najkun nlibrari
 qe e gjon kallxom se edhe un po du me lexu
Pse nuk i dallon hejterat me ata qe sju pelqen hiq (iu shkon nerva)
 It's the Mista', Thirrum Brain twista' Se sa her' qe vi, Vi veq me sene t'krista
 hahahahahahahahahahaha pse a po u dashka mu tut kur tma bojsh mention a ? Ok mir shum ishalla tu shtohen
 se kom dit qe ki fake followersa se ta kisha bo :*
Anybody tell me qa ju vyn followersat fake ?!
Kompjuter ma tlodht sesa qiky i dajve tmi mdoket ska
 Nese menon me bo fam n'twitter me foto provokuse  se veq hor bohesh
 hahahahahahahha me dit ku ka shkoj i blej vet
 nese tu doket vetja teper i/e mir kqyre veten kur je dal nfoto met klases
 nese beson ni dit bohet realitet
 Ja me pejen ska 
 kur sosht nshpi tdoket si me kon tu nejt nshpi t'huj
 ajo me zo me krejt osht cutie
 Ska me dallu mbreti prej lypsit kur eshnat ju kalben n'dhe.
 niher per niher veq apsolventiada
Qaq e merzitne ja ka nis me kajt edhe pavarsisht ksaj gjendjeje i bjen ndermend me bo foto
 Kjo thenja : mos gjyko nga pamja e jasht me se mrena mund te jet e mir -po qfar e blen bonbonjerin sa Dera mrena i ka…
Dit palidhje, koh palidhje
 mfal sjom hejter i joti, veq m'pelqen me fol qa osht jo qa s'osht
 le tshpresojm se do jete ashtu
===