ti je zevendsu tash
shoqja jote shum pidh i mir
spom dokesh interesant ma
 spe di se s'tkam
nuk je qaq pidh sa menon.
 nejse te pishina kena
zvicrra veq ja ka thy karin spanjes
qfar benzeme o zot
ha ha ha ty edhe tkisha lan me perplas 
 un se kom pa qysh me pa ne ig
kejt memories ne snap me ta pom dalin.ok
kush kari o dardan molliqaj me jap menim hala
adelina ismaili ma munon karin kur te fol
ajo badbitch ma paska bo follow
 kush po thot qe sje ti
Kete  po e perkrahi Francen bile 1 titull le ta merr ekipa qe e simpatizoj.
 ty nuk pot vike interesant unumi heheheh mjafton me ti pa highlights
ti nuk um meriton mu.
Festa Qoqaj me unum tu i vet per tabel te shumzimit 
 Afati i qershorit hala njejt
Nese o haram dmth koka harami ma i mir ne bot heheheh 
 mjav qu lakers per basket ma e mir koka
 T'fundit e kan heheheh skan ma chl tash kena me ngu emanuelin
e kom dit karin tem fort jam kom huq
 menoj qe duhet me i pre t'shkurta apet
mos ma thini karin sen mem than 
hahahhahahaha ken tu hi edhe referat me shutu ka nja 
 me dit kurr skish shku
O   ma se e myte haqiun
 shum let jahahaha veq e qan per gjyst
nashta ka ardh koha
3 shtet mat forta ne EU prej poshtit jan te parat hehehe 
sig i ka shti 100€ ne shiba 
ma mir qija nanne parameno t'ishmi kan bullgar ose slloven 
 Hahahahaha jo hiq ama jokreativ
hahahhahahahahha tash pe di qa paska nodh njese 
Miku  i mikut tim  eshte edhe miku im
 e pa qellimshme "mendoj"
Prej 11 asnja se ki ne grupe 
  Bukur pra gjithmone kokmi kan analfabeta!
bash qysh tha  karin ja kishe hanger 
Qysh t'karit mka besu? 
ee un jo ama fort e ka shkru 
 qysh e ma tbana 101
burrat ka 30 vjet mjekrren si skenderbeu, tu mu puth nqaf rrot kara
aj perimee se gjan 
ishalla i then dy kamt roberto
ka viti 2030 qather e gjajna ni mask ne jakne edhe e kujtojm vitin 2020 na kujtohet corona ama skena vakt se duhet… 
jeta o kurv dine
qija nanen qas po man ky twiter
 ahahhahahaha moti e kom rahatu bllok
e mys like tu i ba sdi a e kupton
ra raketa. e spo bje ti heheheh pak humor klb.
Tu u ba gati se ka mu rrzu Airoplani 
 Ama mu pom pelqen rrespekti qe po naj bajn
 Na e dim qe ata e din qe na e dim qe pa ta qent sna han hahahahah
20 t'zeza edhe t'bardha 
 ma murr menja tybe hahaahah  ti je a
njana e ka mshel twiterin edhe i miss
 urime me plot merit
 valla ju kan sos
pse mu kan fshi bisedat ne insta
qa o ky snap o zi mor
po ja boj follow edhe po flej  nashta dej neser ma kthen
 ke mujt me ble te  pranojn me pagu edhe me gjymtyr
mos t'hisha me kqyr ske tu ma marr menja qe o shqiptare 
nuk je kan kurr 
nuk je ma interesant besom
  mjep stres si ekip
I keni knaq kundershtart ja keni hek na ni rrog  
tybe ja kisha qu njanes qetu ne tw 
 shaje edhe per mu
qeshtu e kuptoj qet fore  
Qeshtu kur e bajna mizen-elefant, me pak knaqem 
nashta edhe me ka pelqy pak
 ishalla ka pare me ja jap messit sen tjeter mos te ban
Tha ku e sheh veten mas 5 vjete, i thash qeshtu diqysh  nese hec mit  
nmaje t'malit per momentin
 edhe hala i lypin paret ata pleqt hahahahaha
 kqyre semin hahahahah nfund
like kush ja kqyri bothen tani rina ma kthen followin 
ko me ja nis hiking prej majit
 zerat e quditshem prishtin
 naj thej ahhahaa neser e perkrahim atl.bilbao
 Njo 2 minuta qe jon pa ma friendly pi shkepi qitu 
 Paska ra rina urime marakli
kurr sja huq para golles
po ndjehem si Andi
 &gt; Kejt reperat Shqiptar 
kurr se harroj at videon kur e ka palu pidhin unikatili ne bin qe e thirr njanin i thot hyp ne sken nkofsh pidh nan… 
 Berati me ganen dulen 2 her na 1 her sun po dalmi
Tash kena me kqyr hala qesi lojë kem me u knaq dmth kur ta kqyrim lojen, 90% te kohes kena me nejt ne telefon hala! 
me beri me emocione robt
 Ama Shpend se di a kan jap dorheqje prej ChL klubet apo i kan prejashtu, nese ato nuk japin dorheqje… 
 lajmi ma i mir kohet t fundit mos u merzit
 Jo be se ma mir me pa tu lujt Real Barqa se me pa tu lu barqa lyon
Milanon qeshtu e kan mashtru  
 Parameno ata aty te kuizi "123 Fillo" na u dokshin shume te mequm a krejt pytjet i kishin pas t'pergadituna paraprakisht
 Po u bona nervoz se gjithe baba ma bojke "kqyre fmija hallkut sa t'mequm"
 Si me bo me at programin qe livritshin gjyshet e dekta
   Kur e pat zbulu "tradhtin" e pat qu kosoven ne kam
  Kur e pat zbulu "tradhtin" e pat qu kosoven ne kam
 Koha kur Glauk Konjufca e Albulena Haxhiu dilnin ne konference per media per te lexuar hulumtimet e Insajderit. 
 Jav kisha shit bre racen e majmunav, analfabeta te karit, tan diten hani mut e i kruni dhamt me lug te kaffes, pak ju ki…
 Shqipe a juv bje naj sen taman be sojon e races jav qifsha, tan ky investim naper qytet tu ndodh hajn mut ja sen su ba,…
 hahahahahaha jojo spo menoj qe e ka ba minister a qa o ama qa kari po ban publicitet nkar injoroje q… 
Hahaahhaahhahahahahahash dekaaaa shkova posht, a sken çetnik kta a 
Paramenone parlamenti e Shqiperis mas 25 prillit deputet e VV shkojn ne Prishtin per te marr diriktiva per formimin… 
Fakt lum na per ta 
Albini tu than ne fushat ska familjar neper ministri  
===