 O Sali! Po Iranianet a kane patur ndonje rrol?!
  E qarte si drita e diellit. Vrasesi nuk eshte monstra qe ne kemi prodhuar por shteti!!!
  Me lejo te pergjigjem ne vend te Jorides!Pertej histerise qe ka krijuar ky krim mak… 
   E para! Kur ti adresohesh Komisionit Europian beje Anglisht. E dyta. Cfare d… 
 Me sa m'ka thon baba ky nuk eshte vella! Ai nuk esht perzi me thi asnji her.
  Niko! Nese ti nuk krijon mardhenie te ngushta me popullin tend si mund te kesh mardhenie t… 
 o lul. Te dalesh ne parlament e te thuash qe je aty per hallet e njerezve dhe most te artikulosh as… 
   edhe sa kohe do vijoni te na çani trapin me luften tuaj personale politike. Njerezit pr… 
  Prap  po i meshon termit "Krize Energjitike". Pordhe me rigon. Nuk ka krize energjitike!… 
 o sultan i surrelit. Vertet çmimet rriten ne gjith boten por rriten edhe rrogat e pensionet. Po ashtu rr… 
   Jo jo o Lume! Eshte gabim taktik. E ka bo mos ta zej syni keq. Ti e din qe qever… 
 O Olta! Mjaft me se u bete qesharake! Te tjeret kane bere shume me teper se ne dhe nuk po  ndihen. Shu… 
  Jepi de se lirohesh. Vetem mos u pirdh nga trut.
 Po ti o patriot? Pse nuk bere edhe ca kilometra me shume deri te Kepi i Rodonit? Pse na sjell keto pamje d… 
  Nuk gjete nanji gjo me interesante me fotografu? Durresi ka aq shum gjona qe te paskan shpetu… 
  Hajde lale hajde! Futja pordhes se lirohesh . Po menohu nji here para se me shkrujt! Kuj… 
  Asnje  nuk ka nevoj per ftes dhe as per mikpritje. Ke lujt menc? Vec nese don me u distancu… 
  Da da druzhe "betim". Kaka je?
 Po ky qenka Ceeeeeekjaaaaa!
 O Like! Mos harro qe je autor, bashke-autor i nje sistemi  ku shteti fle gjume e krim… 
 Thone "shpejtesia vret"! Eshte totalisht e vertete! Por ne shqiperi eshte po ashtu e vertete "… 
  Ndergjegjesimi vjen me  .  e ç'ben ndergjegjesimin edhe atehere kur… 
 Problem  behet jo per gjerat qe ben por per ato qe nuk ben. Ka shume raste kur  mb… 
 O Blendi! Nuk jane femijet qe duhet te edukohen! Jane policet qe duhet te zbatojne ligjin! Jane prokurore… 
 Skandaloze! Si mund te hyjme ne mesin e civilizimit europian keshtu? A e kuptoni ku jemi? Çfare do nd… 
 ne nuk do te dorzohemi kurr per garantimin e paprekshmerise se karrikes se sulltanit te Surrelit. H… 
 Nje emision qe duhet por qe drejtohet ne menyre skandaloze nga moderatorja pa shpirt qe dhunon nene… 
  As mu mos me llogarit.
 O Mero? Te siguroj qe edhe ata te cileve iu lepin menderen, te shohin me neveri!
 Problemi politilesheve si ju o mero eshte ajo qe ju kam thene me pare! Jeni pa shtylle kurrizore! Problem… 
 O Mero! Edhe ti sikur mos te ishe kurve do ishe bere kriminel.
 O mero! Meta ka gjynafet e veta aq shume sa as ne boten tjeter nuk i lan dot! Gjithsesi kur e shan ti nde… 
 Mero o mero! Merre me long se mishi u maru!. A e din ate shprehjen- Per inat te sime vjehrre shkoj e flej… 
 Majko, te njoh ty dhe prinderit e tu! Ne aspektin e vlerave morale nuk kuptoj se çfare ben ti aty?! G… 
 Lale, mendjen e kam top! Nuk eshte faji Tik Tok-ut! Po te thoja Tik-tak ti do thoje tik-tok. Quaje si te… 
 O Shukri Rama! Gezoi dhe keto pake dite qe te kane mbetur.Ora e se vertetes po afron! Tik tok, tik tok...
 Shteti kur nuk eshte i kapur nga krimi kap kriminelet por kur ai eshte i kapur i leshon ata. Si mendo… 
  Manjola, nuk te njoh po besoj qe kultures time nuk i vjen rrotull. Gjithsesi jo se je ga… 
  Obobo!!!! Tani qe ta pash foton harroje ate punen e lodhjes. Ndoshta ta shpjegon Shukriu🤣
  Keqardje!? Po jo moj xhan jo! Kujtimet nuk jane te lodhura! Nuk eshte faji tyre qe ti ta… 
  O Manjola! Ti me kujton nje komshie qe ishte somnambul. Nje here kishte dale poshte pall… 
  O Nik. Po te mendoje ky aq gjate sa te ktheje ty pergjigje do ti plase truri nga mbingarkesa… 
  Ore! Akoma ti? Keta jane klysh komunistesh qe hajdutllekun, spiunllekun, patronazhllekun… 
  Ronaldo, je shume i lexueshem si klysh komunisti. E ke pas gje plakun fuks apo patronazhi… 
  Qe te behet lufte duhen dy pale te kunderta. Zakonisht jane kriminele qe luftojne per territ… 
   Per cilat ndertime e ke fjalen lali! Hiq ato qe kane bere turqit, shoqeria c… 
 Ja dhe dok. Pataaaaa! Doktoresha! A i ke raportuar sa kane vdekur se i ke nxjerre para kohe nga spita… 
  E ore pse bohesh xheloz. Osht zakon politikanesh! As skuqen as nxihen. Si mishi gomarit! Po ta s… 
  Po po e ka thon xhaxhi! Qente le te lehin karvari te shkoj perpara! Je si shpirti lale! Te du fort!
  O lale! Çare osht ajo tav Tirone ne avatar! Shefi ka kerku tepsin jo taven! Mos i ngatrro gjonat!
  E o lali! Ça do ne London ti mer jahu! Hajde mer dreq ktu se na duhesh.Kena bo n'men ta bojm Saukun me rrota!
  Po o beno po! A te kujtohet ajo reklama kur Edi dilte dhe thonte "a doni shkolla? A doni spi… 
  Aman o Shpresa! Ke te drejte! Nuk ben bilancin e qeveriajes se vet po luli keshtu e luli ashtu… 
 O Edo! Ke dale ne fushate te shash Lulin apo te besh bilancin e qeverisjes tate. Lere Lulin vella! Shiko… 
   Ne fushate pozita jep llogari dhe cdo shvendosje tematikes quhet demagogji. Dhe dihet q… 
 Kokrrat e legenit. Na torturuan kaq muaj me rradhe vetem e vetem qe ta inaguronin ne prag zgjedhjesh!
  Nena Bozo ka te drejte! Gjithesesi floket e bardhe ja japin kete. Nga ana tjeter pensioni eshte tota… 
 Nuk kam asnje simpati per Like dallaveraxhiun! Gjithsesi populli thote "O fol e mba, o pirdh e ha". Pol… 
 Albin, do ishte mire te perfshinit serbet ne qeveri. Jo per ndonje simpati te veçante por per dy arsye.… 
===