Aj momenti kur krejt parkingi osht shlir, veq ni kerr i parkum dikund larg... Edhe ti shkon e parkon afer ati 
Vendosem ne CC me qet rend edhe mu 
Yoo loj e fort sonte, dy ekipet e mija favorite 󠁧󠁢󠁥󠁮󠁧󠁿. Amo ma shum jom it's coming rome 
Damn mos e ka haku dikush llogarin e twiterit t'kosoves 🧐 
 Ruju pe mer vesh kanadezi qfare je t qet zhag prej atyhi!
 edhe ty turki e arabi!
Da fuk, sheqyr e kom fitu qat burse e po iki prejt kti populli
 Shko 15 min ma heret edhe kesh me foret e tyne palidhje! 
Ishalla qajo raketa e kinezve ju bjen kinezve!
 problem me kit mentalitet
E blejn kerrin e shtrejt, a buken e hajn thatë....
 damn na pushim deri te marten
 jo se gjith pi mer t bardhat 
lmao, krejt krejt amo tonshi kosova me lek a euro pagun. Leni kto sende se shkum posht 
 Siq po shihet kemi mentalitete komplet te kunderta, sido qe te jet e respektoj mendimin tond. Po e perfundojm me kaq
 A duhet me ja kthy me sharje tu e konsideru veten fetar? Normal qe jo. Sa i perket asaj qe u tall, i… 
 Me arsyetu qka? Ska lidhje me at send
Mendja ime kur mesoj emra te ri ne gjermanisht 
2020 ka me kon viti jem.2020: 
 jom do sende qe duhet me u pajtu me to, dmth sdi edhe kurr skom me dit ahhaha
edhe pse jom i rritur, kur jemi te vallzimi i takoj qatyne fmive qe e hupin ritmin hahhahah 
Ktyne marimangave qe rrin neper qoshe t'dhomes, jau kom shty pagesen e qeras deri sa t heket koronavorusi 
Aj momenti kur ne film personazhi negativ t'duket qe e ka mire ne fjalimin e tij...  
 t kish me u kthy normaliteti ma shpejt
 se di veq qeto ondrra ma t quditshme skom pa najhere
A osht kush knej qe lun Clash Of Clans a veq un
Ku more jom kon deri tash qe mpaska pa ik prej radarit seriali Vikings? Hala ne sezonen e par jom amo gjithqka e tensiunuar 
 kismet n list do ti vendosi, t besoj ty ahahhaha
 ka sa sezona i kan
Rasti i Shqiponjes qe aksidentakisht u rrit ne mesin e pulave. Mbasi qe rritet me pula fillon me mendu si ato, kur… 
Me te vertete kosova i ka 2 miljon banor, amo qata 2 miljon krejt jon aktiv n krejt fushat ahahhaahh
Sheqyr erdh dita e shtunde, pak pushim 
Profesori kur t'bon pytje t lehta veq sa per me mor kaluse looks like... 
 koka shkru me nxon ni qen t'rruges e mja qit rrypin 
Big up per iPhone qe po don me bo revulucion me produkte, kurr sjom kon adhurus i ksaj kompanie per arsye qe qmimet… 
Un krejt sendet muj mi pas hallakam, amo desktopin e kompjuterit e kom t'organizum ne menyren ma perfekte 
5 euro amo per ty 3  
 siq thot i madhi Naim Abazi ahahha
 po jan imun ahahaha
  Veq qeta njerz si kap korona se ju dhimen
Qysh e di se kush i ka ra ziles t'shpis...Babi e mban shum pak, veq 1 sekond.Mami se ndal deri sa t del dikush 
 Thjeshte, paster, qarte! Bravo kushdo qe e ka punu :)
 Parameno tash me i bo villat ka 5 euro se veq 1 or e gjys
Mpat nxon polici edhe ma pat bo ka je ka shkon? Ama leternjoftimin ta kqyri numrin e parafundit.. 
9'shat ne keto momente 
 Boll tash se nuk rrena me vlla per kerr 
Veq demtoje numrin e parafundit ne leternjoftim edhe del kur t dush ahahaha
 Khu qr gjdo fm qe e shisha nqytet sod bomb mu doke.- Na lujti karantina.
Kur mendoni qe ska ku shkon ma keq, gabim e keni...Ma mire mi lon flokt e mdhaja sesa me provu mi shkurtu pak ne… 
 qfar thenje e thelle miq
 Mka mor malli per Futboll.- me kqyr, jo me lujt
 ja ka nis mem pelqy, pom doket kur t'rregullohet situata un kom me u shendrru ne person introvert 
Me emigru jasht vendit  ne gjermani mos me qit flamurin e gjermanis ne profil i bjen qe sje… 
mos t'keqkuptohemi, kosova perballohet me dy ekstremitete: Ka njerz shum t'arritur por ka edhe asi qe.
 ky qen osht njona prej probleme pse osht rrugve. Ky ose duhet me kon i mbyllur, adoptum ose hiq rrugve.
Qka bona me meritu kit kerkese ahhah 
Hala pa u kry 2 javet vendimtare, ja nisen 3 javet tjera vendimtare... Fuck it a! Ju e keni fajin qe po delni
Su mbet njeri mo per as ni rrjet social, krejt me modele... Veq n'linkedIn hala osht safe
Gruja osht sikur granata e dores. Nese ja hek unazen t'shkon shpija
 sigurt pe duron deri sa ti bohen letrat ahhahahah
  veq ti kishe dit me qit n binar kit femen 
Sa planet i kom pas per 2020, 0% jom realizu! Me te vertete jeta osht e paparashikueshme 
 Me kallen kur po qesin foto prej qytetit e tu anku qe shume njerez ne qytet. A vet rrugve. A bAn mos me shkru hiq.
Dy javet e ardhme jon vendimtare
 Hahahahah ma pak shpenzime 
duhet me perkthy se ktu n'tuiter ka shum adoleshenta, nihere jon nxon tu e shiju jeten 
Dy javet e ardhshme jane vendimtare. 
Hahahahahah si me pas bo per mu qet meme  
Bruh ma shum pe kqyri a pe kapin brushen ne formen qysh ja ka gjujt ajo perpara 
Tash para se me jep qiken, po pytshin a ka netflix aj djali 
"Mka hi diqka n'sy"Legjendat kur dojn me u justifiku se nuk kan qarë 
 damn bro ajnshtajni para teje nuk vrehet
 Une, kom aftsi met kallzu, qfar dite o sot, nese mkallzon qfar dite bohet neser.
 shume urime, suksese ne te ardhmen 
 Jo badihava cocacola i ka rekllamat mat mira 
 pom doket qajo koka kon pjesa ma interesante e ligjerates
  Profja jem masi e kryti u qu tu i la ent nkuzhin 
 Nxenes te dashur, neser fleni shlire. Oren e gjuhes shqipe e keni kry sonte me Albinin  Gjume te embel!
Nime dje vllau tu mbajt ligjerata online, un i hina n dhome bertita: Ma kan mor grun ma kan qu n'golem  Shittttttt
Qysh pe shihni shumica e debateve jon me diqka qe ti ki thon ma heret, e tash ta rikujtojn qe po bjen n'kundershtim… 
 ahhahaha bash, bile 10% bateri su kon kurgjo 
Zejtin Po, mill Po, pite me purri, mantija Po....
So ka m'rrihet n'shpi..Mami: 
 Mario, Peje, Te rruga spitalit 
Lajm i mire, ja paska nis me punu berberi me orar t'shkurtuar 
E kish pa vet babagjyshi stergjyshin a ka me u bo mire
 veq edhe partia Fjala na ka mbet me provu 
 Faleminderit per shkatrrimin e cdo andrre per ni t’ardhme ma t’mire n’Kosove, t’cilat i krijum per kto 50 dite
Qeta deputetat qe kur ju ipet fjala ja nisin me lexu, jon po te njejtit qe kur jon pyte ne shkolle kan lexu prej li… 
Ne vitin 2035 kur t'ma bon arkatarja:Totali osht 20.20 €.My flashback: 
Kur po mi qesin do librat n'storje...
Sa e pash qet film, 100% pja vlejke. Qudi qysh  mka ik pa e shiku. 
 po de sa mos me nejt 
 A po mendon se funksjonon ?
A keni provu me ndal 2020'ten e me dhez opet?
 Nuk eshte mburrje kjo, kur e mendoje se cifti i saj ne te ardhmen ka me u bo Nene, edukatore ose mesimdhenese, po e paramen…
 Msusja tu e vet nja t Deçanit: Qa ki qef me u bo kur t rritesh-Sigurim n'Zone
Duhet me bo Hallve 
Perderisa sa osht opsioni unfollow, mute edhe block, qka t'doni postoni n'tuiter
 krejt i kom pa, edhe krejt jon t mire
 sigurt u kon i brazilit, se ata e lujn fort 🤓
 po edhe qajo osht shum keq, per kto arsye kom vendos mos me lujt mo at loj 
 ose lojtari osht qaq i fort, as qe t vjen rendi me lujt 
Paramendo sa puna i pret tash Berberat mbasi qe t'kryhet epidemia 
Kujdes: Virusi po perhapet shum edhe prej shkembimit te parave, ne menyre qe te mbroheni ju kshilloj ti mblidhni mo… 
S'dita gjo, kur hina ne instagram pi shoh krejt me nominime QR
 Ti nuk mundesh mem tregu cka me bo per dreke. Ndoshta edhe mundesh, por pastaj nuk mundesh.- Nëna
Kudo qe shoh harta, gjith ja boj zoom me kqyr a e kan qit Kosoven t'ndame prej serbis 🧐 Siq po shihet ktu po 
Nuk osht ka m thirr mo babagjyshi me lujt shah ♟
 „Ti tash kollitesh shlire, n‘ate kohe s‘kena guxu“
 personi qe e ka postu kit foto e ka thon qet vit, amo ka mundsi qajo qe po thu ti
 Qkado qe tboni tash, amanet fotot e vjetra mos i kqyrni 🤒⚰️
Update:Dita e 2 ne karantine...Me gjysen e antarve t'familjes spo foli
 Jo aj direkt n finale osht ahhahahah
  Edhe ai tipi te kojshia show
Broo 2toni edhe Gold Ag sjon n'list!! WTF 
 vllaqko se kom basu as un qe kish kaq shum njerz t'prapambetur
Dita e dyte ne karantine.Un:Pse njeri mer frym automatikisht, amo kur mendon per fryme tani duhet manual 
 Mc Kresha: Korona virusi eshte shqiptar: Korona= koh' t'rona
Paramendo kta puntort e viva freshit e rrezikojn shendetin per ni rrog 200 euro
Qfar rrjeti i dobt si n vitet e 2000 kur e qitsha lojen me u downlodu ton naten  Efekti i coronavorusit
shyqyr  se kem tu u bo marak pse veq neve spo na bjen haha 
 Hahahhahaha krejt kjo osht tu ndodh me hek vemendjen prej morenes
 Tash Morena Taraku ,tu than sheqyr qe erdh virusi, po merren me to e mharrun, se hor u pata bo
Kajhere do twita jon qaq t'fort sa qe e meritojn me dhez amo nuk dhezin. Qka dhez osht veq fotot gati nudo
Kurgjo s'bohet me rrejt pak bro 
 ky status osht i editum, fake news
 a po i lexon krejt email'at 
Damn bruh mjafton veq mi lexu komentet n'prortale edhe e sheh sa persona naiv ka ky shtet...
 holly shit erdh edhe ne kosove
Spo di cili prej zerave t'brendshem ke ky, negativi a pozitivi 
Nese femna m'kish lut me bo switch challenge, jo qe nuk e kisha bo amo edhe switch relationship sa ma shpejt...
 3 here e lexova edhe besom thash mos nuk jom n rregull diqka 
 duhet mi ngrit ato klikime diqysh 
Kamarieri: A po i paguni veqmas a njoni?Femnat: 
 ky skoka qaq keq, mundet me u permisu
 se ki pa ti mc liren 
Nuk osht e vertete amo fatkeqsisht qeto qe kan twitter po. 
 e ka edhe konkurentin e fort aty afer
Smuj me ardh se kom mysafir.*Mysafirt: 
 Zdi diqysh fort mkap nifar stresi,mem than dikush npublik, hin deri ne google
Po de, mos u nxej shpejt  
 Qysh tvin do lypsa kur del per kafe. 
Femnat be like: I postojn dy foto, njonen me No Makeup edhe tjetren me Makeup... Dyjat i ka me Makeup 🧐
 Ton diten muj rri pa hanger, amo hiq smuj pres deri tftofet 
ps paret nuk i kom bo me shifra, amo osht ni bastore hahah
Edhe nese prej dites qe ki lind e deri n vdekje, i kshe fitu qdo dite ka 4.5 miljon euro... Perseri skishe mujt mja… 
 hashim thaqi me ekip
Kur e mban deren qel per me dal edhe personi mbas teje, spo thom kurgjo amo bile ni Faleminderit me ta thon.
 e nganjehere jeta t'rehaton 
Buzeqeshni o njerz, se me at buzeqeshje shkoni n'xhenet 
Qeshtu palohen teshat hahaahh 
 Kjo osht new wave sa i perket postimeve
 Veq nese Albin Kurti e ka shkarku prej postit
  Nga larg po qe duket siç thua ti 
 Jo more qik e shpis po duket hahahaha
===