 Cka ka logjike ne mediat tona, qe me pas kjo o bro? Mizerje!!
 Hoxhe, cka o' kjo ngjyre e cajit, spo i shihet luga 
 covid-199, mos na tutni Allahile. 
  Hoxhe,  po del nji person tjeter qe ska te boj me kompanine. Nqofse munesh me e siguru… 
   Besom edhe ma keq u kon pa ta, une menoj qe as ni rreth sbon me lon, krejt nsemafora mi kthy.
 Depresioni eshte qrregullim mental per te cilen rrefuzimi i se kaluares eshte vetem nje pjes e shkaku… 
 Per hire te korrektsise. 
 Allahu i past meshiru.
I ftoj Hoxhallaret   po edhe tjeret qe me e mesu gjuhen e shenjave (nqofse veq nuk e dijne) q… 
 "Umeti qe fle naten e Kadrit kurse rri zgjuar tere naten e vitit te ri, mos pyet per shkakun e dobesise dhe poshtrimit te…
 Vaksinimi nuk nodh per mu sheru, po per mos mu infektu.
Ton' kto gropa n'Prishtine ja kom nis me menu qe Shpendi ka marrveshje me Automekanikat!
NPrishtine me mujt me gjete naj dron qe te transporton, perndryshe vaj halli per neve!
 E paskan flliqe edhe kta si cdo sen tjeter..
 Ke tu na lujt me numra tlternjoftimit ka 2 or me dal, as virusin me nal plus na kem tu lujt..
  apot bjen me teleportu ty pershkak rruges hhaahahahaha
  Merendsi o' mi ngjyros fushat e basketit
 Pa rrjete fort munim
    Urime covidi tgjith atyre hahahhah
 Debill, fallc tu u munu si Gordon mu bo kishe.
  A sprish pune me na e rregullu kete, sa here po hijm me kerr pe hupim ka 1 jete si te Mario.
O perhajr ky Bajram i gzuem.
O perhajr ky Bajram i gzuem.
 Nese stadiumi nuk eshte qishtu "futuristic" (se pi shkon shume me arkitekture shume te mire te Prishtines) athere une protesto…
 Na kem nevoje per spitele, shkolla! Na Brazilo-Argjentinas sjemi me maru stadiume ktu! 
 Se di pse o me ransi mi repliku turli klloshari qe flet rreth xhamise se madhe.Problemi o kane qe su bojke se tash veq i…
  Shum gjest i dopt
 Ish kon interesant me e qite edhe pjesen e replikes qe ta ka kthy.
  komplet pejtoni i bllokum o' ski shanca me leviz!
 Qysh jeni ju a po lodheni? 🤦‍♀️ 
 Ne perfundim te tij vetebesimi ngritet sepse e kupton qe ti mundesh me arrite cfardo qellimi me pak sakri… 
 Arben Gashi: "Luftimi i koronavirusit eshte ma shume ceshtje e sigurise se e shendetesise." OK, atehere shtine koronavirusin…
 Khuu qysh e paske zbulu a! Impressive.
Edhe qeveria me ra ish bo interesant!
 Veq hajt tfoli diqka
Kur tprishet lifti e sheh sa njeri qe se ke pa kurr o' nhymje te ti. Meditim i thukt.
Pse gjeth qet fjalen "Prsh" e lexoj si pershembull e jo pershendetje?
Ti pin 10 paqeta dunhill ndite, a kur del jasht e vnon masken se ajri i ndotun. Hehwhehheh
 Kjo edhe ma zi hahha
O na mytet me qito kshilla tmunimta, sdo me thon bre me kon secili kshillues nrrjete sociale.."Mos i beso rrencit… 
Mo me axhin, nuk bAn 🤣 
Bajram te mire o umeti ma i mire nbote. Qofshi te lumtur ne dy boterat e u pergzofshi me xhenet.
A ka fitu naj njeri n'bote najsen me qat sms qe t'vjen prej Hej Ipko qe duhesh me zgedh ni maskot prej 6.. qe te di… 
  veq qe spo shoj nmatrix mo hahahahaha
Ta lun Gary V e suksesin ma te madh qe e ka ne jete o' autoshkolla!
O Vllazni e motra nalne doren tu u llajku mes veti se na qut posht !
  ahahah e pa pritur prej fibit
 Barra i bjen nanes(mamit) n'ket rast se qysh te mson nana me thirre fmija e thirre.
Senet qe shihen prej hanes: Muri kinez, Tymi i obiliqit etj etj
 Noqfse i han farat per vlerat ushqyese qe i ka mire e ki, ama me dal para mahalle me honger fara pa u bo v… 
Hajdi Kha, ti menon qe osht far aktori a poeti po jo.. osht Hajdeni ktu.
 Miq te dashur te gjithe ju qe ende nuk keni edhe aq shume informata per jeten e Muhamedit alejhi selam (te derguarit te Al…
A e din sa debill duhet me kon dikush me thon, leni hoxhallaret e xhamiat kapni shkollohuni.
   Masi ska benjamini twitter se ma pat spjegu shum fort.
 Vllaqko une thash shumica prej tyre NUK besojn ne Zot, per qata thash osht e veshtir me ua kundershtu idete.
 skisha thon qe o absurde, se shumica e tyne sbesojn ne Zot, e per kete arsye osht shum vshtir me argume… 
 Une smenoj qe duhet me i sulmu qishtu as veganat as vegjetariant, se tani kur po na suljmojn neve ne di… 
 mu per kete arsye i kqyri filmat, se filma n'stilin e gjeki qenit ose scarface skom qka kqyri ntv hiq k… 
Cka sheh steaku kur osht te nusreti  
  ksi foto qe t'pelqejn ty
Ditet ne vijim nuk do i pergjigjem e as kontrolloj as nje rrjeti social prej ores 08:00 - 18:00. Muni me me kontaktu ne nr e telefonit.
 Hoxhe nqoftese angazhimi me dynja te largon prej Allahut, ateher ku me i lon ambicjet qe dikush me u… 
 ama ja ka thy turit veq
This is Kosova :), ta myt studentin me stres jet oj jet.. drit me sy mos pafshit more debilla se ju myti kompleksi.
Per me i liberalizu vizat veq qoni dikun nemergjenc ose shtepi tshendetit e shohin qe ski ku mu kontrollu se shkon… 
 Edhe mu bash me intereson !
T'dashur Bajram t'kendshem &lt;3
2 sene i kom gajle nket kosove.1. Vizat2. Nderimi dhe dekorimi i Shyhrete BehlulitTash pasi qe kjo e 2-ta vete… 
===