 Kur po tham "maxh*p", se kam fjalen per ty si rom, po per do te prapambetur.Kur po tham "ausllander" se kam fjalen per ty…
 “Jena jugosllave po dokem latina”
 paramendo me perjetu tnxetin e djeshit edhe sotit edhe prap me thon vera stina preferume yall are insane edhe po rreni
  Edhe qikave ja u kish thy me marr pare kur ju vijne menstruacionet per here tpare, ama sbohet sen, bile e mshefi…
 Zhega i smuv njerzit ✨ 
 Vetem per personat prezent po flasin
 qfar analfabeta as "dit e nat" sdin me shkru
 kush une? jo more cfarti 
Jom t'u mendu a e din ti vet cka ki desht me thon a vec na jena konfuz? 
 labinot tahiri nkry tem tu thon "kujdes banore te fshatit nerodime"
 "Sherbimi mjekesor ne Kosove shume i keq, tmerr!"*shkon ne Sistine, i pagun 15 mije euro*"O Zot çfare sherbimi i mire"
 deka neser koka e premte
 o zot kur e knojsha kangen e ermalit tlutem zot kthema edhe niher se kom pas me ma kthy dhimbjen
  Ku po organizohet kjo?
 Spo di a bon ndihmen e mikut 
 Ose skype a najsend 
 Ose skype a najsend 
Gjyshi jem, qe s'e ka idene se cka eshte linku, aplikimi online, website, duhet me bo kerkese per vaksine kunder CO… 
 Eshte e nevojshme qe reagimin e njejte me e pase edhe per bullizimin e Ganimete Musliut mbi dukjen e saj. Pa marre parasysh a e…
 A bon me fshi qita se ka ra mixha jem qaty
 O ma shume qisi seanca se u knaqem. 
 Parada e anijeve ne Lumbardhin e Pejes 
 e kom rrit fmin mire fmija jot bon editime e skenare intime tkides butrintit yllit edhe i poston ne instagram.
 Plus arsyetimi i tyne qe kan punu me gjys kapaciteti per shkak te pandemise nuk qendron.Full i kan mbush autobusat si gj…
 Ah yes two genders, na qe e dijme qe admirimi osht robot edhe ata qe menojne qe admirimi osht qenie njerezore
 Sekretari i Kuvendit tu i numeru votat e Glaukut 
 Cka mujn me bo kosovart me pasaporten e tyre tutorial: 
 Qysh i thojne priftit qe osht edhe elektricist? Pop Kek.
 Shqiptari t'u kallzu qysh eshte pro dhunes: "Une jam kunder dhunes, por..."
 Njerzt t flliqt jemi be valla 
 Amerika nmars na hala nshkurt jena ncnc
 Kush po te pelqen kush e zuri vendin tem, vendin tem nuk e ze dot asnjeri ne bote
 Paramendo mu kon kunder diaspores e me pas emrin mergimtare 
===