analiste e futbollit nt7
specie tjeter ishit kone
ku o logjika me vesh pantolla tlekures n’35 grade
cka o more ky nxeht
ushtrojme pilates me komplet t’arit
@ ai djali me motor tbardhe qe sillet cdo dite nrrugen b ntnjejten kohe, stop it now se ma ke tesh. &lt;333333
nje foto ne shesh tu lepi akullore taparatit
kompleksi fafa 2021, muzike live 
 po qe de thu ti prej 2010 jon tu e perdor
po shkoj me kultivu domate ntermokiss
me bo ni tatu me celsin e violines :ppppppp
 Ligji 21 i natyres: nese nuk pin cigare tymi gjithmone ka ti ka me ardh
qysh me depertu nkosove ——&gt; shko bonu moderatore n’emision te sportit edhe nese sta rrok
kafet e rruges b = kafet e durrsit
me bo ni emision ma mire 
fakulteti i ndertimtarise e knej su renovu ndertesa prej viteve te 70ta
 Pse sja kom pa pra asnjonit hala vesh?!
 Une besoj ne chicken crunch fajita t’papirunit supremacy
 hehe ska lidhje e heka une :ppp
 Qekjo kurre smbohet bajat tu e ngu :( 
kush qohet bre nmengjes edhe thot nal tshkoj me bo ni tatu me trendafila
 hmm ia ke qelluar endzi
 omg vete a e ka naj vlla me emrin fllad hahahahahahahah
 O zot o edhe ni liste e emrave te ndalume istg duhet me shti plot aty
kush more ia len emrin fmise tvet Fllad
Nje video tek dentisti
studentat n’fiek be like kom e mbrojte ni teme. A po lune futboll a po bon prezantim oj moter
 a p p l y i n g . p r e s s u r e   video out now 
 der qelu  ,u familjen  der hapu 
 gotta HotGirlStudy before HotGirlSummer
 HAHAHAHAHAHH ik smkeni marre
po i pres fotot e ballos t’aukut
cdo i dyti kamarier e ka emrin interesant
Gjenet nuk i bleni n’Albi Mall, i trashegoni.  I. M.
 ti vajze mos hi ntwitter kshtu e ki, per ty e kom pase
 une spo boj hite si anisa smqesin
cdo portal cdo gazete tha, e ka qite nihere telegrafi snalet tash
presim tash fotot e detit ne story te gjithkujt
eh masi tha rina qe po e boj 
ofc jo ne kosove se k’tu s’ka vaksina po qe i ki letrat ahhahahahahah 
trendi 2021: qite n’story qe je vaksinu
po doket si ai vendi ku vrapojshin barbit ne nintendo 
vetem ne kolegjin me prestigjioz, UBT 
mesojme statistike me paint
peticion alban skenderaj me nderru stilin e muzikes
ky djaloshi eshte nje ceo i vertete
 istg na kane teshe cdo dite
one more provejshen left
o ma ka vjedh bre foren 
vec ne ubt harrojne profat qe kane caktu date te provimit edhe nuk hijne me ta mbajte
A ktu pos sheshit ni flamur tkosoves se sheh nqytet 
 big sean &amp; jhene aiko &gt;&gt;&gt;&gt;&gt; 
 i thash po smngune :”
edhe punetoret tu knu
kshtu shume fort qe e ka knu qet album po ska pase nevoje mi jep zor 
 Tash a po e din dikush, a ma ftohte osht kane kur ka vdeke Rugova, a kur e kemi shpalle pavaresine, a kur ka fitu Albin Kurti?…
dite borxh koka sot
forever my favourite hdbskdbsj 
===