 Hahahaha shuj o budalle
 Hahahaha po çfare miri more, me guxu me fjet tash
Armend Mehaj, ministri qe me ka befasu me se shumti, per te mire. 
 Naj Ferizajli me mobilu zyret e kombtares ndryshe jo 
 Qysh kish me thane Glauku; "le t'dalin krejt expressi bashke me ni ane edhe le t'maten me Jahjain,… 
Pse me investu n'bitcoina kur munesh me investu n'akp? 
 Keta e sherojne komplekset tu ba blloka. Nuk mujne me pranu qe dikush me pas ma mire se ata 
  Fatkeqesisht, Besa e ka pas ni faze t'shkurter kur mendonte qe personat qe e kritikojne duh… 
  ty t'njoh ma mire se plot do qe i shoh shpesh🤣
 I nderum. Nuk e di çka ki kunder 'neve' qysh po etiketon. Une ta bana share ni lajm me te tregu qysh… 
 Une nuk morra qendrim. Veç ta bana share qe me pa.
 Edhe kallxoji kur t'ja heksh
  Joja. E dijne njerezia qe ti s'pi çkado 
Dhe pas perfundimit te episodit te pare te shume perfolunit Rrushës, mundem me thane qe eshte medioker n'rastin ma… 
 Ka pas nevoje per qesi trajneri. Asi qe kontribon me rrite mentalitetin e lojtareve se kane ra ner 0
 E mire po ama jo qeshtu. Çka po bahet me ligat nacionale. Edhe diqysh kjo super lige e madhe po ekipet jo qaq tmdhaja
 Long time no talk. A e pae millani aty me ekipe tmdhaja kishe pe bajna ni lige tmadhe. Jane ttanu krejt.
Nese s'i ka fajet Albini per kete llug kush i ka? 
 Nje trajner i mire e nxjerre me te miren e lojtareve te tij.
Kur pozita nuk i ka numrat, opozita po refuzon me i ndihmu pozites ndersa kur pozita po i ka numrat atehere po kerk… 
Krejt bashke kane met me 40 deputet edhe prape s'jane mush men. 
Lumezi nuk ish kane bash i keq, shoqnine e kish pas t'keqe.
Ia kam huq LDK dhe AAK me 2, respektivisht 1%. Ama s'kam faj se partive te vogla eshte veshtire me ja parashiku rez… 
Endrit Shala - Na mungon
Qaq shume deputet VV jam saqe s'cuditna nese m'del emni edhe mu per deputet.
Nese si Ferizaj nuk e kalojme 60% per VV kurgja puna jone.
test test:  kqz rezultatet live
Bora e pastroj natyren. Na po e pastrojme Kosoven.
Parashikimi im eshte qe 5 personat me te votuar te jene nga radhet e VV.
 Deri dje t'shtike n'gjume nDebat plus tu fol e sot koka qu kishe tu bertite ndaj VV
Hala jane masat A? 
 Ka pas shume loje t'fitume qe ka lujte shume keq, me qeta e lidha. Perndryshe kogja nalt eshte tu i pas parasysh krejt
Eshte per keqardhje qysh shumica e personave qe flasin per sondazhet ne studiot televizive nuk e kane te qarte plot… 
Me kqyre televizionet t'miren e pergjitheshme nuk i ftojne ne debate keta anetaret e PSD. Dojne me na myt.
Une nuk merrem me politike se ky shoki jem   ka plot do foto e screenshot-a t'mi e ma merre ftyren nersy krejt Kosoves.
Shkun paret e trustit. 🧨
Studentat:  Provimet e janarit ne njeren ane, debatet zgjedhore ne anen tjeter. 
  "Po menon gjynahi qe pernime po e njohin.🤣" 
Te jemi te qarte. Nuk eshte denoncu qe ka ofru 20eu ryshfet, por qe s'ka ofru sa ja kane kerku; pra 50eu. 
Per 100 milion euro, Serbia nuk duhet me u leju as me ba piknik te Ujamani, le ma me shume. Ne Kosove 100 milion eu… 
Zafa as a koordinator per siguri kibernetike. 
Muriqi anej Kumbulla knej. Bile edhe ngjyrat po pershtaten. 
 Sa u gezum pak qe ni lojtar i hajrit mos po del..
 Tani jo vallah s'ka larking n'prishtine 🤣
  Brokes i ik, katunarizmit jo 🤣🤣
  Adet eshte me ja lane ni bakshish. Bile s'paku ni pare qerapa.
Kerreve me drita e njerezve neper shesh po duhet me jau ba me sy me ju kallxu qe policia jane ma poshte. 
Vatra ma e madhe e infektimit per momentin eshte qeveria e kuvendi. Rrini larg tyne.
 I hupen nja 2 3 shanse e morren gollen tani u kthjellen pak
Naser Ramadani dobet sonte. Çdo gazetar i fort mundet me ja kundershtu argumentet e tij.
 Aham. I mire eahte virani. 
 Çka po thote? 🤣
Sylejman Qerkezi sot e bani pytjen ma t'mire qe e kam degju rreth xhamise. Pytja ju drejtu nji injoranti funksional… 
 E paske nderru foton. Perhajer komrade.
Bashkesia Islame e Kosoves duhet me e leshue nji ultimatum duke kerkue shumen e nevojshme per me ndertue xhamine qe… 
Po m'pelqen vetebesimi i Dardan Molliqajte. Po thote qe une e kam kundershtar t'madh Albinin. Po menon qe Albini e… 
Endrit rrugaqin e paskam harrue. 
Une cdo nate, para se me ra me fjet, e pyes veten, cka kam ba qe e meritoj qe n'shtetin tim me kane nje deputet i t… 
Qekjo menyre pa plan e testimit eshte veç humbje e pareve. Ma shume teste per personat e infektuar qe presin per ko… 
 Perndryshe vec lexim i te dhanave. S'ka te baj kurgja me logjiken tem.
 Madje te pas parasysh qe pacientet testohen disa here deri sa dalin dy here pozitiv per me u cilesu t… 
 Per me kuptue ma mire do te duhet me pas edhe shifra tjera, sic jane, numri i testeve per rastet pozi… 
 More gjermant e kane marre prej neve 
Shtegu per vetura t'kuqe ose sic njihet n'popull shtegu per bicikleta. 
Çfare beri Hoti se na shkoj loti. 
 Prej ketyne treve, sa jane analfabet jofunksionaë?🤣
"Duhet me pas ligj"; po thote Kadriu i PDK-se.
Armend Zemaj si minister i shendetesise s'ka kurrefare dallimi prej Palave e Ekremave e atyne Shyqerive qe s'dishin as me lexu.
Haxhi Shala si ai femija qe kallxon çka ka shpija.
Festojne se tash ju nshohet taxhija profiterave. 
o , a po done me ta qu lokacionin?
Duhet me u pershendet 2 deputet nga komunitet qe nuk ju dorezuan klanit per krijimin e qeverise puciste.
Aq beson ne veten ky saqe i duhen 4 zevendesa. 
Ngjarja po zhvillohet brenda. Vemdendja tek ata qe jane jashte.
As vet nuk po ju beson atyre qe po i thote. 
Albin Kurtit nuk ja fali, qe m'ka ba me i rezistu mergimit. 
"Nuk ju besoj ketyre rezultateve madje me duar ne xhepa", thuhet te kete thene ne mes te tjerash Isa Mustafa. 
I bashkangjitem edhe une trendit  
Nuk i kemi majte men njerezit qe per 20 vite na e kane vrare shpresen e shkaterruar te ardhmen e po e majme men nje… 
 i befasuar, per te mire 
Mos e prish.. mos e prishni mas mramti , mas t'menojne qe jena gjin t'eger. 
Llamella koka prish por une mendoj qe problemi eshte dikund tjeter, problemi eshte te Albini.Dardan Molliqaj
T7-shi po thote qe muaji i Ramazanit do te zgjase 1 muaj. 
Pajtohem! Visari e ka dhane tane rrogen e deputetit e nuk e ka ba t'madhe, e ky gjysen. 
Ju vjen çudi analisteve te ju thote dikush 'nuk e di'. Jane mesuar me Ramushin qe i di te gjitha.
Albin Kurtit mundet me ja thy rekordin veç Albin Kurti.
 Jo veç une, edhe ti, krejte Kosova, a nuk jemi na krejt eksperta t'jurispodences? 
 Hahah edhe mu mpelqejne shume.. une blejsha libra me fjalekryqa.. munet me pas.. ni kohe ka pas expressi online tash sdi
 Po le t thehet, jemi thy na njerzte e s'eshte ba e madhe
Pse lindi shperndarja nga Bonstilli? Pse jane mbajte te fshehta rastet nga Bonstilli? Kush do te mbajte pergjegjesi… 
 Po beja hajgare vllaçko.
Dadhta me kqyre Çernobilin po ma kane spoil. 
===