 Nuk m'doket qe pate bo zo kur ish ministrja e Puneve te Jashtme Meliza Haradinaj na ka bo block gati krejte rinise t'Kosoves…
Kjo “Nana me karroce” qe krejt kryetaret e Prishtines jane mundu me ja liru rrugen, fmija ju ka rrit e ka kry fakultet 
 Shoqni me ma shume komplekse skom pa.
 kapne vaksinone qit dardan molliqajn ma shpejt se shkoj per lesh 
Reporteri i T7 direkt ne televizion kerkon falje per dhenien e nje lajmi te pa konfirmum dhe ende pa kalu 1 minute… 
Kthene Artonin mbrenda..( osht ftoft ) plus kurgjo relevante nuk osht tu ndodh ne Mitrovice me pas raportim drejper… 
E vertete. Veq as nuk kisha dasht me vepru diqka me mendesine “Edhe ju qeshtu ja keni bo” 
Ktu faj ka veq Challandes teper strategji nonchalante tu i llogarit mangesite ne mbrojtje 
 "NuK kA fLeTeVoTiMe" Ska lidhje, po presim derisa t'i bijn☺️ 
 Ku je kon kur e rrehen rojet e shefit tond ni djal t’ri veq pse e tha te verteten? 
  ne kete video Selmanaj nuk po i referhohet Sarandes duke thon “na keni lodhe”. Jo qe jom perkrahe… 
  Jo axhi Gani,nuk mundemi por na te pakten bile me dit qe eshte pula pa kry!!
 Ani Hajrulla, edhe ju duhet me ja nis me menu pak si politikan nashta ?! - Mi parashiku nja a dy tre levizje ma heret
 Super e vendosun ke MKD taktikisht na kan mujt , edhe pse nashta jemi ma t mire overall!
Ma inferior se Dulla , veq Atifetja! 
 Avdullah Hoti: Qe 4 muaj e kemi larguar fjalen korrupsion nga diskursi publik.Fjalen po, ama korrupsionin jo. Por eshte e…
  1-0 me Luton ( me penallti ) spo doket qaq impresive . Nuk osht qe i keni shti me lujt u21
Ku po don ma shqip  
Per pak kesh tu mendu qe ke fotografi ne     
Hajde Avdullah, kallzo veten! 
 "Ka ardh koha me ja dorezu grate digitronin burrave" qeshtu diqka ke nashta jo bash. Mandej tha " pak sh… 
Qfar komenti palidhje i komentatorit ne ipko !! Panevoje , e terhoqi fjalen por komenti mbetet palidhje edhe seksist!  
Ma e mira deri tash 
 Njo si Hashim Thaci!! Fatkeqsisht ka shume njerz qe e perkrahin e menojne si ky.
 Pse nuk ke reagu n’kete menyre kur je kon n’tavoline me kolegun ton Butrintin qe e ka tregu ni histori t’tille? Pseudo ar…
Thaci me fjalet e tij len me nenkuptu se kjo qka ndodhi eshte sepse Veroni eshte aktivist i LVV dhe se "keta" nuk d… 
2. Thaci thote : "Truperojet kane bo nje pune profesionale e te perpikte "Fakt : Veron Hasani minimum 200m larg pr… 
Kjo deklarate osht skandaloze!!!! 1.Thaci flet per depolitizim e ne te njejten fjali jep mendim politik.Thaci si P… 
Nese nuk e sheh qarte uniformen e policise hiq mos u nal , bertit me zo nese tenton me tu afru e edhe ma shume nese… 
Thaci ne T7 tu fol per depolitizim hahahahahahahahahah- Ky Leo kogja ja ka shtre sot,po quditna valla per te mire  
Ne pike dite! Midis Prishtines 
Le bre mos ja qi nanen!! Krejt e dini, mandej dilni shitni pordh kishe politikisht korrekt ne televizor  
Eshte paradoksale!! Perkrahesit ma te mdhaj te PAN nuk eshte qe i kan punet mas miri,bile shume prej tyne as deri n… 
 Une nuk e kom dite, krejt e paskan dite dmth.. A nuk e bon ky fakt per kete gjyqtar mi qit krejt v… 
 Nese don me marr post publik edhe e bllokon cdo te dytin ne twitter qe te kritikon (jo qe te ofendon, por te kritikon), at…
 Qeky osht shqiptari tipik, kurre i knaqun. Mos harroni qe karantinimi o bo per mos me perhap infeksionin prej t'cilit kishin m…
 . e shkarkoi Gashin te nesermen per nje deklarate si ato te Thacit e Haradinajt: ka pase krime nga individet, por j…
===