 Une ni dit mos me u la mdoket qe mka ra zhuga le mo 3 dit nejse tung spo thom xoxo mo hajt hupni
 I ke prindrit e ndam prnj mterheq ti se din me dasht srz .
 Mos e hapni me linkun se na bet me kancer
 Qka osht o vllazen e motra qysh ne ju nal a bo me dit 
 A ka naj vend n shqipri qe ska lokal me emrin "lulishte".
 me ta thon qysh me ta tho me ta lyp snapin a ma kishe dhon
 Kari n pidh ca bohet kshu mTgjith n depresion
 Nese jeta juaj eshte nje liber ,si do ja vendosnit titullin?🤔
 Sa i/e gjat jeni?
 Shkruaj "llapaqen" me sy mbyll
 Shkruaj "koronavirus" me sy mbyllur 
 aj pidhi osht striptiste e ky haveri sdo mu kon ajo striptiste tana shkon e rezervon krejt lokalin ku ka me kcy ajo kurva…
 Se dua diten e ditelindjes . Edhe .
 Prind: Krejt tmirat e zotit i ki nshpiTmirat e zotit nshpi: 
 A un besoj qe ka mu bo mire n'Kosove sdi pse
 Sa m kishtee munguar ky shiu🥰
 ask me a question, se skam ca t bej pz
 Qysh qka o ky mood i prisht more
 Un dhe gjeli ju urojm naten e mir gjum te embel🥰❤❤❤ 
 a jam e vetmja qe shikoj akoma filma t animuar?
 Shum i tutna qesaj
 Me mujt met kuptu ku je tu dasht me mrri auu
 Kushedi sa rob tshkolles time kam ktu un na boni hallall se sjam un
 fotoja e fundit ne telefonin tuaj eshte arsyeja pse jetoni.
 Po pritoj me hi me kqyr kush jon qata 2 qe ma kan hek followin
 Ani me hulmumtu veq paaaakez nga ana Politike apaaapaaa qa del anej naj Dinozaur i fjetur
 O pidha a e ka njet mu bo mir a ja kom qi mu nanen mdoket
 Pllumi im ti je e bekuar✨
 ajo kesh me ai kesh me at berllog
 -o maa ma kalo pa-- a tjan tha durt oj lop, me majt telefonin ndor sperton ti MERRE VET
 Okej... okej... ai me tha "te pergjerohem" sa srz ta marr🤑
 Si mund ta gjej nj cun sa per letra ?
 Aty ku magjia vjen ne boten tone 
 Dashuri e sinqerte: Kafsha shtepiake
 tu i kshyr kta kurva qka han mut per na 
 do qika ekon ni t mir seen kurr sta lajn po edhe mesazhin kurr sta qelin 
 Njerezit me sy jeshil ose blu 🤝te rrine ne pritje te komplimentave
 A si vje era gojes kur tqohen pi gjumit ktinve ropqimav a 
 kur do pim bashk naiher?
 Ja qon ni video 1min, ta kthen mas 5sec dekaaa
 A kan cunat ndjenja??
 Kujt ja kishe puth durt?
 Te te vije mumdesia ne dere, te mos kesh nevoje per provokime, por ti e refuzon... hahaaha sa vk q je
 Pash Zotin a keni pa me dal notat e matematikes ma mir se te tikut?🤧Ajm hir
 Ja nisi bor ktu hehe
 Ei veq po jau kujtoi qe n’Kosove mos pritni me u bo mire sa t’jem gjalle na si gjenerate e bukur hihi
 -Qoma ni voice + pse? -mju kallxu shokve neser qfar zoni ka ni engjull
 Ja qes kafen thot ma paske qit t omel se pij une qitma me pak sheqer
 Sa mire juve qe ju kan ardhe ata shacat
 NATEN E MIR YLLA judua
 Kush ka instagram tm ndihmoj dot me i gjo 
 As nermen se ka
 A vetem mua me duket shiu romantik
 Aman shi sa t mir e kaaaam 
  Mbase ashtu i provokojm
 a ka femra qe nuk fajsojn gjith djemt per nj rrotkar?
 E nese do t'ndiqje zemren, kembet nga do drejtoheshin?
 Si sna boni njeri RT per 300 milly m
 Vdisni n gjum kara &lt;3
 A ju ka dal naj her ne enderr gjelat?
 Gocat qe din me bo bakllava jan dashuri.
 A ju pelqen panetonja?
 Kush po vini ti qn feros nmitro te shtunen koka
 A jam i vetmi ktu qe jam single?
 pse ni qik thot smuj me majt djem n snap e nuk thot sdu met majt n snap ?
 Ata qe njohin kete kan respektin tim te perjetshem 
 Kush do m sfidoj me sy 
 ca shenje horoskopi jeni?
 kur e mendoj qe te menduarit per rroba me ben me te lumtur sesa mund te me bejn mesazhet e nje djali✨🤡
 Bakllavaja me peta te blera ta shpif
 e kuptum qe po bjen bor NDALNU me snapa
 a i keni then ndonjeher ndonje njeriu "te dua" po ne t vertet as ju ka plas fare?
 Kto qe cohen qe n6 i kam frik pz
 M shkruaj paraa se t ikkk ky vit
 2020 po iken keni per ti lon naj msg ndokujt qe akm se keni marr guximin per tja thon?🤔
 O XHINGO BELL o jamano HAHAHAHHAA, do qetu ma keni ba 2020 ma t’mir🥰❤️ 
 Ei veq po du me ju thon qe ju dua shume ska rensi kush jeni as spo du me dit , me rensi jem qenie e njejte edhe po nihna sh…
 A lujm truth or dare
 ma se vallahi po prehna po bohna gjak
 kush koka aj hamshor qe pot pelqen
 une ta uroj masi t ma kthejsh followin hhahahhhha
a vjen ikum dikun bashk?
edhe un jam KOSOVE
 ndrroje emrin loqk para se me mi ngu deklaratat
 kerkon deri sot se kom ofendu pa pas diqka me ta kshtu qe ha sa t mujsh
 spe di qysh ke qkjo e keshne
MOZZIK - MADAM 🥂 
special one qekjo ✨ 
 nasht le ti rritet ymri HAHAHAH
qesi skena bojn shokt e mi n kafe! 
 ama ti fllw sma ki kthy qysh met bo une frends
ta bona retweet se perime mu kesh HHAHAHAAHHAHAHHAGHAH 
 n list t bllokav jon prej qe kan qel instagram
per mi ndje te dyat duhet me gjet partnerin  
hajde bir twerkirate pak  
 ti kisha shti dhomt n mish pak
N’GISHT T’VOGËL KOM ICEEEEEE🧊
 E mir koke me ma gzu nonen
  JO I BUKURI JOM
HAJT NI FOTO KISHE SPO KQYRI !He a dul mir a? 
 Une po pres kur ti shtish t bardhat
 Ku e morw qet foto 
KUR TA PYS BABIN!KU OSHT VLLAU?  
KUR T DAL ME SHOQNI ME PI KAFEE PAHIRI M DERDHET KAFJA!NJERZIT⤵️ 
QEKJO FOTO GJITH MDOKET SI UNE BE LIKE : KUR T’HI N SHPI E PA DIT SEN VJEN ERA PITE✨ 
 T qifsha derrin e nanes bash si k.. Mu ka dok HAHAHAHHAHAHAHHA
 Idk veç po shkelqejshe Bile qysh prej sotit hanën kom me thirr LISA
 YOU HAVE  TO BE HAPPY Ni njeri si ti e kisha qit n ven t HANËS
 E paska meritu qaj qe e ki sha ONE PERSON LIKE U nuk bon me nervozu🧡
 Po bile e din qe I LIKE U✨
 GJYNAH MOS ME PAS EMRIN ENGJËLLUSHE TI✨
A M’DON QYSH UN TDU TY!✨
 Jeta e shkurt ama ti je ka m’mush me jett✨
KUR TA SHOH SHOQEN TEM PA MAKE UP! 
 Ver pe bojshe ti I paske qel lulat✨
SHOQET E MIJA N’DARSËM T KOJSHIVE ! 
DAJA MI OFRON 10 EURO UNE EDHE MAMI BE LIKE : 
S’VYN PARJA KUR SE KI SHNETEN!✨
SHOQËT E MIJA KUR TI NGUC NAJ DJAL: 
E PREFEROJ HESHTJEN N’MOMENTIN KUR DUHET MU PERDOR FJALA E NDYT !
JA DHASH ZEMREN MA SHUTOJ✨
ME FJALT E MIJA TI E KI PREK QIELLIN✨
E KOM BO GATI KAFAZIN PER ZOGUN E TWITERIT !
Zemren ma ki marr , zemren zemren zemren ma ki marr  
SA HER T’MERR MALLI PER MU, VEÇ KQYRE HANËN !
NJERZT DOJN MET SHTY KUR T’SHOHIN QE JE N’CEP !
Kejt thojn : SHPRESA VDES E FUNDITUne thom : I FUNDIT VDES SHPIRTI !
 Qe po ta boj qefin pe boj shpirti pro
 Faleminderit per mendim ama sosht qysh po thu
 SHPIRTI EDHE TRUPI JON NJO
GJITH KUR T’HA SMOKA, DURT I FSHIJ PER DUKSI T VLLAUT ! 🧡
KEJT T’KQIJAT E BOTËS ME TI BO NJERIU I ZEMRËS S’T GËRDITET BEE ! 
Qka ju thom njerzve : THJEHTË E KALUME ! Qysh ma kthen zemra : E KALUME E DESHPËRUME ! 
PSE NJERZT SHESIN MEN TU KON ME BLE 🤦‍♂️
E KISHA PREFERU ME PA VIDEO KIT PJES JO FOTO 
===