 Dmth ma mire mos me padite, me nejt me pij çaj ose çka duhet me bo sipas teje? 20 vjet askush nuk eshte ma… 
 jep doreheqje! Vete fakti se poziten e ke marr ne menyr manipulative ti ishe dasht me u amgazhu per… 
 Bile te ta dihet se eshte nje TV me informata subjektive. Ndryshe jan mediumet e juaj te cilat shiten neut… 
Ne ate nivel kemi ardh ku deputetet as ironine nuk e kuptojne edhe nuk kan asnje turp te bejne arsyetime kaq te kot… 
  Si mundemi me ardh kur keqmenaxhimi juaj me egon e juaj na pamundeson kete?! Per marreves… 
  ende nuk i ka shpernda 500,000 maska qe i ka dhuru Jordania. Maskat kane ardhe para 25 ditesh. dhe…
 Aniii kur po thojne “Per hire te korrektesise” hyhyhyhyhyhyhyhyhyhyhyhyhyhy
Mbeshtesim politikan se kan nje titull akademik pa vleresuar dhe reflektuar punen e tyre.. Njesoj te  dhe… 
 Ministri i Shendetesise Arben Vitia eshte ministri me i mire ne historine e Kosoves.Ai po zevendesohet nga Armend Zemaj, nje…
Kisha shpresa per Kosoven por sot shoh  Hotin dhe shokt e tij te cilet duan te kthehen per te vjedhur me s… 
Per testet e covid nga Serbia e kritikuan qeverine (per te cilen edhe une kisha mospajtime) por pranojne ta bejne n… 
 Kryetaret e komunave. Reflektimi i shoqerise tone patriarkale. 
  Ishte vetem nje fore me Flaken se natyrisht se edhe ata lodhen  te pershendes❤️
 Qa gzohem kur te zbres edhe t’marr niher mire ajr t’kosoves dhe t’ja boj atyne punetoreve “a u lodhet”… 
 Kurre nuk do ta dime numrin e sakte te jeterave qe i ka shpetu menaxhimi i mire i pandemise ne rrethanat e luftes se eger se P…
Qeveria e re e Kosoves  duhet me hap nje fond per me financu kostumet e  se Qeveria Kurti i ka… 
 . e shkarkoi Gashin te nesermen per nje deklarate si ato te Thacit e Haradinajt: ka pase krime nga individet, por j…
 afat-shkurte do te shpetoj nga drejtesia, por afat-gjate  do te behet shtet dhe kriminel si… 
LDK kishte ftuar  ne takim kur aj ishte haptas kunder koalicionit me  kurse … 
 - ani a ka gjet djali ni Lehre?+ po, n’spital po punon eshte bo doktor
“Ti mire e ki, po nuk eshte ashtu” 
===