 Ti jo, dmth sje
Ngjarja e serialit Lucifer osht sinonimi i fjales “Femna ta shtin edhe dreqin n’shishe”
Blej shtrejt shes lire 
 I kisha qi nanen veriut
 N loj jom bo qka t dush
 Fun fact n’qite kolone u kon baba jem
 Kqyre snapin tu brake ma late n’rreth se hamiltoni n’monza
Isha myt mejher me pas naj kerr ma tshpejt, edhe asi ndeshje qe si dihet forma kerrit qysh u kan
Qysh din gjinja me nxirr lekun 
Momente kur baba ka kallzu qe me gjys kerri ta sakaton finishin 
 Po si jo o shoku
  Paj shiqo , nxine qe ke shkel naj qen njejt o
Llaf e kem pas me  nese bohet lufta me marr ni sclass blind edhe me dal me shkel shkije 
 Njoni qishtu hin n’fb live edhe bertet SAPUNIIIII MANGUPIIIII edhe ai nuk ja huq shejes spo foli me emra
 Flm kusha qe don me ardh tpres kuptohet perqindja t’pret
 I vyn mashum per me mtrullu
Kjo asistentja e re nubt 
Dite e mire sot me pas pare shume
Skandaloze i riu nga mitrovica eksitohet me shpejtesin e bmw se shokut ttij 
Kllika jem veren qe shkoj qija nanen 
Erolli kur shkojm nkafe porosit sprite veq mu dokt qe o ka pin lean 
N’ubt jon krejt profat… tani betim gashi tu dal tu hyp n’X5 M si king
Barku o per burra o hamillt shoku 
Kur t’qitsh ideja t’reja qe tkundershtojn 200 vet sbon mu mshef kur vjen puna mu perball ne debat me ta… po nejse qishtu kjo kosove
Shpirtin po ma knaq qysh pi sill 
 Shume o shofer i fort* amo op edhe nafakali
 Ti shume maheret e ke kqyr
E KA FLLIQ BRE HAHAHAHAHAHA 
 Hej hej oj feministe
  Duhet me bo termin per kit sen
Po din baba te kush me nejt te i forti 
 Une neper intervistat e mija t punes kur m vesin a din me programu 
HAHAHAHAHAHA haj qija jeten 
 Ah mamire i ki punt
 Po ti se ke kry databazen smun hin nlab 2
Ramizi osht njeri ma bullshit nbote
 Ti je faqebardhe, e kjo i perket rrugicave!
Paska kry te llesna 
 Mbaje koken lart king, kjo bushter nuk te meriton ty!
U pat shku n’egjipt n’tetor me Q8 i pat hargju kogja do pare tash thot zoni i skAmjes… mos i rrej gjinen o p9 
 Shqiptar koka, mbiemrin kyqyku
  Nc po qa po thu o ermal
Urime 8 marsi per drejtueset e dynjas!
 HAHAHAHAHAHA O JA KE QR prit te boj une najnjo
 S'je e vetmja... hehehe
Mitrovicasit tu shku ne neja ne Vushtrri… qysh ka ndrru dyjeja
 O vlla a hyp 2$ se e kom shti shpin nashta e nxirri ni penthouse
Paaaaj sa lekt i kan marr kta prej neve, gjys milioni osht t’ima hesapi 
I sinqert ky djali kom respekt shume ndaj tij 
 Je bo ekspert i pikupllajnave
Shyqyr qe e la Putini me nis luften masi u kry Big Brother se skishin dite shqiptart a me komentu situaten ne Kiev… 
Ja qiv ropt ncncnc 
I ra rusi ukut,  ni kafe borxh ja kom
Po qa karisi bre nga ju
Njo e nodhet e tet pak teper po qa me bo……… 
Kqyrum prom me kasirat ka ni bilete per Miami GP 2022 me kushen po ishin shit biletat
 T’kisha rreth thuper t’lakt shoq trupin varr ta kisha bo flm jom nervoz se jo
A ka njeri qe si han kari per bb o vlla po me kan mu interesu per msime e ven tjuvin shkaut dej n’beograd i kishum… 
Te tjeret festojn une msoj Java flm klb
A ma qiven, mshkun qato 70$ crypto qe i kom shti 
Dikush bomani ni qasi license t’mercedesit amon 
 Lem tmys n’soni niher
 Respekte vlla, qashtu duhet
 Me tweetsa a me qka
  Ma paske palu valla
Po thot ni jaran i jemi “Femnat qa kryjn shkolle edhe jon tinzake jon shum t’rrezikshme” per juve e kom eh
 Njo bre se tjert jon havera shume, edhe kom respekt t’madh per ta, a njonin e kisha faru
   Im gjaun qe ta kena thi karin
Ma me lyp me ja qi 700 nana se ni prof ne UBT kush s'lyp.
Sosht hera e pare qe bros share hoes 
 Kush je ti shok? Hehheheh veq birra mik
Nese isha kon naj drug dealer i fort nicknamen e kisha pas Katunari
 Jeta per ty ish kan shoqe veq vazhdo me udhetimet tua neper vende turistike
 Jeta per ty ish kan shoqe veq vazhdo me udhetimet tua neper vende turistike
 Jo amo pe ngojsha
Kur po i thom  qe Hamiltoni o tjeter brum po ma lun qoken 
Hej sa po thoni shkon SAITAMA edhe VETi
Kesh tu menu qka me tweet najsen
Po du me shku me punu si bodyguard ne angli e me ardh me hi aksionar ne naj kolegj mi rrzu studentat per 4 pike veq pse jom klloshar
Allah allah ska sen ma big 
  Shuj se pe pres 32shin mja gju ni 4she
A osht e vertete qe ne 2025 ko me ndodh ni uragan hapsinor me rreze t’diellit edhe ko me kon vdekjeprures per njere… 
Kadri babes i paskan ardhe side hoes n’darsum. Ja pse eshte king!
O pasha ropt po shkojme tu u plake, e hiq spo e vrejna!
 Amo edhe Spiderman NWH kryeveper ka dal
Kur ish kan i vogel skish pas, tani qka i kish ardhe per dore kish shit 
 A je e interesume per vllaun n’Holande
N’bollovaje prej 31 dhjetori
 Amo po vrehet n’foto te profilit qe ty s’tka fav girl hahahhhahahaha
Shkijet pedera aaaaaaaaaaa HAHAHAHAA 
Veq n’mengjes, se ton diten a? 70.  
Prej 1ve dej n7te tu nxon arusha ne Germi
Tash mbetet te shihet ne ditet e ardheshme,  fiton ne exitpoll 
 Na jem jarana moti bir, amo Erjoni ko me t’prish tu t’rreh
 Ti o djali i mixhes ropt ja qin
KUSH MENONI QE FITON NE NJE NDESHJE BOKSI  
E qon ni E, tani shkon n’restorant ne dasem e bon atmosfere
Katunar i Kçiqit vllaqko, amo une kom rryme.
 Kur po kishe pare shume, spo flejshe rahat
“Rri mire t’qes ni foto” 
Nana e vakive jom bre ropt, qa sum ka gjet edhe mu!
Po du me kqyre apet SpiderMan No Way Home 
Uneee te leeeee nuk me le tiiiiii
 St’kane faj njerezit qe je e gjate kushe hehehe
T’qifsha gripin e nanes, ma ka shtre per toke
Mi than Magjup pe qet ma zotni, a Maxhup shum i gubaft diqysh
 Pse kaq depresive, a m’more lakmi mu qe kom kalu nje dite te bukur sot a hehehe nrm
 Eroll kur ma ke bo sot tedua, menova qe friendly. Amo qitasht sjom tu u ni mire vlla…
 Ja paska qi dekt
Tu prit mu ngjit llufi me ble ni mercedes tkarit 
 HAHAHAHAHAHAHAHAHAHAHHAAHAHHA JA KE Q ROPT
 Semafori i kuq bizi bizi
Tu shku ne provim te SD1 masi si di gjysen e detyrave 
Qaq bored ja shenova linkun vet 
 Pranoj mu djeg nferr per kete veprim qe kam bere!
 HAHAHAHAHAHAWHWHAHWHHAHWHAHA MOS MQIT NDELL SE KOGJA NIFAR PATRIOTI JOM
Ke tu mkap gjumi, edhe mu kujtu forja e  kur e ka vet njoni hoxhen “hoxh a o haram me qi femnen n’kom”,… 
Qka pata bo tu kajt per kit njeri ncncnc 
Betimi: Spom rrihet, hajt ti anuloj ligjeratat..
Qellengji juaj per sonte o me thon Rika shpejt
“Jeta o si rrota, sa shkon n’asfallt drejt, sa ja qin nanen hin neper lloq e neper gropa, po ma qanej apet del n’as… 
 Ma ka dhon ai nalt
Dite e mire sot.
 S’je e vetjma. Urime!
Pse vlla kur jom n’lidhje m’shenojn femnat, diqysh a bon kur jom single?
 Dalja e pare publike e UÇK. 
 Mos ta nin se sleqna rib qitu jet n’twitter veq
 Pse e ke provu rib a
 Pse spe qin magjupen, t’kthehet zari
Mitrovica, ky vend i mundesive.❤️ 
Marakli t’kerreve, ku muna me gjete ksi mbuloje per kerr? Flm paraprakisht 
 Saher ta shoh nje shka, ose shkin gjithe e menoj qysh ju kish nejt sheja e plumit n’ball
Qfare kongsh i qoj erollit, qfare m'qon ai mu... ncncnc 
Fatmira Brecani - E vogla nanes 
Qija jeten far muzike big
Albioni ma ka qite nermen, shume nostalgji na solli kjo muzike…
Shume lehte munet me gzu i riu 
Zotri Skandali jam une, ne first date m’qkepen pantollat te patenti.
18 vjet land n’gjykat veper penale brrrrr sdokna per qashtu po qe
E bon provimin 30 pytje a 14 prej tyne jon t’njejta po veq ka ni pike ja u ndrron edhe per qata jon keq. Boss o
Qe qitu shume i rregullt ne dergimin e detyrave tek lenda e profesoreshes me te mire ne UBT Vesa Morines, qa bOt ju h3h3h3
 Ko me shku sinepleks me kqyr
Me torturu djalin me ramzen e besen qija nanen 
 Ajt bablak se mu mka jep Rexhep Gjergji e se kom ba tmadhe kjo kishe une diqka
Une masi t’ia shti nkry grus tem kush o baba i formules 
 Une sta zgati muhabetin une ta kryj
 Po tyben mkqyrke ajo prej ni kerri tfort a une tu kcy si karcell n’kerr me nxan hezin me tdyten qe mu dhez
Une n’ligjerate*Nderkohe mas 5 minutave: majmunat  tu  kcy 
Une edhe  tu kesh me foren me kaoboj qe na e kallzon  
Shkatrroj bateria te telefonit
Nejse e ka kry me 3 guma e spe kryn me 4 hehehe 
Kur folin shoferat tjere ski qka mo 
 Me flok t’gjata qysh ki qef ti e ndertuar
Nashta ju shkoj per raki njerzve me F1, amo fatmirsisht nuk m’han.
===