...e atyre qe dhane jeten nen emblemen e saj. Nuk mund ta nencmojne kalimtaret ate qe e ka lartesuar historia. Por,… 
Te mjere jane te gjithe ata qe mendojne se lavdia e Ushtrise Çlirimtare te Kosoves mund te zbehet duke mos e permen… 
Po ku i ke gjete keta hajgarexhi te sondazheve o Berat ? Po me vjen mire qe krejt panelistat e paskeni k… 
  Nice! Kurre s'eshte vone. Bile hala jemi heret. E sidomos per DeFi. 
  Veq duhesh me me percjelle ne twitter, krejt i merr vesh. :)
 Ama foton mire e paske bo :)
Me t'u dhimte n'shpirt Amerika qe s'e pat ni minister t'hajrit n'kete kohe krize. Atje papunesia ish rrite ne nivel… 
 Ose dikush po rren?! 
Per ta bere situaten edhe me te keqe, para tri javesh ministri ka deklaruar se ne KS kane arritur edhe 7000 teste,… 
 Pajtohem se disa veprime eshte dashur te ndermirren cysh ne fillim te ketij muaji, por tash jemi ketu ku j… 
Besoj se ka qene e pashmangshme prezenca e koronavirusit  ne vendin tone, por shpresoj se Qeveria dhe insti… 
 E keqja qe ti e din se jane te manipulume - ne fakt, kushdo me dy pare mend e dallon qe s'jane te ver… 
 Meqe ne kete "komunikim" qe e paske nxjerre nga arkiva me paten perfshi mua ta shkrova kete tweet.
 Vehbi, si gazetar hulumtues qe je, cudi qe s'po e din qe keto jane "mesazhe" te manipulume qe s'ju ka… 
Pas tre vjet e gjysme pune intensive dhe perkushtimi serioz, sot Meliza mbrojti me sukses temen e doktoratures ne U… 
Berat, masi s'qenke gezu, a kaq veshtire po te vjen me e pranu qe sot e ke mashtru nje Kosove me lajm te rrejshem a… 
Duket se deshira e flakte e disave ne Kosove per t'i pare udheheqesit e luftes clirimtare ne banken e te akuzuarve… 
Faleminderit  per kete kujtim te bukur sot. Pa dyshim, ishte nder i vecante per ne dy qe te fillonim… 
Kam pase nderin jetesor qe te jem nje nder nenshkruesit e Deklarates se Pavaresise se Republikes se Kosoves, me 17… 
Sonte djemte e Kombetares se Kosoves na ofruan ndjenjen e jashtezakonshme te fitores dhe te krenarise. Faleminderit… 
Sot, ne Buenos Aires te Argjentines, kane filluar Lojerat Olimpike per te Rinj, ku Republika e Kosoves po perfaqeso… 
Te dashur miq, ju ftoj ta lexoni kete interviste timen te dhene per Gazeta Express. 
Si sot, 100 vjet me pare, u themelua Komiteti "Mbrojtja Kombetare e Kosoves", qe mblodhi rreth vetes nder patriotet… 
 Jo domosdoshmerisht Fatos! Projektet e mira dhe me vlere mund te gjejne mbeshtetje, pavaresisht se a… 
Nje opinion i imi i botuar ne numrin festiv te gazetes Zeri. 
Gezuar Vitin e Ri 2018, me deshirat me te mira per shendet, fat e suksese per te gjithe ju dhe… 
Pas kater vitesh, perseri mora pjese ne Forumin "Peace &amp; Sport", i cili kete vit shenoi 10-vjetorin. Ky Forum ka qe… 
U prehsh ne paqe Bajram Rexhepi. Do te mbahesh mend si njeri punetor, i dashur dhe i sinqerte. Ngushellime familjes dhe miqve.
Djelmoshat tane na e bene zemren mal me fitoren e sontme qe e dergoi perfaqesuesen tone te basketbollit ne... 
Me Malin, ne perkrahje te djelmoshave tane! Forca Kosova!  
M'erdhi keq kur e lexova ni reagim te Shpend Ahmetit, se edhe ate po duket ia kish shkru Dardan Molliqaj. Shume... 
===