 Valla une e di qe njeriu ku lodhet e merr gjumi leht e shpejt.
Qka me lyp ktu,tash osht cool me kon Arab.
 E paske bo pis knaq e paske. .Ku qfar zhgenjimi je tu na sjell.
Sa injorant duhet me kon per me bo ksi pytje bre?- Kur je nder kontribust per ndarjen e saj pyt per bashkimin.… 
T'dashtun, urime Fiter Bajrami!Zoti ju ruajt e ju dasht.
Nganjhere kam bindjen se nime osht ka e vet dikush  se qysh ja kishe bo.- o boss besoj e din qka dmth analist 🤷‍♂️
Isa shkoll boll po men hiq.
Menyra e nxjerrjes se konkluzioneve nga Ilir Mirena osht "haj medet haj" 🤦‍♂️🤦‍♂️🤦‍♂️
 E pash ni ander qysh n2022 na kish sulmu ni virus i barkit, rrishmi kejt me pampersa edhe thojshmi sa mir kem me maska
 Qarkullon ne jem te veqant ne qarkullime 
Diqka te bukur nga 2Ton: birribam bam bam bam 
Dikush shume mandate e dikush veq nitro.
  Hehe ani presim ne.
Paramendo nifar vakti folshim ne Messenger gjys ore na shkojke tu than a pom nin, 5 min folshum edhe u ngishum. 
Mos harro me thon aha edhe me vazhdu perpara.
Zakonisht zyre - shtepi merr kohe 20 minuta.Sot 1 or e 20 minuta.- Vetem per ni kafe a dilet oj fshis e qaraveshn… 
 Valla nganjhere po menoj qe jemi popull mosvet veq Zoti hajr e boft.
Pa mask edhe vet ne makine.- Kur nisha qe pi denojn thojsha ka diqka aty.Deri sa e hongera vet.
Qysh tash pi bjen me i than Albini prap Agim Veliut t'shkarkojn  aa 
Krejt llug u bo se pak u kon.
Ja nisi me folqysh duhet me ju bo shkive e kshut me radhe- ishte ul duke ngren plazma
 Kur merresh me Discord tbjen edhe flamuri ne emoji list 
Ke than mbyllja totale so zgjidhje ka je nis tash o vlla  ??? 🤷‍♂️🤷‍♂️
Duke perfshi  ne .
Çdo kush qe e ve ne shprehje perndjekje  per bindje fetare ne luften e Kosoves ose eshte budall ose ka qellime te d… 
-Megjithse une si respektues i rregullave 5 ose 10 ma teper ama prap 
Nese e shihni rrugen qel asni kerr nto mos i grahni shpejt se qe dy here pe ha qashtu.
Zafa shume i dyshimt osht ka me doket  
Do njerze jane ma fake se Feka te seriali 'Kafeneja jone'
Shoku e vret shokun per 20 euro 
 Mesiguri spo ju pelqejn qka po bani *like*. 🤷‍♂️
Bota eshte bere shume e quditshme. Krenohen per ate qe ne fakt duhet te turperohen.
Bartja e maskes po ta letson more jeten, kur t'hapet goja ske nevoj hiq me qit doren. 🤔
 Privatisht kshilloje bre ne menyren qysh kishe dasht dikusht met tregu per ni te met qe e ke besoj qe d… 
Pe du bre pak Diell mu ngroh.
Kush i shikon fotot e vjetra.E mendon 🤔 - Nje nate u duke me mrri ne Durrs. - Nje nate prej Vjenes ne Prishtine. 
 Kemi kendveshtrime te ndryshme:Mesa po e shoh po thu me mir me u pendu se me i ra pishman.Nder… 
 Por pastaj zhgenjehesh bre nese i'u jep vlere me shume sa qe e meritojne.
 Demokraci me vnu shkavin edhe n'AKI ja qetu mir e ki.Stkisha shkru por i mllefosun jam tu u ndih.… 
Biseda me shpesht me kolegun. - 5 min para perfundimit punes. 
Kur shkoj tek berberi edhe so askush ne rend.Une: 
 I njejti lloj qdo vite bre e njejta ftohtsi e njejta mendjemadhesi vetem se tani munges kontakti ma't t… 
Njeriu nga natyra nganjhere  ka me shume nevoje me shume per vemendje, besim dhe respekt se sa per dashni.
 Sa harxhoni koh me i bo foto perfekt Kuranit edhe sexhades , pse nuk munoni mu kan perfekt ne praktikimin dhe leximin e tij…
Problemi nuk eshte gjithmon me ata qe mekatojn, por me ata qe mendojn qe jane te pagabushem e kjo I shpie ne arrogance  dhe mendjemadhesi.
 Ka nivelin e detit me te larte. 
 Qysh i buzqesh ftyra kur thot:"Sa t'kam une jete jam Shqiptar." 🧡
Gjendja aktuale, jo prej agjerimit... 
Urime muaji i bekuar i Ramazanit.
 Basha valla ma more fjalen prej goje se sa tweeta i pash deri tani te kti lloji.Hajr e boft Zoti.
 Pha une vetem prej kujtimve pe shoh. 
Disa njerz jane sikur ndjeksit e  ne twitter ska asnje postim apo tweet por e ndjekin 4.2 miljon veta. Dmth… 
 Ka sallat, han shendetshem .
 - Besoj qe eshte vendi ku shikon edhe si i shikon.Mesele: i paten then hoxhes ska vajza te hajrit, j… 
 Po valla notification shpesh nuk vin, duhesh me loadue manualisht ndryshe nganjher spo shfaqen mesazhet etj.
Spaku gjate vikendit gjejm kohe me u marr me punet e kopshtit. 
 "Per njeriun, me e rende se sa vete urrejtja, eshte injorimi. Te pakten, ai qe te urren te trajton si qenie te gjalle, ai q…
  I/e nderuar me gjith respektin mendoj qe duhet ta lexoni edhe nje here qfar kam thene seps… 
 Kshtuqe njeki andrrat si me pas mbiemrin Bolt. ✍
 Nuk ju kuptoj pse e ofendoni, ai thjesht ka bere shaka, ate shaka qe ju ja keni mundesuar per vite me ra… 
Mos ma trego historin qe te pelqen, por ate qe te ben ta ndjesh.
 Tweetat qe kan kuptim.
Ku i nin fjalet e atyne qe ju vlersojn.- pha Zemra don me dal prej veni.
A nuk i numrove sekondat sa zgjaten kur qe afer litarit te vdekjes. 
Nuk eshte me rendesi fare qa thu me fjal, nese zemra renkon pa ndal.
Ngushellohemi me kohet e vjetra qe i kem kalue sepse tani vetem i numrojm ditet qe jan duke u harxhue.
Ju marrim zemren tjereve kur ju tregojm historine tone qe na shkerrmon thell mbrenda nesh.
Kadale se njeri jam, gaboj!
 Nganjhere ndodhesh ne kete gjendje edhe pse ndoshta e ke mire.
 Ju ka thon presidenti 🤦‍♂️
 Paramendo me ja hej qet "stupid" ish dal shume ma mir besom.
Kta me mjekerra po marrin mill per me mbajt mjekrren. Hajde  ma gjall.
O vllazen e motra.- Duhet me marr seriozisht gjendjen ne te cilen ndodhemi ndoshta nuk eshte problem per neve qe j… 
 Besoj qe dora e djatht osht mbi te majten veq video eshte bo flip prej djath ne te majt. Logot ne rroba za… 
 Fatkeqsisht aktualiteti i diteve te sotme, ndersa per pytjen besoj dyt (edhe pse ne kete rast vajza mund… 
Valla bre  po ma kujton kohen kur ishim fmi, per ni faull e merrsha topin edhe kerkush nuk lujke mo.-… 
Kur i shoh njerzit e lumtur, tregoma pse je i/e lumutur ndoshta nga arsyeja jote lumturohem edhe une.
Nese nuk keni qka me bo ne kto dite izolimi.- Sfidoni njeri tjetrin cili po lexon ma shume libra.Fitim i shumfisht.
E kish ngre komen zhag ai i pari qe erdhi prej Italis. 
Qe qitu ku degjohet fjala.-Shuj se qa'aij koka Shqiptar.
Pash Zotin mos fol ngjit se nuk po te marr vesh.
Keshtu duket nja bankomat i zakonshem ne Republiken e Kosoves fatkeqsisht.-Se di pse nxjerrin letra kur nuk ju du… 
Qefi ma i madh se Stambolli.  
Kur don me prish rutinen e punes, me bo ma atraktive. 
Ngushllime per presidentin.Nuk me perfaqeson dikush qe me injoron. 
Tash a Albini ke kryeminister deri tash apo Ramushi. 
 Une erdha po si sem pe.
Kogja interesant koken bo debatet politike bre.
 N'faqe te par t'kti libri mos u ul n'tok se ftofesh. 
Shohim gjithqka por harrojm veten tone.
Kur mvesin t'shpis pse po man shkrepse duhanin se pin.-Si dihet si puna e ktij! 
 Athu sjan te interesum per 100 po per 1 apo kan qellime mat mdhaja 🤔
 Munët me kon dita, minutat, sekondat e fundit qē fol me dikon vlersoje edhe thuja fjalt ma t'mirat se kurgjo nuk t'kusht…
 Shum sene fillojn me at shkronje po ti mos kallxo per te tonat. :wink
Kur pret dikush me ja bo like tweetat ama ti nuk hyn nto hiq. 
 Jo ja kem bo delete pahiri. 
Disa njerz jan t`parendesishem sikur  numrat e telefonit pa emer n`to.
Skem rrym, skem uj, skem internet.Ama kem semafor n`Llap.
 Sinonim i asaj: Zoti ta jep trunin perdore ate.
Nje mashkull ka aftesi me u ul dikund edhe mos me mendu kurgjo per 15 minuta, gjinia e bukur smundet.
 Valla i nderum Vala 4G nime shum te dopt kurse Ipko shume te shpejt. 
Po ta dinin njerzit qe na urrejn per dashnin qe kemi ndaj tyre, do t`u qahej zemra ne dy pjes.
Shumica e mendimeve t`mia te shprehura ne nje video. 
M'pelqen leximi, leximi i syve t'njerzeve tregojn gjithqka pa i pyt.
Krejt senet n`terezi veq per greva na kish marr malli me ni.Bravo bre. Dy asestet kyqe te shtetit ne greva (mesimdhenesit dhe mjeket) .
Po te ishim kembngules ne shqiptaret edhe ne krymjen e pyneve siq jemi ne pozicinomet politike vertet do kishim zgjidh shume probleme.
 edhe fjala vret sidomos kur dikush i afërt e flet
E kam shkru ni leter osht si poezi e kam fut ne shishe e kam nis per tek ty, por sdi nese najher ajo a ka me mrri,… 
 Dhe me tendenc qe me ngrit veten ne sy te tjereve karshi tjetrit.
Gjasht muaj burg e barabarte me 3500 Euro.Dmth tash per qdo krim shtinja lapsin me kete vlere.
 Tek revolucioni, sipas kendveshtrimit tim.
 Shumica e femrave te cilat zhgenjehen nga personat qe i dojn, pas kesaj bejn ndryshim total te jeten… 
Borgji eshte lare 20 vite me pare. 
Shanset per te fituar zemrat e njerzeve nuk vin shpesh.
Lusim Allahun te ju jep saber te gjith vllezerve tane qe kan humbur te afermit nga termeti i dites se sotit.
A ka jete pas vdekjes? 
Mos e tepro, qdo gje e tepert nuk te sjell dobi.
Te disa, fjala legend qajo "d" ne fund pom doket teper.
 Ose ne nuk i merituam e Allahu i largoj nga ne.
Kjo bote eshte e destinuar te ju thyej zemren tuaj sa here qe lidheni me te. 
I japim diteve emra sepse ja kemi harru vleren.
 Zoti ju shperbleft per permisim 
Harrojm te falenderojm zotin per qdo dua te refuzuar, duke mos ditur qe ajo eshte me e mira per ne.
Kanihere eshte mir me tregu mendimin pa tu bo von nese dikush preket prej te vertetes.
Krejt bota: Te dua 2 fjale 5 shkronja 1 dashniShqiptari: 
 Bukur por mos perdor full HDR sepse po duket fotoja shum e vrazhde.
 A hiq s’po ju vjen marre me i qit disa gra me miniqa demode me i prit futbollistët a? Pse jo fëmijet mos me ju deshiru mir…
 Shqip:  mos kesh shum se te del idhnim.
 Pa dasht me ta bo bajat veq edhe ti koke frrik ktu. 
Sot vin Anglezt silluni natyrshen mos u boni si t'qarten mos t'menjon se jena xhin t'egjer.
 Te gjith Kosova me juve Forca Kosov  
Nderkohe ne merrjep.Reklama e monego: merr kredi ndersa me posht ofertat e biletave per ndeshjen Kosove vs Angli. 🤷‍♂️
 Spo di as cka me bo ma shume. Po kqyri rrugeve kah po sillna. Shpresoj qe gjindet shpejt kjo nene Ta ndihmojme familjen.…
 Ne shumicen e rasteve vet jemi fajtor sepse i vlersojm shume ose i teje vlersojm njerzit edhe jash… 
===