  Detyrat e Shpis nuk ndalen kurr. Mire e ka ministrja. Vazhdo punene tende dhe leje EU te b… 
 Valla shume po Ju dhem Buzh. Por ky eshte vetem fillimi.Tash po dalin hala hala, sa sendviçi sa sene. Po… 
      Kesaj here e rrezojn t’rasht e surrles. Dhe sillen rreth sajna.
 Pse me u mar mediat e beogradit kur I kan keto te Buzhala. 
 Urime per djalin. Zoti I dhasht shendet.
 Ky po shkon me u takue me Vucicin ne kohen kur e ka caktue vete e JO vucici se pari me e pastrue venin qe… 
Une NUK urrej askend. Sidomos keto fobia qe I ke. Une pikerisht  (Ortodokese) kam ne Famije. Gjykimet tuaja jan… 
  NUK beson fantazira por te tregoj qfar po shoh me syt ketu? Shqiptaret 100% te lindur me Shqipe… 
Duke filluar nga puntoret e mi ketu. Deri shume te tjere. Sjam I sigurt be numer. Nji shqiptar I quajtur Fotis -… 
  Ketu ne Londer shume nga jugu flasin gjuhen Greke ndermjet veti. Shtrohet pyetja PERSE? Kur e kemi gjuhen ton shqipe.
  I ka hy fitili per mas e po kercen
  Serbia, vend depresive, I manipuluar, pa shpres, pa rini. Ne at vend vetem shkon duke u keqesuar g… 
 Kjo e fundit erdhi shume me vones.
 Ne Qfar sondazhi eshte kjo?
  Urime Jemi krenar me Vjosen.
 KOSOVA nuk do te jete streh e Krimineleve. JO ME KURR.
 Me bllokim nuk bon gje. Duhet ti pranosh ose JO mendimet e te tjerve. Pa mar parasysh se a te pelqejn apo jo.
 Londra para pak minutave;1 ore e gjysum pritje per vaksinim. Kjo qender ketu sherben per nji pjes te Lon… 
 Para pak minutave Nji nga qendrat e vaccines ne Londer. ‘ Barnet’ nji ore e gjysem pritje per nji vaksinim… 
 Pajtohem. E them kete me ironi.
 Ose te pasur brenda nates ose fukara me tradit.
 Shqiptaret e kemi nji te mire;- mendojm vetem per sotmen Ha, pi, be qejf. Qfar bjen e nesermja mire se v… 
 Kjo e fundit na ka kushtue me de shumti.
 Puna e Padis se Genocidid Serb nuk lindi tani per tani Tek  Per kete e pata fjalen. Ne Kosov… 
  Mos ke frike Shqipe ska lufte. Keshtu e dojn ata. Siguria e para pastaj ekonomia mire qenja socia… 
 Hajt mos u brengos. I kan do sene tjera me I ba - te opozita ju ka tuta nw asht. E tash po kqyrin me I rre… 
 Te dyt shkojn ne kontrolla nuk ju kan then kurgju njihere.
 Te njejten pyetje e kam une. I kam prind e moshuar 87 vj. baba, 80 vj. nena qe te dy kan smundje dytesore… 
 Bajraqet ne Prishtine qojn veten be Hag? Get it?
 Shume.Tek ne, ne veri-lindje thuhet;Kur ti lidh kembet vetes nuk ti zgjidh dot kush.
 Tani duhet ndarja Apo? Taman alla shqiptare.
    Kjo eshte pikrishte ajo Qfar Serbia ka munduar te argumentoj. Por KOSOVA esh… 
 Nji gjykim i ulet.
 Ne Qfar gjuhe I boni lutjet I nderuar kris?
 Verioret? Qfar problemi keni me verioret dhe jugoret??
Gazeta e Buzhales meret me krye - shkjaun Petkovic e paska kritikue Kurtin. Po gjithsesi e dim qe Kurti nuk I per… 
 Per nji njeri qe ka pak sense te kuptimit ky aludim i Keti gazetari se gjoja te gjith pensionistat tek e p… 
 Qfar do te thot KISMET? Me nji permbledhje ma te gjere?
 Pika pika mbushet gota.. te mirat vijn ngadal ngadal.Kjo jete eshte shkall shkall. Me rendesi te kemi me Qfar krenohemi.
 Ke te drejt me u tut. Nuk te bej fajtor.
 KOSOVA e mbron veten e vet. Nese nuk ka mundesi KOSOVA ta mbron veten. A’there Moralisht Shqiperia duhet t… 
 Eshte ofendim historian i nderuar te thuhet se perendimi po na mbrojka neve. Neve e kemi mbrojt veten Edhe… 
 Xhandar- Marie e Serbis I ka krye keto krime. Janar viti 1919. Mrapa E digjet Prapashticen. 20 km larg PR.… 
===