  Irani dhe arabia saudike, me ma shum homosexual ne bot, ne iran secili i dyti mashkul ka provu m… 
Valla nuk sherohet, edhe do hoxhallar ja kishin pas nis me u lut qe ta fiton Turqija betejen ne Çanakale, kur e mer… 
     po, UCK e jo kta pishpirika qe u mshefen neper burgat e serbis kinse
  Ho mor qyqan muti, kqyre vendin tand se u bot oer rezil, tuj vra gazetar e marija tj… 
 Ska gja te papranushme, per t miren e saj, mozot alla, superpesha me Covit asht fatale.
 Bravo, krejt me dredhija mbrini n pozicion. Populli e din, e sheh, pret, duron por sta haron moj Vjos,… 
Hajt ta shohim qka do t bon kjo femen presidente, po gjith e dim se Vjoses nuk i ka interesu gja tjeter ma s paku v… 
    Po tutna mos tja jap virusin telefonit e mos tja ngjes Vjoses, i bje zaif prapanica. 
   Kesh tu than ju ha dhipin, ama qfar dhipi? Dhipishte mashalla ka dhan zoti tul.
   Auu qfar organizimi u shkoqen tu bo pazarllaqe,
   Ha de ha, vjen mbreti.
   A vetem pse asht grue,?? qfar krenarije, 100 dallavere i boni deri sa u bo......
   Per qfar lirije flet mot tup, lirin na e prun UCK me USA, kta muta as UCK nuk e dojn e as USA.
    Qfar hajri mor vlla kjo asht aq e korupt sa kile ka.
Qysh se myten shkit ather n parllament nji mut ma pak n popullin shqiptar, bre far e poshter, familje tradhtarsh.
Afrim gasjit edhe kti mutit tjeter jau qifsha  robt e shpis edhe krejt qka kan 300 metra reth e perqark shpis, naj… 
A thu pse e shtyn deri te mujt e pushimeve verore, diaspora kthehet n vendlindje, bojn provokim te ashtuquaterit "m… 
 Shko bre fotografohu, se askush spo te ze si n ven t njerit e leje mo naj....  Falni nderin Qekis… 
  Po, domethanja asht netnshkojn n rrot nanes qata dietar🤔qe e qpiken ket logo🤣
  Na bon , vetem dallimin e kem, na reth 2 milion ata reth 2 miliard🤣
 Avash avash, krejt Kurtat kah jan e kah nuk jan do ti fusni n parlament, kshyre mos ta importoni ndonji Kutd nga  ose turqia
 Kur t peruleshnxhitja.....  🤣 
 Eh kjo asht pak teper. Dhasht zoti te ken nenshtetsi kosovare,!?!?
 Valla hallall ju koft, bonet qka bonet, gaz hodhet, bomba hodhet e bonet rezil parlamentin si inn ash… 
Ani u myt tu na than Erdogani se na ka vllazni,  ndihmo me financa e inveatime, n Kosov ndreq xhamija e medreze,P… 
  Hamas paska kundershtuar hapjen e ambasades ne Jerusalem. Pse hamas nuk i kundershtoj lideret… 
===