 I mrekullueshmi Simon Shiroka!
   A e njeh Bleti a? Sa mire!
 Po bash ai osht!
  Me kete me ja nis!
 Oh, kenga qe me pelqen me se shumti nga Violeta!
 Ka edhe ma zi, "mos u lodh!"
 O kuku cka me ka shku ne nerva!
 Mos me fol hiq poashtu eshte opcion!
 Kur ta don, ta don!
 Ahahahahhahahahahahhahahahahahahhagagagaghahahahahh! Me zo kesha!
 Pse cka tha Shpendi?
  Krejt barra ne po i bjen qytetarit te infektuar vet. Ne versionin me te lehte rreth 100 eur… 
  Ne fakt prodhojne shume bashke me Aiden! Se fundmi ka paralajmeru nje rikthim. Te shohim… 
  Oooo kshyr po mire ja paske pikat!
 Kta qe po i permend ti ne rradhe te pare e kane vjedh thirrjen!
 Osht kogja ma komplekse kjo pune, se sa a e mire a e keqe!
 Ska kthim, veq vonim!
  Gani, kete "Bisede mes hekurash" ta siguroj une!
   Ooooo diqa bre! Bravo ju kofte!
 Po intelektuale te pavarur! Te lutem!
 Hahahaahaha! Perndryshe shume nice kang osht!
 Hahahahahahah! Shume e fortë!
    Bleta e paska nderpre diskutimin se sju ka duk mjafte i denje me vazh… 
   Spi vjen marre moj, se spo e njohim na profesorin!
 Ma e veshtir ma, veq vdekja!
  Gani nashta po dal pak prej teme, por i kom degju cd-te qe ja ke dhuru Agonit. Fort me kane pelqy!
 Botha sma ka ni!
 Kane punu shume valla, por spo kemi mundesi me i pa! Qe nje shembull Agon Myftari! :)
 Sa sexy tu kakan
 Shume lajm i mire! Urime!
  Hahahahahahahahhaahhahahahahahahahahahahah! Spo me besohet! Hahahahahahahah!
   cka ka me kesh ktu?
 Paj zaten veq per ate tille ka hapesire. Jo vetem neper televizione! Gerrdi!
   Po, prandaj po them me reflektu VV-ja e edhe me bajt gajle se ne fund te fundit barra… 
   Po po ama me Levizjen u bo krytar! Duhet me reflektu per kete sen!
  A shpetun politika bre?
 O zot sa e tmerrshme, plus ka mujt me vazhdu me punu ne spital!
 Ama i ka kerku falje!
Falemnderit! Ma ship ska ku shkon! 
  Nuk osht deklarate konfuze por osht dalje ne mbrojtje nje politikane e ky sen osht i papranueshem!
 Na mire mos mi mshel kurre!
 Jane tu lujt basket!
Rrahje me dituri! Bravo ju qofte! 
 Po po e lypni bre, kah po silleni! :)
 Hhahahahha, e paske qa!
 Po se u munojke me rrejt nersy!
Sa ma shpejt, aq ma mire! 
 Po ksi pite, fli!
 Se dojna me qit foto ne instagram!
 Astrriti: Qeveria po dojke me ba automatik se manualin s’po e lexon askush 
  Jon dy sene te pakrahasueshme.
 Shume me pelqej kur ju pash ne Interaktiv!
   Mu mos ma bon tag
  Beja follow ne instagram per me shume ngjarje nga Besi!
 Ku po banon ti?
  Ja duhet me me dasht ja mos me me dasht!
  Qeky Agoni me ka baldezke!
  Ooo ska me ferizajli bre!
 I tepert ku sduhet, i munguar ku duhet!
 Kallxoj Arbeni shul ship!
 Per kon e ki fjalen, edhe pse bash per insajderin?
  Ku mujme me lexu?
 Po hajt se dy jave mo! Sbohet nomi!
 Shume deklarate e ulte e veprimi yt edhe mai ulte!
===