Deklaratat kan fillu me panik, panika dikane, e bane te famshem..por ja fama e shpejte sjelle pasoja.
Ku e lam' e ku na mbeti vaj-vatani e mjer mileti.
Y. Mushkolaj, Kur po ju bertet ne studio  muasafarve, a thu i ka te selektume apo krejve ju bertet qeshtu. Po e sho… 
Mediet duhet te jane me te sinqerta, patriotizmi i tyre dihet tash, via e frontit te pare,  munde ta ndihmojne situ… 
Kush nga ju bahet serioz dhe i tregon popullit dicka seriozisht..e para pse nuk po behen teste dhe e dyta cka kemi… 
Sot bukur mire kane funksionu tregjed ditore, edhe nese respoktohen masat neser, kjo me tregje sot e ka dhane testin!
 Qeshtu eshte kur t'nreqen senet....
Lider e njerz me fame, dergojuni mesazhe miqve tuaj qe te rrin n'shpi..hajt se juve ju ngojne...Rri n'shpi
Apo rrim n'shpia tona ajo, a po e bajme krejt si Agimi e si Albini e si krejte qytetaret e globit. Te pakten nje 14… 
Albini dhe Vjosa, po i thojne Beratit dhe Parimit punoni ne piarin tone se po na bjen popullariterti. Jemi ne kriz… 
Nje koalicion qe e shfrytezon nje situat te rende, siq eshte Corona Virusi.  Voton buxhetin vetevetes, prish marrdh… 
 Blerimi, po don me i dhane hapsir Serbise me kalu neper oborre tone e drejte e n'deti. E sa i perket… 
Blerim ruju incidenteve-Nese jo, mire e ka opozita hec vella ne shtepi. 
Apo thojne tash ministrat jane pijunat e Albinit...shfuqizime e fuqizime te vendimeve krejte me urdhera te Babes.
 Keni ba sa dush shikushmeri, ja keni nreq vetes renet ti dhe Berati me fole cka dush. Misoni ka me ju z… 
Berati dhe Leonardi, e kane mision me ule nivelin e Thaqit, e shfryezojne  mundesin me te mire, kur kane shikushmerin me te madhe.
 Mos me pas shofer ju kish shty arrestimi edhe per disa dite.
 E pata ne fillim sa per shaka, ma more si tendenc, prandaj te thash neser qe te jame sonte gjeni.
 Dika duhesh me qen i forte Astrit.
 Tani u be vone, me lexo neser do te ju shkruj perseri. Kaq ishte per sonte.
 Me rendesi e paske kuptu mesazhin. Pasagjer
 Me pasqyren tu be prova.
 Keto komente t'shkojne ty kur te jesh posagjer i Beratit.
Sa vota u marre me premtimin se kurren e kurres nuk ka me ule bashke me Vuqin. 
Hakiu qenka milioner, Dulla tre banesa ashtu edhe te tjeret nuk ishin keq ka 5qinde mije...hec e mos u gezo Berati kaq shume hahhahah
Urime dita e veteranve! 
Une vendosi dy here i pari, pastaj ne te treten radhe ti vendos i pari.
Sfeçla a u shku t'bujshum apo u kthy mbrem nga Tirana, se merak jemi ba mbrem, tham, mos po shkon udhve te kqija.
Buzhala, ani pse bahet muafiri me i rregullt ne TV-n, e vet, me sonte i ka ra pishman qe ule perballe Pallaskes.
Buzhala edhe Olluri, po dojne me ja zbehe Edit solidaritetin!
Berat Buzhala e Parim Olluri demokratet e "vertete" Largojne nga komunikimi ne fb, cdo persone qe 'ia thote nje te vertet.
 Mos shkruj ma se nuk ta merr seriozisht askush, tu kane perzi idologjit tye..se me te majten e sa me… 
Kosove, kujdes, perendimi eshte kaja e drejte. Mos lejo te tjeret, te jua shtremberojne drejtimet.
 Arbana, te ka dale ngjyra, tash veq per comente ne rrjetet sociale je mbete, faktorizimet tjera te de… 
 E gjeta rubriken ku me te shkru, me ti uru tre fitoret e sivjtme, ke me u kenaq per vitin e Ri, me ke fshi… 
Me Shehun e Prizerenit 
===