  S’guxoj me kallxu qe gjithe kjo ngjarje me ka ike si pa vemendje 🤪
  Ministre, pse s’po del ne keto takime monotone dhe te parendesishme me pizhama? T… 
Podcasti me  mbi zhvillimet politike ne Izrael, politiken e jashtme ne raport me shtetet e Lindjes se Mes… 
Nese  e  do ta kishin seriozisht padine per gjenocid, nuk do ta benin kete ceshtje pjese… 
Presidentes po i mungon Thaci ne politiken ditore, e keshtu e ka gjete Edi Ramen per me kallxu urrejtjen e saj ndaj… 
Ke po e mbeshtete KM  ne Tirane me 25 Prill? Eshte me  apo me ? Kush jane figur… 
Nje diskutim shume permbajtesor mbi Lindje e Larget, rritjen e Kines, raportet qe ky shtet ka me shtetet perreth, r… 
Ne momentin qe e shoh, qe nje grua pasi eshte martu e ka nderru mbiemrin  e vet me ate te burrit ose ia ka shtu ate… 
  Po sakrifikojne shume :P
Nuk eshte shenje e mire kur kallxon qe po te pengon prezenca e PSD-se. Jo per dicka, por vetem nje jave ne pushtet e keni 🤪
Cfare deklarate skandaloze. Nese Serbise nuk i cenohet Kushtetuta, i bjen qe kjo gruaja nuk mundet me qene ministre… 
 Nuk jane vec dy opsione, jane 200. Une ne kete rast zgjedha opsionin qe LV kishte me e perdore kunder te tjereve.
Sakrificat e Albinit s’kane te ndalur. Fillimisht sakrifikoi qe i hyri politikes, pastaj qe u be Kryeminister dhe s… 
Rruges se Edi Rames. Per nje thes me vaksina, organizim e ceremoni sikur te ishte Kosova vendi i pare ne bote qe po… 
Eshte shume mire qe LDK po thote qe do te jete konstruktive ne ceshtjen e presidentes. Vjosa eshte kandidate e koal… 
Nese punon mire, edhe Albini mos me fole shqip s’me kish pengu, apo fundja, mos te flet hic, vec le te punon (mire)… 
E ka dite i shkreti cfare detyrash do t’i jepen, per ata s’e ka marre gjumi qe 1 vit gati. Dialogu, integrimi e zhv… 
 Ke 40 vite qe perpiqesh, afer ndryshimit je 
Prapa nje gruaje te suksesshme, qendron nje burre/hajn-votash 
Cfare gjuhe seksiste. Mediat nuk ish dashte me e botu kete shkrim te Mero Bazes. Duhet me fillu me e ndertu nje sta… 
Ka kohe qe s’po e lexoj , e ne vend te tij, po ia lexoj kolumnet Mero Bazes dhe po e di sakte ku eshte Rama 🤪
Episodi i fundit i podcastit Rendi Boteror. Me  kesaj radhe kemi diskutuar mbi politiken e jashtme te K… 
Se fundmi Mara ka fillu me me kerku me ia vizatu kafshet, cilado qe i bie ndermend. E nese nuk vizatoj si duhet, nu… 
 do te duhej me e refuzu  si ndermjetesues ne dialog. Ky burokrat, hapur &amp; pa asnje dilem… 
    Falemnderit per komentin. Me siguri qe ka vend per permiresim. Jemi ne ate rruge :)
Letra e Trumpit per Biden  
Ne te kaluaren, qendrimet partiake mbroheshin nga njerezit partiak. Tash, qendrimet e partive po i mbrojne analista… 
 Hahaha, nejse, qendron ajo qe the, qendron
 Nje pjese po, kane kontrobu, ose po mendoj qe po, TV po paguajne se fundmi :)
 Tashme e kane kriju pervojen e punes duke qene analist :P
 Me jete te gjate Eriku! Qofshi te lumtur bashkarisht!
Ermali kishte afro 2 milion ndjekes ne facebook, ndersa Elvisi gati 1 milion. Cfare biznesi i mire per ta e cfare b… 
Po i bejne matjet e nevojshme per fasadim  
Akt patriotik eshte me heq dore prej tyre. 
Zhyte Shqiperine ne korrupsion e pastaj ben fushte turbopatriotike, se nuk i dihet, ndoshta ben pune.  
 Hahaha, me shume qejf :)
 I kujdesshem me shume sesa skeptik. Pervoja po kallxon qe na duhet me prite deri ne finale
 Vec le te vjen ai moment :)
Vendosne ma shpejt tabelen me emrin e Donald Trumpit ne hyrje te liqenit te Ujmanit. Jo per dicka, por jemi pajtu per kete gje 
Nje eksperiment qe kemi qejf me na funksionu mire :) 
Ne kete idhnim, le ta njeh Kosoven si ndeshkim ndaj Serbise :) 
Ngarkesa e urrejtjes, e sidomos e asaj ndaj komunitetit LGBTI, me siguri duhet me qene shume e rend per nje person.… 
Lajme nga Qeveria Hoti 
Debati per ekonomine, qe s’behet thuajse asnjehere ne Kosove. 
Njehere behesh koordinator pastaj viktime  
Politika e dy dekadave ka qene: 1. Te kane taksu dhe 2. Te kane rrahe. Si kundervlere ke marre komentet “kemi luftu per kete lirine tende.”
Politikanet kryesisht duhet me i marre me nje doze rezerve kur deklarojne qe do e bejme kete apo ate. Albini eshte… 
 Keshtu fliste Avdullah Hoti! 
Kosova duhet me e zbatu vetem kete pike te marreveshjes. Edhe ashtu e kemi zanin e keq qe nuk implementojme marreve… 
 Ne fakt, nuk eshte vetem nje person ne kete valle.
Me te lumtur per marreveshjen (ne ardhje) po jane ata qe s’e kane pa ate, sesa ata qe po e dijne cka ka ne te e qe… 
Me shume i besohet nje politikani qe e kupton ekonomine, sesa nje ekonomisti qe s’ka lidhje me politiken.
  Paj, e para nuk nderhyne ne politiken e brendshme te nje shteti tjeter. Tash te bjen me punu… 
Bllofi i dyte diplomatik i  brenda 4 vjete u konfirmua ne Malin e Zi. Para 4 viteve Rama u kishte kerkuar… 
Bojkoto Devollet dhe partite politike qe i mbeshteten keta oligarke. 
Nje qeveri anemike komplet. 
Prej qe e mbaje mend, Ramushi ka qene ne kerkim te nje pune. I zgjedhte si shume, si psh, Kryeminister e tash Presi… 
Ramushi president? Ky do te ishte paralajmerim i mire. 
S’di pse mendojsha qe Keshilli i AAK-se nuk do ta donte Ramushin president, ama po e dashka. Vetem po shpresoj qe e… 
Dojne te bejne ligj per me e mbrojte kete betim te UCK-se. Nese kjo ndodh,  atehere qytetaret e Kosoves duhet me ke… 
E kane emeru televizion, ama qenka kanal ne Youtube, njejte dicka sikur Radio Televizioni Publik, sic eshte emeru,… 
E kam njefare deshire te mshefte, e qe po e boj publike, qe keta tipat qe thojne s’ka virus, me ti kape virusi, e m… 
Moment i favorshem qe Kosova e Shqiperia me u pase aktivizu politikisht qe permes lobimit ne ShBA me nxjerr nje “le… 
5 nga 10 ekonomite me te medha, qe potencialisht do te jene me 2024, nuk e njohin Kosoven si shtet. Per me keq, ket… 
Me gjase, sa me te vogla shoqerite, aq me te theksuar dallimet e tilla. 
Vec nuk e kuptova ky mesazhi i dyte qe po shpreh ngushellime, kujt, e per cka? E neveritshme. 
Na iku pak si heret Nena Tereze. E sikur te ishte keto dite kesajde, do ta bente nje postim ne twitter, me ate hart… 
Kur ta mendon, sikur ata qe po e zbulojne vaksinen, sikur ne qe pertojme me mbajte maska, tru kemi. Biles mundet qe… 
Ka shume gjasa qe me perpara shkenctaret e zbulojne vaksinen kunder covid-19, dicka qe eshte jashtezakonisht e komp… 
 Ne kuptimin me bazike, te trija keto kategori kane/shprehin, e vazhdojne me shpreh perbuzje ndaj nje… 
Ndonje koment per kete ? 
Te pakten mos i postoni keto takime qesharake. Jeni bashke ne nje qeveri, na keni thene qe keni nje program, keni n… 
 Boll kemi kallxu inovacion prej 2007, si duket ka rene kreativiteti kesaj radhe. Po te them pergatitu… 
 Baton e ka emrin, pse po ia shtrembron :) E per presidentin, nuk shoh qe ka alternative tjeter, pos terheqjes.
Ani thonim qe KM Hoti e ka marre qeverisjen ne nje situate delikate, vec imagjinojeni kushdo qe do ta merr postin e… 
Qe qysh te bjen bingo, kur krejt bota e facebook-ut ishte duke u marre me nje zevendes-minister, frrap dalin aktaku… 
Menyra ma e lehte per me e shnderru nje figure politike ne lider/e, eshte persekutimi politik. LDK po e ben kete me… 
Gjate konferences se perbashket te Presidentit Thaci me Perfaqesuesin e BE-se, Lajcak, ne momentin qe Thaci filloi… 
Duhet me qene shume i papune  i cili s’po le kamere televizive pa iu drejtu, brenda e jashte Koosves… 
 Kqyre, nese pak s’na pelqen KM e rrezojme shpejt, keshtu qe le te kujdeset edhe ai :P
Glauk Konjufca sot gjate nje bisede per Lidhjen e Prizrenit, ne mes tjerash hodhi dilemen qe ’mos Lidhja e Prizreni… 
 Mirko Gashi me djalin Lumin para nje polici serb ne Dardani/PR. Kur policet e rrahen poetin kosovar, djali i frikesuar e py…
Aktualisht, LV po e menaxhon shume mire Thacin. Telashet qe ky po i kerkon, s’i duket LV ka vendos mos me iu pergji… 
 E vertete, ka nise me kalle, cka po mundet e ku po mundet :P
Ne cfare niveli te ulet ka ra Thaci, hic nuk isha cudite nese ne vend te truprojave, e kishte ndjeke vet ate aktivi… 
Shkoi Qeveria Kulti, erdh Qeveria Koti 🤣
Tash pritne Avdullah Hotin duke ju thene mbeshtetesve te LV, cka keni me kete Albin Kulti, Albin Kulti 
Kjo kontrate duhet me u hetu nga prokuroria. Ministrja Dhurata Hoxha duhet me dhene llogari per kete kontrate qe es… 
Flirtimi me grupet religjoze per perfitime politike nuk vjen pa cmim. Qeveria e majte ne detyre, tash behet e ekstr… 
Edhe kjo eshte pandemi, vec kesaj radhe, trunin e ka cak  
Nese problem ka qene menyra se si eshte mate papunesia ne te kaluaren dhe rrjedhimishit perqindja ka dale me e lart… 
Boterisht ka rritje te papunesise, a ne Kosove ka ulje. Ky eshte lajmi qe mediat boterore e kishin bo me senzacion… 
Vec po shpresoj qe kerkush nuk ia ka perkthy statusin per papunesine Besnik Bislimit, se nese ka ndodhe kjo, Presid… 
 Rrnofte pandemia, poshte papunesia :)
Albini prej kohesh e kerkon qe te gjithe te tjeret te behen bashke, e ky perball tyre. E me sot ai e realizon kete… 
 Qaty mos me le anash :)
Me se shumti po me pelqejne njerezit qe po e kritikojne Grenellin ne twitter, me siguri jane duke mendu qe ato krit… 
Vec kur te shohim pas 10 viteve femije me emra Grenell 
 sot e paska sulmu , sikurse edhe  duke tentu me e mbrojte  nga… 
 sot e paska sulmu , sikurse edhe  qe duke tentu me e marre ne mbrojtje… 
Cka ish kane fore Albini me ia kthy ftyres kete gote me vere Hashimit  
Hashim, me e shfrytezu momentin po, ama a po kallxon qysh edhe cka je kah mendon ma sakte per ‘momentin edhe shfryt… 
Vucici &amp; Serbia nuk duhet me qene te relaksuar ne takime kur flitet per Kosoven, ama as Kurti e Kosova nuk duhet me… 
LDK e ka obsesion te duket partner i ShBA-ve, ama asnjehere nuk e ka pase idene se cka do te beje me ate partnerite… 
A nuk ishte Veliu minister i brendshem a? 
Para zgjedhjeve, PDK dhe Veseli kerkonin suspendimim e takses, nderkohe qe LV kerkonte mbajtjen e saj, anipse nuk i… 
Thane qe teme diskutimi ishte edhe veturat qe u paten rrokullisun nga Glauku disa vite me pare :) 
Pra, sa me shume qe po i largohemi dites kur e kemi shpalle Pavaresine, aq me te paafte po tregohemi, dicka qe do t… 
Sikur te na e benin publike Programin Qeverises LV e LDK, keshtu e kishim pa se cka kane dashte me be me te, meqe p… 
Te pakten t’i satirizojme, t’i perqeshim,  t’i percmojme. S’ka lidhje qe keta vazhdojne me qeverise dhe me menaxhu… 
Lufta e Trete Boterore edhe Qeveria e Re e Kosoves tash per tash s’po duken ne horizont 
Per me e bo punen berllog burrat, pas deklarates banale te Agim Veliut per Vjosen, ishte kane mire me dal me reagu… 
Vazhdon saga e te ftuarve neper studio televizive e njerezve qe akuzohen per vrasje ne pike te dites dhe midis shes… 
Nje prej ‘parimeve’ qe po e pengon koalicionin ish qe Isa po insistonte, qe ne CV e tij per President mos me e perf… 
LV e LDK i kishin edhe nja 2-3 parime me i diskutu edhe po e bojne qeverine. E kur te eshte puna e parimeve, ia vle… 
Shume e rendesishme eshte me e kuptu dallimin ne mes gazetarise si zanat e profesion me te palacos. Ne kohen e keti… 
 S’di sa e ke marre vesh, Serbia ka bankrotu qe s’po shet plazma ne Ks :(
 Ne rregull, vec po kqyri me u fut me thelle qe me e kuptu cka ke dashte me thene :)
Kerkesat per rinumerim te votave jane perpjekje e qarte per vendosjen e fituesit ne tavoline. Cfaredo tentimi tjete… 
 Pse cka po thote :P Jaro, s’po e shoh qe po provokon dicka, e zakonshme :)
Jo Rusia, por eshte Kina ajo e cila do te pengoje qe marreveshja ne mes Kosoves e Serbise te mos arrihet. Shkrimi i… 
===