 Askush nuk asht' shume i zant, ti thjesht s'je prioriteti tyne
  Paske problem mi kuptu senet ti.
   ku bash ti mdule 
 Kur po ndertohen bastore, e katedrale, e puba, e diskoteka kujt spo i mteket spitali e shkolla, kur po ndertohen xhamia po bohe…
   Ortodokse edhe katolike jan sekte nuk jan fe. Keto jan sektet e fejes Krishtere.
 Ec bre mos na lodh se nuk paske kuptu cka ka shkrujt e ktu na filozofon.
   Edhe na kallxo cila po lejon zhveshjen
   Ajt na kallxo cila qenka 3shi ?
 Ski faj as nuk duhet me ofendu e me shajt por  as  me toleru   ✌
 Kur e ki accountin public sun i thu kerkujna çka pom shkrun koment ose mos mu perzi. 
Qeveria e re serbe ne Kosove tmerr 🤦‍♂️ 
 Zdi çka ju ka tek Komunizem Komunizem tjt kurgjo spo kini çka me than.
Dil ne studime jashte vendit pi moshes 14 vjecare dhe gjdo dite puno me nje ender per mu kthy ne shtetin tend.Dhe… 
  Kta 2020’at e murren qaf twitterin krejt do klloshara 🤦‍♂️
 Shume bre jeni bo mangupa jeni tu kqyre shume filma nalne pak kabllovikin se veq fjale po jeni
 Sesht puna me dasht mos me dasht po juve ndite sodit spo ju prekin kamet ntoke. Take it easy jeta sesht si nfilma 
 Njerzit pa ideal, vizjon dhe qellim e prishin per pare.
 Nuk ish bo keq edhe ju pak me ndihmu nxansat qe studjojne ne Turqi e deshirojne mu kthy ne Kosove Bile… 
 Nuk ish bo keq edhe ju pak me ndihmu nxansat qe studjojne ne Turqi e deshirojne mu kthy ne Kosove Bile s… 
 Shkarkone, s'meritojme na ksi njeri. 
 Ndoshta keni degjuar qe gruaja i dhuron burrit veshken e saj dhe anasjelltas, nena djalit, babai vajzes etj. por kurre…
U prefsh ne paqe 🤲🤲 
  Sa tshpejta o hag hallal buka.
 Feja krishtere jo katolike. Katoliket jan sekt dhe feja me sektin sjan njejti sen.
Dita e par kur shkoj NKosove fillojn analizat a jam dobsu a jo 
Un kur hy ne provim  
 Zdi qysh paske nerva me tylifar njeri mu mar halal tkoft per durimin.
 Paj kan dit ata tmoqmit skan fol badjava ka naj hajer.
 Ma shum ne rajonin e drenices perdoret gjiz.
 Thu se gjinja kan ardh tw me zgjedh lop qe pe poston peshen.
  Tylifar Arsimtari/e ndit sodit nuk eshte per mu qudit. Nje fiziksnt thot nesr nuk mundesh di… 
Fillova me kqyr ni film The Irishman qe 3 dit sun pe kry 
 Po vshtir qenkan bre kto sene . 
Ani do tmenqem kur po shkrujn 5’10 ose 6’7 po du mu tranu. Me pyt tabelen e shumzimit nuk e din  🤦‍♂️
Po ashtu behet shkak per moskuptimin e fizikes kuantike.
  zoti na boft nasip met pa neper vende mat mdhaja tu na ligjeru inshaAllah 
Apapapapa po ta qon mallin e Prizrenit  
 Kjo i bjen qe po i jep mundesi tjerve me pas forc mbi teje 
Diqysh qiky njeri mi mban shpresat gjall ❤️❤️ 
Mos ndaloni sepse eshte koha per vendin ton. 
Beson ne horoskop nuk beson ne Zot 
 Twitteri: Vendi ku pishpiriki qe hala fakulltetin se ka sos, flet me ironi per dijetar qe ka marre titullin Shejkhul Islam (Hox…
 Ma shum se njerzit
Ma shum pi du macat se njerzit 
Per viz edhe b*then e shesim  
 Duam falmurin qe stergjysat ton e kan bo e jo Perendimi ose Evropa. 
 Nuk eshte njejti sen se skan luftu per at flamur per kuq e zi kan luftu . E sa perket per punen e sofres n… 
Zoteri kryeminister! Kosova eshte ne duart tua!   
 Nese nuk e ke kuptu sproven ti nuk e ke kuptu fene!
 Pse ti kur pi sheh qe me dy tri fjal çka kan msu pi serialeve shesin mend a spot prishen nervat a ?
===