 Qeshtu duhet mjau qit ne fush kejt
  Bashk me ndihmen e atyre qe e kane votu gjykaten speciale. Mos i harroni ata patriota. 
 Un nuk nenshkruj asgje se jam vetem njeri i thjesht. Patriot ose je tan jeten ose nuk je hiq.UÇKja,… 
 Oj moter, kur po e krijon  nje FOND shtetror ku ne mergimtaret mundemi me kontribu per USHT… 
 Qeshtu osht kur te nenshkrujsh qka te lyp Serrbia. Pydyky-Lydyky.E njejta ka me ndodh per Bosnjezimi… 
 E kualifikuar per Lojerat e mia te dyta Olimpike  
 Sa koncesioni eshte be per kete "njohje nga serrbia" nuk eshte normal.Vetem shqiptart e qajn kryt a na n… 
 “Sbashk” eshte kanceri i arsimit shqip ne Kosove!
 Qe dy muje jom tu prit me i shkarku kto sterevina.
 Eshte idiotizem te vaksinohen -18.
 Nuk e ki iden sa debilla doken Shqipet me flamura kombtar kur lun zvicrra. 🤦‍♂️
   Shiqo, potencialisht, per urrejten tane ndaj Albinit nuk pom intereson hiq, mirpo kjo q… 
  Pajtohem, mirpo KM Kurti nuk mund te reagon per qdo qytetar. Ne kete rast u dasht  te reagoj.
   Nuk pajtona me ate qka ka shkru A.Molla, mirpo me doket qe Amerikanet nuk kane msu nga… 
  A. Molla nuk eshte kerkushi perpos nje simpatizanti i VVs ne USA. Mos birni pre e propagandes t… 
  Hiqe kete flamur o debill.
    Rezervohem me faktin qe me sa e di une Molla nuk ka lidhje me VVn. Nese e… 
    Basically, eshte sikur un ta kisha ba kete deklarate.
    Nuk e kuptoj, siq e di Molla nuk perfaqeson asgje ne VV.Molla per Kurtin… 
   Po diskutohet sepse Gjykata Kushtetuse qiti tradhtin e Thaqit &amp; Mustafes ne fush,… 
 Po ky Serrb eshte identifiku me beso, kam pa edhe llogarine e ti ne Facebook.Kjo ka ndodh gjate Euro 2018… 
 Ky eshte BOT serrb qe shtiret kinse francez.
 Nuk e di ke po merr shembull ti, mirpo personalisht, nuk kam pa hala nje Shqiptar qe mbron Serrbet apo Gr… 
  Iliret nuk jane latinizu (shembulli i Romanise), ne fakt jane romanizu.Romanizimi dhe Latinizi… 
 Better question, ku jane burrat Shqiptar ?
 Problemi eshte qe territori i Mitrovices se Veriut eshte shum i pasur me minerale..
  Nuk eshte gabim, eshte e qellimshme.Te njejten vije me serrbine…
   Nuk eshte ky gabim, eshte 100% e qellimshme.
 Liberalizimi i vizave po perdoret nga BE si imponim e nje marrveshje (potencialisht AKS ose autonomi ne v… 
 Per politikanet e KS e pate fjalen, mirpo kam taku personalisht edhe persona te tille.
  Na trego oj krijese se kush e ka votu kete "gjykate nderkombetare", se kjo gjykate u votu nga… 
  Bini ju kallxoj para ni jave, mkini rrxu niher, mos gaboni mem rrxu apet se ….🤣
  E pata fjalen per , qe tha se me Biden ka ndryshu fryma.Personalisht, zhge… 
  Qka do te ndodh sipas teje ne 8 vitet e ardhshme ?
 Duhet me i fut ne burg nje nga nje kto sterrvina tradhtare.
   Nese KS e bene asociacionin e komunave Serrbe, atehere KS behet shtet jo funksional… 
 Sllavet* jo vetem Lajcak.
 Jetoj ne Perendim, dhe e di saktesisht qka mendojne per Ballkanasit.Nuk te don kush ne BE kur edhe zyrtare… 
 Kjo vlen per Turqin qe ka 85 milion banor, por jo per shtetet e ballkanit.Problemi kryesor eshte korrupci… 
 Ka ndodhe perqarja e BEs. Ashtu siq deshen armiqet e BEs (Rusia, Kina, etc).
 Nuk e besoj aspak, kini kujdes nga mjeshtria Serrbe qe ka qellim perqarjen.
  E di, mirpo kjo qka paraqiti  sod, EU ka me perdor presion ndaj Serrbise, se nuk e k… 
 I zhgenjym qe  nuk permendi kostot e demeve e luftes, vjedhjen e pensioneve, kthimin e artifekteve…
  Veq me myte te ngrahtin.
 Asnje simbol kombetar, deshpruse…
 Hajdeee damuu lichnaaa kartaa hajdeee
  A e din pse ka rritje te ekstremizmit te djatht ne Europe o trap ? Pikerisht sepse keta qe p… 
  Mundet, nese ka vullnet politik mundet me u ndryshu edhe emri i Shtetit e lere me simbolet.To b… 
  ne qdo intervist te tij ka thene qe do ta rrespektoj sepse eshte flamur shtetror mirpo qe nuk… 
  Un jam nje nga ata "shacat" qe shkrun Shqip ma mir se ti. Nuk po i mbron askush dhunust(edhe… 
  Shumica e te rive jane si ky, jo integrime, dhunime etc etc, mjafton me e pa shembullin e ty… 
 Eshte per keqardhje se si askund nuk shihet flamuri kombetar, sadopak naj simbol…
 Pse ki fol me Jesusin ti personalisht qe tpaska kallxu kon e don e kon jo ?Ju lutem, mos bini pre e propa… 
===