diqysh bash kur tma kufizon kohen ti per mu ba gati un sbana hiq
kisha pas flejt isha knaq
primitiva jeni veq ok
 Qohet njeri me mengjes sdin ka mja majt
 fatlum i suharekes je a
qe qitu tu ba grill me ausllandera
 senet mkan ba mu mesap
te ermal fejzullahu kisha shku nkoncert veq kur tja nis ajo kanga Nuk te mbaj inat mu perqyrrav
edhe niher mpyt najkush sot a je lodh kryt ngipek tkomit ja shti e sa tmuj i bi
 pak pa dek sha ka tre?
jojo sen sjam per me pi veq me flejt jam a ka naj dhom tlir ktu
 gati jam mi shkru un mi tha thirre hahahahah
un me fr tem kam me lu sony
 pse spja nis me pllum?
kom dal me ble fustana seksi se tash kem mi qpu nejat me 
pa qare e kam mu dok mir nfejes tmotres se e kam exin aty
 ishalla qato nemt e mia e nzajn edhe kta tanin HAHAH
 pi kuj ti HAHAHAHAHAHAHAHAHAH
 temit dej qitash 6 ju kan ba vazhdojm ala
 njo i jemi ka 4-5 i don perniher
mdoket edhe ktynve npun edhe nshpi ju kom ba bajat gjithqysh dojkan mem feju
 mshile bre ti mos e ha per faj tjeter kuj
pash zotin a se pasna dit
zhag tkisha ngre dej te xhamia sinan pashes
shum be ti kisha qi ropt aaa
 hiq mos tum shkrun
fort gzushem jammm a
  Lum kush tka mjer kush tka hup hehe
o zot sa e mire jam 🥰
 po a qysh ndryshe tjeter
 more ky mtha nimi neser qaty inati pom vje
e mere allah sahat i hajrit ka mu kan kur tjo boi bllok
 e mu kannn qashtuuu
 a ban me ba koment qe sjam ?
 me nja ksi hovi
 u myta mar tu shku ndasem sen i hajrit so
 qafen e theft e more allah sahat i hajrit
syt be mi ka qel a 
sikur te vdisja ne gjume
 pse sipas teje cilat kokan ato vene?
 spring, edhe katuni jem qe o baba dmth
 ska buk pi asaj pune
 mamir se suharek po, po menoi
  pasha buken edhe pasaporten e kam
 me djem u perla o kar pse spo kapishh jahahaha
  mos nej me gipen se ky tqet fare
 jo be gugell ish perla si ka nguc qikat
 fjala jote nvesh tzotit ishalla bana nime hahaha
 ma se ma kishin nguc do tw pika mu ke tum ra HAHAHAH
  o easy se pe di qe i suharekes o pi mbiemrit po dallohet po se kape ti qysh e thash
 ja mjafton me hi nspace bashk edin
 o ma shtajne HAHAHAHA
 cilla pot leke ngjum?
jam qu keq sot muj e baj naj mut as frym mos merrni afer meje
 kismeti jem o kurr
nese ttham kismet dije qe kurr
 kshyrem mu ma baben 🥲
 nxeht + npune= thyrje
le qe zapullim, le qe doren e vrajta edhe ti mem ba stila tspidermanit a?
 u kan dasht mi shkru kti nenqimi me tha fofin mos e le larg shkendes
 pse un larg shkendes 🥺🥺
 edhe un met 3 e kam
 mashum per dostin e kam po ok
mojjjj e premte e gzume hade mashpet
kuku bre mos u kthefshin ato dit kurr
far mundsie pata me kthy krahin e me vazhdu gjumin 🥺
 ajt kur tmrrish shpi shkrum e pres spacen
qelni space moree ejj
 dikuj dikujt e dilla pi paguhet ekstra hehe
 jo se tha mos ta din kejt tw qe po folmi se i idhnohen biqat
 e shame e let ke HAHHA
 sjam mir diqka qonum te mjeku
kisha harru qe e pi cigaren kesh tu dal pa to
 Jam e lodhne shpirtnisht
 jojo kta jan tu feju heret sjem von na mos ta nin
 Andrra e cdo vjehrre
 hajt be tmenojn kishe po du pernime
 po tdu po ti a martohesh me mu
 pjesa tjt o met himt HAHAH
 ok te ana benz e kem
e a martohesh ti me mu? 
 sjam mor me ty un nshpi jom momentalisht
 exi ka thirr ejj
 fix edhe mu exi mka thirr Hahahaha
hejj qa dmth met thirr njeri pit ?
shum pom pilqen qeky stil 
 paske me ardh me u nis me ni dit me ni dost temin
 po nrm se na han
 jo flm ka per kan nknojn hajde nuse reja jem
 sha e ki Shyhreten
 ja ai qe e kom pa un nks ke
qysh mor spo mujn mem gjet nsistem tgjykates ?
mujna mu kan na dy qeta po ti po do me ba stila 
 ku o fatlum ajo nafak ?
far mengjesi kryt spe di ku e kam
edi qe kom pas mu kan npun 7 rrafsh sen so me shku 1 or ma von
pse ma ki cap tfitin? 
 flm edhe mu vetja pom dhimet
 moti ka flejt edhe para se mos me ba snapi
nejse se mu ndreq snapi mu
 qy nig mka pyt ai plan suksesi ku je 
 qy nig mka pyt ai plan suksesi ku je 
 pa tut tybe HAAHHAHA
 hu ni djal nsnap edhe qaj spo ma rras kjo so nrregull oooo zotniiiiii
 skam as kuj mja lu kejt qika nsnap qr
  lumet ju qe keni android hahahahaha
 tash idhnohet mos u gzo
 le qe spom ban po e fshina niher tash u ngula Ahahah
kush e nguci snapin qe u idhnu?
  sje ausllander i suharekes ti
  jo farti sje nren ti
 5-6 veta jan pak kunder gjyses suharekes qe jan ausllandera
 thi te restauranti doni te kshyri mos e ka fllw HAHAHAHAHAHAH
 a ban be do minuta heshtje per at lochk tshpajrtit
 Qe na ishte na ishte nje her nje perl mesnate 🤣 o deka tu kesh me qetooo 
 gabim be je se rumanisht ska tbaj me tsuharekes
 sha merr vlla shirok e te nalt anej sjan ausllanderat si tmalisheves so gabim je
 ta kisha preferu me shku te Doni
 ta then sa amel e folin shqipen 🥺
 ma ka ik truninnnnn
 spo ma merr menja tlajmoj
 ooo edhe far ausllandera seeeee 🥰
ausllanderat e Suharekes nuk i ndrroj me kurgja .
edi qe so 1 prilli
dilni se kom ardh n’itali 
 ti pja qishe vetit mushknit me at Winston
hajde dalim n’date edhe e kshyrim Haidin ose Gokun
a jam e vetmja qe ala pa e kry buken mir du me kall cigare ?
 zgate doren per 4000 🤝
 sa i smut je AHAHAHAH
 golf 5 me dy dyr e kom 
 dita shkoj ama nafaka qaty o HAHAH
 ora 6 , gati shkoj dita e lypin nafaka 
un masi ja kom myt kurvat atij  
 Edhe fjala ma e vogel t'lendon kur godet aty ku s'duhet
   ti e din qe nuk ngon
   sun i baj sen un ahahhahaha
 paske mem kallzu diqka mdoket 
ju qe mkeni ntik tok mos gaboni me hi mi kshyr videot se kejt depressed jan
 a i majm edha na ?
 shyqyr qe e kam perbes HAHAHA
 mo se po i Hurt
jeten e kam tmir veq depresionin ala mat mir ❄️
  sha me ba jeta kto
un rri po golldigll edhe e ngoj hajde luj qyqek
n5 kryhet dasma plus ni or pi shefit e kan plus ni or pi policis e qeshtu
  qysh e ki agjen tash a i ka kalu
 skan ba fotoshop po ai qe i ka qit pllakat u kan smut
 ni cigare ko me dhez e ko mi kthy deshirat nshpres
kur nuk folmi na mo a ki me kajt a ki me kesh?
 nese ski llasik ki stenk
 perqata qe jam te thy kom hi ti kshyr senet para dy vjete sha jan ba Ahahahah
 momentalisht te kshyr tezaken 
 a se paskna ni perbes
 vet e kom shpik pse sha ka?
mos um thuj loqk ma se po keqkuptohum edhe nese mthu e ban hashtag not homo
 Hala mrena e maj ton at vaj
 Mka bo Foffy dhurat sot🥲
 si si la Kosova
 hahahahaha ta ha zemren❤️
sha pom kshyr vlla a kurr femen me sy ski pa a
 se jeta so e bukur
1 or i bani per ni esspreso pff
mani se ala sjam kfill o njerz
sha motren vlla saba saba vin gjinja folin italisht e bertasin
 edhe un ty hahahahaha
 tut ni jam Ahahahahahha
 adelina ismajli o baba
 a nashta qe e baj un gjeth mut mdoket se kejt e bajn nejse
 se ti e ki ba mut
qita tjashtit me shum sene pldh mirren Zot pak sabr
 40 grad me kan smuj pa e pi ni esspreso
a skeni pun tjt a veq me kshyr me msitnu ikni pash allahin lenum rehat
shum do ttw lypin qi nane
me dal sot me pi me tu ba def
far dhurate tqart jom tja bo vetit ide skeni 🥳🥳
  qitma ni sok te sahiti bleje
  shum kink u kallzova HAHAHAHA
  tash i shkruj farukit
  hej shuj ti se te labidari tla
 sikur te isha djale
 oke qe dush qat liber qe dush Ask ve Gurur se kam prb
 vallah gzim mat madh sdi hahahahah
nese mbon liber dhurat automatikisht ma merr zemren
 veq haribo mu sen tjt
 ani qe stkan pru sen mos i le met hi nshpi un e kom ba qit sen mka dhez
 a ju kan ardh gurbetgjia juve
 mos fol palidhje i nderum
 shum jon t munimt kta qe stlojn me dhez cigare nkerr
  nime blerim a e ki pyt hallen tane ti me kan i perngjan?
 ehpo kaq duro njeri
 jo se se kom marr un po ti
nese un ta lo seen dije qe ma ki vlu shurren fort .
 Thash te ju tregoj qysh zbritet shkallve  
tash me alkoolin mu ka lidh dora per gote
pa e ndjeh ket ndjenj u dont know mah pain
 qij fug qe ki hesap se shum kam
si e ka qit mentor kurtishi coja nje selam qaty ja kom nis me marr teposhtzen
“jo po ti se din qysh o met lan ai qe e don “ bro wtf a stka ra me mlu me dhe njerin mat dashun a kurr a?
 AJ Mos Um Shkruj Mo Me In The Morning : ⤵️ 
  snapin e tij vlla jepja
a beson ndashni shikim tpar a duhet met kshyr edhe niher
allah merrem mu ktheje Adem Mikullovcin
 djemt jan muta nejse shujta
nashta mas qisaj pytje keni mem than ti qifsha gajlet ama spo muj pa pyt ! a e din sara qe ledri e ka ex dua lipen a?
 faleminderit per neren ❤️
  Nkar edhe foffy po ju qon
skokna nto dishka sot
 thuj edhe pi meje
  ska vakt se po del po laperavet
  jo spi marr se sa mi ka hek mjeku
  spom plq se nike kokan
 i kujt o qeky motorr
 hajde per njoni tjetrin beeeetomiiii
  qe nuk pini mos hajdi
 koka nkoncert te burri jem
 qe po ha akullore ti qa bane 
Andrra e cdo vjehrre 
===