Liria - M‘ka dhan baci 12 vjece 
Tu e pa azpin vec kur po e festojne gollin
 Po amo a e din ti qe modrici e ka fitu topin e arte
 Me bo nje test te tille ne byrekt me mish ne Kosove?
 Pse duhet me u vazhdu kjo tradite palidhje edhe me i qu 450 punetore te arsimit n’deti. A qekaq shume e meritojne a🤔 s…
 mesharin e gjon buzukit e ka shkru nana jote
 VEC SA E PASH DEKA
 pse  digitalbi nuk e bon ni website ku i ka krejt filmat vizatimor qe i kan dublu ne shqip
 Hahahaahaahahah ncc une mendoj per shendetin tim mendor
 I ka hi uji nuk punon amo e maj
Kah me ja majt o allah🤲🤲🤲
Flm na keni nimuu
Ku me i kqyre friends gugel serq ?
 A e kane thirr xuxin hala me naj emision
Per mengjes e kqyrim Dimal Bashen tu ja bo valon syles ti ki t’drejte mu kane budall po na s’dmth me u pajtu me budallakine qe e thu
Cka ki me azpilicueten shoq ?? 
Kombetarja e Messit Ahaah
 Qe de. Plus ton diten tu e prit azpin🤡
 Lol si e kom pa qe ky osht mu ka kujtu kjo 
 Sig per me ja rrit vetebesimin e ka lon kapiten sonte
 Nese ju dhimbset V.Daka po e bej share nje perle te profesionalizmit se saj, leshonte sallen sa here ishte ngushte. Ne cdo ve…
.   ku osht more Azpilicueta a hajgare po boni me mu a???
Aa tuta cka t bon 
Me nanen tane tu e prit Azpilicueten
Kush ka loje sot kush🥲🥲🥲
Komentatori per pak me na kallxu edhe analizat qysh i kane dal Eriksenit
 Edhe une. Qysh mka ardh lujtaa
Kjo dynja e kerkujt
  Ti pi kallxon andit
 *Hoxhe a osht haraaaam me shkaktu faull a kuku lujta qr
 I paske hi fellit shoq. So ntv
 Telefonin me lon me bo foro??
Me kon , qaq !! 
 Bone naj tweet si visari tagi t fructalit mos pe lirojne doren
 Qysh se pi Arta sokin kurre
Jericho - Nentor i ftohte  via 
 besnik bislimi me nipin, tu shku per pune 
 Me mungon buka e prindit qe lind femijen
 Gold AG kur i ka dal fmija me 27 nentor
Pse ja nale njeri zanin tu ja nise refrenit sdi vllaaaa 
Po po amo Portugalia e njeh Kosoven
Calling ronaldo goat vec pse e ka permend Kosoven ?? vec te shqiptart nin dmth
  Hahahahaahahaha ka qef mu nguc
 oo ju qi nana njonit 
 Fmijt jan temporary g wagon osht forever
Po qa po di une  po mi qon qesi
 Walk of shame amo jom tu i qu ent qe mu kan grumbullu ndhome drejt kuzhines
Hajde edhe ti o king 
 Shume bre doket si pediater.
A ka mundesi me qit femnen e azpit ta kqyri a ka shpresa
 Mami e ka pas zakon me ma bo per Messin a mos ma pate vlla a 
Hajt se kta marrin pare ty as qe t njohin
✨Cfare kapiteni asht ky pse ni goll sun e japi ✨
 Hahaahahaahaj nuk ish kon keq jo
Hajde le t ja nise pjesa dyte ma shpejt se kapot e kane kohen e gjumit
 Mos na nguc se e kem njerin aty
Guardioles i urojme nje dite te mbare
Me nanen tane tu kqyr tiktoka
 A ka sekondari pjese a
 Berat Buzhala be like: Lehte eshte me ble vaksina prej shteteve tjera, po le ti prodhon Albin Kurti ato vet.
Po kjo vet pi jep zor more 
 Kha ska sen ma tmire
Gjejani ronaldos ni numratore huahua 
Aaaaa zemra e mire🥲🥲🥲 
Hala sot se kom ngu semin tradhtare
Ndreqe bre dikush me kangen e teuta selimit takoje nga une boni t fala 
 endrrat deri te new yorku amo motivimi menxi pe mrrin fushe kosoven
Nentoka filmi ma i mire n bote ok 
Po, amo me e pyte qat plakun pse ka dale, sigurt ia nise e thote s‘po naj rrisin pensionet. 
===