 ma mir vrajem se mi nda
cka keni bre se po fejohni,kush po ju ngut allahilee???
 ju kan bo bajat fitorja gjeth qata
kto kongt qe i knojn per nat qikav diqysh t shtijn mos mu martu hiq kaja nonen
a ishit ik prej shpis me shku te frajeri?
ska lidhje sa e ftoft o nata,sa ka distanca,une t'pres ty edhe nese je larg me hapa
tu thy rekord si gjith ronaldo nminutat e fundittt
hej gjoma dikush ni djal me kqyr lojen  e futbollit bashk deri n finale
jom ka du me u zhduk dika
 e ki kry me ket vit ti me qet ide t fort
  se smunen me marr shoqnin me veti aty mi nihmu qa mi thon qata
 paramendo me ra n'dashni me ta pa i pa
sdi sdi veq edhe kta lojtart ku po qellojn krejt t'bukur,mi nda si mi vra
edhe nese n'stinat tjera skemi me kon bashk,kujtoje gjithmon pranveren tone te dashuris
kur ti i kallzon shoqnis se paska ni nej ,e kur ti shihsh se jon shku pa ty
 - Helm kan me tu ba tana "te dua" qe t'kam than, helm tana perqafimet qe t'kam dhan." 
nkoft e zoja ti e bon per veti njerin me men jo me foto desh aty
edhe m'han mu fort se je ka vun tash per mu
 pse po genjen se sdi
prej javes tjeter 4 provime n ren i kom,e zoti ma qoj ket grip mos me mujt me msu kerka okeeeeej
 veq budaaall mu kon njeri
ma mir me tdjeg realiteti se rrenat
duhet mu vlersu edhe baba po aq sa nana,baba e jep mundin e forcen per me na bo kushtet me na knaq mos me na mungu kurgjo.
diqysh shpejt bre po vijn kto ditet e provimevee
far dite me shi,me nejt ndhom ton diten e me lshu asi kongve deep!
ora 12 kaloj,hala tu e prit un at mesazhin ton.
 jo veq e ceka se po ju pengon cdo sen e sosht per mu qudit se apet mendimi jot ke🤍
 femnes i vjen era orbit e parfum edhe masi ta pijn
 veq nkosov po ju pengon cdo sen e jona
krejt kush t'mshohin nrrug po ma bojn sa e lumtur je,damn shit a e din ti qka kom mrena?!!
 spo tu fejojka kerkush pra
,po kur dalin tylifar njeri prej te i vogli e deri te ma i madhi me perdhunu ni femen pa deshir veq "pse u vesh pro… 
Per ata qe thojn  e qu kudra bishtin qeni si ngan mas" !!pika par na kafsh sjemi ktu,e dyta kur tna pelqen dik… 
 haaaaaaaaa kuku se sa skem honger aty
 qija jeten e nons
ej e ku pi merrni ato paret se po delni cdo nat breee?!!!???
po more qysh jo mem hi far gjarpni tu u kallzu na t'dashurum 
qaq bosh jom ka e ndij veten sa as zemer skom per mi dasht njerzt qe e meritojn e le mo ata se sja vlejn.
Shume e priten bajramin me gzim,po dikujt sot i mungon dikush,e presin ket dit me lot ne sy e mall ne zemer.
 un fk spo shkoj ja boj pushim vetit e ju ntmesmet me shku sdi sdi
nese ti i ngon ma shum fjalt e tjerve sesa personit se je me to,ma mir as mos ja nis mu dashuru
spodi a me kajt se shkoj ramazani a mu gzu se erdh bajrami
ani ani krejt metet tu qel shisha
 apet ty nkry mu ndhom nprotezaa
 te na dominojn krejt llojet e ndryshme jo veq domestosi
 e pse jo Fresh hajt?
 Zemra pom dhem prej qesaj video.... 
veq zoti e din qysh jem tu fshi per bajram na se jem  me ramazan
 i kom dy par nshpi a don me ta fal njonen
 ti jeee halittt amo dije une tkom mrenaaa
kurr sma ka marr mendja se mvjen dita me feel kongen e gjestit🥲
kush o tu shku seee...
a shkohet nfakultet nditen e dyt t'bajramit a??
mka lan baba amaneeeet merre djalin qysh don vett,duje shumm dujee
  zemres tone jo a tnanes po
 mu besa per iftar e hongra pending
un kom probleme me ndjenjat e mia
 kuku kryt Palma mu ka boo
 a e pave far rrushi
 mu kon shoqni tylifare dihet,a me kon ni shoqni qe e kan nifar lidhje pak ma tveqant s'hupet
 HAHAAHAHA mpaska kap ramazani mfal
 veq ishalla jo me Palm Angels
ju se pe harroni shoqnin veq pse keni bo fm/fr veq kthehuni mas kqyrne kush jau ka majt krahin e o kon me ty nt'mir… 
 SHA ZOTEN tu kop  je
 kaja nonen kurr su gzut edhe ju
 aa pot vjen inati a? pse pot vjen inatii🤣
me dit njerzit se gjynahi ma i madh nket jet osht mja thy zemren ose me lendu dikon pa faj se me rrzu ni xhami,kurr s'ishin bo t'kqij.
"ti sem meriton mu,ty tvyn ni djal ma t'mir se une...." 
 sma prish bossi qefin
 po vjen ali baba me 400 hajduta
 "gabimet sja kom fal edhe kurr skom mja fal"🤣
ty ka me t'vra loti i asaj
 po ka,kur se ka ndjeh at knaqsi heren e par masi e ka gjujt e perserit ntdytin
e du vetmin se mbon me kuptu qka du pernime prej jetes
m'tha ki mem lyp po nuk ki mem gjet, pse a e kthen najhere najkush berllogin nese e gjun nihere a?
nuk t'vyn me e pas n'jet,nese se ki ngat kur je tu kajt.
A keni edhe ju ni qisi vllavi?! 
 HAHAHAHA bukuroshja e fjetur
a e keni vrejt diqysh te djemt kur dashurohen pernime,nuk e shprehin me fjal tveta po n'mnyra tjera
 ato shikime se sot mkan fut n zjarr
  ma mir se nbus apet si do do
nihere n'jet du me gjet dikon se tutet me m'hup,sen ma shum sdu
 zemra pom dhem se spo msohet🥲
une jo se skom me kon po vet sdu me nejt me najkon deri n'syfyr se dashurohna flliqt ok flm
lem me ti puth cdo cop t'zemres tande t'thyme🤍
Krejt meten tu shku n'Dubai qetash
lluni ka pas thon"smunesh mu fry me ni sen se ta ka fal zoti,kshtuqe ner dill krejt jemi t'barabart", e kush je ti… 
 e krejt ato kujtimet tona ti i hupe:/
  un po foli qa m'ka ra me pa vet
Njeri ma i fort osht ai se e jep ni buzqeshje t'madhe e te sinqerte,perderisa e ka shpirtin t'coptum e nuk e din kerkush!
 shum djem pak burra 
 bre thojsha qa spaskan femna knej,cdo dit kaloj ndeqan krejt kafiqat tmushne burra e djem !!
sonte syfyri i par🥰🥰🥰
 ju vyjn atyne koh e gat mu perballu me ket true story
 veq me pas kesh me qef jo si me zor
 ngushllime,n'lule te xhennetit inshallah
A ka mundsi me nejt nshpi e me rujt veten,t'pshtojm ma shpejt prej qesej pandemiee???¿¿!haa deee!!
spo du me m'njoft krejt bota,po du mem njoft vec ti
dallimi mes meje edhe teje osht,se ti ki rrena shume a un dashni!
A bon me m'dasht dikush real,jo fake???¿
Ramazani po vjen...duhna me gjet at personin me fol tema deep deri n'syfyr🥺
Ja msova dashnin,e nfund shkoj ja fali tjetres.
gjoma dikush naj djal si s'del t shtunave n'promje,fill e martoj hargjimet prej meje i ka🤔
 HAHHAAHAAHHA na ka nem dikush
 doren nzemer edhe mu ka mdham
Edhe ata qe t'dojn e t'kan premtu,kan me ik,heret a von,mos u cudit!
Kurgjo mos paqa nket bot,as pasurin as lumturin,m'mjafton dashnia e nanes edhe babes si me e pas krejt boten n'dur tmija!
 mos t'lasht Zoti pa ta
Ka don mem smu qikjo vetmia tum rikthy n'qato kujtime tkqija,kur ski njerz se rrijn me ty ton jeten prap e vetmja z… 
Ni dit m'tha ni koleg "Qaj qe ka mas pakti shoqni osht ma i drejti se ai si pershatet kerkuj per qata met vetem"    I feel that!
zemra e thyme osht ajo qe e ndryshon komplet njerin!
u qel afati i provimeve,un qe qitu tu kcy palidhje :/
 hahaaha veq sjelli ti se i ruj pa problem
 hahaahahahahhaa e ka nanen qut
m'prunen n'spital me kqyr beben naten,se m'than ti rrin qut dej von st'merr gjumi......
 mu po se sja kom kthy mesazhin HAHAHAHAHHA
sen skisha dasht veq mu kthy edhe nihere shyhretja me mahmutin,hit e bojshin🥺
I lutna Zotit,me pas sa ma pak njerz fake qet vit e ma shum real dashni per njonin tjetrin.Nuk kushton sen me bo mi… 
 I kom pa krejt tu ik ata qe m'premtuan qe do rrinin..
 me harru tjetrin sa si kan preh venat HHAHAHAHAAH
 esenca osht se t'qet posht mrapa shpines tone,se ti nuk e din qa bojn ata e qa folin kur sje prezent aty
ni pytje?pse n'shoqni duhet me dal gjith dikush me t'qit posht n'sy tjerve?
 e Anisen veseli kush e ka  rrejt se e ka zonin  e mir per me knu!!??????
qeky bor qe po bjen e permbylli  me kaq vitin 2020....
 Une perqafova nje homo sepse jam gangstere HAHAHAHHA
 kohve tfundit je dhez diqka
 thirre e nale ai t thirr vet masanej i thu mfal pahiri t thirra
 postimi i famshem AHAHAHAHAH
 Ni dit...Ka met perqafu.Per krejt ato dit qe skam mujt.
 hahahahahaha e vetmja ndit e kqija
===