Filloi shperndarja e mjeteve te ndara nga qeveria. Shum familje u gezuan ne kete muaj te shenjet u shpreh Kryeminis… 
Çdo ekip qe do te mundohet te nderhyj do te perballet me pasoja te paparashikueshme. 
Kosova nuk ndalet me sanksione ndaj Rusis. 
 Rezultat:- I nje klase politike shqiptare t'korruptume ne Maqedoni.- I nje Tirane zyrtare qe nuk i mbron te drejtat e…
Kurvat e maqedonis deri qetu e patet.
Paramendo me lujt vendas edhe me te fishllu tifozat si me kon tu lujt musafir.
Qka o ky mall o bir spot bojka senMas 5 minutav 
Gazetar qe kem na si ka kerkush 
Un me dosta gjat veres. Ska nevoj me kallxu cili jom sigurt po vrehet. 
Mka pas trondit njo dy muj skom mujt mu kfjell  
Bile ky i kish qkep do grushta 
Krejtve jau kisha qi ropt qfar loje kan bo nkit pjes tpare. More mos e veshni mo at dres o rob qira.
Qija ropt qka jon tu bo more
Carvajal ka me na mar sonte nqaf qysh po shihet
Moti e kemi prit kit sen. 
 vetem nje serb nuk e bon like 
Un e kom veq njo 
Na bonen hor kta robqira 
Per ju per ne per te gjithREAL MADRID 
Sonte ka me flejt ma mir
Po qihen kurvat e Parisit midis Madridit
O dekaaaa o dekaaaa ja qiva motrennnnnnn
Benzemaaaaaaaaa ja qiva roptttttt
O Modric o Modric
Edhe un ja qita do sanksione Rusis. 
Parameno me dal na nqytet me ksi qizme komplet ni Kosov ta lujn koqen deri ndit tkjametit 
 E nderume un nuk e dij a ki fmi ti a jo, po me siguri ki naj vlla ose moter tksaj moshe, lirisht merr… 
Krejt shtetet po i mbledhin kshillat e siguris per te diskutar rreth nje lufte te mundshme botrore, kurse tek ne mb… 
Gjynah me tardh se qfar lojtar lujn per ManUtd tmerr🤮
Keee bilete kthimiiii n’burg Dardan 
Aj dosti qe o borq deri nfyt e shitet qe ka pare llom. 
 Jepni nafte Prindonit, se mos po i shkymet ne perpjeteze. Athu edhe per sa diplomate te tjere te rangut te dyte Ministria e Ja…
2) AKI-ja hala nuk i ka rene ne gjurme qysh e tek po rrjedhin informatat.Ama s’ka gajle. Kur je ne pushtet lejohet… 
1) Nen udheheqjen e re Agjencia po avancon sigurine kombetare 🤣🤣Po po Prej se e ka marre Prindoni ne dore popullat… 
 Po kursejne ne uje, ama po i mushin A8L me benzin 
Noizy, Rugova edhe Hashim Thaqi ne Rambuje 
 Deputetja Fjolla Ujkani po i prin nje kampanje lincimi ndaj nje profesori qe bash kurgjo gabim s'ka bo permes videove ne TikT…
Deputeten ne fjal duhet me shkarku menjeher sepse ne nuk kemi nevoj per deputet qe linçojn qytetaret prej nga te ci… 
 A e kqyre videon a jo?
 Prej "krejt protestuesit e PSD'se mundesh me i ngi me nje pice familjare" te protesta e sotshme, real quick.
Zot mos ma merr shpirtin pa e ble. 
 E meriton m’u bo viral kjo video  
Brune nga natyra, blondin e rreme.
VV pak a shum si djemt shqiptar qe kan qef me qi a kur tdojn mu martu kan qef me mar grun e virgjer. 
Meten tu na uru 
President ne momentin qe lejohet me u mbajt ky referendum osht shum ma e rend sesa asociacioni i komunave me shumic… 
Spo ja vlen me majt burg per turlifar klloshari se kuku qysh ja kisha shkun pluhnin asaj ntavan… 
Nashta qe kesh tu u perla me femen tek qetash e mora vesh qe koka kon bo termet.
Kur mjepin njerzit premtime mu kujtohet ky bossi. 
O militantat e VV a po ju rrihet pa rrym breh? 
A thu qysh ndihen kta mergimtart qe e kan votu VV kinse per ndryshim kur tvijn te familjet e tyne ne Kosov edhe ma… 
O Benzema a je normal o bir
Lojtar ma i flliqt ma i pa ftyr se Jordi Alba nuk ka.
Ni dost temin e pata paralajmru qysh ne Gusht. 
Albin Kurti diten e neserme e shpall dite zie per nder te kapove te Barcelones
Shum interesant po dojka me u bo Europa League sezonen e ardhshme🤪
Leni fmit me besu ne babadimer se na hala ju besojm kurvav.MC BRUDA
Hajde Bari i fresket para pak qastesh i vjelur 
Paska lind Marina. A ka kush tash qe i duron kto mediat tona? Jo i boni ni jave jo dy jo ni muj e keshtu me radh…… 
 Hahahahahaahahahahahaahah o thash mos telefoni i ka fajet
A po ju bon snapi juve a jo
2) Kur ju voton pupulli, populli osht i mir nuk e perkrah krimin e korrupcionin, kur nuk ju perkrah populli juve po… 
1) Molliqaj,Ahmeti,Krasniqi e te tjeret sa ishin me ju ishin te mir kur u larguan ishin te korruptuar e te poshter,… 
Mimoza A.K.A valltarja e Gadafit jep dorheqje nga VV dhe ateron ne partin e cila gjendet ne drejtim ka fryn era. 
Euu sovran he rrokotel .
Dr. Arben Vitia kerkon qe ti bashkohen qytetart ne terminin e radhes ne bilardo
Nuk bohet fushat tu u mundu me perqesh dikon o mindil. Hajt tash shko qite naj bilardo 
I fitun 51% ne zgjedhje te pergjithshme dhe filluan te mendojn se jemi ne kohen e perandoris Osmane ku Sulltan Albi… 
Qysh? Pse? A thu? Qeshtu a? Njejt si ata a? 
 Qeshtu jeni ju VV ku sju pelqen meniher kceni dikun tjeter edhe tentoni te sulmoni duke u mundu me… 
 As nuk e kom dit bile veq kur mqove snap me fol tshatirata
Njo e jemja hala pa e bo fam i ka shatirat 
Na keni lodh breh o nuk jan tu ju shit mo kto fore kur doni me kuptu? Ti zoj paguhesh per qeta merr rroge edhe duh… 
 Hala kish ksi njerz qe mbulohen e thirren ne emer te fes e ju doket normale me i bo dikujt sehire🤦‍♂️ 
Fort um mungojn reklamat e Top-Shopit
 Osht e kot me juve me diskutu se e keni trunin e fshim dmth juve nuk ju punon truni as 1% nuk kom shpreh… 
 Qysh ti po menon qe osht zgjedhje e mir me bo ksi sene a? Oj e nderume Zoti e ka ndalu me bo ksi sene e… 
 Shtine trunin nfunksion Kerkush ska me hi ne vorr me to po Perderisa o mbi vorr po ju bon keq njerve tje… 
 Krejt ata qe i bojn kto sene e juve qe i perkrahni kta persona kurr drit me sy mos pafshi o njerz tposht… 
A ropt juve jau qifsha breh po far e flliqt ishit kon, nuk keni lon kurgjo pa bo tu u thirr ne emer te fes breh rop… 
Reagon Agim Bahtiri: Hupa bashkA me Albin Kurtin
A i ke thon naj her dhipit ti hajde ulmu nftyr…. 
I ka mar Facebooki nqaf kto portalet tona. Paramendo ne qfar gjendje munen me kon adminat qe smunen me nejt pa honger mut naj sen palidhje.
 Hahahahahahhahhahahahaah tana spo muj qohna me shku npune🤌
Qr si hina ne Twitter e mora vesh qe spo bojka Facebook, Instagrami edhe WhatsApp
Ja kisha shkrep nlule tballit pa mu dridh qerpiku🤌 
Blero u kthy ti kur do te me kthehesh 
Si po i shohin lojtart e Barcelones lojtart kundershtar me dresa tkuqe po i lshojn komt
Mos deksha pa e ble 
 Debat intelektual mes dy kandidateve per kryetar komune! 
O rob qir na kurgjo tjeter sen spo bojm perveq te njejten sen qe po na bojn ata neve breh ropt ti qifsha ku i ki o… 
Ahh sa me pelqen kjo karikatura 
Loja osht shum e thjesht ki me hi me tabela te serbis ne Kosov.
Kjo foto mkthej me ni periudh kohore kur se kom pas as ni gajle. Take me back please 
Heheheheheh. Respekte per baben e kombit Alpin Kurti 
E kisha ble IPhone 13 po spo ka… 
Pse a nuk jan a? 
Ju e mani familjen Dripi um man mu  
 Hahahahahahahaahahahahahahah metafor ke metafor♥️
Tkoft normal qeky CR7 une po ndahna me femen tem sonte.
 Jo pe dij mir plus rregullat e ligjet as talibant ma strik nuk i kon
 Edhe ti je nifar talebanje shkon i pushton njerzit pa prit e pa kujtu🤌
 Ani pra tkallxoj une ty kur thush anej knej.
 Hahahahahahahaahahahahahaaha shum ma tmira se ne restorant a e bojm si tyneher shum ma mir
Nese qytetart e Skenderajit e zgjedhin Lushtakun per kreyetar ather nuk kon pse me dal e me u anku pse nuk ec qytet… 
Ma ne fund sonte muj me lujt rehat Pubg pasi qe ajo ka shku ne nje kanagjegj.
 Sa t'ka marre malli per Kosoven?Une tu i numru dite deri n'pushim. 
E rikthejm kete Perl. 
Une smuna pa to ajo smunet pa mu, munohna me pas afer po naj her duhna me shku….. 
Mu ma nin valla per to. 
Te kish dit Ismail Qemali qe vjen kjo dit nuk e kish ngrit flamurin ne Vlor. 
Qe nuk osht Mercedes as mos me shkruni bile. 
Big Shaq.Largon Coca colen dhe vendos Gjygymat e Qajit.Raportohet se Coca-Cola ka humbur rreth 10 miliard Euro ng… 
 Mos u qart tash
 Jo veq 5 ma shum jon
Veq ne Kosov ndodh qe prej analistit politik e perkatsisht nje deputeteje me dal e me kon drejtus te nje emisioni s… 
Prej tash puntort e sigurimit kan me e gzu ni respekt ma tmadh prej qytetarve.....
===