 Finlanda e ka golaverazhin -2. Kur e tha Andini kete, Portugalia e pati +1. Nese i peson tre gola Por… 
 Dyjat jane te verteta.
 A mundesh me konkrete, kolege? 
 Nese se bon, shkon ne shpi, si heren e pare.
 E vertete se studiot jane me mbush me militanta qe flasin si ti.
 Nuk me le pershtpje berllogu qe po e nxjerr nga goja. Jeni bo kamisha te vegjel qe kur s'keni cka me thane… 
 Kush te ndreq ty qe t'u ka shperla truni?
 I nderuar, ti s'je per twitter, je per spital.
 Sakte. Ta ka fshi.
 Ti qenke zani i kopese se lopeve.
 A te pelqen sana a talla?
 Ai njei eshte full komplekse e ju qe e perkrahni verberisht vec nuk shiheni prej komplekseve.
 Ne fakt semundja ma e rrezikshme eshte pamundesia me mendu me tru tendin.
 Te tregoj kur ta hapesh nje llogari reale.
 Vec mos t'i teket Albinit se e shkarkon edhe Bidenin.
 Op, 50.2% jane me kurriz. Tjeret jo.
 Më fal, po ti mendon se Kosova e ka vec një njeri me kurriz te drejte: Albin Kurtin.
 Tybe ti vec i ke degju keto se nuk ke ide cka jane lajmet fake e as cka eshte media.
 Mendova qe na ke bo mute e nuk na sheh. 
 Hiç marre s'eshte me fole serbisht. Qendrimi yt ndaj gjuhes serbe eshte fashist.
Vuçiq dorëzohet para Kurtit:M'fal, m'fal, m'fal, m'fal,Edhe pse gabimet jane bo pal pal pal Plumi s'osht i ronT'ronda jane fjalet...
 Ti sa paske dale nga torishta.
 Tash te paskan qite tallë te keqe.
 Paske hanger sane te keqe.
 Çfare sane e han ti?
 Edhe e kane zbulu Lupqin e Poshtem.
A e sheh a nuk e sheh? 
 Mentalitet i Sadri Imerit te Kojshia Show, bre Zoti e vrafte.
 Tash ti po merr guxim me vleresu edhe gjendjen time emocionale e psikologjike.Pervoja na e tregon se per… 
 More keta duhet me i menagju dikush. Ministria e Shendetesise nuk edhte askund. Me pase qene Zemaj ministe… 
 Po po, kur te fiton Albini, populli eshte i perndritur. Kur e ben lluge, i paemancipuar.
 More le ta permend luften, por mos te me flase per artin e luftes si Sun Tzu, se pastaj per mu esh… 
 Prape s'po kupton edhe po i then hundet. Nese lufta eshte faktori kryesor, Albini nuk ka kurrfare… 
 Pra, pikerisht ketu e permbyse veten. Tweeti im eshte dicka qe une nuk shoh ne rregull te ai. Nuk… 
 Dmth po te mungon logjika komplet. Ti je kape me nje status ku une bash hic nuk e gjykoj per nje g… 
 Une ia nxjerri te metat sikur te tjereve.
 Une po them s'ka nevoje me prit me kry mandatin per me kritiku. Po s'po kupton. E nese bon gabime… 
 Ke keqkuptime bazike. Askush s'u çu kunder ligjit. Kritika nuk eshte e kunderligjshme. Me kritiku… 
 Une nuk jam ne gare. S'kam obligim me jep alternative. Une jam qe me ia bo bajat dokrrat cdo polit… 
 Pikerisht ketu eshte gabimi. Me nejt t'u prite kur gjerat shihen ne start. Dmth mu per kete keni m… 
 Jo, jo. Keshtu e keni prite edhe Thacin. Kur ti s'ke alternative per probleme reale, nuk humbi koh… 
 Edhe Thaci pati premtu qe ben padi per gjenocid? Qysh do me bo Albini kete padi kur s'po mundet as reciprocitet me vendos?
 Ca ka servu Albini?
 Politika nenkupton nje proces qe ofron disa zgjidhje, jo vec nje. Nuk funksionon vec me "merre ose lere".
 Edhe ata e kane mbajte ne menyre tjeter. Ata t'u dashte me perfitu nga e kaluara e tyre qe lidhet… 
 Pse nuk e vendosi reciprocitetin sepse hesapet nuk lahen me fjale? A mundet ky me u perballe me Se… 
 Me pasoja te luftes perballem se Albini po ashtu ka dashte me mbajte teme Serbine qe 20 vite. Seps… 
 Une nuk i mbroj as AAK'ne e as PDK'ne as per lufte e as per asgje. Vec me lodhe idiotizmi i juaj q… 
 Askend nuk e godas pse nuk ka luftu. Ne parim jam kunder luftes, dhe ketu pajtohem me Albinin e vi… 
 Une po e verej qe ti po do me mbrojte Albinin t'u i sha komandantat. Kjo eshte praktike e njohur n… 
 Kerkush e kerkund nuk u tha kjo. 
 Semundja nuk shihet ne pasqyre. Ty te duhet mjekim ne spital. Nuk besoj qe te ndihmon gje, por beja hyz… 
 Me trurin kane problem militantet qe mendojne qe Albini eshte edhe strateg lufte. Te jem me i qarte, TI… 
 Secili ka bo ka dicka. Dikush per liri, dukush per pavaresi. Ky vec ka kundershtu, ka bo zhurme, e ne… 
 Po, krejt cka eshte mberri deri tash, ai nuk ka faj per asgje. Se bash ne asgje s'ka jep kontribut.
 Kapes i policise, sic e quante Thacin dikur.
  Problem ne glob nuk jane ata qe s'dine, por ata qe s'dine e s'dojne me dite. Lehte eshte m… 
  Per me i dite keto, duhet me lexu. Per me lexu, duhet me dite me lexu. Kur lexon duhet edh… 
 Hehheheh. Humorist i oreve te vona. Ku po e di ti qe eshte fy Saranda? A po pret krejt bota me qene naiv… 
 Mos eshte hamburger nga ABA? 🤷‍♀️
 Ketu s'ka hajgare. Ky po e thote krejt seriozisht. Te tjeret po ia luajne vec.
 Shko fli, me mire.
 Krejt mire vec nuk te marre seriozisht as ty as llojin tend. Shihemi!
 Strategji e njohur kjo: iki kritikes, shfrytezo viktima e shko te Thaci ne Hage.
 Trego i kahit je
  Ka te drejte plotesisht. Trenerkat e tij me AC Milan i mbijetojne cdo fortune.
 Edhe sapo ia viziton profilin kqyre ke ta rekomandon. E following i paska Vjosen, Biden dhe Kosenetin… 
Se kish harru Toma. 
Mbase edhe disa grave  
 Cfare sane po han koheve te fundit?
   Nejse de, ne nivel perralle ta thashe. Mund ta themi Albin Kurti &amp; Sali Zyba.
   Qe u drejtove me "ju".
   Ama une se kam vjedh. Une as nuk kam qene organizator e as pjesemarres ne aksion.… 
   Pse e pate per mu? Dhe kush qenkam une?
   Jo bash po me intereson pse?
===