 N'lojen e par paten respekt ma shum se qe duhet per Feynoordin, ma shume per emrin qe e kan, se sa k… 
 qu dil vajze, kush po t'nal heheh
 Po, nese shkon prej spanjes n'japoni.. po prej kualitetit t'liges t'zvicrres me shku atje s'po m'dok… 
 Liga e Japonis mos koft ma e mire se e Zvicrres, s'po m'doket qe ka shku n'nivel ma t'dobt
 Saka lojtari ma i mir i Anglis deri qitash, a n'ven t'Sterling bon
 Mos ia lsho zonin Anglis se osht Skifteri tu komentu
 Une moti kom thon, qe pika ma e dobt e Kosoves osht pozita e Shales edhe Kryeziut
 Shala 3 her po menojke para se me bo pasimin ma t'thjesht n'futboll
 Kjo osht faji i sistemit t'keq qe e kena na, kjo gjithmon u kon.. po ishalla ndrron dikur
 N'qdo sen qe e bon njeri munet me deshtu, edhe me pas efekt t'keq psikologjik te ata, jo veq n'futboll..… 
 Nuk osht qe ia imponon mu bo futboller, po mir osht mu mirr me aktivitet fizik, plus mson qysh me funksi… 
   Gjith mir ka lujt, perveq debutimit qe e boni 1 gabim.. 15 loj i ka lujt, nuk… 
Veq shqiptari t'kqyr qka vesh e qka pin 
 Menxi po pres me dal ne pension.
 nese s'don me fitu chelsea = s'ki lidhje me futboll
  How? Shtin sulmus n'ven t'tij, plus qendermbrojtsi osht ma i favorizum se ky, qe qat pozit e ka pozicion natyral
 1 tjeter e kqyra
 Hadergjonaj osht rast i njejt
 Ariani mos me qel telefonin (1.05)
 Voca e ka pozicionimin katastrof (sa e kom pa n'lojt qe i ka lujt me Kosoven)
 True, edhe qitash po m'hahet
I kisha honger nja 3 hamburgera
  Na veq kena dal  
   Urime viti i ri 
 Bash per qat arsye menoj qe Fidan Aliti s'osht per startus n'kombtare
    Lewandowski osht Polak lol
 S'ma mush synin Fidan Aliti
 Zhegroven e shajn edhe kur lun mir, se qashtu ish trend per me marr llajka
 A osht i Presheves?
 Qe doni mu martu per letra me kontaktoni, banoj ne Prishtine.
    Pata punu me 1 lokal para 2 vjete, erdh njeri me kerr, e parko… 
 Mire ish kon me marr edhe Serie A, me kqyr Muriqin n'HD
   Nuk osht bre qendermbrojtsi veq per "mos me lon me kapercy lojtart"… 
   Shum gabim e ki, Dresevici patjeter duhet me kon partner me Rrahmanin n'mbrojtje
  Pash krejt Slovenia tu dok ekip i fort a? se maj men qe ka lujt me kundershtar ma t'dobt se t'sotit Kosova
 PSE KUSH PE MERITOJKA
  ej mo mo, qu qu
===