 Cfare kritika te zbrazeta dhe te kota 🤦‍♀️Te pakten gjeni dicka konkrete se ma merr mendja qe ka dicka tjeter me kritiku.
 Cka po don me than me kete? Edhe burri i Kamala Harris quhet zoteria i dyte (mbasi gruaja e Biden qu… 
 Zemra me tu thy prej kesaj fotoje dhe postimit te prindit te Embeles  A nuk doli asnje prind me vet… 
 Qesaj valle kjo pi referoher si veprim degjenerues. Athere darsmat shqiptare qenkan kulmi i degjene… 
 Me za kam kesh qetash 🤣🤣🤣
 Amo hiq skan marre a? Asnje pike pike
 Albini shum i fuqishem bre, jo veq Kosoves, po kejt botes ia ka rrit cmimin e rrymes:
 Rryma asht shtrejtu edhe ktu ne Norvegji, kjo ska te bej me qeverine e Kosoves po asht nje krize ne tere Evropen.
    Dmth viktima duhet mu eduku se viktima i ka fajet ktu (ne kete ra… 
  Femijet munden mu mashtru lehte.
 Ata ma pare iu kishin bashkangjit serbeve kunder albinit. Tash kane me quajtw Albinin anti-EU.
 Kane rrejte e kan vjedh pa pike marre!
 Te njejtat sene i thojne "qytetaret" e vjeter te Prizrenit, Pejes e Gjakoves. Thu ti asht arritje e m… 
 Djali i hasretit munet me ba cka te don
 PDK tu e kallxu nivelin e tyre si gjithmone.
    Mue moti ma ka ba block 
  Shume kriminelave po ju pengon se koxha ua ka prish punet.
 Ani ma mire, tash se du ma
 Shqipen ma te bukur munesh mi than heren tjeter 
 Nuk me kuptove, asht veper penale me rreh grun edhe nese mendon qe ki "arsye" si  t… 
 Sille pshtille, gjithmone femna ju del fajtore. Kjo asht rrenjose ne mentalitet. Pa e ndryshu menyren e… 
 Zemra me tu thy kejt  Sa jete shkaterrohen prej ketij mentaliteti. Edhe me pas fatin e mos mi pas prind… 
  Per kete arsye jemi ku jemi!
 dmth veq katunaret bajne zhurme e  qytetaret kan nevoje per qetesi  o kejt kosova asht nje katun i madh
  Jo sta bana tag aspak, mos i merr gjerat kaq personale. Une ju pergjigja Albionetes, me doket… 
  bravo Albioneta. Gjenerata jote asjt ardhmeria e Kosoves e ju se keni as bagazhin e ju… 
  Edhe me Borrelin mire shkon, se Kurti po ju kallxon qe pa e paralajmeru edhe caktu takim, ky… 
  Sic po e shoh, vizita e Kurtit ne Bruksel po shkon shum mire, edhe po e presin shume mire. Ni… 
 so true. sikur vjehra qe ka than ishalla me vdek djali per inat te rejes.as disa jave nuk kan kalu prej… 
  ok. te pakten ketu po pajtohem.kan luftu per liri, po kjo sju ka dhan te drejte per me vjedh… 
  ok, ndoshta u shpreha gabim. te themi qe kan luftu per liri. a ju jep kjo te drejte me vjedh shtetin per 20 vjet?
  kur ska argument tjeter, te barazon me serbet. Po ta perseris, edhe nese kan luftu per liri e… 
  nuk po te tregoj per media. po veq kqyri statistikat per korrupcion gjate ketyre 20 vjeteve.… 
  Keto fjale: "ka luftu" i ka besu elektorati ne vitet 1999 e deri ne 2021. Me ne fund u kuptu… 
 Sen spo kuptoj.A po ma spjegon dikush kete grafit?
  une menoj qe e kan egon shum fragile e kan qef mu dok qe kan shum vetebesim.
 It takes two to tango. Nuk mundesh me bsshkepunu me diken qe nuk don me bashkepunu me ty edhe qe i ka kerkesat jologjike.
 jo 200 po opsione pa kufi ka...
 Ka dy menyra me kqyr kete, kjo e jotja ose ajo tjetra qe ai e mori vaksinen per me largu skepticizmin… 
 Skan ne cka me u kap e flasin kot. Cfare niveli i ulte
 Ne Amerike as qe e njohin kush asht Grenelli. Ta injorojme ket njeri te parendesishem per Kosoven.… 
 Nuk po muj me i kqyr emisionet e shqiperise se gjuha ka nderru qaq shum sa spo tingellon shqip pa. int… 
  Shum mire po ju ec, 1%  e ka kejt pasunine e tjeret skan as sigurim shendetesor edhe bankr… 
 qe sa kan kontrolle ne pjesen veriore 
  sa fjal e bukur. a thu a e kan ne gjuhet tjera?
 nese i tham une dikujt ishalla vdek ti, edhe ai vdek aksidentalisht. a eshte faji jem a? a kam superpowers une 
    e kam pas profesor ne fakulitet edhe ka qene i dijshem, profesional dhe i… 
 Mergimtaret e kan majte Kosoven ne kembe me dekada. Kur duhen paret, i lusin mergimtaret, a knej voten dojne me ua ndal.
  kontenti? = permbajtja? mu dasht me lexu disa here se nuk e kuptova cila fjale asht kjo?
===