  Shum leht osht veq e bon tag.... 
  Qent e rritun problem se i adopton dikush, se nuk jane t'trajnum edhe tjetra osht gjendj… 
  Kta e insajderi, indeksonline, expressi e ploott plot tjera...
  Po thu mos mi i kthy thate kontenjerat qe navijn prej kines a? 🤣🤣🤣
  Osht e vertete qe sjellja e qenve osht prej mosdijes te ksaj zonje, te garantoj qe me ka… 
  Problemi osht se vijne prej qyteteve tjera...
 Qysh bre edhe n’Skoci mu nal rryma?? Posht qeveria Kurti!
 Ajo pjesa kur i tregon botes se ajo e kontrollon burrin kur thot se "tha burri hajde e kqyrim edhe pak un i thash jo" 🤣🤣🤣
  Qka tani qe ka dhone intervist prej burgut?
 Ja prishe ti gjumin ja muti ta prish ty 🤣
 Ja kan nis me e dhi si nShqipri anej...
 Ki produkte qe jane ma tmira sa tdush.
 Qa ma ik trunin qr
  E qe kto markete e mbajn popullin me buk(veresia), se mos te jepshin veresi kta me t12 t… 
 Ky ose nuk ka ushtar ose po e lun blofin
Ata qe na vrane po na fajsojn tash 
   Qekjo "injorance" qe ti po thu ta ka rujt shqiptarizmin mos me u ba serb, ta ka rujt… 
  Ne jete spo them veq kto tfundit as edhe 1 second..
  Tiii skoke nveti jaran, shko kontrollou naj psikolog a najsen.  Aja ke mbajt qirin qe po… 
  Spo thot kerkush me i gjujt, po kallxoj qe ka zgjidhje.
 Ajt more se bon pa premium qyyhh
  Kur thu "cdo" dmth krejt, sen qe e ki gabim tu e dhez nxemjen veq mas ores 10 nbanese fatu… 
  Perveq kishes ne Viti ku ju ka ofru shuma te majme shqipetareve edhe nuk ua kan shite, p… 
  Prej kah pe din sigurt qe u kane serb? Ne qytetin tem njoh familje qe kan qene ortodoks… 
 "Qepusve" nuk i bene pershtypje keqperdorimi 53.000.000€, sepse duke e luajtur "telin perçues" te krimit ata sot gezojn…
 Qen luli e Qen saliu 1 mut te dyt.
   Polict po suspendohen edhe kur po i nxojn hajnat edhe kur po e kryjn detyren e… 
   Zotni Alban nuk e di pse merr mundimin me i bo reply nje personi me fake acco… 
 A e man nmen ti rastin kur polici i bjen pendrek plakut edhe ja qet ashtin e kames jasht pantollve?… 
 Ec more kur tdilni edhe ju me tregu burrni qaq mo, tu ja nis prej burrnis tdjemve t'PSD-se që mendun… 
 Koka mundu mi mshef, sdi a ftyren a vesht po diçka po sigurt....
  Hiç mos prit me dal diçka... bone men për 20 vjet qysh i kan mshef senet kta...
 Ngërrq koma njonit sigurt.... 🤣🤣🤣
 Berat ta paskan dhanë mision shefat me hu kap Albinit tash, dyqysh po vrehesh.
  Qka po thojn bre se pak di serbisht
  Po me analizu pak qaj qe e ka bo ket foto del qe e ka parku ma keq se ky i Austrise, ama… 
  Prap opozita po i kundershton ama spo i ka numrat. Hehh
 Kur i ki kriptovalutat vet e tkan prek ngjep e di qe reagon, nkohe kur nuk po mujm me u ngrohe ju me shpen… 
  Edhe nuk i ka investu, se besoj.
   Shum tpaverteta jon, kjo po lavdohet me qeveri qe jon kon t'korruptume dej nf… 
 Shum mut emnin e paske shkru 
  Veq nalu lexoje qka ke shkru edhe analizoje a ka logjikë kjo, kerkah nuk je besom...
   Dil prej fake accountit niher edhe tani bon kerkese per protesta. Jo me marr n… 
    Pse spot konvenon qka po folë a?
  Kur e ka ndale serbia aksionin? Kurr veq kur jeni kone ju damin e ka pas ma tmadh se tash… 
   Hahah ke lujt ti
 a ka naj koncert ma frik more se na ka marrë malli?
  Me ket tkajtme kush ska me ngu ma...
 Fsha diten nkoqft qashtu valla...
  Hejjj ti nëse menon mi nda osht si mi vra njeri... 🤣🤣
 Skom fb as inst... veq tfiter qa po thu ti?
 Jerem u qu tipi...
 Ai osht djale i mir,rrjedhe nga nje familje e vakcinume.
 Sa ki me nejt edhe a ma mir ktu a atje?
 I ka pas do tmira edhe maska...
Qe pse duhet me lexu para se me ble... hallall kti nanaki. 
 A ka burjum??!! 🤣
 "Tu i ndihmu je" 
 Ishalla s'e myt najkon
 Gjath me gishta, sha po bon
 Qfar emni si unmik dyqysh si kurrqysh
 Mos ta nin se post politik o, nuk zgat qaq 
===