Anglia jane msu me lujte ne shi, kane perparshi  ⚽️
Maske qe s'ti avullon syzat. Mos jam tu lype shume?
T'dalnet n'pandemi: Ora 22:00, Real Feel 03:00  🥴
Qysh ju thojne dy vllaznive qe e kane ni kali? Kemikalë brothers.
Naten e pare per vit te ri, naten e fundit per karantine.
Paramenoje me ta blloku najkush kombin ne parking, kur vjen me ta lshu rrugen ta cel Rrugen e Kombit.
Une tu menu qe avanture, ama ky virus e paska pase per lidhje serioze. 
Urime 8 Marsi  ✊ ❤ 
Qysh i thojne priftit qe osht edhe elektricist? Pop Kek.
Bashkeshort/bashkeshorte - a i bjen kjo qe luhet shorti se bashku a cka se sun pi bi ne fije?
Vjosa ma shume vota se PDK + LDK bashke   
Urime 1 vjetori i njoftimit me Dedimerin.
 Hahahah, a i kom edhe nja 3?
Ambasadori i Amerikes e ka mbiemrin si internet kafe e mas luftes.
Qysh i thojne anglezt evladit mos me bo zhurme?Harry, mos bo Potter.
A i bjen tash qe neja e pare mas karantines osht direkt afterparty? 
Policet tash kur t'na nalin jashte:"Te shpija, krejt mire? A jeni n'numer?"
Qeveria e Kosoves i shuan krejt andrrat e mia me qene 10-sh.. 9-sh thane je, ama po m'pelqen se pasna shprese. 
Ue, 9'sh dmth. Ndrroj gjume me buke taze. 0 &amp; 1-sha, lajmerohuni.
79 raste te reja Po vjen era si naj loje futboll qe pjesen e pare lun mire, po ne pjese te dyte hupe 8-0.
Ku pe festoni javen e trete pash nanen
S'ka asni njeri qe s'kom mujte me e kthy me dashni.
Kam me i knu kanget shqip qe me kane inspiru ma se shumti live n'Instagram  prej ores 20:00. Follow   &amp; t… 
Perpos njerezve super-smart edhe interesting, n'Twitter i gjen edhe kakat ma te mdhaja.
Thaçi n'T7 me 1 prill. Koincidencë?
Pa marre parasysh zhgenjimit personal qe e ndjej ndaj Migjenit keto dite, kanget e Gjurmeve jane te pavdekshme edhe… 
 - ALO, KU OSHT RAKIJA, ALOOO 🤡
 yes, mire e ki!
Momentet si ky te bindin sa i randesishem asht vendimi kujt ja jep te drejten me ta determinu jeten me vote.Juve… 
U myten tu thane "per hir te qytetarve" here njoni, here tjetri. Nese doni me bo dicka "per hir te qytetareve", e… 
Live instagram quarantine session osht ne story deri sonte 🤘. E nisa per 40 min, meta 2 ore . Falemnderit krejtve… 
E pergezoj frigoriferin qe e ka gjete qitash me mu prishe. Bravo 
     Me se e vertete. Ju falemnderit nga zemra! ❤
 Skenat me te bukura jane ato te Trashegimise Kulturore️! Pyet  qe realizoi aty  Kultura- hapes…
  Perqafime shoqe e dashur 🤗✨
 Shoku im  super cun e superartist e ndriti ne Tirane!  hapsire per muzike te mire 
 Sa mire qe kemi ende dite e nete te ngrohta dhe tani ne tetor, per te ndjekur koncerte te tilla magjike si ai i  t…
, falemnderit qe po na inspiron me hapesira si , e qe ma realizove kete anderr. E bukurin… 
Shihemi te premten ne Tirane!Biletat: .al    Falender… 
Shihemi neser ne Shkoder! ❤️  
Live performance video - "N'shpirt M'ka Rritë" me Joss Stone ❤️  
A e ndan do  per mu pash nanën  
Dembele futet ne loje, e merr topin, dheeeee priton....
N'kete oborr  m'ka mesu me i grahe biciklles :) 
 Thanks man, happy to help - perndryshe po aderoj edhe une kismet ne ni kange me Rihannen. Koalicion i qelluar a? :)
Hajde po lujna: Aderon aderoooooon....
Bon vaki s'bon vaki, bon vaki bon vaki
N'dikon ndikon, n'dikon s'ndikon
Interviste e disa prej anetarve te ekipit te filmit  pas kthimit ❤️    
Kur osht puna te puna taman puna, se kur pe soske me t'sose vec qitja do sos.
Ra PISA e s'po guxojne mo macat mu sille n'Facebook.
E çova me e masteru, ma kthyne CD-ne e masterit, po ish thy rruges.. E kapa nji cope, thashe: What a Masterpiece.
Serish vjen Marsi, serish vjen Bounty
Qysh i thojne njerzve qe t'i marrin borxh veç ka 50 cent? Mikroborgjez.
Mundesi e mire me e rrite eksportin edhe me e ule papunesine njekohesisht   
A t'per7-8, a t'konve9?
 rrene kofte, edhe haber s'kom per cka e ki fjalen tybe
Poget dje paska qene mire se kejt pi shoh me do fustana e tesha kat, 'Prom' kjo, 'Prom' ai, kah po dilni breeeeh  !
Macat e reciprocitetit - asi maca qe t'perkdhelin. 
===