 Sipas mundesive se skemi shume buxhet.  Me mire 50 se hiq!
  Fusha e basketit dhe futbollit te vogel
Pas pak te Fidani!
 It is true.  Te tregojne Ballistat.  Perndryshe perndryshe para shume shume kohe kam qene me Ish-Sllogen… 
Kurgje pa e pas emrin
 Qat pune e kam!
 Me u marr tjeret me punet e tyne sa merrem une me te komunes nuk i kishim pas punet keshtu.  Por cka… 
 Po.  A sbon me kqyr NBA a.  Gati krejt kohen sa jam zgjut mendoj epr komunen.  Flej me problemet e la… 
 Po! Gjenerata e parë!
 E mora si humor lajmin
  du me ja nis me shtru vet
Kjo eshte lista e fituesve te granteve per bizneset e Komunes se Prishtines me qarkullim deri ne 50,000€, ku ne tot… 
Skam vdek hala, jo. Hajde nje dite ne komune rri me mu nja 12 ore mandej shkruj.  Po ashtuqat dite qe ma dikush… 
   E qysh me ma qit emnakk ne zyre te une.  Ma mire naj kafe ku ulemi afer teotuari… 
   Sa me perket mu, po
  Vec a me len me shkru
  Po vallahin! Edhe me kallxon per gropa ku i ki ankesat e i zgjidhim bashke emnak.
 O jo bre po pritoj me zgjat  axhi Shpend se po tutna prej teje!
 Heren tjeter kur te postoj te ves thash. Mos u nxej! Smujta me u kyq sot ne hapje. Sorry! Kesh tu u ma… 
 Ani emnak, te ves heren tjeter!
 Cka mundemi me bo se nuk po kuptoj. Krejt ekipet i ka angazhu kedsi dhe spo munden ende me rregullu.
 Jemi duke e shqyrtu
 Numri me i madh.
 Taman puna!  Atlet nuk jam!
Edhe ti e ki mire! 
 Shyqyr qe nuk e dini cka i kam shkru une Kekes, po e dini vec fillimin e pergjigjes se tij.  Vazhdimi te he… 
 Zhetoni ra vonë, emnak! Jom plak!
 Skemi drejte me ligj.  Edhe keta me konkurs jane pak sa na nevojiten.  Nuk lejohet nga qeveria me shtu numer.
  E kqyr Portugaline ti!
  Pse faj? Po lexoj cka po shkrun.  Vec per Juventusin mos me shkruj.  Tjerat po.  Edhe teksti me emoji spo shkon!
  E mora vesh  per qata bona I know I know po harrova një smiley.
 Ok. Me fal ne qofte se nuk pergjigjem cdo here sese nganjehere nuk i shoh.  Sot ne ore policore .
 :) nuk e di per Arizona.  Problemi eshte me tender qe na eshte anulu.  Tash jemi ne fund te procesit.… 
 Qysh more skemi ndihmu?  Krejt ja kemi dhënë.  Krejt i kemi bo.  Edhe spitalin mobil mundemi me bo. 400… 
 Qysh me mu merzit posti i kryeministrit?
Nje pergjigje e sinqerte.  Ja kemi shkeput sepse u vonua shume. Jemi ne peocedure per asfaltim.  Te lajmeroj neser me sakte per data.
 Munden, vec tregom ku kane refuzu dhe ne sa ora
 E pash e pshtova. :). E kemi lajmeru.
 Mundem me dit vec per komune por per qeveri punojne me shume se 50000 persona per te cilet nuk kam informata
   Nuk e di a eshte e qarte mjaftueshem vec ne skemi drejte me vendos.  Ke… 
 E tash a me ja pranu punen kur po mbledhet uji a.  Natyirhst qe nuk ja pranojme edhe tash e rregullojne… 
===