Kta 4 na 1 qeshtu e kena bo
Vazhdojme me naj serial turk 
Kush se ka mja nis me hanger kapak sapun 🤣
A jeni bo gati me kry ushtrine? 🤔
Ta qet kerrin me qmim sa sbon hiq edhe ja shkrun aty "URGJENTTTT" demek fale po ta jep.
Nese osht dasht 365 dite me u kriju viti i pare, kjo sosht e vertete 
Me vs pa kapuq  
 HAHAHHAHAHAHAH ta ha zemren bac, moni agje se marre 
Mood - Mariza Ikonomi - piano e vjeter
Sot ish pas mush polic 
 Aq shume jemi defaktorizu si komunitet saqe dalin haptas flasin kunder shamise pa u frikesu nga pasojat elektorale!🤔
Koha per duksa po vjen- çmimi mbi 100 euroJo more nxeht osht hala 
Krenar me kta djemat, shneta koft se ka mu bo mire ❤
Definitiv keq jom i lendum 
 Oj mam qu shkojna te dajt 
 Mendoni ne keto dite zgjedhore. 
Se kuptoj, qe 15 here mbon follow ja kthej ma hek followin, ja heku edhe une. Ma bon prap . Sdi qka jane kta njerz kshtu
 Kur All-llahu e mbjell udhezimin ne zemren tende, krejt shkenctaret me u qu me thane qe se ki mire, ti qesh me ta.Enis R…
Ku jeni be njerz
Ku jeni be maco 
 Ya Allah na mundeso ket rrugetim  
Cka jon 77 milion euro per marakli, duhet me kuptu njerin i ka bo me pune.Kejt i kem ka 2-3 milion 
 motres jom kan tu i than: mos i qit pije musafirve se ramazan 
VAllah, Enis Rama n'Presing me t'knaq.
 Do te vjen nje dit kur dikush do te flijohet vetem ti te jesh i buzeqeshur, andaj mos i mbyll gjitha dyert e zemres tende n…
Kush osht tu e kqyr Hoxhe Enis Ramen  ne T7Allahu e rujte 
 Sot, vec me lidh baterine e telefonit direkt me KEK 
 Kurani sherim per zemrat tona❤️ 
Nuk ishmi dal n'rruge, po spo ka vend  
Urgjent duhet me flejt pak 
 Faleminderit, Allahu ju rujte.
 Perhajr Bajramin te gjitheve. Allahu jua pranofte agjerimin, lutjet, adhurimet e veprat e mira te ketij muaji. Qofte ky Ramazan…
Hina nDM me kqyr me kon kom shkrujt ma heret Krejt ishin kon " Thanks for following..."U emocionova 
 Leje vlla se as ty skoka tu tmarr gjumi 
Kush me mujt me flejr tash se 
Sa erdha prej xhamise, qe 16 here jom tu e ndi fjalen "kakao"
 Nje dost vjet m'ka dek ne diten e fundit t'Ramazanit! Ka honger syfyr, mas syfyrit nuk u ni mire... Dikur ka shku te mjeku, dh…
Ktyne islamofobave sdi qysh edhe sju vjen marre, a bash qekaq haptaz duhet me kallxu qe na urreni a.
 E Ti duar bosh mos na kthe, Allahu im..!!Sh.P
O edhe 15 ore me flejt, pa flejt edhe nja 30 min para iftarit sbohet 
Squditna kur ti shoh naj njo prej ktyne maturanteve qe "po çmendin meshkujt shqipetar" tu lujt me naj serial vendor.
 Uje gjate trajnimit, ushqim tpaster, stervitje me pesha tlehta, gjume tmire, edhe pse sjom adekuat une me fol 
 Per shtim a per renie peshe? 
 Buzeqesh!Se vetem buzeqeshja nuk e prish agjerimin! ☺️
 ku je qe je hup si morali !!!
 Sa e dhimbshme eshte qe njeriu te zgjohet per te ngren syfyr e te flen pa e falur namazin e sabahut Perkthim
De Jong tjeter nivel osht
te rinjet e ajaxit miq
 Haha po munohna mu qu me shku dej nteras qatje me kcy, spom majn komt 
 Eshte duke ndodhe tani live ne sheshin e Prishtines. 
qetash kom nis me zvoglu rrethin 
Qysh jem tu u bo edhe na si n'MeksikeVritet nje person, therje me thika, djali rrah babane,.... shkuem per lesh babo
qfar niveli kemi ardhTu u shit mangupa me prind, phuuu
Sot e kom pa ni restaurant, dikun nkomune tKlines, emrin 'Buka e Gurit'🤔 
Kuku danimarka flake flake
Veq me pi ni kafe me gentin e vren qe osht dost i jetes
Jemi ne kolaps energjetik 
Sot e pash ni qike qe e kom pas nklase nshkolle tmesme.E vrejta qe u befasu me mu sa kom ndryshu 
 Mos e ngo unikkatilin se po mujshe me myt naj kon mandej 
Kurgjo sosht me tnxan mengjesi tu menu per dikon qka osht me tdal gjumi tu ja permen emrin 
Nja 3 dite pa nderprerje  
pse na mos me dal mja thy komt Eriksenit, 
Prej sot, jap doreheqje nga Kosova 
Kom lajme per mu e tyBo paqe me tkalumen Koha nuk mun mu kthy 🤔
Kejt e dijne qe jom MDV  
Qka folet mas shumti nfitness"A po ta don""Paj mire sosht keq"
Ju babo keni shku per lesh babo 
 Sdi qka tkena bA 
 Ik se ti veq na kij inati sen tjeter 
Mihrija paska thon ikim pej Kosoves Aman sa ma shpejte sju shohim mo bile
Une kom dosta t'vertet, ama asnjo sosht ksi tipi "mka marr malli me tpa bro "Neeein qe thojn gjermant
 Derisa ke All-llahun, ke gjithçka.
 Kta jon kan tjeter dimension 
Sa mire tha hoxha sot "E urrejme te keqen, jo personin""E keqja duke u mbajtur fshehur rritet, e pastaj mesohemi me te."
Suarezi do me ma bo kancerin
sot bash kom prit me djeg fitnessin, ai mdjegi mu 
Ai qe ti mendon se eshte me i miri, per mua mund te jete komplet palidhje
  llegend e kom kta
===