Shume me happy jemi, se qe po dukemi  
 Degjova qe ni valltar high profile kish qene aty 
  Te dashur,Me dashamiresi ju them se duhet seriozisht te konsultoheni me terminologjine dhe… 
 Luan, qysh edhe thane ekspertat, qaj kcimi paaak ma i nalte se qe duhet i kushtoi ...
 Seria per Kosove, po thu e vecante Edis a?
 Sipas logjikes se tyne "Super gjigant" ish dashte. Po prape keto dyja mbesin margaritare.
 S'po din me vleresu ti zoteri. E rendesishme eshte çka te apostrofuarit dojne me thane ne ate momen… 
  Lab, me "anti-çfutboll" nuk e paske rondu. N'kete rast Ç-ja e ka naltesu personazhin ne fjale.
 Po de, festime jon. E ti the qe kerkush, bash kerkush nuk e feston. Make up your mind dude.
 Po thu a?Hajt pra te lutem mi spjego keto dy foto te fresketaA jane festime a cka po te duken? 
Kjo puna me festu "titullin vjeshtor" ne ligat kosovare te sportit eshte e kote. Kush e njeh ate titull? A ekziston… 
 Me Arabine Saudite me siguri ke dashte me thon, po USA ka interese aty e nuk i ka raportet e kqija.
O ku ka si ti ...
 M'shtine me keqyr. As Andora s'kish.A po, pajtohem Tuka e ka shansen e fundit per medalje. ALB fatkeqe… 
 Moti s'ka lujt, e zor qe e merr ne Euro. Ishalla e merr
 Finlanda s'ka marre pjese ne Euro deri tash. Ne euro 2020 po, ama hetemaj nuk po lun
   T'ka pase hije valla edhe ty me komentu F1 ne shqip, po ja qe ...
 Keshtu po, e vertete.
 Bajagi moti je n'tripa t'Edit Durhamit a 
 Sakte, dicka si kjo ne foto  
 S'ka rendesi bre luan qysh e thirrim. As ma te vogel as ma te madhe nuk e bojme qyshdo qe e thirrim.Ky as problem nuk osht.
Kush nuk e ka pa hala serialin kroat "Novine" (the paper) ne Netflix, ia rekomandoj fuqishem.Ngjashmeria me situat… 
 cka osht kjo pune keshtu? shume po jep, po edhe shume po merr. S'ka diskutim, ekip spektakular, a… 
*Ligave sportive unike - gjuhesisht me e drejte
  A pi nimon Bidenit ky muhabet a jo?E di qe ky s'osht shqetesimi yt, ama just aksin'
  harrova edhe qeto me ta kallxu leart  
  E vertete. Favoriti jem gjithe u kon Ato Boldon. Ndoshta pse u kon ma atraktiv. Pune femijesh.
 Provo 1 iave, e sheh qe ki mu mesu edhe kurre skane me te mungu. Perkundrazi e sheh qe trauma te ka… 
 Kur e provon, e sheh qe osht ma mire, s'ka kush qe t'kthen mo me ate loje.
 Tu e kqyre jom, rivalitet po, ama derbi s'ndertohet brenda nje edicioni.
 Mu m'ka pelqy shume ai serial, tbh.
 Faleminderit Po, euro 2021 do te jete ne rtk.
 Nuk ka zbulu kurgjo. Ama si duket po mbetet ne Gjermani.
 Sakte Lab, ama qajo osht madheshtia, me u rrite kadale. Tek e fundis s'jon lule, por drunj.
 A eshte autentike Fatos?Po me interesojka historia e kesaj.
 Ketu pajtohem 100 %
 Jo, veç kur e ndegjojne rastesisht
 Po, ama s'kom qene i kujdesshem mi rujte 🤷‍♂️
 Saktesisht edhe une e mbaj mend qashtu. Nostalgji.
  Cili MJ Bajram? Se MJ osht edhe Magic Johnson.A e pate fjalen per 23-shin? 
 Jo, shpeshhere ki qef vec me kqyre, me shiju, edhe + s'ki nevoje me u rujt mos po rreshqet me anim 
 Pse deti ka krype?Nje teori rreth ketij fenomeni z. Sinan t'lutem! 
 A e ke vet Mokin sa loje i ka lujte ketu krejt?
 Njeri i arsyeshem si ti nuk e len veten me bo ate sen. E me keto keshilla ju paske ndihmu edhe tjereve. 
DIALOGA: Shume aktual "Dekameroni".B: E vertete ... deka ma e ron... shume thenie aktuale!A: 
 S'osht qe e kom harru MVB, ama s'ka bo kurgjo Qe pe shti edhe njo se vec 5 rezerva i paskam lon: Lidbarski
Vendosa me bo self-challenge sot - me iu shmange 100% portaleve shpifëse.Rezultatin veç po e ndij: nuk kam tug 🤮 s… 
 Patjeter, i botum n'vendlindjen e nanes teme GL
Shyqyr qe seancen e sotme njerezit e keqyrin ne TV, e s'e kane portalet ekskluzivitetin qe me mujte me nxjerre cita… 
 Nese ndryshon situata per t'mire, vendimi mundet me u ndryshu prape, por ne kushteet aktuale asnje repr… 
 Me u mbajt mbahet ama mire me u shty deri ne kushte adekuate.
===