hajde e pim ka ni classic mojito edhe bojm muhabet
just keep BREATHIN &lt;33333
 na thojm i rafsh banderit te rruga skenderit
qet tweet e shoh cdo muj po so tu u bo mire .?.? 
honestly matematika ka me mi qr
 shume grande po pritoj mi njeh
 shume shqipo po pritoj mi njeh
  hajt se mirremi vesh na neser 
  mo se mu po mvjen marre per komentin ton e le mo ty
jeta osht si bombonier ka thon forrest gumpi adrenalina in the air la bombonera buenos aires
 jo bre ju hiq se hiq
 ehh qashtu e kan scorpiot
 un se kom lexu po nejse 🤣
 sine shum palidhje ke qfar humori
 para se me tnal policia, masi tka nal policia p.s shum bukur sine ❤️
 hajgare sine ti e din qe te dua
 Senet e mira gjith fillojn me S
kur e kthen jastakin ka ana tjeter 
 ta dhezi pa shkreps hiq? 
 ma mir shqip po doket
qe vjen dita me thon jom knaq nshkoll qija nanen
 me do airoplana ke
  amo kur thu ti ajo osht e kryne
 ta kisha bo retweet po e paske lon mos me ta bo 🤡
 ku je be sine ke hup krejt
 Leje leje se Gjokes ju keni tut krejt
me nejt naten qut pa fol me kerkon 
qka o kjo dit palidhje kshtu
 qysh me roll tutorial
  patjeter topi mbi te gjitha hahahahahahahah
  krejt qai topi na terheki dekaaaaaa
  une e kom shti me provu kur na tha 55 euro na u sill veni sdishim ku o dera me dal 
 hahahahahahahahah a tju kallzoj cilen bish
hup se po ta qi 
zakonisht kur rrezitemi me pantolla nplazh kemi synime per jeten 
 sa tlodht be nooo
 po pra na plasi lexoje edhe per vete
 pode si meriton twitteri kto foto tbukra ❤❤
 gati jam bro tash nisem
 mos ju jepni fmive telefona‼️ 
 Prizreni i ka qikat mat mirat.Naten e mir gjdo t'mir
 ky po qe ishte nje diss per mua
 Dita flamurit sot hehe
 edhe kjo flutren ndor a une pa flutur a e vrejte hahaha
 jo o lale thash ti le keshtu deri sa te marr verejtjen tende hahaha 
 thash mos ngjon buzuk, respekte
 Tjeter mengjes me shi , shkarkone dikush Avdullahin se lujtum
 hiq valla ka ti
 obobo naten e mire
Bile naten e mir me mthon
 Ti qifsha ropt a smujshe ma gat a 
 Telefonin, Kuleta             Ta qifsha   Qelsat, Cigaret.               Masken ta…
 mu kon i prizrenit e mos me hanger qebapa te hyska, sdi sdi
 Mshele tw nese si njeh qita te dy 
===