 Ka perfundu nihere aplikimi tash qe sjam gabim ne dhjetor hapet but not so sure
 Qysh po shihet ti e paske
 Menxi spe pres at kohen ku mthojn krejt mos ha se je trash
 mendova per direkcione HAHAH jam shum keq ma mir mos pyt pse
 a me dit ti qa jam une ishe kan e lumtur me veten HAHAHAHAHAHA
 ooo mendova se mundet edhe me tel 
valla pa gjyshen tem Shyhrete Behluli as 500K viewsa skish mujt mi bo 
 a ka naj link ku muj me lexu a najsen
 a ke qai i njejt diqka Anderson apo najkush tjeter tash?
 a ka psu naj lendim a najsen?
 so leht mu kan UNE, ama shum mir o
 Po qe prekesh ti mu mbjen ntok tani a dish!
 HAHAHAHAHHAHAHA mos em krahaso more me gjethkon
 veq Dio Rinen e ki en ker me feron ki kujdess
 Ronaldo me qellim ka hup se tash n’korik e ka dasmen.Edhe Messi njejt se ka mu kon djal kerri n’dasem t’Ronaldos.
un tu kerku se ku lesh pyta per mendimin tond 🧐 
 shaa u bo oj booter
 Ju “djem” qe boni video me kangen e Rines, edhe ja qojni me qellim me dal n’story te ajo, gjithqka muni mu kon, veq djem jo.
 HAHAHAHAHAHAHHAHAHAHA hajt se spo vrehet fort
E kisha pyt a jan virgjereshat pernime tvirgjera ‍♂️ 
qka kam qef me fol kur askush nuk em vet
*kur ti lyp me arsyetu veten po prap se prap mami tngan me papuq* 
 from bored to deka tu kesh real quick HAHAHAHHAHAHAHAHAHAHAHAHAHA ama veq hjg ke bo
 ka ik njoni en shqipri e po lshon fore
 edhe mem pas mu nklas
 o hahahahhahahahha o ani edhe sa here ki me drop dead  a ke apliku najku a ?
 HAHAHAHAHAH biq skom konkurrenc 🤣❤️❤️
 do njerz jon si sholja , sngihen kurr tu honger mut.
 hahahah tu bo qefi pak a a 
 a ke kjo pjes e aktrimit qe ke pergadit per sot a
 edhe trrezikshme tnjejten koh
 ooo ma e mira e Pejes 
 kqyr mir se ka edhe ma mir hahahah
 besoj qe mikroskopi mkish kry pun🤣🤣
 a tishe kon edhe ti en foto shum fort kish dal
 HAHAHAHHAHAHA qu po kavim bashk
 a e bane like a jo
  O lum twitteri qe tka rrush 
 person: *fol*me: shnet person: steshame: mu po
 Dita e mire shihet n'mengjesPo un kurr nuk qona n'mengjes
vallaaa kur ma shum nuk isha agree lmaoo 
 aaa hahahah ani sabahu te pret ty goce
 kape kimikun edhe diplomen qite ni 2 qaty vet
 Shumica vujn prej sindromes "kuku cka thojn tjert"
 ma then qekjo sa her e shoh🤣 
 Kari mos ta nin per kerkon.
dashnia nuk tlendon, po tlendon personi qe nuk din me tdasht 
ta then netflixi kur ski me pagu ti lol
 U nalen dy miza n’display tem edhe gjeten me bo sex qaty, a un ma budall per ti inqizu e lshova screenrecording 
 Un e kisha bo me ligj, ni çift mos me guxu me nis fmijen e par pa e kry ni kurs adekuat se qysh duhet mu kon prindi idea…
 po dojshe me nejt ni koh tgjat Orges lmao
*ja sot kom vendos me msu tan diten*tnjejten koh un tan diten: 
 cka je ka bon oj moter 
mas 1 ore kendim e vrejta qe dritaret i kam tqelta ‍♂️
 po thu ja vlen me kqyr se sa deshta me pyt najkon per naj film lol
mir e kom un, po so qashtu 
 I mshon dikush ziles:- mfalni erdha un, mjeshtri dritareve!+ Po a nuk hyne ma heret a?- O i njejti jom po rash prej n…
 Shume krenare me Meritonin   
 Gjakove- skoka kjo gjo shka e paska vllavin 
 Ooooo jem en publik se fort tkisha qu en rts
 Edhe un jam Kosov. 
 Njerzt po jetojn, a ju kqyrni rregullat
 Hahahahahahahaha vallaaaa e ki qellluuuuuuuu deri en maje 
 A tka rreh zemra naj her per mu??-Zemra jo veq baba jotè njo 2 her..
 Ju lutem mos me ofendoni. Nuk jam asishne
Une n'or tmatematikes be like: 
 Krejt per veti e ki
 Sjam person i pershtatshem per u pergjigj 
Tu lyp mi kallxu shokut/shoqes foren po sun nalesh tu kesh: 
Qe pse u ktheva en Twitter  
Qka me bo me 5 followersa more 
 Mos mi vjedh more memes 
 Aaaaaaaaa e shpallim veten bur e grua URIMEEEE
 A i ki letraatttttt
 Pom vjen keq nashta per hater tEljeses kisha bo najsen ama spo muj 
 Kto pun me zor nuk bohen, nuk muj
===