 Ni kry e kena hahahahhaha
Mos ju paqa borxh juve cka e i besoni partive, krejtve pa dallim 🧠 
"O Kamanjer a bon ni ekspreso ngjyst" 
Sot kafet po i pagun trusti 
 Un inventorin, mashum po mpelqjke 
Tutna prej xhehnemit edhe pse jetoj n'ferr
pik presje vazhdojme me tutje
 Drrases t'gjelbert i thojne drras e zezė?? 🤒
 A do me dal tpremten xhemen e vogel
 kjo po dojka lluks jo shpejtsi o p9
 -1 zbriti zakonisht rib
 mashklli 20 vjet me vjedh meme qija ropt hahahahahha
 Se ke hy n2013, e nuk pershtatesh me kta t'rit
 Flm per solidarizimin rrespekt &lt;333
 A po ec si robot??
Bravo Labi, ska virus
Nashta pak po dal prej temes veq,  e familinderoj nga zemra zevends kryetaren znj.Kaltrina Merovci
 Ky i fort esht, doren duhet me ja jep qe nuk esht hajn, a per kto qe po thu qe "he acts" ssss i ka je… 
 Ekranin e madh e paske pra hahhhaha❌
 spreferohet me kqyr n'laptop ket foto
 O biro kjo zyrtare per fotokopje o le qka fol kjo 
Tfiteri po mi hidis ballunat cdo vjet, respekt
Qysh me ik prej Kosoves gogle serq
 Analizoni gabimet qe i keni bo, msoni prej atyre gabimeve e taaaaani jeni te gatshem me u kthy fuqishem!
  Mos ma nguc xakin a u kry, edhe reduktoj vijat naper shesh jo jooo ....
  Ska ra ntarak kjo hala 
 a bablok qka po thu ti
Mos e hidh e mos e shkel sepse rreshqet zhhhvit
  Ski faj i ke bo do vjet tash hehehe
  a mun me bo ti qita 
 nashtaaaa edhe veq me jetu n'Kosov osht enough?!
 bashkveprimi mes karantines dhe ramazanit ndoshta, a qka po thu? hahahha
Bree qka knojke, e paska dit ky pllanin
O  kurgjo nuk osht me dite çka osht me ta dasht!
 keq ta kan montu bro
Çka t'bon i forti i ligu veq çuditet 
 Shihmi nshtator kolege hahahahahha
Konsiderohet se dy javet e ardhshme do te jene piku i pandemise ... popo qysh jo  
Kushi se ka me flejt
 O krejt amerika i ka ndor kto sene
 Kolege veq e kan bo me pik se smi kishin pa syt ? 
 Ti skishe fe bre familjen njog
 Krejt ropt ka me ti qi
 Jo be n'janjev osht 
Fort e luj rolin e tmeqmit 
Me hi n'market edhe mos me ble kurgjo 
 Qashtu bir specifiko se keqkuptojn popullata hahahhaha
 Tash e tutuje kena me u ul pa tutttt !!! 
 Qysh po menon bir curly hairs qe i kon a per qika qe jon kshtu tdredhavta
 Kah ana e djatht menova, se knej shum e forrt
 qikjo ish pershtat mashum 
 Ke hup krejt njeri ♥️
 Qitash pe di pse ja ke shtu edhe flora emailit 
 A e ki larg pjesen veriore?
 Kuku kolege e paske djeg tfiterin ❤
Phaa qfar gabimi trashanik osht me i bo 20vjet nkosovë
 Rrespekte per syt e tu qe t'shohin mir ❤
 Merre naj gajbe tbirrav ta then 
 Ruju se po tdel naj integral se limiti leht o
Ku bohet audia me teknik allahile 
 Ti qifsha ti qifsha
 Rrespekt per ty qe jeton tu i vnu vetes qellime, veq next
  Qitash ke fol si burrat
 Shqiptart kurr skan me msu qe maspari duhet me dal njerzt prej liftit/autobusit tani me hi
 Ashtu do veproj , rrespekt per kolegen
 A duhet me ta bo follow serish?
 Ani de sa mos me nejt 🤨
===