"Dikush ketu ka probleme me vetveten" - Gjuha Shqipe 
 “Merre me veti” vlen edhe per berllogun masi te pini kafen te nderuar flm
"Para teje i ftohte eshte dhe Dielli"
  I kan zhvendos zebrat ma nalt edhe ni semafor e kane vendos per me i dhon perparesi levizjes s… 
 edukimi seksual duhet me u kon pjese e sistemit tone arsimore...
 Sot e kom degju 
 Une e vnoj doren te barku Mami: po tdhem barku a?
 Me rroge mesatare te Kosoves ti spo mundesh as shpenzimet e qerase me i mbulu. Kjo eshte e tmerrshme … 
 Per mu prap nuk justifikohet ky cmim kaq i larte per kaq pak metra katror. Tek e fundit kto cilesi qe i… 
 A mundesh me mtregu qysh e arsyeton nje cmim kaq te larte per ni vend si Prishtina (duke e perfshi edhe… 
 Tmerr! Un spo di kush pajtohet me marr me kete cmim. Le tshpresojme qe seshte ky trend i ri se pom doket… 
Ni banes me qera ne Dragodan 58m2 ka cmim 560€?!?! A mundet dikush me m'tregu ku osht Dragodani saktesisht se spo m… 
  ti kur ke qene i vogel 
 Awww... pse cka po te shqetson tash o nys?
 Kosova seshte mire 🤗
 E Enjtja e fundit e Gushtit, falas te Shtepia Studio Kadare!  
  te kisha sygjeru me pa kete video! Ndoshta te ndihmon me shume me kuptu edhe k… 
 Cfare kuptimi ka kjo fjale??
 Hahah se paskam dit qe paska kritere para se me postu foton... Ose ndoshta kjo mendon qe krejt qikat pos… 
 E kryjte a? Hahaha
 Tri raste nga shume tjera qe ma kane vlu kupen e krese;1) Une paguj rryme/Ata falin borgjlinjet, sidomos ne veri! 2) Une…
 Para 5 viteve nje profesor ne fakultet ekonomik ka tregu qe nese ish mbyll fakulteti ekonomik edhe skis… 
  Atehere ndoshta kish me qene mire me i kategorizu nxenesit edhe me i hap shkollat profesi… 
 Analfabet do te thote qe nuk di te shkruaje e te lexoje. Duke e marre parasysh faktin qe shkolla fillor… 
 Ma shum kom une llajka neper do video se Avdullahu vota !
  Bash per kete arsyje duhet me u bo nje hulumtim i tille qe tregon te verteten se kush… 
 Nuk e besoj. Po teme interesante per hulumtim, e sidomos nese e perfshin edhe faktorin social
===