 Ata qe e kane pa ket jane sot SUPER NJEREZ 
edhe ni shoqe e jemja ama se paskan thirr 
 Haj se tkallxoj sonte pat shti met zi se lo  HAHAHAHAHAHAHAHAHHAHAHAH 
 Ashiqare duhet me lon emrin qamil se njejt po ndjehna
 hahahahah pom mjafton qaty te 2shi normal mu kon
 Po krejt fmit me tela personal prej 2 vjeç🤦‍♀️
 Sot neser masneser kur na kshtu? 
kem qit mos ma qo munin dom 
 hahahahahaha jo menova qe ja sheh hajrin ti me shku edhe un se as un si kom renet tash
 Dhe ja ku fillojmëë 
un para çdo provimi: 
 Gjesti ma cute nbot 
 Vibe sot me Goce Pejanet :)) 
 Vibe n'2 t'natesKUJT NE VENDIN TIMMMMM 
no one:gjyshja jem: shyqyr qe kan ndrru senet e sjon mo do budallaki si ktyneher 
 o ma tmirat e Twitterit❤❤❤
krejt kto kojshiket qe jane n'Gjermani e n'Zvicer i kan hek zanoret prej mbiemrit neper instagram, boll palidhje vec nejse.
pse me mi kqyr story-t e mos me ma bo follow, hajt pse?
ishalla smu ka kthy covid-i
qita story n'instagram, vec kur ja nisen react kojshiket rend :/
 Une qe i dua mbi 1.80 
po du me ia thane edhe plot sene ama o vone.
Pse tu kujtova bash sot?
krejt si ni shoqee e jemjaa 
 Kurr smujsha me gjet njo me qisi 4 gjete PHaaa 
 marshallah🧿si mbesa si halla sa tbukra!❤
 Virusi o tu zgat mashum se lidhjet e disave lately
 NobodyBabi kur mer ftoft "Kan thon t’Moqmit , cungun e madh rune per shingjergj"
 QYSH PO KESH NUK O NORMAL E KTO NDJENJA QE I KOM N'BARK MUJ MI MYT KADAL KADAL
 sen ma shum skisha dasht 
 jo, se jom e meqme
 njejte kurr ma t'mira si sot si kom bo
 Momenti kur sdin mu ngi tu honger 
Ni qesi qike si Mila pe du.Nashta spo lypi shum. 
 qajo p gabim koka prek
 t'hi tja boj ni foto para 7 muje like se qashtu o puna
 Me na ec dita mbarë✨ 
qohesh heret kishee me ardh mi nxan ligjeratat n'fk kur mrrin ktu thojne online kane me u mbajte qr
 hahahha ti je edhe vet e mir pervec asaj🥰
 hahahhahahahaha njejt tybee po ski qka bon me shty qeshtu me zor po duhet
menojsha vec me ty ndihna vetja
 hahahahahahhahaha mos u deshpro kaq shum per ex se su kon e shkrume
a kthehna me t'marr a me t'prit?
 as un vec po shpresoj
 bashhh o allah njejt edhe un qysh di mja prish vetit diten as hasmii ma i madh sdin me ma bo kto
 hahahahahha i jemi u feju tybe ski qka bon
 hahahahahha i jemi u feju tybe ski qka bon
 hahahahahahah mu live valla mkaloj perpara
dit ma palidhjee si sot sdi a ka
kena mujt mu kon qeshtu ama asnjoni skem iphone 11 pro 
me prit busin edhe me t'ik qeky sen vec mu m'ndodh
pa gjume edhe ftoftt, po dokna si mu kon tu kajtt
2 min para alarmit mka dal gjumi, hajr ishalla
 Nobody:T'shpis masi ta marrin vesh punen e notav: 
"Ginga a ma vizaton ni flutur"  
 Butoni ma i paperdorum ijemi. 
Valla sonte kam me flejt heret nderkoh une- n'01:43 
 Sa t'dush hekma followin po une edi qe n'mene mki hala.
 a t'jep nana n'katun?
 Me kqyr holl e holl, tash pi qojn n’shkoll e vet po ikin te burri
  po i mir o o allah
 Cfar degjoja un femij VS femijet sot. 
Pranvera erdhi, ti kur?
spom lojn fmit as ni film me kqyr rahat
Kur fol najsen palidhje shoqja ama e nin veq ti e bohesh kishe ske ni sen 
Qeshtuu vec mos me mendu qe po tranohna mas tij
Un e shkruj fjaline n'shumës ama qat snap ja qoj veq atij
 Me fmi tem tu e kqyr kafeneja jone 
 Nuk munden me pase seriozisht🤦‍♂️Cdo dite jo veç ulset, po njeri as n’kam ska pas ven me nejt po leni kto fore 
 ma mir se qeky nshpi qe e kom
tu ju vjedh qetu kojshive wifin, ju qka bonet
 Mvajn dniher tfoli palidhje ama e ndali vitin shiqir
i bertita ni fmis e si kusht mu pajtu mtha "Call me Bukuroshe"
 Hala jom tu lyp vetbesim te Anises 
 a ka najsen qe sun e blen me pare a?
tu e kopju Anisen ncncncncnc 
250€ patika tha mi ka ble shoki, pse spom qellon mu qesii shoki bre qr
 vet i bojna viral selakat kur munem veq mi injoru
Qr as kamarjere pa pervoj pune sun po hin se le najsen tjeter 
*a je idhnu a?*une: jo 
sdi pse foli palidhje
 Qeshtu kur tqohna prej gjumi n’mengjes,ama veq qe ksaj i rrin ma mire
 kur tme shihni se jam tretur mos mendoni se kam vdekur 
tha kom msu 1 muj me kalu testin teorik n'autoshkolle a un po menoj mas 1 jave me hy ala pa nis me msu
garant e ka pas Crush kto Aferdita kur u kon e re  
 hahahahaha ju kallxova veq ishalla dijn anglisht
 Beliii un dua nje tjeter 
 poo e mir jeeee!!! tduaa
 pse sma boni RT ti boj edhe un 1K follows?
Çdo dite me qesii tesha kom me nejt veç a bona najher nuseee 
 dej sa tvi n'vjet tksaj kom koh e mashtroj naj fmi qaty
 Si Dardi me Ganen
Vec sdin me fol se qato ta kish than garant
Ajt motraa jem lena rahat a spe sheh qe jem nxon a? 
tan diten kom ngu llafe t'grave, hajr ishalla
e gjeta qfar numri me ble unazen e fejeses
shoqet i kishin ble vellot a un burr hala skom gjet
tu menuu qe jom rrit muj me shku neper neja, vec kur e pash:Mosha 21+
n'vjet e tua ajo nan ti rrin ktu fol palidhje
qikes 5mujshe ja bon fotot me filtera t'instagramit
 Garant qaj qe e ka thon "Shpresa vdes e fundit" tka njoft ty
 Po normal be pllaum so njejt ta ngjojsh Ilir Shaqirin ene ta ngjojsh feron
 Des be nanen saher e kshyri qeto 
kur e sheh qe ske kalu per 6% 
mami: Shkruj, shkruj se spo tkqyri.*nderkoh ajo* 
qysh spe kupton qe pom folet me to:(
16% teli ishalla smnalet
sdi qka mka gjet menxii spo pres me ik per shpi
 po thu qe ska ma mir a
 a don ta fali qato temen se sen spom vyn
 hahahahahahhahahahahahahha rrena ma e mira
vetja shume n'qejf t'paska hy e po mendon qe ska me ty
une spo tthom sen po kqyre fol ti me to si dihet nashta ju shkon muhabeti 
shuj shuj zemer, boll gjemove.
 16 Marsin e paskan shortu me Janar po m’doket 🥶!
qe sa vjet asni memories se paskna me 16 mars
E vetmja gje pozitive n'jeten tem o grupi gjakut.
mkopi rrjetii hic spom bon
sa her ma le seen dikush gjith e nemi " Ishalla  Allahi ti len seen lutjet" sdi tani pi bi pishman ama prap tnjejtin sen pe boj
 ala smka ardh njoftimi qe kokna punsu
ti edhe mi dit te dyjat prap se prap stmerr kerkush
*gjendja*duhet mja nis ja me kqyr futboll ja me lujt csgo see du me met n'der t'babes
 kush e bon like ta ka inatin
Sa pata kajt kur e patem lidh me Kujtesen e aty u kon Tring Tring edhe sjan kon kta dy programe 
 hahahahahahhaha kuhhh qysh smu kujtu robt
 hahahahaua si krejt ma mir leje
taksisti mtha sot boll miree qe koke gati me perfundu fk ama ski me gjet kurr pune pa bo seks me shefin, is this true?
 -Kur fol ton naten e kur qohesh mengjes e sheh pending+Me: 
 hahahhahaha mu mkan pa n'instagram story bashk me vllaun pa flok ama mir pshtovaa e provova edhe qat sen
 ti koke njeri pa ndjenja
jom qu n6 mi drejtu flokt, dola jasht mu kthyn dredhat qr bile tkisha flejt
po bjen boree, vec thash t'ju kallxoj
kaq dit palidhjee ala pa u kthjell mir sdi sdi
 edhe sa djalin e tezess
 Tringa loves you kjutiiii
ishalla  e pranon bile qe e ka dasht 
===