 Kot u hjek ora policore. Komt ne 23:00 vet po t’qojne kah shpija. Slava Nafti!
 O Putin bagla, nuk na le me ju gezu perfundimit te pandemise.
 I erdh puna me shkru edhe kete sen; Ma nxehte jashte se mrena! Gjitha te mirat,
 Ne zor jemi me ja gjet diagnozen Edi Rames na kosovaret. Here na del tradhetar, here shpetimtar, here engjull here djallë…
 Miremengjes miq, USA  ja paska ndalu oqeanin ati tipit veriut a? Shume mire.Kjo eshte arsyja pse e du at shtet. Nqs j…
 Mos e ndrysho jeten per dikon qe s'ta rras, vazhdo ec perpara kshyre qysh t'vjen permas ;)
 Ta kisha fal zemren ama ki nevoj per tru
 Gjenerata jeme tu e festu fitoren e kryetarit aktual te Pejes.Cka ka bo ky kryetar qe 2 mandate? Ju ka shti mu zhvendose ne P…
 Institucioni qe i ka respektu ma se shumti masat kunder pandemise osht Zara
 Vequ ruju mos tmbet kryt mbrenda nmaqin hahaha
 Zoti tgjykon jo njerzit
 Qysh me i thon dikujt “jo” ne nje menyre pozitive???
 Ropt jau kisha qi qysh po mbohni franquza per gjys dite kur po bjen shi me ni liber te dritarja e ni filgjon qaj rusi qe e perv…
 tipar femror mi qel mesazhet nsnap gjys
 Shyqyr qe andrrat qe i shohim naten nuk transmetohen live najkah, se hore ishim bo!
 Ndaq me ma gerdite jeten, vec kthema borxhin copa copa.
 Pse a tka kallxu a
 Po ta dinin lulet se shumica prej tyre u dhurohen kurvav, kurr skishin me qel
 per tema super te ndjeshme, perderisa nuk e keni pervojen e dijen me jep keshilla edhe me e zgjidh problemin - mos fol…
 Aty ku ka heshtje ka pune
 Mos u lidh shume me njerzt, se t'gjith kan me t'lan nji dit
 Shoki vertet t'lendon veq 1 her n'jet qat'her kur t'len vet se ndrron jete
 Tan kto vite edukim e askush s'na msoj qysh me dasht veten
 Referata per Bamjram referata per vitin e ri phuu npidh tsomes bjeri ma shkurt se veq qato Urime e lexoj .
 Un nuk nervozona un distancona
Frasher ta honksha zemren qeshtu duhet me ju bo shputakve 
 Nuk osht qe jom perdorues i marijuanes thjesht me pelqen kjo foto si art' 
Na ka mar nqaf exiti
Kurgjo so ra bore npej qka o ra nboge
Interi e ka bo kaken 
 Me hek 1 sulmus mi shti 2 portjera
 edhe qet vit e ki e kryve hahaha mos ja qr
 ma mir qajo se me tu pi dora
 npamje mi analizu doken bura mi hi ma fellit me analiz dalin kurva
 o denis analisti per qata osht lecesteri nvend tpar
Realli ja ka jep tzezen poget barcellones  3 humbje rend 
 mbama qirin ti mu
 pasha allahin skom mora.
 paj ma mir pite se era mut
 valla une se kom zanat mu la me uj tbunarit mos mki ngatru me veten
Kqyre sa kcejn shputakat e kqi bre rod i flliq
 o ma perpara gabel bona se sa drenicak bre far e flliqt
Ishalla sna bohet ky shputak
 E gjeta nusen me letra  
 Urime 80vjetori lindjes Kadare, 2 libra deri qitash ti kom lexu boll hahahahahha
 normal edhe ne jemi kosov shija majken bur
 fort osht tu qit jasht qetash ja ka qi nonen
 N'Kosovë veq fmit e kojshive msojn 
Balica kur e bon check in qe qetu nprishtin                                      Shoqja vet knaqu zemer se sefaja  per ty ish kon 
 Qajo shoqni qe kesh me foret tuja ma palidhje osht shoqnia ma e mira
 kto pamje e knaqin komplet ni Serbi 
Sa here qe zbrazet mbushet perseri
Si nje gote me vere osht kjo dashuri
Xhom ishin bo rrugt
Qysh sbjen bore 2 metra e me na shty pushimin 
Veq budalla del nket ftoft nkorz
 ani ty met ra msysh
 hahhahaah pse spo del pra
 Konga e Kreshes shume real talk,shume artistike.Vec ni njeri qe si ka dy lidhje me muzike e nenvlerson✌️
Kish me hup manchesteri e me hek ket mut LVG 
 a msohet more muzik more
 hiq mos ta ndin 
 hahhahahahaha veq per ty neser 
Ishalla spo na shtyn edhe 1 jav msimin qysh po thojn 
Shyqyr 3 dit pushim tash 
 ej kokan bo shoqe ato 
 Neve na jep dhipin ty sta jep as faqen
 ka ishalla edhe na
 a veq ju a edhe na
 hajt kqyre lojen qaty se une spo muj as me pa
 mut osht ky veq superkupa ka fitu njet vet
Kur sma ka mbush synin Benitezi si trajner
 kqyre daten pak qor 
Qka na ka fut keq sot kimia me qat test 
 sa pike i jepe 
Qfar ajri i nxehte
Qeky osht lojtar qe rrezikon per ekipin e vet
A ka pas qfar party sonte a
 keke mu qa kryt
 pot fali veq hatri pacovit
 shihem te kthesa na atje p9 thir njerz 
 ku po don arsenal o papuqe  
 7 miliard njerz n'bote, edhe ty t'ka ra fati me lind n'Kosove.
A edhe msimin qe jena tu e bo mashum ntelefon se kryt nliber 
 Ai momenti kur Shqipnia kualifikohet ne Euro 2016 
Hajde more urime ✈️
 hahahhaha mbaj zi tash 
Paska hala ksi qe ma mbajn qirin 
 qe po kqyri flm
 ku pe kqyr se pom bllokohet
 Per dikon ja vlen me prish gjumin veq per me fol me to a per do veq mesazhin me jau lexu qka kan thon sja vlen
 Elben e du mas shumti nbot .
Kush i ka librat e 11 klas
Edhe pak e me tja fut te i 5
 qata se i kish krejt ter kur hina nklas 
 dallohem tash prej tjerve na mat veqant 
 jo veq kshtu jom shku
 i vetmi gabim i jemi osht qe ju kom jap dashni tteprume njerezve perreth meje ,  qajo dashni i ka largu prej meje
 qashtu poget sosht hala sigurt
 vi kshtu pa zavendsim
 bash te ju valla
 vi vet pa zavendsim
 ku po shkon ndeti
 edhe un kom menu qe smuj me nejt pa do njerz,po sot jetoj hala ma mir pa ta..se nese mkishin dasht pernime ishin kon ktu me mu
Ja badihava nuk pom mer gjumi
 Ramosi me kontrat t'rePiqkue me karton t'kuqBarca hupi 5-1Today was a good day
Dje e kom kuptu sa pot dojshin njerzit edhe sa pot vlersojshin
 o nori faleminderit shum ❤️
 falemiderit gresa mashum ❤️
 faleminderit shum loqk ❤️
 hahaha flm shum ❤️
 sa mir kur i rikujton momentet  ma t'bukra me personin qe i ke perjetu bashk me to..
Me ta tesh me qet bahqe cdo i dyti tu shku
Ku du mu smu bash  per dtl 
Krejt trupi mu ka pi
Veq 4 ore kom flejt
Vera ma palidhje nbot
Ku edhe 1 muj nshkoll qr
 Urime ishalla edhe 100 tjera ❤️
 Smundesh me rregullu veten tu e shkatrru tjeter kon .
===