 Haj allahu i gzun hahahahahahahahahahaah n ramazan
  perhajr lidhjen o brooo
    Kti ka me ja bo ni film hahahahaha
 Ke nje kshill si miku mikut
 Dost tkom ni sen po ta thom kshtu si haverit, feja, namazi, agjerimi jon obligime per muslimant. Pra kjo… 
 Me LOT IFTAR ME BIJA, halla e madhe nderon muziken me shum hurme jashaaaaaa
Se paska grun xheloze hoxha se tyben skish fol kshtu  
 Valla babik veq kallxoni ku a ka naj institut te forenzikes qe ju i besoni? Ky raport i kti institut… 
Tash ku me qu? Ku jeni te knaqun ju??? 
U zhdukshin ho se bash shpirtin lodh na keni. 
Lutja ime per kete dite eshte... ZOT qoma vendosshmerin e Rrahman Jasharit.
  Ma mir se me neve n finale ju mysum hahahahahahaha
  Ajt se me kon ti bjen tash ka me eliminu Villareali ka me mujt hahahahahah
 qitnja drynin ksaj gazete bile mos t bohni hor. 
  Une po ju thom qe sonte eliminohet city 
 Po de edhe une jom pro niher me rrit cilsin tani pagen po ky ish i vendost bab spo lshojke t gjall me p… 
Nuk ka pushtet te mbas luftes qe Rrahman Jashari si ka bo grev, besa ne qeverisjet e kaluara i ndihmojke edhe Kurti me aksione hehehe 
Nje HURMA nje GOOOOOOOOOOOOOOOOOOOL
 Kur t dush burr veq kallxom kur po don
 Bahahahahahahahahaha ja pe kqyri se na keni lodh
 Taleban do te thot kerkus i dijes spo ju shkon kjo 
 Ps te befte mir iftari e agjerim te pranushem.
Ja cka quajm militant. 
 Nuk bohet nashta ma e mira per te gjith eshte mos me u bo llaf
VRASJET POLITIKE BEHEN VETEM PER DY ARSYE, per ta faktuar nje genjeshter ose per ta fsheh nje te vertet. Ky raste m… 
  All in jom njo edhe fort keq 
  Skom shiba skom ble najhere hahahahah
 Thmit jon te paparashikushem bre THAMILJEN 
 Po a spe disha 
 Ani shko te termokosi tubo besoj ni dark e mir te del 
Pse kremijt mos me pas te drejta pse ska organizat qe i mbron kremijt
 Ahhh ani bon pare kur vjen knej na bon gjiro me kerr 🤣🤣🤣
 Flejj nxine veshin moj
 Besoj po e kap sarkszmen
 a je gati bir🤣 
 Po veq shkine t keqe ska 
Gjenja ni pune qeti njeri dikush allahile, po get ka vakt shumm ky e fol palidhje nonstop. 
  Ani djem ani lumna lumna hahahahaahaha
  Kjo vlen edhe per ty mika ime te duaaa❤️
 Hhahahahahahaha boll valla alpini ka mi qu hahahahahahaha
Djurici kur THAÇI ishte president dhe tani.“DAJAKI T’bon njeri ja tqet prej tefteri.Thojshin perpara” 
 Hahahahahahah ajt se edhe kta tu e mjel jon hahahahaha kush po vjen i parē
 Hahahahahahahahahahaha po bre amo ishalla so qaq gllub me i ble e me u vrejt n shtet se sbesoj qe o qikaq i pa meqem 
 Tyben sje ka e njeh as ti si gazet qeto hahahahahahaha kallxo drejt a pe njeh 
 Hahahahahahaa amo m shtini me keshe tybe hallall 
Ooo kqyrja referencen INTERLAJMI  
 Alpini ma i meqmiii krejt pe dojnnnn hahahahahahahhaah
Cilin kryeminister se kan marr ne intervist te gjitha keto gazeta? 
Sdi sa i ki...veq e di qe si hije permas jom.
20 vjete e kan shkatrru kete vend.Albin Kurti viti 2050 
 Flamuri ka bo simpati hahahah
 Hahahaha edee hahahaha phaaa devotshmeria n buk koka met
Mos e perzini agjerimin me gjithcka se bajat edhe njerzve jeni tu jau bo, jan rregullat qe e caktojn devotshmerin n… 
 E pash... po e njejta del fol per te drejta te femrav, qe po thuu tii fati i saj qe skom evlad ne ate s… 
Gjemna veq nje SHKA qe ka kerkuar falje per MASAKRAT ne KOSOVE e qe prej Rukije Morina qe ju eshte nxjerr femija ng… 
Nje shka i mir eshte nje shka i vdekur... se jom me ramazan e spo muj hi ma fell n qet temë, ishalla si shoh qata tweeta mas iftari.
  Bash qet sen jem tu e diskutu me Beratin, CKA NESE SDO TA KISHIM FLAMURIN ne RETHIN TONË
 Hahahahahahahahaahahahahaha oo mir e ki po pot nguci tybe me qellim e bona se moti stkom dhezzz TE DUAAA
 Qikjo fe osht ska modernizim as sen n kto veq sbon me thon nuk agjerohet se une se kom ni ni hoxh t vetem… 
 Nuk pajtohemi ketu, veq let agjerojn ska lidhje a qut a fjet me rendsi me agjeru me arrit shperblimin.
 Agjerohet agjerohet, nuk agjerohet pa e fal namazin se per qe flen KUPEEEEEEEE GJUMIN BABO 
Sluj mo CS dej n dimer edhe pik
 Ahhahaahhahahahahaah ose kta bab t kamionav n emen t fmive
 Une syfyr e kom çdo nat
 Veq tash e hajna syfyri ma taze
 Se bashku drejt xhenetit ❤️
 Per 30 dite e ndryshojm foton e profilit per shkaqe.. 
   Hek ty se mu jo hahahahahahahaa
   Nuk eshte e sigurt themeli KUJDES
 Ps Duli U fejove u fejove
 Perhajr se e pash ne snap
Zhegrova duhet te jete titullar i pa diskutushem.
Dresevic eshte KOKA e perfaqsuses se Kosoves.
 Kur t’thojsha bone be Semin nuk e bojshe 
A ja nisum e folum per politik?
 Ncnxncn edhe ato kan shpirt
 Ani a i mbrojm milingonat?
Jom ardh mu bo mik me ty 
 Hahahahahahhahah bash valla jau then 
   Distanca distanca spo na len me majt romanca❤️
 Pooo veq mos thuj tani spo vjen 
 Ramazani gati erdh amo ti mos hajde
 Qeee breee ska fjal jahahaha   
 “Kallxom kon i ki dosta, pa mos me m’kallxu qe i ki dosta” 
 Hajde kujdesu per ambientin 
 Gjuja edhe ni gum 
 Ooj balicē mos m komento kshtu eh
 qr kejt e pasna qit mas mene lObin🥺 lObiiiiiiii te duaaaaaaaa
 Qu moj mos flej mi tastier
Maksi kta njerez jan te çmendur...
  Ehhh ktu jemi ne nje vi
  Ja ja kur e ka pas mir ti e din mki neper rrjete sociale e din cka kom shkru... problemi… 
Qe n kete dite te bukur, jam i lumtur gjithcka shkon mir amo ece mos e shaj bree kete derrkuc bre fml. 
  Ky o n Turki dy or perpara qata 
  Ahh ta befsha gropen hahahaha
 Nese ti s’mdon, e du un veten :)
  Guaca t krymyllit jon kur ka lageshti dalin
   Neser kysmet une me Riadin edhe do shoqe tina pot pina kafe 
   Ti i ke premtu 50 milion mdoken hahahahahaha
   Po hi me kqyr 
 Tu desht mem bo xheloz, u bo kurv pahiri.
   Poo ashtu edhe une miku im, shpresojm qe joo
 E gat po dokesh
 I tmerrshem... kur thot Loti s’qonë selam a Luti duhet me thon a.s
 Kta kan me ra mu kan mem qmend
 Berati kur ka lyp mendim per nje qeshtje te islamit e ka marr ne intervist Enis Ramen, dallon prej ati… 
 Ke mujt ma mir 
A e qeli ni spejs?
  Jo more ZOTI ka zbrit libra, ne to ka ligje per jete, ka shembuj edhe per kto veq duhet me lexu qikaq te vyn.
  Faleminderit prej teje po sss
 Per bese poo hahahahahaha
  Pajjj eshte jasht ligjeve te Zotit more a je normal a menon a veq cka mson ne seminare 
  Spo e ngojsha se tullusum e kom 
  Eh ktu eshte jasht cdo limiti, per shum arsye e njera nder ta eshte qe me adoptimi.
 Hahahahahahahahaha ani rujuuu pra hahaha ju edhe ashtu jeni n sy tyne per t keq
 Kush e knon breee?
 Po ta bllokon prap e t merr n qaf
  Hahaha krejt kto i gzojn ne Kosove, as per mu nuk me pengojn, poo me ta thon t drejten pe… 
  Si krejt njerzt qe i kan mbrenda ktyne kigjev qe jan as ma pak as ma shum.
  Leje mundesh me pas mbrenda normav jo jasht tyre, mendimi qe duhet me pas gjithqysh promo… 
  Perdorimi i drogav eshte e drejte e njeriut, a pin a spin sbon me ju perzi amoo eshte ne… 
  Bash ta preferoj me pa qetē parad ku te pyet nje gazetar se a e kishe pranu djalin ton me… 
  Ja msim prej ti muj me marr qysh sakrifikohet rinia, rrezikohet jeta, qysh duhet atdheu p… 
  Vallahin kishe osht Muhameti (baba jem) per ta isha marru amo per Thaçin sssss, ti e din… 
  Lendomnaaa zemren lendomaaaaa nasht
      Hhahahahahahahahah une veq puntor jom plus jom i Shkupit
 Hahahahaha i hershem jeeee o mik
Spe di qe sa e bon, veq shum mir pe bon.
 Qfar loje, qfar atmosfere   ⚽️ 
Let mbetet ne mes neve
 Vec i mani ne mend kush e ka qu doren per thob multifunksionale edhe si votoni KURRE! I votoni ata qe jane kunder... qisht…
  Aiihaaa po kqyrin me permirsu krijusin, krijesat
  HAHAHAAHAHHAAHHAAHAHAHAH o mu shperthy parashuta 
Spaska ren me fol, ma mir me flejt 🤣
 Hahahahahahahahaha ja more ti guri je
 Oooo t knoft zemraaaaaaaaaaaa eta hongsha loqken hhahhahaha
 Te vuajm se bashku 
 - A e ki gjet dikon per me fol deri n’sfyfyr?Naah, e kena spejsin
  Po qysh spe ni amo une sjom per spejs n ramazan, duhet te jem i devotshem
  Hhahaahahaha sja qi nanen asni partie kur t vjen puna te ti babooo t pshurri politik ZHHHHHH… 
 Hahahahahahahahahahahaahhahaha na myten gardhiçet
 Qe 3jav n + edhe 15dit tjera knej.Mos u merakosni ju, ka jeni ma von  
  Poo more edhe une t njejtin sen po thom veq ju qe po folni sikur me jep urdher ministri hahahahahahahah
  Po ka pas shummm aksione shum arrestime, pajtohna plotsisht me ty amo une veq t kallxova ne cf… 
  Une sthash ti po e thu as nuk mendoj qe osht ma e deshtunja as skom thon kurr, je kam perzin L… 
  Asnje qeveri hiq, prokurori i shtetit je urdher jo ministri ktu osht dallimi, perveq aksionev… 
 Ta kan bo sell hahahahahahahaha
  E kur te bon Albini naj plan ekonomik si me largu krizen ne vend me shtrenjtim qathere tham merit e tina.
  Aiiihaa Lam une po ti kallxoj procedurat, sa i perket SIGURIS edhe Kroacis i kem jep informaci… 
Po ju po i fyni ata qe kan luftu per liri keni fy nanen te heroniev pa ju bo sen. Viktimizimi per Doniken osht buda… 
  Hahahaha prap meritat i ka Xhelali 
  HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA i ka ra si… 
  Pseee po i jep fam
Mos i lyp mo, si mi gjujt gurt n’liqen.
A po DUHI nerveti ju shummm a?
 O knaqu bre knaqu se ta ka dhon ZOTI
   Hhahahahahahaahhaahhqha ajt more pom han pse a po bona ma hor a
   Aiiihaaaa le se ma ka tesh jo bonum foto n caffe t don xhonit anej knej sdi sdi hhahahahahahahahahaahahhahaa
  Ajt more ti ma ke jep snapin met qit foto neper nejaaa me menu hallki qe je tu u knaq HAHAHAH… 
  800 i paskem bo
 Jo se ke pas po ta kom bo une 
  Hahahahahahaha nejse se spo muj shprehna Dard se i kisha thon dicka tafuttit 
 Hahahahahahahahhahahaha zonin e omel qata pot nxen hahahahahah
 Amo prap te ndodhi neser e sheh qeto 
Irani eshte kafshat super e leht. 
 Nejse, kerkoj ndjes pra sidoqoft qofsh me shendet.
 Qysh u met qikjo pune nime te vegjla apo te vogla
 Hhahahahahahahahahahhahahhahahahahahahahahahahahahahahahahahaha jo ni dit ka mu prish prej juve se jeni b… 
 Mir ktu n Turki be abi vallah bilah 
Veq niher u dal ky tani mas 5 minutav une qe mos mu vrejt  
  Kur o bro hahahahahaha
 Ajt seeee naten ma prisheee, pommm vjen inati qe je qatje kupaaaaaa HAHAHAHAHAAHHAAHHAAHHAAHA
 Luj luj e azilin ta nalshin lujjj he lufsh meq HAHAHAHAHAHAHAHAHA
 Ku vetet njeri n Amerik qysh osht, le allahile mos m bo nervoz sa u qova prej gjumit koka nal ujt xeher jom
 Sell bo ja prej meje dej 70 e ki
 Nime burr pse gjith t vesim qysh o bali Brah e ti qysh je s vesim kurr ???
Per bese SHOK qe m vesin qysh je i pasna veq 3 djem spo ju boj tagg se palidhje  
 Po Alpini osht i ma i me meqmi sdina na ksi sene
Po po boss Alpini ma i meqmi 
 Hahahahahahaha ehh se i di kapak senet
 Jo joooooo te lutemm hahahahahahaha
 Eeeeeeeeee sdo ta besoni do te deshproheni keq
 E ktu skam info tybe hahahaha
 M kallt viva fresh store ne skenderaj u gjobit nga komuna edhe j kan thirr krimet ekonomike hahahahahhha… 
 Sthash bre po komuna e Skenderajt e gjobiti edhe e paraqiti rastin ne krimet ekonomike
 Albini, banka, fajdja, kocka edhe lina mu myten hhahahaahahhaa
 Ky asht njeri ma i meqem n‘bote, asht ka i rrit qmimet me rrit ekonomin, Kosova me Zvicerr asht ka shtyhet.:Ekstremista…
 Krejt ato qe jon qu n7 n’mengjes veq me kqyr Tomyn me Jerryn, sot jon n’depresion
 Edhe na qe sjena qu jena hhahahhahaahhahaahahahahah
 Hhahahahahaha mos t ke Skenderaj me ngrit alarm sken tu shku tybe hahahahaahha
 Alberina Krasniqi mir t rrika 
 Jo ma mir mo sbon hiq po spo din kta 
Albini ka me u mbajt mend vec qe ka rrejt 15 vjet, rrenat e ti kan marr fund per 4 vjet. Nejse sa na si popull e… 
 Pom vjen mir qe ke fillu me mendu ma gjersisht, jo siperfaqsore. Sa per militanizmin tend ke kshill sh… 
 Ahhh munges argumentesh, prap marre miku im nje djal i ri si ti me u kthy ne nje militant mu mvjen keq… 
 Hahahaha e kom t ndalune prej twitterit edhe 3 dit
  Nashta po dhezet luft bile ma sheh hajrin Kosova 
  Me rendsi kom ftyr hahahahahahhahahaa
  Ahhh jau befsha gropen dyve
  Ja po tybe pa modesti jam i lagt ksi i fort
  Po po cfar gojdhanash jam ne minus gjithqysh jom ne minus ska hiq ma n minuspo me rendsi shneta shneta me rendsi
 Ahhhh baksuzi qe jom qeee me me u pagu tybe mkish ra shorti mu HAHAHAHAHAHAHHAHA
 Kush tha ashtu burr se jeni ka tutni HAHAHAHAHAHAHAHHHHAHAHA
 Veni i mir me gjona t mira me gjona t bukra hahahhahahah
  Ihhhhhh Lam Lam ke pi aaa? Se sje ka din cka po thu 
===