 "A po pagun bilete per to?"
Moti s'jena kane n'ato 2 javet vendimtare : P
Kravaten edhe masken n'brryl, kurr s'u msova m'i lidh :P
Rikthehen maskat n'brryla :P
   A na keni kallxu :P
Mas ni dite t'ngarkume kur s'din kah me ia nis me uru e me i kthy urimet e Bajramit 
Perhajr Festen e Kurban Bajramit te gjitheve.
Prishtina jo me lum, po edhe deti me lundru ️
 A ka najsen per ndermjetesuesin :P
Gjysë dite mos me pas bateri n'telefon, si me kane 3 muj jashte vendit :P
 Flm shume Shpend :)
 Plus shkakton edhe irritim qe masat po vlejne vec per ata qe kane mbet n'Kosove e s'kane mundesi me shku n… 
Sot sheshi ka qene si korzoja e dikurshme e viteteve 90, qe pas nderprerejes se komunikacionit (ne ora 18:00), shnd… 
 Na i ka shpenzu energjine :)
 Kta t'kompleksum t'vetmen te arritur n'jete e kane qe jane lind n'qytet, e mandej kqyrin me jau gjet ha… 
  Sidoqofte, perderisa numrat e golave i kemi njejte, mire o puna.Urime fitorja 
  Dallimi eshte se kto qe i ke permend i kane flamurin, simbolim &amp; emrin e shtetit ose t'f… 
  E neveritshme qysh njerezit per me arsyetu keqperdorimin e fondeve &amp; punen tejet joprofe… 
  Po, kane ndonje pjese te flamurit ose simbol kombetar bashke me ndonje top te vjete… 
  Op, perfekt krejt historine e kombit shqiptar &amp; ilireve me qit n'logo futbolli Mundsish… 
  Na s'duhet me u bo si ata kojshite tone qe i mbushin sheshet me statuja per me tr… 
 Hahahahah. Me randesi logon me bo gjithmone e ma t'keqe, me pas 1 yll ma shume se Brazili, edhe me pas… 
Pranvera ne Prishtine :) 
  Faleminderit shume per vleresimin Hoxhe :)
 Po pajtohem. Ne pergjithesi shumica e partive, ma shume jon marr me njona-tjetren se qe kane pas dicka kon… 
 Mesimi ma i mire ka qene Astrit Salihu kunder Isa Mustafes me 2009 qe krejt fushaten e pat perqendru me ni… 
Vota ma e ftofte - ever ️
  Pak me vonese edhe falenderimi. Allahu ju shperblefte te gjitheve per shperndarjen.
N'fund t'fundit, eshte prape populli qe tenton me ngrit veten n'kembe me forcat e veta. 
 Madje as tentativa e Qeverise Kurti qe i ka inkuraju bizneset me i regjistru punetoret e mandej me ju… 
 Po fatkeqesisht edhe une di raste ku puntoreve ju ndalen paret per trust e ne llogarine e trustit s'j… 
  e me fole fjale t'mdhaja por me fsheh identitetin, qysh i bjen?
 Kur edhe ofendimet, te sharat e tekstet e kangeve degjeneruese bohen bajat e s'kane çka me bo, mandej disa… 
 A quhen marakli masi atehere s'kane pas faqe n'facebook :P
 Hahhahahh. Eshte problem me gjet thanie qe i pershtatet aktualitetit te sotem ma shume se kjo.Ec e bindi… 
 Cila gjykate vendore guxon me i denu ata? Sa paraqitje n'polici e sa lende jane n'gjykata kunder padrejt… 
Kisha komentu diçka per Vjenen, po si plotesoj kriteret se s'kom foto qe jom kane atje (masi m'u pat desht me anulu udhetimin) 
Kjo eshte gjendja e ballkonit tim (kati i trete) ne Bulevardin Bill Klinton pas Halloween-it. Imagjinoni tash cka k… 
  Çka jon 2 milione euro per marakli?1.83 cm t'gjate si Zafiri s'jemi, ama krejt i kemi k… 
 Si kemi punt mire me 2 milionsha :P
Sa 2 milionshi 'avullon' e 'shpenzohet' palidhje n'kete vend 
 Me gjithe respektin, autori i shkrimit e paska keqkuptu situaten dhe kontekstin e ngjarjeve, sepse r… 
Sa me shume njerez e aksione te ngjashme qe behen, aq me te mire e bejme per te jetuar vendin tone. Shembull! 
Eh, juve po ju vjen marre me thirr aleatin n'xhami :P 
Prej sot, duhet mos me i injoru emailat ne folderin "Spam" :P 
  Ku eshte esenca me bo shpifje, ofendime e me shkaktu trazira &amp; kaos e me u fsheh prapa… 
  Askush se perkrahi as dhunen as vrasjen, por ashtu siç kerkohet mos me reagu dhunshem,… 
 Po, ka ndodhe edhe ajo, por m'kujohet shume mire qe neper debate e rrjete sociale analiste e gazetare bojs… 
 Ne regjistrimin e fundit te popullsise, perkunder fushatave qe mos me e deklaru fene, zyrtarisht 95.6% jan… 
    N'fakt, nese kerkon n'Google sheh plot lajme t'denimeve me burgim per mo… 
 Shtetet e forta edhe kur mbyllen ne pandemi i ndihmojne bizneset qe sa ma pak me u demtu dhe e kun… 
 S'mendoj qe mundemi me u krahasu me suedezet e besa me askend, as per jetese, kushte e as shendete… 
 Varet prej vendit, edhe cka ka prioritet ai vend ( ruajtjen e jetes se te… 
 hahahah, jo vec hajgare bona qe kishin dal shume njerez sikur me qene e fundit e mos me mujt me da… 
 Eh, kultura pellazgo-ilire e kto 
Kishin dal sot njerezit si me kane vikendi i fundit n'ekzistence te tokes. 
 A pat uje? Javen e kalume thane se eshte kthy uji pas reshjeve, por te dielen spat.
 Po e kuptoj qe eshte kulture qe sportistet e mirefillte me kerku falje dhe me marr pergjegjesi kur humbi… 
  Spo na don diçka me Veriort :P
 edhe kta paskan hup prej Veriorve :P
 Hahahah jo jo s'ka nevoje, veç shprehje ke per me tregu qe m'peleu shume vendi e fotot :)Gjithsesi flm s… 
 A i ka hek Austria testet e Covidit :P
   Tash e mas qaty duhet me dal n'hiking me  :P
Tash mundemi me vizitu liqenin e Trumpit, malet e Grenellit etj.. Urime liberalizimi i vizave me Ameriken!
 No comment - s'ka fjale qe e pershkrun as nivelin e ktyne njerzve qe jon n'gjendje me bo gjithcka per inte… 
 Sikur diten e pare n'shkolle qe gjith o fole per pushimet verore pa msu najsen t're :P
    taman me t'i qele syte me sabah :P
  Sa po don me t'i pru heren tjeter :P
  Hahahahhahah, e di. Kosovart ne pergjithesi s'munden me i hanger. Une jom msu se prej i vogel t'u… 
  Mo vllau jem me ksi provokime se prej tetorit 2019 s'isha kane ne Shkup 
 Tweeti s'pat t'beje me njohjet ndaj nesh. Thjeshte nese ne  s'do t'kishim deshire me u nda Kosova &amp; sht… 
  selami si pershendetje qysh e permende eshte vetem nje forme e kuptimit &amp; perdorimit. E perdori… 
 Ne kete kuptim qe e permende, une e di permendet &amp; perdoret shprehja "jahudi" ne kuptimin e dore-shtrengua… 
 A mujte a u lodhe a?Per gif-a jom bo a 
 Veç edhe ne shpi ka met me ardh me na denu pse s'po flejme me maska. Eshte absurde me u vershu qendrat tre… 
Udhetimi per Shkup prej 5€ ne 205€ real quick.
 Kurgjo kuleta cka po t'bojshin followersat 
 Duhet ndryshu kete mentalitet. N'SHBA o tradite qe kampioni i NBA me u taku me presidentin, po ka vite q… 
 Prej tyne i kemi la durt moti. Po flas ne pergjithesi per njerezit qe fillojne kampanja te ndryshme n… 
 ja gjejme ilaçin na edhe ksaj mos me qendru :P
 Dy paleve se pa aprovimin e ekipit nuk dalin n'treg ato
 AhhahahhaSi me ju pas ra Covidi, ju ka hup shija dizajnerave t'Juventusit :P
  deputetet me kete lloj niveli jon tmerr. Çfare perfaqesimi munden me pas qytetaret me kesi niveli t'deputetve
 Flm shume Miran. Amin :)
 Flm shume. S'kom nevoje per vize se i kom dy shtetesi (t'Kosoves &amp; Maqedonise) Veç u pafshim per t'mira… 
 Faleminderit shume. Perhajr Bajramin edhe juve Shkelqim. Gjitha te mirat 
  Po, kjo gjendje po len edhe ka me lan pasoja te njerezit.
 Perderisa nje pjese e bizneseve te gastronomise e kane reduktu stafin per 50%, e nje pjese po mbyllen,… 
 S'paska as te infektum pra :P
Sot 276 raste. Kurqysh s'po mujme me i bo ma shume se 300 :P
 Qeshtu o kur qellon introvert ne grup 4k+ 
 Amin, shpresojme pas pandemise kur t'largohen keto testet e Covid-19 :)
  Shume faleminderit per vleresimin Arlinda
  Une gjith kaloj. Sidomos kur ka njerez ne pjesen tjeter te trotuarit, me kalu n'mes te shtyll… 
 "S'ka virus"30% me Labin jon - me letra se not officially jon qashtu qysh po thu e qysh pe sheh edhe vet :P
Sa serioze munden me qene masat e partive qe sa ishin opozite nuk lane rekomandim pa shkelur, pa kontestu e pa kerk… 
 Komentet vec e prishin 
Situata politike ne Kosove 
 Kete deshmon levizja e partiakeve prej nje ministrie ne tjetren pa marr parasysh a jon te thirrur me… 
 Po, por mbi te gjitha tregoi se partise nuk i intereson me vazhdu punen e suksesshme &amp; profesionaliz… 
Jo kthim ne normalitet, po tejkalim i normalitetit per nga numri i njerezve qe kishin dal sot
    Besnik, a je i gatshem me prit kesaj radhe si turist Rexhen… 
 Amin edhe juve. Perhajr ju qofte Bajrami. Allahu jua pranofte adhurimet tuaja :)
 Amin. Flm shume :)
  I ke shkri skenat si zakonisht 
 Fotografi per versionet e ardhshme te Windowsit, sidomos e dyta 
 Faleminderit shume Petrit. Urime edhe ty. Shume te fala ne shtepi :)
  Urime edhe ty Labinot :)
 Faleminderit shume Shpend. Urime edhe ty :)
Ra ky shi se kem t'u fillu me u njoft me krejt banoret e nderteses perballe t'u ndejt neper ballkone. 
  Urime Bardh e Nehare. U befte i devotshem e i dobishem per juve dhe shoqerine :)
  faleminderit edhe juve per permiresimin
  Nese "s'kemi qene te informum", pasi jeni informu, eshte dasht me e permiresu gabimi… 
===