 Sa kat po e don 🤣
 Provoni nje here tjeter sepse me kete tentim keni deshtuar. 
  S'ka faj kamarieri a keni dal me pi kafe a me lexu libra 🤣🤣
 Bravo bre ti po din ti grahii...a na veq mujm me lu me ty se je mbet pakice 🤣
Edhe Rugova me pas kan gjalle e me kalu ne Vetvendosje prap Ldk ish thirr ne Rugovizem...🤣🤣
 Jane edhe do tjere qe e shofin anderr hala po sjane shume.  Me 5€ krejt partise tyne ju kthen buke 🤣
E thirri mjeshtrin qytetari, tha: nje shirit i kuq prej skajit ne skaj te televizorit ne ekran m'ka dale. Naj ngj… 
Dardan Molliqaj ka nevoje per nje vaksine qe ja heq VVn nga fajlori se don me mbet me pasoja djali....i ri bre diqysh.
 I kan heq vijat e kuqe...shume keq per kete rast 
 Nuk ishte aderim por huazim per sezonenon pranverore 🤣
Rezervoj 200 pika! 🤞
 Gjithsesi te dyjat jane ekstreme shume te demshme. Por ka nje video qe i thot pak ma shume gjerat
 Jane dy gjera pak a shume te ndryshme kur i shiqon nga larg. Njeri po thot te denohen(por por del ed… 
  A behet me mire ne KS nese ai distancohet? Ai nese ish distancu vec ju kish dhene vlere aty… 
  Mendoj qe ki kapacitete te mjaftueshme intelektuale ta dallosh keshilltarin ne aspektin ven… 
  1. Nuk me takon mu e besoj nuk eshte e ndershme te gjykoj aspektin moral. Ka kushteture per… 
  Ai ka te drejt te shprehet. Per mendimet e tij une nuk pajtohem. Mirepo ne po e kryqojme in… 
Meqense i keni aq per qefi grilat, i gjeni shume shpejt ne Dubrave.
 O... çka na bani me qat lutje bre!...e din ti 🤣
Ketu ne Ks nuk ka gjasa me u infektu prej parave sepse shumica jane te shperlame 
Nuk ka ma plaka ne EU, u martu kush u martu 
 100 here e permendi qe taksa 100% eshte tuj e demtu ekonomine e Kosoves. Ky tybe asnji analize per zhvillim ekonomik se…
LDK ne kohe te Rugoves i kan qu dy gishta,Ne kohe te Thaqit dy kembe...Tash e kan qu kryte ! 
Shajshin(m) perpara Kina na.. Kina na.. qe tash po dalin te shamet 
Po mduket Amerika na sjelli Coronavirusin vec pse se largum taksen 
Pa na njoh Kina pavaresine na nuk ja njohim virusin. 
Ai ka pare na kem mend...na i shesim mend per pare te tij...🤣 ë
Me pas drejtesi ne jete, parat e vezeve i merr pula 
Ky Donjeti me mire te kthehet ne bankat shkollore te mesoj cka i bjen ...spontan  o pusss bre...
 Hahaha jam duke e shqyrtu kerkesen tande....
 A po e dishe foren me qen a?
 A neser e paska a 
 Ahaha e ka munu naj birre se kshtu seshte djal i keq 
 Ceke hajnave se shume kush e lyp....
 PSD-ja tu e zevendesu Srpskan nicely. 
Emrin Liridon e qe 4 vjet s'mban telefon! 🤔
 Nuk dojm me pagu ma liftin 
Merigoni: Astrit tu rrit nera!Astriti: me nere spo mundesh me ble kurgja!! 
"I ka ra morri" qysh thot populli, e qohet e gris emblemen e shenjt me ba nam e bon mut krejt...idioti...
Thojshin me rryme e me gjerman mos u shtyj...ani hajt provo termetin tani flasim 
 Ke vetem pak VetBesimOooOOODo prekesh qellin me guximAllahile veq ke guxim...
 Paq fat te lumtur 
19:28 A jom ma e rancishme une a futballi?22:16 Ti zemër!VG
Hajde ne shpi, i than qobanit, se t'ka ardhe fjale nuseje... "fjale jam ngope, po du nuse", tha ai!A.Z
Djali : Babush a i nxen kta HARAMI ? Baba: JO evlad , kta edhe Harmin e kan vjedh !! 🤔
Euu Kosove ...ta kajti nanen Oligarkia....
 Mos e ki fjalen me marr meditjen sa paga minimale ...
21:30 Tha a e bajm mos me shajt21:40 Degjohet dikush duke punu me hillt ne banese...ec e mos e shaj at ...n...
Çka bon ne kohe te lire?Tham "zgate zot" 
 Ndalu diku se s'mujm me t'ndjek gjithe 
 Ja ka zhvillu e ja ka rrotullu 
Ma e forta ke ku i tha "le bre mos m'lodh"....e mytiii
 Nuk jam njeri perjashtues 
 Jo bre mos ja bo qefin vetit se as ne shahadet sdin me ra 
 Po don me na hup gjaku i shqiptarit tu hanger madarina.
 Hahahaha pse nuk hyne azil politik ...
 a po vjen ban pak rend se u ba hallakam
 Njerezit e krimit bashkohen ne nje subjekt te quajtur PDK 
Ka po shkon kjo pydyky more jau  P.S: qafen e theft!
Sot e pash qe pdk nuk ka rini por shoqate te peshkatarve...🤣🤣
...fshaa muzikenn..."ata bllablla e na hahahah" enca 🤣
 Kur ja ke nis me u marr me arkitekture! 
 Shka je bre tuuu folenn...
Tha e kish picku peshkaqeni njanin....çka je bre tu thane ai t'perbine oj shqipee! 
 Hahahahaha le mas Bajramit 
 Hahaha Arbane, Erioni e ka mbrapa Edin. SHPENDI i ka krejt perpara. 
Kush po pin cigare tymi po vjen prej meje...po mdoket diqka puna mire don me u ba! 
S'ka faj  se moti i ka prish krejt 
 Hahahah shaaa je be tu thanen
 Shkruj sms se e kish mshel zoti accountin 
"Me kan me ngajt ne pune qysh ngajm me hy ne valle ishim kan te part" BB
Msuese, une kur jam n'shpi krejt po i di detyrat...ka po vij ne shkolle po i harroi!! 
Larja e eneve, proces per tu kaluar!
 Bir qa u ba kshtu krejt shokt po t'martohen, qa po don me ba ti?-Me shku me u pijav n'dasem t'tyne.
   shume fort e kendu a 🤘
  qashtu pra i nderuar 
Kur jam kan DJ dy shokt   menojshin se po ben muzike 
Faleminderit...duhet me kcy me qata tupana 
Tu e ngu kangen "Moj Serbi murin ta rrxova se mu m'thojn Ibrahim Rugova"..e kuptova pse shume njerz menojn se ai ende eshte gjalle...ehh
 Me dek tan tdojne. Me ba me u ringjalle tan tthojne rrenc.
 po a. Hajt se shihemi na 
 a jeni?? na jemi te pakonkurence
 edhe te dielen njejt e ka 🤘
 qysh bre mos me votu prej 2004-es....kushtetuta t'lejon shume gjera...besoj qe e ki parasyshe.
Perpara futbollin e ka lujt fukaraja e pasaniku e ka shiku...tash po lujn pasanikat e po e kqyrin fukaraja 
Ma mire mi ba 6 pike se mi marr 6 gola...po na vjen dita edhe neve ⚫ KS
  po qfare rregullash ore vllazen keto...une i respektoi institucionet qe jane kriju me konkurs ....
Kur ti vyjn shtetit paret edhe veshin me kru polici ka me t'denu...se i duket qe ntelefon ki bisedu...hajt bacë hajt 
 "Kurr nuk duhet me cenu lirine per shkak te sigurise!!!"
Masat e siguris i kishin pas marr me Durex    
===