Mungesa e teksteve shkollore, Ibrahimi: MASHTI nuk...  via  LV nuk ka njerez qe… 
Kimete Berisha: Sot jam me Sali Berishën  Jo,jo ma mire mos kishe shkrue...
LAJMI I FUNDIT: Arrestohet Dardan Krivaqa  fare e keqe e magjupit
Adriana Matoshi  Deri tani asgja s ke -ni ba/deputet/ si nuk sollet nji ligje qe denon burrecat e femrave ashper
 Para disa vjetesh e kam ble gazeten "Koha",tani e ka humbe shkelqimin e vet,ca shkrime per palestinezet me… 
 Urime Nores ,shume urume trejnerit Dritan Kuka
 Memli Krasniqi nuk posedon aftesi me udheheqe PDK en,ke aftesi tjera por jo me qene lider i nji partie!
 Nje dite do te shpalle populli hero nese "tyrben " ne Mazgit me kamiona te ngarkuar ja dergone si dhurate Erdoganit.
 Femrat shqiptare jane shume ma iteligjente se burrecat shqiptare,ti ske faj i papervoje i padijshe… 
   Jo, Zotni Mark,Zonja Donika asht Qeverija Kurti,sepse njiherit asht edhe Zeve… 
 Kur ndodhe nji krize,siq tash kemi luften e Izraelit me Hamas, politika provohet guximi vjene ne pah.Sht… 
 doren ne zemer keta "deputet" duken si arab ma shume,shkoni n Arabi atehereRrnofte Izraeli
 Shpresoj te fitoni kete rund te trete,sepse s kemi ma te mire.Po me intereson pse Shqiperija/Kosova s j… 
 Tash jeni ne pat pozicion me hajnat tajkunat e sahanlepirsat/gazetare../ e qe popullit tone nuk i… 
 Palestineze nuk ka pse; s kane gjuhe,kulture e as tradite palestineze po kane gjuhe arabe dhe kulture… 
    Shallom  Israel Shallom Jerusalem❤️❤️❤️❤️❤️❤️
 Ti ske potense per me qene kryetar i LDKes
 JU Zoti Sherifi jeni politikan shume i afte,natyrisht lideret shqiptare duhet te marrin ser… 
 Mezi pritem nga Ju Zonja Donika te perkraheni inaugurimin e Ambasades ne Jerusalem,ju futeni koken… 
Daut Haradinaj nuk e pranon se AAK po negocion me ...  via  Partit si AAK,LDK dh… 
 Po do te kthehet mbrapsht!
 Mjerisht nuk fitone,po merret me politike!
Humbja e verdhë  Ketu s ja ke qellue,sepse ngjyra s i ka fajet por lojtaret qe luejten dobbbeeeet
Deputetja Musliu krahason kryeministrin Hotin me E...  via  kjo deputete analbete mjer Kosova qe te ka
===