Qa karin jeni panikav, hajm molla nven tbukes zgjidhet problemi
Dek sot neser harrohesh qikjo duhet me na motivu me jetu qysh tna qohet
 Pse a egziston pozit tjeter a?
 Çfare Vit i Ri palidhje
 Ktheja se sa her ti she tkujtohet
Sot para mengjesit po shihet qe osht dit muti
 Bone retweet qita nese je tu u knaq. Retweet per ata qe se dijn osht qai buttoni ne mes te like dhe comment.
 Mka ra nja do vjet ma shume se ti me nejt nks
 Sjam nket bote spata val
Aihh sdi qka kari e shkarkoj Manchesteri trajnerin bash i mire u kan na thejke karin
 Ja mem ra nmen ti boj vetvrasje
 Kujt i kishe ra nmen ti?
 Pasqyre, moj pasqyre, kush kari je ti me m'kallxu kush o ma e bukra n'botë?
 Mos i bo publike senet private se tani po thojn pse spo na thirr neve
Prej tw n'yt edhe anasjelltas spo kam ka sillna
 Blej dy qira kah t’vish…
 Po be nonen kom met me tvjetren me letra hala po foli me p
 Rrena dezinformata po shperndan
Kur pe sho neper data viti 2021 po tham "wtf kur u bo viti 2021"
 Shume tkisha than diqka po hajt spo bon para tjerve.
I ka mledh Manchesteri penzionerat bashk, si shpi e pleqve do mu bo
Qr jon do tipa qe mun i gjon n'komente te secila femen 🤦
 Aaaaa per faqe tzez
 Per qashtu kish nejt nshpi
 Qysh po ja bojm mos me m’perfshi mu n’small talk hiq???
 Sa osht pagesa? Se sonte nisna
Pasha zotin as psikologu s'kryn pune me kta fmi 
 Ah me dit qysh tash mkish nxon mu gjumi
 Sen veq mu tek me sha
Veq spo bon me sha se ropt ja kisha qi.
 Ndrro me naj kerr
Qa k mu ka mush feedi me buten
 Sa here ja boj scroll feedit t’cilitdo rrjet social, pa m’dal naj “reper” i ri qe se kom pa kurre s’bohet !
 Pse pi rren njerzit
 Jo ti ki me qendis kur tbashkohet ksova me shipnin
Kush e ka qendis flamurin e kosoves shtrohet pytja?
 Pse prej kujt je pavarsu ti?
A ka lujt barca b a?
Paramendo me gjet fatin e jetes tu votu ose tu prit me votu.
Vvotoni mos u ankoni
Shyqyr po kryhen kto kar zgjedhje
Biden kur qohet n'mengjes maspari menon athu qka me bo najsen tmire per kosoven se 1 rruge nkosov e ka emnin e djalit tem.
N'Kosov ka mu bo mire kur ta kuptojna qe jena 1.7milion njerz edhe kerkujt si ha per neve.
Bro po du me u kthy n2009 me shit shpin me ble bitcoin.
Qe 6 7 muj skom lujt basket
Prej qe e kom lan alkoholin krejt po menojn qe jom i pit.
Kta qe i lojn fmive ksi emra palidhje i kisha vra
Edhe pak ngjyra e kuqe nkosov ka me u bo ilegale
T'hane ma t'mire qe 36 vjet skom pas.
Qifsha qdo internet shperndares nkosove Naten
 Mos e bo me tmadhe
Qa kari zoti jau qon vetbesimin do njerzve si qifti i ksaj anises?
Çka me bo kur merr hapa per lukth edhe prap tdhem? gogleserq
2 ekipet ma mute nbot pasken lujt bashk sot MUTd edhe ky evertoni
Zgate zot ket kohe
  babo zevendso  rronin me donin n'T7
Zot jepma vetbesimin e nismes kur po thojn qe kan me kalu pragin
Me 14shkurt: Ku e ki vendvotimin ti?
N'ket muj mkan zan ngusht spo di a me investu ndogecoin a ntoka tprivatizimit.
Shume burre i mire ma tmire ska pas, kto fjal thuhen veq masi dek.
 Ty sun pot gjoj si faksin.
 Ta ka flliq emnin bab
 Ah shtet-ndertimin qe e kan bo mas 99 kta 🤦‍♂️
I madhi buta 1her ka thon: secilit qen i vjen dita.
Gjysa botes e pasken ditlindjen n'janar qr
Brravo ku ju ka shku menja Psd me i zbukuru kontinjerat🤝
Kush pi len kta fmi me hi ktu bre?
Spo muj pa i sha do njerz, po hajt sot hajt neser.
Qifsha bitcoin-in qka ish investimi n'toka tshtetit.
Krejt social mediat ja marrin tdhanat e knej m kan per WhatsApp.
RTK kerkon 2analista, perparsi kan simpatizust e pdk-se.
Nese alien-at kishin ardh ntoke per Shqiptar kishin than: kena ni per shqiptart qe jane njerz tbeses edhe tfjales.
Pse kerkush spo kallxoni qe i ka ndodh dr dre-s diqka?
Une ose rri deri n6 nmengjes ose mdel gjumi n4 nmengjes, sdi qysh ja ka qit terezin ky truni jem.
 3 sene tperbashkta i paskemi 🤝
Ndryshimet i bojn njerzt jo data-t, sjam i pite.
Kush karin osht aj qe han qipsa sonte?
Qr pi si gjaja spom kap sen kom fitu imunitet prej ksaj qim nane
Ka me pi qaq shume sonte sa ko me harru cili vit ke ky qe shkoj.
Dita fundit e 1 viti tmire deri diku.
Si çdo vit tjeter edhe 2021 ka mu kan i jemi,  sdi kur ka me dhez veq po testoj cili vit qellon i jemi se di.
Qysh ish kan bota nese ish perdor? 
Pi du 24h mos mem hanger kari per sen.
 Po fmi t’llastum ishit kon, me m’qit mu probleme per ushqim qishtu fmija e mij, i kisha gjujt n’berllog ata :)
 Nashta se ki pa, bor po bjen.
Lojtar ma mut se  Westbrook ska ssss'mun me gjet
Avavav e paska dek topin 
 Nuk ka ndjenje ma te poshter sesa me te sulmu dikush fizikisht ne pike te dites. E kam provu kete ndjenje. Me Valon Sylen…
Eh çka ta bon goja.
 2021 po doket reprize!
Hajt qit t'hane hajt  n'qat t'hane... 
Ket valon sylen e kisha qit n'merdare me jau la xhamat ktynve t'jashtit edhe ja kisha marr paret nfund.
 Sheepe be like: I besoj permbajtjes te suxhukit 1€/kg, po si besoj permbajtjes te vakcines!
 Sheepe be like: I besoj permbajtjes te suxhukit 1€/kg, po si besoj permbajtjes te vakcines!
Mkallin kto komentet "2020 still best song ever" neper kangt e viteve 2000-10
Qiky eshte manchester-i i vertet, ec se veq per Fa cup jeni.
U bo bajat ky virus mo
 Diqysh, kom harru cka eshte jeta pa gajle, and that’s kinda sad :’)
 Qfar karrike e paske mu knaq tu flejt
 St'kallxova sa funny je, tveta a tkan kallxu.
 Nuk e di a t'kan kallxu sa funny je.
Sot sjom patriot se krejt koken.
Mu paska dasht me i marr do muzika te reja.
Besom per ty eshte Ufo. 
Fmija n'darsem edhe Interi n'Champions league skan qka lypin, deka 
 Qysh nihna kur m’thot najkush n’shpi me ja qel naj tegëll... 
Shume ta then ky i ftoft.
Gjith e di qe u bo diqka kur e sho ntitull Lajmi Fundit...
 Qashtu kallxo se sju besojsha njerzve.
N'Kosov krejt njerzt spo kan kohe, ku leshin pe shihni at papunsi?
Sa thash ska me dek as 1 legjend mo sivjet  po jo sdo mu nal.
Qito 2jave vjen qare ska pa ardh 
Gajret burra qka kan bo perpara pa rryme.
Dmth te njejten foto ne snapchat insta facebook edhe ntwitter edhe ngjume keni mem dal.
Na edhe blackfriday-n e kena fallc bre nanen e shtetit ja qifsha.
E pret gjys muji 1sen edhe nfund jo valla spo vjen.
Hala nuk dul as 1 fitness me oferten "Ushtro prej shpis".
Prap Shqipnia ma mire se kosova me rezultate.
 "Te" -ja osht lidhs qishtu na thojshin nshkolle dmth veq 1 fjal osht.
Msimi online==Msimi neper podruma paralufte.
 Rri afer aparatit te ekspresos sot se ka me tu dasht.
 Veq 3ore gjume tbon ma keq se mos me flejt.
 Ma pak testime = Ma pak te infektum
Shqiptart shume tnxet n'qaj, sa komenti hajde na ktu ju presim me kallasha po harrojn qe 1milion paten ik 99-ten, ikni lypni pune.
 Per 500$ qashtu tprisht qysh e ki 🤝
Gjiko-koha shpejt po shkon osht perfekt kange.
Per me votu e kisha bo 1 test shkrim-leximi edhe 1 test psikologjik se na murren nqaf.
A pe kalon nisma pragun?
Valla as popullit Amerikan si han k*** sa po na ha neve per kto vota.
Pse jon nal numrimet ne Obri te Ulet?
Kur te qohna po du me pa Biden-in president.
Qr dojn me bo europen si ne lindje te mesme, Idiota tru shperlam
 Pse me thon kta, kur na sen spo thojna.
Me hi mi kujtu do kujtime.
Njerzt tash qohen une tash bi, kjo eshte jeta.
Parzit ke 2 tash prap 2 mu prish ora.
Kafshet ne qeveri po shtyhen kush me hanger ma shume. 
 Ufff cka me kishin kry pune 2.000.000 €uro!
O i kan ra pahiri qato 2milion so qe i ka vjedh o njerz.
Kosova bohet vend i jetushem kur interneti osht stabil, jo 1shi nkaqanik me ra m'nalet mu ktu.
 Ti je si kobe me gishta te thyn lun st'ha.
Nuk jetohet me sinus.
Mu ka perzi koha me amerik tash duhet me fjet.
Qka i keni kto video me shi
U taku Albini me ket bokserin qata u bo kampion ky.
S'kam shije per filma hiq.
I fitum 2par trasht te sulës
Maqedonia do ti fitoj trasht e sulës.
 Fragmente nga nje debat intelektualesh ne studio televizioni 
Spo ka dillera mo se krejt repera jon bo.
Klan kosova 600 dokumentar per Vetvendosjen. pse?
Momenti kur shkrun code po sdin qka ki shkru po prap tfunksionon kshtu qe qr mire o.
Naten e mire Arsenal.
Ky 9shi i arsenalit  koka lojtar i llapit veq huazim koka n'arsenal.
 Normal qe ti e poston nqat minut se mas 2 minutave ndryshon qendrim
 E ki lojen n3 kqyre LA
E nala pak dokumentarin(the social dilemma), me kqyr qka ka n'social media.
Veq pse i qet 2 foto qdo dit ka tdel me pi kaffe, e bon profilin ne insta "Personal Blog". QIU
  Jo i nderum si ka fajet "shkelzen gasha" po i ka fajet populli qe ka votu njerz qe skan… 
Ky Grenelli paska lujt koqe, kta tont meniher jon nxe nqaj.
Une nanes tem : Grupi 403-nuk kryhet shkolla me zor. 
 Spo bon interneti!IPKO: Zoteri, provoni te largoni nga rryma modemin, nese perseritet kontaktoni me Zafirin.Hehe, jemi…
Ku mos me ik prej kti vendi kordinator per siguri kibernetike e kemi zafir berishen, le qe ky titull "kordinator" o… 
Nese din me perdor excel-in hajde... 
Prej tash po ju kallxoj qe ne itali titullin e fiton juve.
1 her njete e bona shutdown llaptopin edhe mu prish le sja qi nonen mo veq npull.
 Me qka po i bon
 Kqyre e ki 1 script ne python e kryn ket pune
Veq edhe story me qit twitteri edhe krejt si insta pe perdorim. Me dasht met pa ta boj follow ne insta.
Prej 1 Malazezi dalin 3 shkie kan thon t'moqmit.
 Po krejt qata nashta jon te asimilum qe i kan kthy mbiemrat me 'viq'  si qaj shqiptari i 1 partie qe i kish marre 4 mandate.
Do qi-hen pa like e po shesin men.
A e ka perdor dikush qit barcod najher 
 Aj edhe 2 vjet npenzion del qka po ju vyn.
A po lejon qeveria mu la nbazena qe jon neper shpia se spe di.
Ky neymari su shkru mu knaq, me top tvetin edhe spe lojn me fitu.
===