 Jo ishalla, hajd se mire jon qaty.
    Ma ma, me deke se kena ba.
Jeta Xharra, kompania e t'ciles i ka marre 1,914,312.00€ t'omla prej RTK's tu u anku per RTK'n. Si ata tipat n'grup… 
Pse nuk ke  n'takim me 'n e ?
 Balta ma omel se mjalta
 Hajt se ka 5€ te pazari shkojne.
Peticion me na i pagu qeveria maicat Palm Angels!
Peticion per me i pagu qeveria specat per neve t'jashtit. Ideja eshte me ba ni qender t'specave n'Merdare edhe pro… 
Ora nja i nates, mu nuk m'merre gjumi tu menu se nese na diaspora qe 20 vjet i kemi pagu sigurime oligarkve e tash… 
Kthehu dimer se hajgare kena ba.
 Une jom militant i PSD's, mos na diskrimino. 
Qe qitu te kulla e Mulla Albinit. 
 Pirolla ju koft qetyne qe jau paskan zbulu plagjiaturen Bujar Dugollit dhe Ardian Kastratit. Nuk kom kurgjo ma merzi se p…
 Mu dy dite ma kane shty pushimin per ni gjobe 45€. Ma muren lejen, edhe n'FK dy dite  m'kane zajabate, j… 
 Promaja ja moti tu ndrru i kane fajet
Kush do te behet kryetar i PDK's
 Kta qe po e akuzojne Gazeten Express 
    FMLShembullin ma t'mire e ka dhane ky kur ka shah e pergjake polic… 
  Valon Syla e ka pase fjalen vecantarisht per ata qe ofendojne neper komente ne rrjete social… 
   A.Molla eshte zyrtar i LVV ne ShBA.
 Hahahhahahahahahaha hala pa i ba 20 vjet thojshin, tash deri t'bahen 25 nuk e ndrrojne
    Edhe ti paske interes prej qeverie
 Hahahahahahahhahahaa albotsat tu e qu KFC'n n'falimentim.
Mos ha mut i nderuar. 
 Cka eshte postimi se ma ka ba bllok Vela
 Zakonisht LDK'ja ose une ose ti. Gjasat jon edhe t'mdhaja qe  i ka fajet.
Lypi material / video t'zyrtarve t'VV's tu fole per shkelje t'kushtetutes. Se shpejti ka me iu hype vlera.
  Ka edhe asi si profa Rrahman Pacarizi qe e majne nifare objektiviteti, po faj nuk kane v… 
 Hahahahahahahahahahhaa o une thash nihere ishalla fake hahahahahahahahahaha
Peticion me shkarku Albini Kosnettin!
A po bahet zajednica?
  Demokratet qe ia mundesoj Bini me ardhe n'pushtet. Ahh po t'pa ftyre ishin kane bre...
Be bojke njeri, e kish djalin e halles po punojke n'hotell n'Bruksel, gjithe naten ka nejte Vucici me drite dhezen… 
 a eshte Lajcaku kauboj? 
 Takim pa as nje kushte edhe ndodhi. 
  Qurqilli ka thane jo une
 A jon veq emerimet politike partiake, a edhe shkarkimet?
 Ahh mos te harrojm edhe dialogun, Flamur, per cilin po bahet fjale. A shkoj Kurti n'negociata? Pa kerkim falje?
 Rrespekt per Kurtin qe nuk pranoi me negociu me Vucicin pa kerku falje serbia. Po Negociata, jo VETEVENDOSJE 
 Flamur, Kurti u kane simbol per ndryshim, e esht ka vazhdon njejt. Nuk jon 10€ ma shum a ma pak ndryshim… 
 Sa here e kane vazhdu 3 muajshin, o Isaku i sakt?
 Ku jane , , ? Me te drejte reagojshin per cdo tentative te qeverive te kaluara me i manipu…
 Ekspertet po thone qe  nuk ka te drejte me e shkarku ne kete menyre udheheqesen e KQZ'se. Nese eshte keshtu, a…
Po de po, Daken e shkarkune. Cka pritshi? Republika e trete me brina nuk vjene. Qyqetari me qisi senesh mahet. Penz… 
 Nese Kosova mun krenohet me dicka, jane proceset zgjedhore. Ato jane bo ma te mirat ne rajon, me znj. Daka ne krye. S'di ku…
 Ishalla po pshton hahahahaha
 Po sot Zoja e Zeze ka vendos mos me shajte UCK'n.
HAHAHAHAHAHHAHAHA Lene more rahat djalin  
 Jo tybe hahahahaha pse a mos kesh une qaj person
Ma shpejt e kane harru VV-ja Rexhep Selimin sa une me hjeke tepsine prej furre masi te m'thote nana 10 here para se me dale prej shpise.
 U cka u tu hjeke Njo'ni me juve. Hhahahahhahah
 Mire i paske punt. Une u myta tu e lyp nja qe s'ma munon.
 Nese e konsideron sukses autonomin mrenda Serbise, po, jom kunder.
  Nuk eshte interesant a t'ndodhe po a e han foren 
Viti 2030:Albin Kulti: Po tani jemi autonomi mbrenda teritorit te Serbis sepse kishte keqqeverisje per 20 vite. Ke… 
 I rrezikshem po thu o a?
 “Sikur met thon femna, NUK TKOM TRADHTU VEQ TA KOM KNAQ SHOKIN” njejt osht kjo poooo per xhematin dele t VV-s kjo ka dallime t…
  Nuk kane dallu deri n'2020-ten.
 Hahahahhaahaha pe lajme qashtu
 Hahahahhaahaha pe lajme qashtu
 Arber, t'respektoj po ksaj here ia ke huq. Ketu po shihet kryeministri duke pershendet nje votues.Kryeministri &gt;&gt; qytetari.
E disha qe dikun e kom pa qita. Same vibes. 
 Flej flej ti popat tu ba spota me Eren.
 E kom ni djal t'qikes t'halles t'dajes t'burrit t'mixhes shum esht djal i mir puntor kur dush ta qes. Me… 
Edhe pak edhe kane me ia nise me thane valla sen s'po na vyne veriu, ma mire me bashkangjite Luginen e mu ba rahat.… 
E hala ma ironi tash qe po m'bjen mu mu anku per shpenzime t'qeverise.
Kta qe gjith jon anku pse po shpenzojne qeveritaret u tallshin me Hotin kur shkojke me autobus n'Shqipni e po e mbr… 
 Une nijta ish drogirat tu menu qe jon vaksina
 Na mete n'dere edhe ti :P
 Dardan Molliqaj! Dardan Molliqaj!
   Kadale more se vec sa ta hjeku bllokun. Mu me ma hjeke Vjosa vec bravo zoj… 
Bojshi hajgare me sendviqa t'Kotit. Kulti edhe Biqlimi 2000€ i paskan shpenzu per 2 dite n'Bruksel. Ku eshte… 
Lumiri e paska shkarku Veliun. Nuk p'e di hala cka me menu. Knej po m'pelqen qe po e merre seriozisht punen e refor… 
Masi qeveria ia paska nise me i fale bllokat, i boj thirrje publike presidences me ma hjek bllokun. 
   Krejt narrativa e Grenellit edhe ekipit t'Trumpit per dialog u kane e tille. Qa… 
   Po i kom thane me ma hjeke po s'po ngo' 
  Koka kthy n'fjale t'Grenellit 
 Jena hi n'vitin 1984.
  I lumi ti nuk t'bjen me pa ma qa shkreton
  Partia Komuniste e Kines nuk eshte nacionaliste po akuzohet per gjenocid. Pastrimi i Stal… 
 Hahahahahahha se pasna pa Lumirbot paska edhe ksi
Ramabaja i tha 't islamist HAHAHAHAHAHA
 Hhahahahahaha a s'ke ni a? U hi n'qeveri.
 Pak pak, po boll i ka dale me ba budall 
Ramabaja tu u shty me Buzhalen cila qeveri ka shti ma shume t'njofshem neper borde. Ahhh, era ndyrshim, era shtet. 
 Atu ku balta eshte ma e embel se mjalta ^^
I kisha thane bravo qeverise Kurti po mbasi nuk eshte ba hala 100 diteshi nuk eshte merite e tyne po e qeverive t'k… 
 CheLalin kemi me ba minister t'pallatit t'endrrave.
  Nuk eshte politik po turp. Edhe nuk eshte arrestimi po menyra. Nuk ka t'boj me VV'n e qeverine… 
 Vec jom tu e prite diten kur te bajne pytjen "a menoni qe bon me i vra krejt kta t'opozites", edhe me dale 110% po.
    ja 3mi Euro. Fore si e Bimbimmes me loje fjale u kane 
U ba nifar trendi n'Kosove me i dashte veterant vec nese jon t'varfen. Dmth sa ma i varfen me kane ma patriot e ma… 
Shaaaaaac qa je qart kshtu   
 Hahahahahahahahaha a i lexove pash zotin. Vec do  m'mungojshin. E kishin ba Masterplan qysh me e… 
Ironia e jetes. Kur Bini u takojke me opoziten e Shqipnis e bojke fushate iu u bojke zemra mal. Karma is a bitch ka… 
Qishtu kur t'bojsh qeveri me praktikanta qe pregadisin penalla gjdo dite. Thuni tash jo fakenews jo Buzhala jo kne… 
 Ky eshte legeni qe sot paska thane sbon me kundershtu policine, e me ba te fortin. Ata qe e njohin sidomos kojshia tre…
 Njefar Ismeti paska thane se Hashimi nuk ka kriju storje te suksesit ne Kosove. Jo bir, perveq qe e ka bashke- kriju e demil…
Hahahahahahhahahaha stop it pls 
Prej kurshit u ba T7-shi kaq savage ? 
Qysh u                          Qysh po mbledhshim te            mbledhen dajt ktynehere.            Tash 
 Kjo qe 100 vjet se kish pa baben e vet.
Parameno me ta ba femna nuk t'kom tradhtu po ta kom knaq shokun. 
   Ky tipi as qe e paska kundershtu faktin qe ka perdore telefon gjate provimit. Vec… 
  Jo gabim je Alban. Vjosa i ka kerku per keta krejt.
  Per ata qe shtijne e hijne n'pune me t'njofshem :P
===