Eksportet Ruse sipas grup-mallrave kryesore, pozicionimi i saj në tregun ndërkombëtar 
Përqendrimi  i tregut të hidrokarbureve në Shqipëri sipas Ideksit Herfindahl-Hirschman (HHI) 
Shkëmbimi Tregtar, Import Eksporte të Federatës Ruse me vendet që aplikojnë Sanksione 
Shkëmbimi Tregtar, Import Eksporte të Federatës  me vendet që aplikojnë Sanksione 
Eksporti dhe importi i energjisë elektrike në Shqipëri, çmimet të shitjes për familje dhe biznese 2025-2020… 
Çmimi i karburanteve, Shqipëri dhe Rajoni, 2021-2022, Rritja në Bursë dhe Indeksimi me Rritje i Akcizës në Shqipëri 
3 gjyqtarët që dhanë vendim dënim me burg ish Ministri Tahiri. Cv, vlerësimet  kualifikimet, k… 
SHKURTI 2022: Muaji i Angazhimit të Shoqërisë Civile për Integrimin Evropian! 
SHKURTI 2022: Muaji i Angazhimit të Shoqërisë Civile për Integrimin Evropian! 
 Shqipëria, Rajoni dhe Eurozona Borxhi Publik për frymë dhe Pesha ndaj GDP 
Bizneset që po ndërtojnë pas Tërmetit, 10 Operator Ekonomik fituan 25 % të gjithë fondit shtetëror 
Open Procurement Albania Publikon: 100 tenderët BIG me vlerë më të lartë mbajtur në vitin 2021 
AIS: Shqetësim për Mungesë Transparence me Mos Publikim të Raportit për Zbatimin e Buxhetit të Shtetit mes vitit 20… 
Keqpërdorim i Parave Publike në Zgjedhje, Legjislacioni dhe Institucionet nuk garantojnë Procesin 
Inflacioni Historik dhe Indeksi i Çmimit të Konsumit në Shqipëri, 1991 deri 9 mujori 2021 
Komisioneri për Zgjedhjet refuzon të hetojë Kallëzimin për Keqpërdorim të Fondeve Publike në Fushatë Zgjedhore, çës… 
Po ndodh tani Trajnimi Forcim i Aktivizmit Civil me fokus Shpërndarjen e Parasë Publike në kuadër të projektit me t… 
Fitimi i Bankave të Nivelit të Dytë në Shqipëri, 2016-2020 
Shtator 2021, deri data 23 kemi 110 vdekje, gjatë gjithë shtatorit 2020 nr i vdekjeve ka qene 103 Kurba e prekshmër… 
 Regjistri i Magjistratëve. Emërimet në Gjykatën e Lartë, Promovohen Gjyqtar Karriere  
Rezultati Zgjedhor Parti të Reja që nuk kanë plotësuar pragun zgjedhor prej 1%, Procesi 25 Prill 2021 emrat e kryet… 
 Rritet ësimi, Tatimi në fundviti nuk e FrenoiMars 21, të 2 apo më shumë punësuar 23 063 persona.Ose 3.31% e totalit.…
Web-Faqja për Prokurime Transparente e Konsoliduar në Klikime, Forcohet kultura e Monitorimit Qytetar përmes të Dhë… 
Kur të lakojnë si influente !!!  
Në Mars Prill 2020 humben vendin e punes 39 259 Shqiptar. Shkak pandemia dhe vonesa e nderhyrjes së Shtetit për gar… 
VIT I MBRAPSHTË PER SHQIPTARËT E REP. SE SHQIPËRISËPër çdo 100 Djem të Lindur, Shqipëria ka shënuar 107 Burra të v… 
Korrupsioni në Shqipëri në fushën e prokurimeve publike i ka sjellë buxhetit të shtetit mbi 120 mil $ dëm gjatë dek… 
Vëllimi i Punës Porti i Durrësit, 90% e mallrave të transportit detar përpunohen në Durrës 
  jo Kryeministrin ne Opinion!!!Detyrimi Arbitrazh për Beccheti është njohur, pranuar dhe llogaritur nga Shte…
Komisioni Qendror i Zgjedhjeve, Pagesa Thesari në gjashtëmujorin e Parë të Vitit zgjedhor 2021 
Tiranë: Koncensionet dhe PPP-të krijuan 11.4 për qind detyrime të mbartura për buxhetin në raport me GDP-në 
SPAK heton 9 zyrtarë për abuzim me tenderin €23 milionë të uniformave të policisë =&gt; 
Rama: Bashkitë të mos abuzojnë me tenderat. Open Data: Qeveria ka më shumë shkelje në tendera se bashkitë 
Koncesionet dhe PPP si Detyrime Kontingjente jashtë Bilancit Qeveritar, 2020, Shqipëria dhe Vendet EU 
Arbitrazhi Ndërkombëtar Detyrime të Njohura nga Shteti Shqiptar, akumulative Qershor 2020 
Denoncim Pranë Komisionerit Shtetëror për Zgjedhjet, Fondi i Rindërtimit u përdor në Durrës për favorizim të Subjek… 
AIS kallëzim kundër Bashkisë Tiranë. Mungesë transparence mbi Përfitues Fondi i Rindërtimit në Fushatë Zgjedhore 
Kompanitë e ndërtimit, klientët më të paguar nga buxheti i shtetit për vitin 2020 =&gt; 
.AlTË DHËNAT/ Si i fitoi kompania e përgjimeve të Ndragheta-s 80 tendera publikë në Shqipëri, ‘Ope… 
Publiku kontrollon Integritetin e Sistemit të Drejtësisë, Individët më të  Klikuar në Regjistrin e Magjistratëve, D… 
AIS i propozon Qeverisë krijimin e Regjistrit Elektronik për Magjistratët, AKSHI ngre grup pune për zbatim. 
Kush bën biznes në Shqipëri? 1 jan - 30 shtator regjistruar në QKB 1884 kompani  Me kapital aksionar Italian (pjesë… 
Shkatrrimi i godinës së Teatrit Kombëtar. Thellësisht i lidhur me Sundimin e Ligjit dhe Demokracinë 
Fondi Drama Shqipe, pjesë e fondit të Letërsisë Shqiptare zhanri Dramë dhe Pjesë Teatrale të shkuara në 50 vite nga… 
Raporti të vdekur vs. infektuar është 5.08% me e lartë se niveli botëror sot qëndron  në 4.58.Kliko… 
Open Data Albania krijon platformë me të dhënat në kohë reale për koronavirusin në Shqipëri =&gt; 
Pse po fshihen të dhënat për kandidatët për gjyqtarë suprem?? Shmangie llogaridhënie ndaj taksapagesve ;. 
Arrestimi! Cili: Jam i pafajshëm. Cila është studioja ligjore në zotërim dhe bilancet me humbje 
Pagesa thesari 2019, Institucioni Portofolin më të Lartë Bashkia Kryeqytet  
 kallzime mes funksionarëve të lartëProkuroi Besnik Cami njëkohësisht anëtar i Këshillit të Lartë… 
Çfarë po ndodh me sistemin e drejtësisë, vettingun apo promovimin e individëve në sistem. Si po e pasqyron media kë… 
Pas aktivistëve për Teatrin edhe Bashkia Tiranë po mendon te zëvendësoje çadrat me shtëpi lëvizës (kontenier). 
Transaksione Thesari, Cilat janë shpenzimet e Institucioneve të Drejtësisë Këshilla, Prokurori apo Gjykata Në data… 
Tendera të Shoqërisë me Zotërim Publik Sh.A Korporata Elektro Energjitike Shqiptare Tiranë me vlerë mbi 100 milion… 
Tendera Bashki mbi 100  milion lekë muaji dhjetorDy tender mbi 100 milion lekë të shpallura në Muajin Dhjetor nga… 
Transaksionet Vip Thesari 2019Gjoka  87, Jehona Software dhe Fusha kanë përfituar transaksionet më të larta për 20… 
 ka informacion për shoqëri biznesi shqiptare që janë kontraktor me njësi të qeverisjes vendo… 
E vonuar por Bashkia Vlorë më 24 dhjetor shpall fituesin që zbukuron qytetin me rastin e festave të fundvitit 2019… 
Tendera dhe Kontraktime të Autoritetit Shqiptar Rrugor janë tashmë të aksesueshme në standardin e Open Contracting.… 
 PROFILE TE PROKUROREVE SPECIALCilat janë profilet ptofesionale të Prokruorëve të Lartë të SPAK(Stru… 
 Transaksione Institucione DrejtësiShpenzimet për Sektorin Drejtësi përmes Lidhjeve të krijuara me… 
Inspektori i Lartë i Drejtësisë zgjidhet me tre të pestat e të gjithë anëtarëve të Kuvendit, për një periudhë nëntë… 
Amendamentet Balla mbrojnë Klientët dhe Autorët e KorrupsionitAmendamentet e deputetit Balla për Paketën Ligjore A… 
Shpenzime për Tërmetin si pagesa thesari me vlerë mbi 5 milion lekë të reja.  Një promovim… 
VETTING PER VETTINGUN !???Cilat janë interesat ekonomike të atyre që kontrollojnë dhe përjashtojnë nga sistemi gjy… 
Akses Info Drejtësi – Platforma Prokurori i PërgjithshëmZoti Olsian Çela është Prokurori i Përgjithshëm i përzgjed… 
Lista me Shkolla të Rikonstruktura nga Korrik 2015 deri Dhjetor 2019, Bashki të prekura nga Tërmeti A i rezistuan… 
Ministria e Mbrojtjes Sociale ka paguar në datës 4 dhjetor shumën prej 7 milion lekë për 7 familje që pësuan tragje… 
7 ditë pas tërmetit dhurimet për Qeverinë vetëm 4.2 milion EuroPorta Vendore mbledh premtimet e Biznesit për 61 mi… 
7 ditë pas tërmetit dhurimet për Qeverinë vetëm 4.2 milion EuroPorta Vendore mbledh premtimet e Biznesit për 61 mi… 
 Albania  Albania Cilat janë shkollat e rikonstruktura në territorin e Bashkisë Tir… 
Numri i Shoqërive të Pezulluara në datat pas Tërmetit.Nuk janë në këto nivele në datat e një viti më parë .Sipas… 
Pak orë pas tërmetit zoti Arben Malaj, ka bërë një deklaratë publike duke kërkuar bllokimin e aseteve të kompanive… 
Tragjedia në ambientet e Kavalishencës! Pyetje për Ministrinë e BrendshmePas tërmetit të datës 21 shtator godina n… 
Video/ I quajti Dakon “xhuxh” dhe kërkoi llogari, Edi Rama përzë me ulërima dhe intimidon banoren 
A janë shtepitë e rrëzuara në listat e shtëpive të evidentuara për rikonstruksion nga Bashkitë dhe Qeveria pas Term… 
Sa Çadra u shpërndanë pas tërmetit të datës 21 shtator, cilat bashki përfituanNga data 21 shator (tërmeti i parë )… 
Ti dërgosh disa programeve që mbështesin “drejtësinë për të gjithë” projekt për të Bërë Transparencë dhe Vetting pë… 
GJYKATË KUSHTETUESE PA TEKNIKË DHE KULTURË GJYKIMINë 5 emra Gjyqtar Kushtetues i rëndë është fakti që asnjë nga të… 
PAS PRECEDENTIT VORPSI i bëj thirrje Dhomës së Noterisë të mblidhet dhe të caktojë sa është tarifa dhe pulla fiskal… 
Propaganda e Nënsqetullës!!!!!!!!!!!!!Ca njerëz të “nënsqetullës”, folës të propagandës me pseudo sabotazhe ... K… 
Merr fund qëndresa e Banorëve të Astirit, Me molotov dhe forcë dalin nga banesat 
Shkollat koncesionare mbulohen me buxhet të siguruar nga taksa për përmirësim të infrastrukturës arsimore. Nga 2016… 
Kush e pagoi biletën e z. Lleshi për Bejrut. A janë dakord taksapaguesit të kontribuojnë që ministri të udhëtojë pë… 
Është Nëntor, Në Bulevard janë varur portrete të atyre të njësiteve guerrile të luftës së II Botërore. Disa thjesh… 
Tre pikë shtatë milion dollar amerikan ose 414 844 706 Lekë fond limit Tender për vendosjen e kamerave të sigurinë… 
Rritet numri i tenderave me flamur të kuq, risk për parregullsi, klientelizëm dhe korrupsion nga Njësi të Qeverisje… 
Themelohet VP DUTY FREE SHOPS ALBANIA, shoqëri me përgjegjësi të kufizuar me objekt aktiviteti në Ushtrimin e aktiv… 
===