  e kandidatëve për deputetë, fitues në bazë të rezultateve paraprake…
 ✅Procesi i numërimit të votave për kandidatët, drejt fundit. Vijon numërimi në 9 KZAZ (Tiranë, Durrës, Lezhë &amp; Elbasan). …
 (2/2) Zv.Ndihmës Sekretari Palmer do të takohet gjithashtu me kampionët e reformës në drejtësi. Ai do ta përfundojë vi…
 Qarkore!Në sajë të betejës heroike në vijën e parë të Frontit të uniformave të bardha, të mbështetura nga popullata në…
 Imagjino si do të ishte bota sot nëse ai "kinezi" në Wuhan nuk do të kishte oreks për të ngrënë lakuriqin!
 Ai momenti që mezi pret të shkosh në punë për... t'u shlodhur!
Koronavirusi dhe kënga e zogjve në Tiranë    
 Një këshillë për coronavirusinPërveç larjes së shpeshtë të duarve kujdes, kujdes, kujdes me hundën! Mos e fusni në pun…
 Kërkimi shkencor duhej të ishte prioritet, por kjo qeveri e ka harruar atë. Raporti i OSCE e tregon qartë ndryshimin mes shpe…
Akademisë suedeze të komitetit “Nobel”: Peticion për tërheqjen e çmimit “Nobel” për Peter Handke, shk...  via 
 Para ligjit mund të mos jemi të gjithë të barabartë, por jo para tërmetit.
 U prehsh në paqe mjeshtër! I lehtë qofte dheu i tokës që aq shumë e deshe mbi trupin tënd i cili tashmë do të çlodhet pë…
Sulmi ndaj makinës së Lubonjës, analisti tregon se kush është personi që kreu sulmin  via  News Albania
 Na ndiqni nesër në orën 20:35 në emisionin "31 Minuta" në RTSH 1 HD.      
 18 prilli, Dita Ndërkombëtare e Monumenteve dhe Siteve Arkeologjike! - Amfora 
 Sonte në 20:35 në emisionin "31 Minuta" vijnë dy ngjarje të aktualitetit shqiptar. Në pjesën e parë do të mësoni për popullsi…
    Rifillimi i punimeve për ndërtimin e projekti ‘Veliera’ në Durrës u krye pa moni…
 Gazetaria investigative është një punë e lodhshme, heroike, fisnike e guximshme dhe gjithmonë në interes te publikut Ar…
 Pritja e tretë vjetore e Laboratorit të Gazetarisë Investigative organizuar nga Ambasada e SHBA dhe Qendra për Gazetari…
 Shqipërinë e ka zënë frika se nafta do kapë 200 lekë litrin. Por gazetarëve të Qendrës për Gazetari Cilësore llogaria u…
 GËNJESHTËR/ Arben Ahmetaj: 2252 biznese janë mbyllur shtatëmujorin e parë të 2018-ës
 Maqedonasit votojnë sot për emrin e ardhshëm të vendit. Bëhet fjalë për identitetin, mitet dhe trashëgiminë e kombit. Grindja…
 PROFIL: “Buzëqeshja që mposhti acidin”, Vilma Dule rrëfehet për herë të parë pas pesë vjetësh nga sulmi në Tiranë  
 Një investigim i ACQJ teksa merr në analizë tenderat e dhëna nga Bashkia Elbasan në 4 vjet zbulon se 56% të rasteve ato…
 INVESTIGIM/ Pavarësisht ndjenjave pro-amerikane në vendin ballkanas, ku statujat e presidentëve amerikanë e kandidatëve…
 GËNJESHTËR/ Dritan Leli: Nga cepi në cep Vlorën e përshkon për 3-4 minuta edhe gjatë sezonit turistik 
 Një investigim i Qendrës Shqiptare për Gazetari Cilësore dhe Qendrës së New England-it për Raportim Investigues, tregon…
 Je student i gazetarisë dhe dëshiron të ndihmoni në luftën ndaj korrupsionit? Aplikoni për të qenë pjesë e Laboratorit t…
 Bota në 2018:  Shkrimi im: "viti peshkut, Europës apo i radhës" në faqen 64. 
 InvestigimPrej një dekade ekspertët kërkojnë rehabilitimin e zonës që rrethon ujëmbledhësin e Bovillës në Tiranë përmes…
 VëzhgimMakinat elektrike në Shqipëri, shumë entuziazëm, pak investimNdonëse makinat elektrike janë e ardhmja e transp…
 Video-Investigim i Qendres për Gazetari CilësoreShtigjet e Hapura në Kufirin Shqiptaro-GrekRreth 7 kilometra në lind…
 Ish kryeredaktorja e Atlanta Journal Constitution, Julia Wallace në një intervistë për Qendrën për Gazetari Cilësore fle…
Mentor Petrela në listën e denoncimeve: Vetëm Virgjëresha nuk është e korruptuar 
Basha thyen heshtjen dhe godet Ramën: Na ke kthyer në kohën e Enver Hoxhës 
Rama publikon “listën e zezë”, Monika Kryemadhi e “masakron”: Kërkon t’i shpëtojë të vërtetës vrastare 
KQZ shqyrton kërkesën e PD-së dhe PDIU për parregullsitë në numërimin e votave 
Fakte të reja, ja se si u vodhën votat në qendrën e votimit 1936 në Tiranë (VIDEO) 
Një vizitë në Tropojën e mrekullive mund t’ju ndryshojë jetën 
Denoncimi, fshati i Agollit ka tre probleme të mëdha 
“Kemi gjithçka përveç detit”, Përmeti ju fton për një fundjavë ndryshe 
Fillon puna për aeroportin e Vlorës, Rama takohet me Erdogan dhe drejtorët e “Turkish Airlines” 
Zjarr masiv, shkrumbohet për herë të dytë tregu në Londër 
Ekskluzive, Basha dhe Selami takohen në kafene para se të flasin me demokratët në Korçë (FOTO) 
Reportazh - Dimali qyteti i lavdishëm nën dhe  via 
Dionis Avdijaj do të vishet kuqezi, gati ftesa për miqësoren ndaj Francës  via  PLUS
===