 Ke të drejtë Ilir, Shqipëria nuk futet dot në thes, shumë mirë e paske thënë! Prandaj boll e përdore Presidencën e Republikë…
Si sot, 29 vite më parë u themelua Forumi Rinor Eurosocialist i Shqipërisë. Gëzuar 29-të vjetorin FRESSH! Fitore me… 
 Falenderues për shijen e shkëlqyer të mikpritjes në shtëpinë e kryeministrit Mitsotakis, ku bëmë një bilanc të situatës me C…
 Në Athinë për një drekë pune me Kryeministrin Mitzotakis,për të diskutuar mbi koordinimin e mëtejshëm në luftën e përbashkët…
 O Zot të lutem në gjunjë t'u japësh pak vaj për kandilin e trurit, se u është fikur krejt e nuk dinë ç'nxjerrin nga terri i…
 Konfirmohen rastet e para me coronavirus “Covid 19” në Shqipëri 
 E përshëndes Presidentin që pas disa shfaqjesh publike pa ekuilibër etik, ka zgjedhur t’i drejtohet SPAK me një kallzim p…
 Jam e gatshme t’i përgjigjem ligjërisht, me të gjithë përgjegjësinë po edhe me krenarinë që i përkas Frontit të Reformës…
 Investimi te vetja është pa dyshim investimi më i mirë që mund të bëni për të ardhmen tuaj! A.Rama
 Ja edhe e vërteta zyrtare për raportimin skandaloz të RAI3! Faleminderit autoriteteve të policisë italiane që na ndihmojnē p…
Nga Valbona Mezini, Të gjithë jemi “NJË”. Njerëzimi dhe fati i tragjedive të përbashkëta, pavarësisht se në cilën p… 
RIP  Kobe Bryant vdiq në një përplasje me helikopter në Calabasas të dielën në mëngjes. U prefsh ne paqe. 
Gëzuar 28 vjetorin e themelimit!28 vjet , organizata më e madhe politike rinore në Shqipëri, grupimi më en… 
Shkencëtarët në panik: Diçka po fluturon drejt Tokës  via 
Kryemadhi për shkarkimin e Metës: Mezi pres të më kthehet... 
 Eh Artist si e katandise opozitën! Të rinjtë e PD maskohen si studentë se ndryshe i përzënë; dega e Fierit zë rrugën me jele…
 Ju mbytën me presionin kundër Dialogut se do ju përçaja unë,po tani kush ju përçau?! Mos e vrisni mendjen,unë jam me student…
 Thjesht e vërteta: 1.Tarifat s'i përcakton ministria po universiteti 2.Asnjë tarifë s'është rritur nga 2014 3.VKM për tarifë…
 Fqinj të dashur! Në vend ta quani të papranueshme humbjen e jetës së një të fandaksuri që qëlloi me plumba luftarakë mbi pol…
E Mërkurë ora 17:00  i Universitetit të Arteve FRESSH Tiranë çel fushatën e anëtarësimeve të reja në PS… 
 Media &amp; Online Campaign Training DAY 1:Në workshop,nëpërmjet analizës SWOT, analizuam strukturat në pikat e forta dhe do…
 Foto nga Nata e Gjelbër dt. 1/09 në Parkun e Madh të Tiranës në bashkëpunim me Green Line Albania. Rishihemi në datë 15 Shta…
 Për kujtesë në mjegullën e tregut mediatik ku s'ka vend për shifrat e faktet, sidomos kur vjen puna tek krimi që përdoret si…
 E tëra ka filluar me një gabim të gjeologëve... 
 Kur duhet të jetë në Tiranë, shkon në Shkodër. Kur duhet të hyjë në zgjedhje, futet në çadër. Kur duhet të shkojë në punë, r…
 E patolerueshme barbaria mbi shtëpinë e gazetares Klodiana Lala! Ngjarja duhet zbardhur sa më parë dhe strukturat e shtetit…
 “U tërhoq, ja mblodhët tek pika e tij e dobët”. E dashura e Izet Haxhisë sfidon: Jeta ime mund të iki, por… 
 Senatori John McCain e jetoi jetën si një betejë të pandërprerë për vlerat e mishëruara në qenien e Shteteve të Bashkuara të…
 Paguani paguani artikuj nëpër botë kundër Vetingut! Shani e mallkoni në sa gjuhë të mundeni Reformën në Drejtësi!Na akuzon…
 MIRËMËNGJES dhe me këto pamje nga kantieret e shumta të punës për rimëkëmbjen e xhamive në mbarë vendin që janë pjesë e the…
 Veliaj dhe Myftiu i Tiranës, Ylli Gurra inspektojnë punimet e xhamisë së re 
 Konfirmohet prania e akullit në polet e Hënës 
 Siguria në rrugë, vijon monitorimi me dron, kapen 'mat' 74 shoferë - Për lajme të tjera klikoni në 
 Rama ka postuar disa pamje nga punimet për hapjen  e linjës së parë shqiptare ajrore të fluturimit “Air Albania”. Rama sh…
 Falë kontributit të Bashkisë së Tiranës, volumi i gjakut të dhuruar u rrit me 250%!U jam pafundësisht mirënjohës të gjit…
 MIRËMËNGJES dhe me këtë artikull botuar në mediat italiane me titullin pse verën tjetër do të shkoni të gjithë në Shqip…
===