 Shitblerja e votës u testua në vitin 2013, u përforcua në zgjedhjet lokale 2015, u ngrit në sistem në 2017 dhe në zgjedhjet…
 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 Shqiptarët e dinë që Rama në qeveri është më i dëmshëm se “Ramët” e emëruar prej tij në bashkitë e vendit. Dy gjëra jan…
 Vazhdojmë të jemi lider në rajon sa i përket  Sipas  qeveritarët  përdorin zyrat për përfitime p…
 1/2 Sot pata kënaqësinë të mirëpres Ambasadorin e Japonisë në Shqipëri, z. Takada Mitsuyuki. I shpreha mirënjohjen për…
 2/2  do të vazhdojë të mbështesë bashkëpunimin ekonomik me theks të veçantë në investimet japoneze dhe turiz…
 Mund të lash duart me një kryebashkiak të korruptuar apo të bësh koka turku bedelët e tu në atë sallë, por shqiptarët e…
 ·Emërimi i militantes së Ramës në krye të AMA: Akt skandaloz kundër lirisë së fjalës. Injoroi BE, OSBE për pushtetin per…
 Me kryesinë e PD Dega 9, ku u diskutua dhe miratua analiza e zgjedhjeve të 25 prillit.   …
 “E ka fajin Europa” llomotit poshtë e lart, për të fshehur dështimin e tij dhe pengimin e Shqipërisë. Por sapo i jepet…
 duke hedhur poshtë thirrjen e partnerëve për të shtyrë në shtator votimin për AMA. Kjo nuk është forcë, po harbutëri në…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
 2/2...lidhjet e Hakmarrjes për Drejtësi me Tushën, Braçen dhe vetë Ramën, dhe përfitimet e tyre të ndërsjellta në vite…
Rama është koka e krimit. 
 Punonjësit e ndershëm të policisë janë të tradhtuar nga regjimi Rama-Doshi. Kur vjen në pushtet me krimin, policia përd…
 Zgjidhja është prerja e lidhjeve të pushtetit me krimin. Prandaj fajtori ishte sot pa përgjigje. Peshku qelbet nga koka!
Ramëziut as që ia ndjen për jetët e humbura çdo ditë. Monstra 
 Trushpëlarë, apologjistë me apo pa qira: boll akuzuat njerëzit për të keqen që ka plasur kudo! Është vetëm pasojë e mod…
 1/2 Kur policia reduktohet në vegël të regjimit për të mbrojtur pushtetin dhe lidhjet me krimin, kur përgjigja e vetme…
 2/2  Me postimin cinik si i sotmi pas masakrës së Velipojës, përgjegjësi për këtë situatë nuk e fsheh dot përgjegjësinë…
 Bizneset shqiptare paguajnë një taksë korrupsioni që vret të ardhmen e tyre. ❌ Mbi 30% e bizneseve sipas Dhomës së Tre…
 Kur Rama, Pjerini dhe gjithe hajdutet e Rilindjes gjejnë " ustallaret" e duhur që u tregojnë vendin...“Komiteti i Politik…
 Pjesëmarrje masive në votimet për kreun e PD. Në disa degë radhë të gjata për të votuar 
Me Ju nga fillimi deri në fitore ✌️✌️✌️ 
 Me Për një Shqipëri si e gjithë Europa!Për një Parti Demokratike moderne dhe europiane! 
  Hapur deri më dt 8 qershor, 10.00-12.00 dhe 14.00-16.00. E shtunë d…
 Garon më shumë për interesin e tij personal.
 Spaku !Njẽ si dikur arma e sigurimit të shtetit në duart e partisë shtet, per te goditur dhe eleminuar jo krimin, por kund…
 Takim me struktura të grupseksionit 8, të njësisë 11, në Laprakë.Mirënjohje për kontributin e çdo demokrati dhe falend…
 Takim me struktura të grupseksionit 8,të degës 9 në rrugën “Jordan Misja”. Të bashkuar në betejën për votën e lirë, rrë…
 Kontrolli i KDRTSH e AMA nga Rama, liria medias në rrezik! PD: të ndalojë skenari antidemokratik i parlamentit monoparti…
 Takim me struktura të grupseksionit 3, të degës 11, në  Institut. Të fortë, të bashkuar e të vendosur për rrëzimin e k…
 Mafia, dhe kleptokracia “rilindase” në pushtet... 
 Kur ke tepsinë në duar, kush është i korruptuar ? 
 Përshëndes vendimin e Gjykatës Administrative e inkurajoj bashkëqytetarët e mi, të cilët u goditën padrejtësisht gjatë p…
 Takim me struktura të grupseksionit 2, të njësisë 11, në zonën “Kodër Kamëz”.Ringritja edhe më e fortë, është në ADN-n…
 Ajo qe u vu re në Kryesi dhe në Këshill Kombëtar, ështe se cdo diskutim, kritik ose jo me zotin Basha, kishin një emërue…
 Takim me struktura të njësisë 9, në rrugën “Jordan Misja”Përkushtimi dhe kurajo e pakushtëzuar e cdo demokrati te degë…
 Sot, një vit më parë, Edi Rama urdhëroi shembjen e Teatrit Kombëtar. Nën terrorin e mijëra forcave të policisë, në mes t…
  në Elbasan!Ne e nisëm këtë fushatë në krahun tuaj dhe për ju. Ne do ta vazhdojmë këtë betejë në krahun…
 Nga zemra ju uroj gjithë besimtarëve myslimanë Gëzuar Fitër Bajramin!Agjërim të pranuar, lutje të pranuara, shpresë të…
 PD nuk do t’i braktisë qytetarët.Ftesa e Rames për bashkëpunim është hipokrite për të tërhequr vëmendjen nga masakra e…
 Lapsi i vogël i vjedhjes së madhe të votaveDuke fshehur edhe dorën edhe lapsin, çfarë shenjash po vendos ky anëtar i Grupi…
 Në qytetin e Tepelenës, në Pallatin e Kulturës Tepelenë, saktësisht KZAZ Nr.79, në datën 26.04.2021, është konsumuar kjo ve…
 Vajza shqiptare bashkëkombsja jonë  është zgjedhur Kryetarja e re e ës_së_Preshevës.Kjo është his…
 Intervista e plotë në Breaking, në Top News.
 PD ka publikuar fakte, prova rreth ës  përgjegjësi i vetëm i së cilës është Rama.  vërtetoi që ë…
 Këtë ditë të shënuar për Europën, le ta përkujtojmë përmes Konrad Adenauer, që riktheu demokracinë në Gjermani dhe bashk…
 Dita e Europës, dita e fitores të mirës mbi të keqen, të së drejtës mbi krimin! PD është forca më pro europiane e Shqipëris…
 Edhe pranvera të lumtura, Glorias✨
 “Nuk ka fonde për të paguar mësuesit në Sarandë” – PD: Paratë e buxhetit harxhoheshin në fushatë elektorale 
 Fushata e PD një fushatë model.Çdo derë u hap për ndryshimin, por vullneti i tyre nuk u përkthye në votë.Krimet elekto…
 Bashkëpunimi me LSI dhe partitë e tjera nuk ka nisur para 25 prillit, është disavjeçar dhe është i fokusuar për të largu…
 Rama vërtetoi se është armiku më i madh i zgjedhjeve të lira dhe të ndershme. Misioni i PD do të vazhdojë, për t’i dhën…
 Detyra jonë është të qëndrojmë të vendosur dhe të luftojmë fort për kthimin e demokracisë në vend. Çdo çështje tjetër, s…
 Gjëja e vetme me të cilën duhet të merremi dhe sigurisht Taulant Balla nuk pranon të bëjë, është vjedhja më e madhe e vo…
 Me hidhërim të madh mora lajmin për ndarjen nga jeta të artistit të madh Guljelm Radoja. Largimi nga jeta i artistit…
 Guljelm Radoja e humbi betejën e parë të jetës së tij por la pas një trashëgimi të jashtëzakonshme njerëzore dhe artist…
 Ngushëllimet e mia shkojnë për familjen e tij, miqtë dhe të afërmit. Guljelm Radoja do të mbetet përjetë mes nesh. U…
Rama-Doshi nuk mund të jenë e ardhmja e Shqipërisë! 
Sot me Z Tomor gjatë vizitës në katedralen e ‘Shën Dhimitrit’ në Berat me rastin e Pashkës. 
 Të gjithë besimtarëve ortodoksë ju uroj nga zemra Gëzuar Pashkët! Drita e ringjalljes i mbushtë zemrat  tuaja dhe vat…
 PD grup pune për dokumentimin e shkeljeve zgjedhore, Ivi Kaso: Kemi materiale të shumta. Nëse vërtetohen, rezultati ndryshon…
Autorët e masakrës zgjedhore Mos e gëzofshin pushtetin e vjedhur! 
Ç’do presësh nga kjo qeveri Mëshirë  për ata që i votuan!!! 
 Basha bën thirrje nga Durrësi: Askush mos të qëndrojë në shtëpi, merrni familjen e dilni votoni 
 Voto sot që zëri yt të ketë vlerë nesêr ! 
 Mos mendoni që Rama dhe Ogerta dhe Veliaj e kanë  .Shiheni asfaltin elektoral që filloi të shtrohej…
 Vota në  është një detyrë historike për cdo qytetar.Me votën tënde vendos për të ardhmen e fëmijëve!Votoni…
 Presidentja e Grave të PPE, Doris Pack, mesazh të fortë për shqiptarët: Të djelën votoni nr 9, votoni ndryshimin dhe Lul…
 Ju falënderoj nga zemra për mbrëmjen e sotme në Tiranë.Një mbështetje e jashtëzakonshme drejt fitores më të madhe në h…
 Të dielën, merrni familjen dhe miqtë dhe shkoni të votoni për ndryshimin që duam të gjithë. ëriaFITON   h…
Fitorja është e jona!✌️✌️✌️ 
 Kush fiton në 25 prill/ Del në Kosovë sondazhi i fundit për zgjedhjet në Shqipëri –  
 E drejta për të votuar është një detyrë historike të dielën! Me votën tonë vendosim për të ardhmen e fëmijëve tanë!V…
Takim përmbyllës me LDG, Dega Kuçovë. E bindurqë së bashku kemi shtruar rrugën e fitores. Prania e kandidates Znj A… 
Me tregtarët në tregun e fruta-perimeve në qytetin e Kuçovës, të etur për ndryshim. E keqja e përbashkët ka një ve… 
Në tregun e fruta-perimeve,në Kuçovë me vullnetaret dhe mbështetëset e mia✌️✌️✌️Fitorja është e jona! 
 ✅ Voto Nr9 ✅  Me  Kryeministër  
 Edi Rama në kërkim të mandatit të tretë pas 8 vitesh dështime i ngjan atij nxënësit të klasës së tetë që ka ngelur në klasë…
 Të gjithë e dimë që Shqipëria ka nevojë për ndryshim.Të dielën ju keni mundësinë të sillni ndryshimin në Shqipëri!Vot…
Takimi përmbyllës i fushatës elektorale në qytetin e BeratitëriaFIT❤️N✌️ 
Nga takimi përmbyllës i fushatës elektorale në Havaleas FitorePD✌️✌️✌️✌️✌️✌️ 
Takimi përmbyllës i fushatës elektorale në Havaleas, njësia administrative Kozare në Kuçovë. Atmosferë fantastike k… 
===