 Dëgjesat publike dhe qasja e mediave në Parlament për të mbuluar punën e seancave dhe komisioneve të tij janë elemente të…
 Keqardhje për mungesën e konsultimeve me mediat përpara miratimit të rregullave të reja nga Parlamenti. Këto rregulla nuk…
 (2/2) ...duke theksuar edhe rëndësinë që gazetarët të kenë mundësi të jenë të drejtë, të pavarur dhe të guximshëm. “Sh…
“Fati” i Dvoranit në KED, në detyrë 7 vjet përtej mandatit, KLGJ vendos ...  via … 
“Lufta” e artistit të rrugës, sfidë koronavirusit me kaba klarinete  via     
 Yuri Kim u betua dje si Ambasadorja e Shteteve të Bashkuara të Amerikës në Shqipëri gjatë një ceremonie zyrtare në Dep…
A2 CNN ndjek stërvitjen e NATO-s në Kroaci  via 
 Një ditë do të dalë dielli i Shqipërisë që herë pas herë errësohet prej reve të egoizmit njerëzor. Shumë prej nesh po kalo…
MAPO WEEKEND/ Drejtësia e re, Armand Bajrami: Ka dyshime për ekzistencën e një “liste” me të “preferuar ose jo” 
 "Ti mbete si fjala që rrotullohet në mëndje, që askush nuk di ta artikuloj…". Love it!
"... Në pafshi ndonjë ditë të bëhem copëranga marazi, siç thonë, të plas, t’ia bëj 'krak'jo kujtimet e Trojës,... 
U desh te vdiste nena e dy femijëve nën rrotat e makonës, që në kryqezimin e burgut në Tiranë të rregullohej... 
"Ai material u shkrua nga 3 veta (negociatorët), u lexua nga 10 persona (anëtarët e komisionit të posaçëm) dhe u... 
Po sikur të dalin ca qytetarë në Tiranë dhe të protestojnë kundër Opozitës, a do dalë Opozita të nesërmen të... 
Ai shante sa herë në TV shfaqeshin ato spotet e stërzgjatura për shitje produktesh të ndryshme. Nuk i dilte e... 
"Ndryshimi për qytetarët do të ndodhë atëherë kur "kimia" në marrëdhëniet mes dy kryeministrave të përshkojë edhe... 
"Ambasadori gjithashtu lavdëroi tolerancën dhe mikpritjen që qytetarët e Librazhdit kanë treguar ndaj të tjerëve,... 
Hetim në Shqipëri për fyerjet ndaj Greqisë në Facebook | Gazeta Panorama ONLINE 
Llupo lë burgun në shtetrrethim nga oficerët e Gardës | Gazeta Panorama ONLINE 
Padia në Gjykatë, Leka Zogu kërkon pronësinë e Pallatit të Brigadave | Gazeta Panorama ONLINE 
Djali i Mirit të Xhikes padit dy xhaxhallarët për dëmin moral | Gazeta Panorama ONLINE 
 Revista Time  rreket një vit për të bërë listën e 100 intelektualëve më me ndikim në gjithë botën. Ne për një orë rre ...
Dosja nga Italia, hetim për rrjet pedofilie në Tiranë | Gazeta Panorama ONLINE 
===