As Rakacolli, që parashikon me përpikmëri orën kur covidi ndërsehet në terren, nuk e ka parashikuar dot që Franca do të vinte me shtesa.
(2) Emëruesi i përbashkët mes të dyja këtyre vendeve është fakti që të dyja janë nevojtore sociale.
(1) Vende me përkatësi komunitare të ulët dhe sens artistik të ulët, si Shqipëria, prodhojnë vrasje tallava të tipi… 
Shumë keq për ne dhe shumë mirë për familjen e saj që Ilva Tare, e cila rastis të jetë gazetare brilante, po tërhiq… 
 Fjala jote në vesh të Perëndisë
(2) Dhe tërë këtë metaforë, që mund të ishte kaq e bukur, e prish Luli, i cili më shumë se Italisë i ngjan Arabisë… 
(1) Me grupin e Italisë gati të përcaktuar, mund të themi se Wales është metaforë e Gonit, Zvicra metaforë e Kadill… 
Populli më ateist dhe tolerant i globit godet sërisht. Dhe si gjithnjë do t'ia vënë fajin jo faktit që nuk kanë Per… 
Për më tepër, dikush të cilit argument i vetëm i arsyeshëm i mbetet "jam grua dhe nënë" është po aq grua dhe nënë s… 
"Jam grua dhe nënë" është argument i cili bën sens si përgjigjje e arsyeshme në një bisedë vetëm nëse dikush të ka… 
Dy gjëra janë të vërteta njëkohësisht: Fëmijët nuk duhen lënë as afër përdhunuesve të djeshëm, e as protestuesve të sotëm.
Ka vende akoma më neutrale se Franca ku Berisha mund të shkonte, ngrinte padi, dhe madje qëndronte për ca kohë me p… 
"Më votoni se jam i ri" dhe "më votoni se jam mashkull a femër" nuk janë argumente për pse dikush duhet votuar, por… 
Në këtë pikë jam edhe unë dakord me Bashën që të mos japë dorëheqjen, i shtyrë nga një kuriozitet antropologjik i c… 
Atyre që blejnë votat, dhe atyre që shesin votat, përveç burgut duhet t'u hiqet edhe shtetësia shqiptare. Të aplikojnë për leje qëndrimi.
Kur luan në të njëjtën fushë dhe u nënshtrohesh të njëjtave rregulla, procesi shkon vaj dhe i qytetëruar, sikundër… 
Sot votuesit treguan qytetari dhe maturi. Tani është koha e numëruesve që të mos tregojnë patronazhi dhe majmunëri.
Shërim të shpejtë efektives Xhensila Sota, që sot ishte e vetmja gjallesë dinjitoze njerëzore, në krye të detyrës p… 
Nuk ka ekzistencë më të dëshpëruar dhe mjerane sesa të besosh vetëm tek kryqëzimi.
Kam vënë re se ata që urojnë më shumë Pashkët, janë të njëjtët që përbetohen se ringjallja e Jezusit është trillim… 
Diskutimi idiot i së dielës:Alfred Cako: Dhe kulmi ishte kur konkurroi George Bush Plaku, në mos gaboj në vitin 2… 
Shteti duhet të ketë politikanë injorantë dhe ligje të forta, por ne do të kemi ligje të dobëta dhe politikanë inte… 
Mezi pres që Shqipëria të provojë në pushtet edhe intelektualët, dhe të qajë kohën kur në pushtet kishte injorantët… 
Urimi im më i madh i 7 marsit është që mësuesit të përpiqen të bëjnë një punë më të mirë sesa është bërë prej mësue… 
(3) Ndaj për Zulu-të, njerëz si Luljeta Bozo janë armiq publikë, jo ngaqë Zulu-të kanë alergji dijen (dhe e kanë al… 
(2) Të gjithë ata që vijnë nga jashtë dhe që identifikohen nëpërmjet individualitetit, integritetit e urtësisë, jan… 
(1) Banorët e Zullulandit nuk identifikohen përmes urtësisë, përgjegjësisë individuale apo integritetit. Përkundraz… 
Nëse ajo revoltohet ngaqë uljet e çmimit të një seti pjatash për 8 marsin i duket akt seksist, vrapo shumë larg. Big red flag.
Specia më e këndshme janë marksistët që në darkë shkojnë në kinema të shikojnë Tom&amp;Jerry.
Si gjithnjë, likes, shares dhe subscribes janë shumë të mirëpritura :) 
"Israelitë dhe Filistinë" e Nolit është vendi i përkryer për ta nisur leximin e veprës së tij. Dhe nëse e ke lexuar… 
Kjo është arsyeja pse tek , çdo të hënë, sjellim libra që do t'i lexosh, a sugjerosh atyre që po të l… 
(3) Na rroftë administrimi i pandemisë nëse zgjidhja bëhet më e keqe se problemi.
(2) Duhet të jenë më të kujdesshëm e dritëgjatë kur flasin për këto punë; pandemia për një vit a dy shuhet, ndërsa… 
(1) Dëgjova nga z. Celibashi se KQZ nuk ka asnjë mundësi t'u ofrojë kushtet për të votuar atyre që në ditën e zgjed… 
Sugjerim libri? Lexo (ose rilexo) "Metamorfoza" e Franz Kafka pasi të kesh parë këtë episod të ri të … 
Franz Kafka, absurdi, alienimi, dhe çfarë mund të mësojmë nga aventurat fatkeqe të Gregor Zamza tek Metamorfoza. Kë… 
Të hënë, 22 shkurt, do të përpiqemi të hedhim dritë mbi këto pasoja, duke analizuar me kujdes zgjidhjet mundshme që… 
"Metamorfoza" e Franz Kafka nuk është vetëm një nga librat më të njohur të shek. XX, por edhe një n… 
Si gjithnjë, mos i kurseni share, like dhe komentet dhe shumë faleminderit për suportin fantastik në këto javë të para 🤗
Si gjithnjë, mos i kurseni share, like dhe komentet dhe shumë faleminderit për suportin fantastik në këto javë të para 🤗
Si gjithnjë, mos i kurseni share, like dhe komentet dhe shumë faleminderit për suportin fantastik në këto javë të para 🤗
(2) e cila në vend të figurave letrare a personazheve (që mua më vendosin gjithnjë në gjumë) çon në një rrugëtim ng… 
(1) E ke lexuar "I Huaji" nga Albert Camus? Nëse jo, ky episod i Republika Show do të të japë gjithë arsyet se ps… 
U kujtoj feministeve të mia të preferuara të valës së tretë se vajza dhe gra nuk janë vetëm Simone de Beauvoir, Gra… 
Herës tjetër le të ngjiten në Jezercë dhe të ankohen tek JOQ se sa u vonua policia. Asnjë fjalë për faktin që nuk i… 
Nuk kam ndonjë simpati të veçantë për Kryeministrin aktual, le të themi. Por ka simpatinë time absolute kur publiko… 
Episodi i parë i Republika Show, një hapësirë javore ku do të merremi me analizë librash dhe kulturën shqiptare, ës… 
(2) Shqipëria ka kaluar gjysmë shekulli me këtë llum, nëpër kampe pune e nëpër shtëpi duke u ruajtur se mbase thua… 
(1) Më intrigon fakti që ka ende njerëz që, meqë Stalini ka imazh të keq dhe nuk e përdorin dot, citojnë Trotsky, B… 
(2) Arriti deri në fazën ku po jepnin slogane partiake si fakte të pakundërshtueshme për gabimet në metodologji. Dh… 
(1) Pashë disa "analistë" dje tek Ilva Tare, teksa shpalosej një sondazh për zgjedhjet, dhe kuptova që e pse kanë d… 
Nuk shikoj asnjë mënyrë në botë sesi ky plan mund të shkojë tmerrësisht keq 
Sonte Top Channel promovoi në prime time një libër që parashtron argumenta se pse toka është e sheshtë. Ky është de… 
Kur mendoj se i kam parë të gjitha, del dikush dhe thotë "hold my beer, jam aq dement sa do të pranoj publikisht se… 
Nuk jemi heronj, por përtacë në kërkim të identitetit. Dhe kjo është gjëja më e bukur që një vend mund të ketë, sar… 
Meqë ka edhe ditëlindjen, duhet thënë se Ismail Qemali nuk duhet të konsiderohet at i kombit shqiptar. At i kombit… 
Propozoj që regjizorët vitin tjetër të mos merren më me etiketë dhe mirësjellje por të kalojnë direkt në Hunger Gam… 
Ky emisioni Përputhen më kujton veprën teatrale të Sartre, "No Exit": Disa persona me aftësi mendore në shpërpjesti… 
Ka një të përbashkët të madhe mes atyre që duan ta bëjnë vaksinën dhe atyre që nuk duan ta bëjnë; një e përbashkët… 
Nëse dëshiron të rizbulosh për të njëmiliontën herë fytyrën e varfërisë intelektuale shqiptare, ky shpjegim i hindu… 
(2) ...në të cilin të torturojmë njëri-tjetrin çdo ditë pa na futur njeri në burg për hate speech apo shpifje.
(1) Kuorumi në Gjykatën Kushtetuese është literalisht lajmi më i mirë i vitit. Është i vetmi rast kur duhej të kish… 
Po dëgjoj që 2020 paska qenë vit i keq. Shumë kurioz të di mendimin e hebrenjve, si krahasim intelektual, me vitin 1943.
Më intrigon fakti që njerëzit mendojnë se pandemia ishte tragjedi më e madhe sesa mungesa e Gjykatës Kushtetuese në… 
(3) nën emrin e popullit, njësoj si ndaj politikanëve budallenj. Ndaj kurrë nuk e kam kuptuar këtë adhurimin ndaj popullit
(2) Në Shqipëri flitet për "populli, populli, populli". Populli është i përbërë nga të zgjuar dhe budallenj. Sistem… 
(1) Nëse shikon se sa mbështesin me komente idiotllëqet e Alfred Cakos, kupton se pse Letrat Federaliste dhe në fun… 
Nëse Elvis Naçi është musliman, që nuk është, nuk do të nxirrte para kamerave babain e Klodian Rashës. Nëse jep par… 
Nëse do të isha sociolog shqiptar, që shyqyr s'jam, do të merrja në intervistë tërë minorenët që u përfshinë në pro… 
Meqë është dita e pestë e protestave, ftoj gazetarët të pyesin ata që kanë dalë në shesh se si e ka emrin ai për të… 
Fajin që minorenë dalin e djegin gjëra për të cilat nuk kanë paguar asnjë qindarkë në jetë e paska RENEA që nuk ka… 
Si marksistë mund ta përdorim vdekjen për çfarëdo na teket, për aq kohë sa kjo që na teket na çon pak më afër asaj… 
Nëse nuk e kishe kuptuar ende që marksistëve nuk u plas fare as për Klodianin e as për qëndrimin fisnik që mbajti f… 
(3) Ne duam të na lenë rehat, qoftë qeveria, qoftë protestuesit. Nëse kam dalë të pij një birrë, dollia e parë do… 
(2) Keni të drejtë të bëni çfarëdo që ju teket, dhe nëse dikush thotë i acaruar që duhet të bëni gjë tjetër, dhe ci… 
(1) I ftoj të gjithë të rinjtë që ishin duke pirë një birrë në bllok pas një jave të lodhshme në punë a shkollë, të… 
Rrëzoni kë qeveri të doni, nuk është se më bëhet vonë. Por nëse rrëzoni Policinë e Shtetit, imazhin e saj ende të b… 
Nëse larg qoftë një njeri del nesër e gjuan me gur një minare, gjej vend ku të futesh. Nëse djeg pemën e Krishtlind… 
(2) Si një njeri që 90% të miqve nuk i ka nga kjo fe, dhe prapë shkojmë super mirë ngaqë jemi të qytetëruar, refuzo… 
(1) Si i krishterë për mua pema e Krishtlindjes është simbol i besimit tim.
(2) Turma duhet të heqë duart nga simbolet fetare, pasi ato nuk kanë të bëjnë fare as me institucionet shtetërore,… 
(1) Protesta nisi me një kauzë të drejtë, dhe si gjithnjë degradoi, këtë rradhë në djegie të pemës së Krishtlindjev… 
Nuk ka gjë më të bukur për mua që realisht qesh kur njerëzit bëjnë budalliqe, sesa kur një debat mes Frrok Cupit dh… 
(3) Të aludosh se njerëzit ia heqin vetes ngaqë kushtet e një spitali ishin të këqija, është gjëja më idiote që kam dëgjuar në jetë.
(2) Njerëzit gjejnë domethënie edhe në vuajtje dhe jetojnë. Nuk i heq vetes jetën kush se zhurma e pajisjeve të oks… 
(1) Nëse hidhesh nga ballkoni dy ditë pasi je futur në spital, kam përshtypjen se problemet psikologjike nuk të nis… 
Nëse revoltohesh dhe mërzitesh nga një statujë, me shumë mundësi do të revoltohesh dhe mërzitesh me shumë objekte d… 
Do të doja që mirësinë, vaktësinë dhe të keqen ta kishin manifestuar në botë, në komunitet, të gjykoheshin në mënyr… 
Vjet në këtë ditë njerëz totalisht të pafajshëm u shuan nën shkundjet e tërmetit. Shumë nga ata ishin të mirë, shum… 
U rikthye sezoni i shirave, ose siç njihet ndryshe sezoni ku të njëjtën që ankohen se "shqiptarët nuk bëhen" janë t… 
Shumë njerëz harrojnë se tek të rriturit liria dhe përgjegjësia janë pjesë e së njëjtës forcë që parandalon amullin… 
Një student i indinjuar ka postuar këtë foto nga teza dhe ankohet se e ka fajin Shahini dhe sistemi që fjala "dlirn… 
Sapo mora vesh që paska shqiptarë kundër vaksinave. Vija e kuqe e budallëkut total njerëzor është bindja që toka ës… 
 Prishja e Teatrit Kombëtar erdhi në një kohë kur ne kërkuam dialog midis autoriteteve dhe shoqërisë civile para se të merr…
  | I urojmë M.S. Mbretëreshës Elizabeta II ditëlindje të lumtur me rastin e 94-vjetorit. | Wishing Her Majesty The Qu…
 "Shumë e rëndësishme të respektohen masat që japin rezultat kundër ."Mesazh i përbashkët nga organizata ndërkombë…
A mund të ketë bazë terrorizmi urban tek ne?! 
"10 qytetet e Shqipërisë ku mund të jetohet më mirë për vitin 2014"  Krenar per ça!
Marko Dodiç: Nuk e duam ultra-nacionalizmin që përcillet në Serbi  
 Kryetari i partisë të spektrit të majtë politik i të rinjve serbë, Marko Dodiç: Nuk e duam ultra-nacionalizmin që... 
Kosovë - Serbi me dialog. ,  dhe  tek   via 
Tironsi që ka dy gra dhe kërkon të tretën: Janë gra të mirëkuptueshme 
50 krimet më të rënda në Shqipëri nga viti 1990 
===