 Qendra e Ndihmës Juridike Falas në Durrës trajton me ndihmë juridike parësore dhe dytësore në të gjitha rastet që paraqit…
 Projekti: Qytetarët në nevojë tregojnë si zgjidhën hallet,pandemia e bëri shtëpinë të pasigurt! - YouTube ⁦⁩…
 Ndihma juridike falas/ Mbi 731 persona në nevojë kanë përfituar shërbim në 8 qendra - ATSH - ⁦⁩  
 Zyrë e re shërbimesh ADISA në bashkinë TEPELENËADISA – TEPELENË është qendra e 21-të ku do të ofrohen mbi 1000 shërbime pub…
 Takimi i Dytë i Grupit Ndërinstitucional i Punës për Planet e Menaxhimit të Burimeve Ujore.Gjatë takimit u diskutuan tematik…
 Falë mbështetjes të  në bashkëpunim me , Qendra tashmë në administrim të  ka fillu…
 213 qytetarë për këtë vit kanë përfituar nga shërbimet e ndihmës juridike falas parësore në Qendrën e Shkodrës. Vetëm për…
 Inspektuam Qendrën e Ndihmës Ligjore falas në qytetin e Shkodrës. Falë bashkëpunimit me kryetarin e Gjykatës së Rrethit S…
 Në Shkodër, OJF-të në një diskutim me Ministren e Drejtësisë Znj. Etilda Gjonaj, Znj. Limya Eltayeb, Përfaqësuese e Përherësh…
 4/4 Takime të tilla do të vijojnë për t’i shërbyer frymës së bashkëpunimit institucional dhe kryesisht për diskutimin e p…
 3/4 Qendra jonë e ndihmës ligjore falas ndodhet në ambientet e Gjykates së Rrethit Gjyqësor Shkodër, duke mundësuar më le…
 1/4 Së bashku me , , , , në Gjykatën e Rrethit Shkodër, në një takim me g…
 Sondazhi “Besimi në Qeverisje 2020” paraqiti rezultatet në lidhje me kënaqshmërine në ofrimin e shërbimeve➡️73.4% e të anket…
 Gëzuar 1 Qershorin të gjithë fëmijëve! Për ju prindër të cilët dëshironi të merrni shërbime publike, në qendrat ADISA Ko…
 I lumtur të luajmë si skuadër e  me ekipin e futbollit të "ëtarit". Faleminderit per ndeshjen shumë miqësore …
 Qendra e re e shërbimeve publike  do te hapet se shpejti dhe ne ë.  Aty do të gjeni. ✔  Zbatim të sta…
 Ambasada Austriake uron të gjithë besimtarët muslimanë në Shqipëri, gëzuar Fitër Bajramin! 
 Kënaqësi të kthehem në ëshen së bashku me Amb. për të takuar Kryetarin e Bashkisë Dedaj &amp; për të diskut…
 Për të lehtesuar aksesin në shërbimet publike per komunitetin rom&amp;egjiptian,eshte krijuar paketa informuese për disa shërb…
 Në Shkodër, me Z.Robert Gajda, Komisionerin për Mbrojtjen nga Diskriminimi dhe ofruesit e shërbimeve për të diskutuar mbi LIG…
 Ju ftojmë të na bashkoheni në lançimin e ideve të reja! Na tregoni nëpërmjet një filmi të shkurtër se ajo çfarë mund të b…
 “Vënia e kompanive para përgjegjësisë, një sistem çertifikimi që verifikon investimin në barazinë gjinore, mekanizma inku…
 Komiteti Drejtues i Mekanizmit të Referimit për dhunën në familje në Bashkinë e Devollit u mblodh sot për të diskutuar…
 Ambasada Austriake në Tiranë ju uron gëzuar Krishtlindjet të gjithë atyre që festojnë sot 
===