 Kryetari i FRPD,  doli sot në një konferencë për shtyp për të denoncuar marrëveshjen e dyshimtë me  tenderat që…
I përjetshëm qoftë kujtimi i viktimave të masakrës në Srebrenicë! 
 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 FRPD udhëhiqet nga parimet e demokracisë, mendimit, të lirisë së fjalës dhe dinjitetit njerëzor.  
Klikoni mbi linkun më poshtë për të ndjekur intervistën e plotë që dhashë sot për A2 
 Deklarata e plotë e kryetarit    
 FRPD  u krijua nga aspirata e të rinjve për një transformim rrënjësor të politikës .Në këto 30 vjet, kemi arritur të anët…
 Jemi vendi  në  për numrin e papunësisë së të rinjve, pasi këto 8 vjet rinia ka qenë pika e fundit në axhendën e socialistë…
Sot në deklaratë për  mediat nga selia e . 
 Që prej marrjes së mandatit të parë të qeverisjes, Socialistët janë bërë ëMeKrimin. Prandaj sot, Policia e Shtetit dhe…
Ju që udhëtoni drejt bregdetit për të pushuar, tregoni kujdes në drejtimin e automjetit. Durimi të shpie shëndoshë… 
 Raporti më i fundit i UNODC e liston Shqipërinë të parën në  dhe të gjashtën në  si vendi origjinë i transportit të kanabisi…
Ju ftoj të shpërndani masivisht këtë deklaratë të përbashkët të banorëve të Kombinatit, shtëpitë e të cilëve Bashki… 
Ndiqeni intervistën që dhashë sot për ReportTV në lidhje me mbledhjen e kryesisë dhe Këshillit Kombëtar në PD, si d… 
 Aktualisht janë 13 kryetarë bashkish socialistë me të shkuar kriminale, të denoncuar prej kohësh nga . Krimi është s…
Viktima akuzuese, Ardian Çela i OSHEE-së, më ka paditur për shpifje, por vetë nuk vjen në gjyq.Do them fill e për… 
Me shtimin e ndërtimeve rezidenciale në Tiranë, mpaken hapësirat qytetëse. Betoni pa kriter rrit nivelin e ndotjes… 
Ndërroi jetë Piro Mani, aktor, regjisor &amp; pedagog i shkëlqyer. Ngushëllime zonjës Pavlina dhe dy fëmijëve të tyre… 
Çdo ditë në Tiranë qytetarët paguajnë 51 mijë euro në ditë që Tirana të pastrohet dhe kryeqyteti sot është më i pis… 
Sot tek Gjykata e Tiranës për çështjen e inceneratorit të Tiranës, i cili nuk ekziston, por vazhdon të paguhet nga… 
Me vajzat e djemtë fantastikë të Pezës, Vaqarrit dhe Ndroqit, që janë lezeti i degës Tirana 15 të Partisë Demokrati… 
Sot, 48 vjet nga revolta e Spaçit.Nderim i përjetshëm për të pushkatuarit e Revoltës së Spaçit dhe për shumë shqi… 
Drejtojuni gjykatës dhe kërkoni drejtësi për veten tuaj.
Përshëndes vendimin e Gjykatës Administrative e inkurajoj bashkëqytetarët e mi, të cilët u goditën padrejtësisht gj… 
Gjykata Administrative e Shkallës së Parë, nisur nga padia ime, vendosi sot shfuqizimin e masës me gjobë, e gjetur… 
Bashkë me avokaten e nderuar Zj. Eda Grimci, në seancën përfundimtare për gjobën politike 50 milionë lekë, e vendos… 
1 vit pandëshkueshmëri. 1 model që inkurajon dhunën &amp; dhunuesin, që imponon heshtjen e të dhunuarit. 1 model që nxi… 
E njëjta dorë injorante që të zvarrit si kriminel, sepse guxon të mbrosh qytetin tënd, identitetin dhe trashëgiminë… 
Është e njëjta mendësi që kishat i ktheu në depo drithi, kështjellat në burgje, lulishtet në pallate dhe nevojtoret… 
Një vit më parë, pushteti i dhunshëm i injorancës, imun nga çdo kulturë, i bëri gropën Teatrit Kombëtar. E hodhi në… 
 Gëzuar Fitër Bajramin të gjithë besimtarëve! 
Sot është Dita e Europës, e paqes &amp; bashkimit të popujve. Shënon fundin e luftës në Europë dhe lindjen e BE.… 
 I ftuar në  Podcast,  Kryetar i  foli për zgjedhjet, hapat ligjorë që po ndjek …
Sot në Ndroq. ëriaFITON 
Sot, me  në Kombinat. 
Një takim me Presidentin  dhe Demokratët e Kombinatit. ëriaFITON 
Ndryshimi vjen duke dhënë shembuj, jo opinione. Bashkohu me ne! Edhe 14 ditë! ëriaFITON 
Muaj të mbarë të gjithëve!Me ekipin fitues ✌ 
Rrugëtimi i pandarë me Tiranën
 30-vjetori i rivendosjes së marrëdhënieve mes  dhe është një mundësi e shkëlqyer për çdo shqiptar, për tu ndier kre…
Kjo është thirrja ime për ju! 
Edhe 49 ditë për të hequr dorë një herë e mirë nga ky model keqqeverisjeje. Shqiptarët kanë nevojë për unitet! … 
Me qytetarët e Kombinatit — Bashkë për fitoren! ëriaFiton 
 30 vite më parë eksodi biblik i shqiptarëve drejt Italisë, shembi njëherë e përgjithmonë murin ndarës mes  dhe . 30…
Me të rinjtë e Unazës së Re. Bashkë për ndryshimin! ✌ 
Në 25 Prill ne do të bëjmë histori! 
 Dita sotme shënon 23 vjetorin e luftës heroike e të papreçedentë të komandantit legjendar Adem Jashari dhe famil… 
577 vjet më parë prijësit e vendit tejkaluan veten dhe interesat e tyre territoriale për bashkimin me Kastriotin. K… 
Me çunat e FRPD &amp; PD të Unazës së Re  ëriaFiton 
 Është më e rëndësishme se kurrë më parë që këtë vit të dilni dhe të votoni. Ftoni miqtë, familjarët dhe të njohurit tuaj! …
 Vetëm duke votuar mund të shohim potencialin e vërtetë të Shqipërisë.Sigurohuni që karta juaj e identitetit të jetë brenda af…
E vërteta e Tiranës ashtu siç është, bruto, e hidhur, pa grimin e propagandës bashkiake. 
Edi Rama e la Shqipërinë në vendnumëro. Ai e do mandatin e tretë për tu pasuruar për vete dhe ministrat e tij. Në… 
Keni edhe 66 ditë kohë për të vendosur gjoba antikushtetuese. Pastaj ju pret 25 Prilli.Asnjë hap pas  
Grupseksioni 10 në Kombinat ëriaFiton 
 Do të jem i lumtur të bashkëpunoj ngushtësisht me qeverinë e re të Kosovës, si sa i përket proceseve të integrimit euro…
 Urime VV, Albin Kurtit dhe Vjosa Osmanit për fitoren e zgjedhjeve. Kosova ka sfida të mëdha përpara. Jam i bindur se pa…
Grupseksioni 5 në KombinatëriaFiton 
Grupseksioni 7 në Kombinat ëriaFiton 
Grupseksioni 2 në KombinatëriaFiton 
Grupseksioni 3 në Kombinat ëriaFiton 
Në votimet moniste të vitit 2019 Veliaj u votua vetëm nga administrata e tij e duartrokitësve. Qytetarët e Tiranës… 
ëriaFiton  Vizioni ynë për rininë 
Të rinjtë duan një dorë, një mbështetje. Ne do t’i ndihmojmë me të dyja duart. Qeveria Basha do të jetë dera e parë… 
 Të gjithë studentëve shqiptarë që vijnë nga familje me të ardhura nën 64.000 lekë të reja dp t'u financojmë 100% tarifa…
 Ne do të zgjidhim çështjen e papunësisë: nuk mund të lejojmë që rinia jonë të rrijë në shtëpi, pa shpresë për punësim.…
Nuk ka simpatizant të PD që nuk e njeh bujarinë e President . Faleminderit Z. Bujar Nishani për m… 
Ju falenderoj të gjithëve nga zemra për entuziazmin dhe surprizën e bukur! Më emocionuat dyfish. Bashkë do të kth… 
Po e nis ditën e parë të punës në familjen e Ardit Gjoklaj në Kombinat. Drejtësia për Arditin është detyrim ndaj çd… 
Në 80 ditë, ëriaFiton dhe Rama humb! 
 Është e papranueshme për mua të kemi fëmijë dhe familje shqiptare që nuk janë në gjendje të përballojnë dot kostot e te…
25 Prilli nuk është thjesht një ditë në kalendar. Është një thirrje mbarëshqiptare për demokraci, shtet &amp; dinjitet.… 
 Në programin tone “Shqipëria fiton Shëndetësinë”, paga e infermiereve do të bëhet 700 Euro dhe e mjekëve 1200 Euro. Ne…
Me , Elbasani kthehet blu në 2021! 
 Është hera e parë që një parti politike vë familjen dhe rininë në qendër të programit të saj: 30 mijë lek/muaj për çdo…
 Me kë tallet akoma ky? Për 8 vjet Rama i ka shërbyer vetëm vetes, miqve të tij, ortakëve të tij, por jo shqiptarëve. Pë…
 Aeroporti Ndërkombëtar "Nënë Tereza" do tu kthehet shqiptarëve dhe shtetit të tyre sipas përcaktimeve fillestare të kon…
 Çdo akt koncesioni, PPP apo zgjatje koncesioni i propozuar nga qeveria ne ikje, është në shkelje flagrante të ligjeve t…
 Do të ul sigurimet shoqërore në 18%.Totali i taksave dhe tarifave vendore të bizneseve të vogla e të mesme, nuk do të…
 Do të rrisim pensionet me të paktën dyfishin e normës së inflacionit, dhe në cdo rast jo më pak se 5% në vit. Ne do të…
 Unë sot marr barrën e përgjegjësisë përpara jush! Ka ardhur koha për ndryshim! Ka ardhur koha ta largojmë këtë qeveri d…
Sot është Dita Ndërkombëtare e Përkujtimit të viktimave të Holokaustit. Si shqiptar, jam i familjarizuar me paragjy… 
Këta janë ushtarët e Ndranghetës. 
 Në vend që të kujdeset për njerëzit, Rama dhe marionetat e tij janë lidhur me mafian për të shtuar pasuritë e tyre, dhe…
I bekuar që e kalova gëzimin e ditëlindjes me vëllain dhe prindërit e mi që i dua shumë, veçanërisht mamin që është… 
 Deklaratë e kryetarit të FRPD, :  
Ndiqeni deklaratën e plotë për shtyp 
 Nuk ka ndryshim në Shqipëri pa larguar Edi Ramën. 25 prilli është dita e largimit të keqes. Më 26 prill nis rruga e ndr…
 Rinia sheh një shpresë të madhe tek ndryshimi, tek alternativa, sepse problemi më i madh që Shqipëria ka sot është larg…
 I bëj thirrje SPAK të hetojë bashkëpunimin e mafias me kryebashkiakun. Nuk ka asnjë arsye në botë pse  SPAK-u të mos kë…
 Sot në orën 17:30 në emisionin "Këtë Javë" në News24 me gazetaren Nisida Tufa. 
Nga dita e sotme, Enxhi Shanaj, studentja shembullore e masterit në Fakultetin e Shkencave Mjekësore Teknike, do të… 
Përgjimet fundosën Tahirin, këto përgjime do të fundosin Ramën &amp; Erionin! Kësaj s’kanë për t'i shpëtuar! Më 25 Pri… 
 Një pyetje e thjeshtë: po ti do ta pushoje nga puna këtë njeri? 
 Thërrisni miqtë dhe të afërmit tuaj! Këtë vit është shumë e rëndësishme për këdo që të votojë. Kur votojmë, fitojmë! 
 Eurostat e renditi Shqipërinë në vendin e gjashtë në botë për emigracionin masiv. Për 8 vjet me dështimet e tij, Rama e…
 Detyra e gjithësecilit prej nesh është të bëjë të mundur ndryshimin nëpërmjet votës! 
 E nisëm me thirrjen "E duam Shqipërinë si gjithë Europa" dhe është misioni i  që t'a çojmë këtë zotim deri në fund.…
 Gjatë takimit me të rinjtë e Fushë-Krujës. Ata janë të vendosur që në 25 Prill të shkojnë në qendrat e votimit dh… 
Për nisjen e punimeve të lagjes së re në Kombinat as që u bëka fjalë. Pirgu me inerte qëndron aty, si treguesi më i… 
 Për 8 vjet Edi Rama dhe Rilindja e kanë polarizuar shoqërinë shqiptare. Ka ardhur momenti për unitet! 
Për gjysmë ore te "Pallati me shigjeta" kaluan 12 betoniere! Është vetëm një nga hyrjet në Tiranë. 1 betoniere ka… 
 Në 100 ditë do të largojmë një herë e mirë të keqen që ka kapur vendin!Në 100 ditë do të zgjedhim një qeveri që kujdeset për…
 Taksimi 9% ka si qëllim të krijojë një shtresë të mesme shqiptarësh të pavarur politikisht dhe ekonomikisht, garante të demokra…
 Më 25 Prill, unë do të VOTOJ për një qeveri të vullnetshme, e cila do të përkrahë shqiptarët dhe do t'i japë fund klientelizmit…
Duhet seriozitet! Duhet punë konkrete! Duhet ndryshim! 
Ne kemi shumë punë &amp; pak zhurmë. 
 ⏳  është mundësia juaj për ta bërë ndryshimin! Voto  dhe bëhu pjesë e ndryshimit! 
Specialistët e PS e kanë një huq. Faturën e darkës e paguan shqiptarët.Faturën e 25 prillit do ta paguani vetë! 
 Vota jote ka shumë peshë! 25 Prilli po vjen dhe ti ke fuqinë të zgjedhësh✅ një ekonomi konkurruese ✅ një alternativë të besu…
 Dita e Zgjedhjeve po afron ️Jemi vetëm 107 ditë larg 25 Prillit, prandaj pajisuni me kartë identiteti  për të votuar.Vetë…
 Për shkak të Ramës, të rinjtë tanë po largohen nga Shqipëria. Është koha ta largojmë Ramën dhe t'u rikthejmë shqiptarëv…
 Prioriteti nr.1 i qeverisë time do të jetë punësimi veçanërisht i të rinjve Prioritet do të thotë të tregosh seriozitet…
 Synimi kryesor është t’ju heqim çdo pengesë, çdo barrierë, t’ju lehtësojmë nga barra sepse gjithë shpresa dhe besimi te…
Nga zemra ju uroj Gëzuar 2021 e një vit sa më i bardhë për ju e familjet tuaja ❤️ 
 Le ta lëmë pas krahëve të keqen dhe këtë vit të vështirë, le t'i mbushim zemrat me dritë, me shpresë dhe me besimin se…
Viti i Ri po afron dhe shumë fëmijë, prindër e gjyshër nuk kanë mundësi të festojnë. Ndonëse pa një shtëpi të ngroh… 
Ngushëllime miqve tanë kroatë për humbjet në jetë si pasojë e tërmetit të sotëm! Shërim të shpejtë të plagosurve! 
 Sot, ora 20:45, në një bisedë me gazetarin Çim Peka në Syri TV. 
 Qeveria është bërë një gangrenë për ekonominë, në vend që të shërbente si lehtësuese. 7 vite në pushtet, Edi Rama ka ng…
 Oligarkët e përdorin pushtetin e tyre ekonomik për të diktuar vendime politike. Përmes ligji tonë anti-mafia ne do të k…
 Me mua kryeministër, 100 milion euro çdo vit do të shkojnë për subvencionimin e fermerëve, 50 milion euro në vit për in…
  SHQIPËRIA ME SYTË E TË RINJVEMoment nga takimi i kreut të opozitës Lulzim Basha me studentë të Fakultetit të Ekonomisë. ht…
  ME SYTË E TË RINJVESot kryetari i opozitës  takoi studentë nga FDUT, të cilët shprehën problemet &amp; shqetësim…
 Të dashur besimtarë të krishterë,ju uroj nga zemra Gëzuar Krishtlindjen! Le të shohim me shpresë përpara, sepse siç thu…
 Mjekët e ardhshëm shqiptarë nuk duan të ikin nga Shqipëria, por kolapsi i shëndetësisë po i përzë. Premtimi për shëndet…
"Ndryshimi ka fytyrën e rinisë"  | 23.12.2020Çdokush që e do Shqipërinë duhet t'i bashkohet ndrys… 
 Mbështetja e sipërmarrjes dhe inovacionit, sigurimi i financimit për projektet start-up të të rinjve shqiptarë është rr…
 Problemi kryesor i ekonomisë sot është monopolizimi. Do të luftojmë monopolet që i kanë zënë frymën ekonomisë. Do të ri…
 Rritja e çmimeve të energjisë i ka varfëruar edhe më shumë shqiptarët. Mjaft më! Le të sjellim së bashku ndryshimin dhe…
===