Ditë e përsosur për të votuar!  Njësia 5 në Tiranë ishte zgjuar herët sot për të shprehur vullnetin e vet në kët… 
Me Vesën &amp; Verinën në Galerinë Kombetare të Arteve. Ngelëm të mahnitura nga ekspozita e një pjese të madhe të arkiv… 
Mjekët e Kosovës vaksinohen në Shqipëri  
Bashkëbisedim online me studentët e Universitetit të Amsterdamit, pjesë e , për politikëbërjen në fushën… 
Nxënësit që nuk mund të shkojnë në shkollë se janë karantinuar në shtëpi, apo kanë sëmundje kronike dhe u rrezikohe… 
Kalova mëngjesin nëpër shkollat që u hapen sot për herë të parë pas 6 muajsh. Ndalova në gjimnazin "Shote Galica" F… 
Sot në ë, me nxënësit e shkollës "Faik Konica", së bashku me homologun tim Ramë Likaj, shpalosëm projektet… 
Nxënësit tanë mezi presin të rikthehen në bankat e shkollës me vetëdije të plotë se respektimi i rregullave dhe pro… 
Jam e lumtur teksa Këshilli Kombëtar Shqiptar në Serbi ka nisur shpërndarjen e librave shqip  nga ëria… 
Si mësuesit, ashtu edhe personeli ndihmës do të zbatojnë me rigorozitet detyrat që kanë përpara për të siguruar mba… 
Nuk do të lodhem duke falënderuar mësuesit e programit “RTSH Shkollë” që treguan kreativitet, fleksibilitet, vullne… 
Të gjithë të angazhuar për kthimin e sigurt të nxënësve në shkolla. Pastrimi i ambienteve të shkollës, dezinfektimi… 
Lëvizjet brenda shkollës mund të bëhen VETËM me maskë dhe sipas rregullave të distancimit fizik. Kështu, mbrojmë ve… 
Pas këshillave të vyera të Kryeministrit në takimin me drejtuesit e Drejtorive dhe Zyrave të Arsimit Parauniversita… 
Gjatë qëndrimit dhe mësimit në ë, pa diskutim nxënësit dhe mësuesit do t'iu nënshtrohen rregullave strikte që… 
Hyrja dhe dalja nga , VETËM sipas rregullave të distancimit social e fizik, të përcaktuara qartë nga Instit… 
Sot ka filluar shpërndarja e librave falas me përfitues direkt mbi 250 mijë nxënës në të gjithë vendin: të gjithë n… 
Mbajtja e maskës  është e detyrueshme, sepse kjo është e vetmja mënyrë se si ne të mbrojmë veten dhe të tjerët. Gj… 
Po vijojnë të gjitha përgatitjet që shkollat të jenë gati për fillimin e vitit të ri shkollor  e shënde… 
Përgjigjet për disa nga pyetjet tuaja mbi fillimin e vitit të ri shkollor 2020-2021E plotë… 
Si ministri e fëmijëve dhe të rinjve, me themelimin dhe angazhimin e vazhdueshëm të Parlamentit të Nxënësve kemi çu… 
Udhëzuesi për fillimin e vitit të ri shkollor 2020-2021 dhe përgjigjet për disa nga pyetjet tuaja… 
Puna e mësuesve tanë të përkushtuar për xhirimin e orëve mësimore për   po vazhdon.  Orët mësimore… 
Me dyfishimin e numrit të psikologëve dhe punonjësve social vitin e ardhshëm shkollor, jemi të bindur se do të kont… 
Populli zgjedh përfaqësuesit në kuvend!Listat zgjedhore mund të hapen pas ndryshimeve të sotme kushtetuese, duke… 
Fjala e plotë sot në Kuvend 
 , ju prezantoj me maturantët  më të shkëlqyer të Maturës Shtetërore 2020.Krenare për të rinjtë tanë! 
 , ju prezantoj me maturantët  më të shkëlqyer të Maturës Shtetërore 2020.Krenare për të rinjtë tanë! 
 , ju prezantoj me maturantët  më të shkëlqyer të Maturës Shtetërore 2020.Krenare për të rinjtë tanë! 
Për të gjithë të interesuarit , sonte në 20:30, jam e ftuar në RTV Dukagjini në emisionin Debat Plus me Ermal Pand… 
“Historia, letërsia, gjeografia dhe artet, përveçse lëndë shkollore, janë edhe burime të pashtershme të debatit kom… 
Fjala e plotë sot në Kuvend  
Vesa dhe Verina (mbesat ) më befasuan me vizitën e tyre nga Prishtina. 
Sot në konferencën për media mbi mbylljen e vitit shkollor, politikat e ndërmarra dhe hapat që na presin në vijim.… 
Aldo Alia nga Kavaja erdhi në vizitë me lajme të mira: kishte fituar bursë të plotë për studime në Universitetin Er… 
UÇK-ja ishte ushtri ÇLIRIMTARE dhe mishërimi i përpjekjes për liri. Ajo është themeli i Republikës së Kosovës. Çdo… 
Nuk e kam kuptuar kurrë se si disa përfaqësues të opozitës – deputetë të dorëhequr dhe në shërbim, këshilltarë dhe… 
Mesazh për maturantët dhe prindërit e tyre para provimit të matematikës. Suksese nesër!Fjala e plotë… 
RTSHShkollë, sot ora 18:00, do të transmetohen sipas këtij programi leksionet për maturantët.Pas transmetimit… 
"Kodi penal është i qartë, procedurat janë të qarta. Por, është gjithashtu e plotësisht e qartë që kjo nuk mjafton.… 
Kam kërkuar sot të adresoj Kuvendin, jashtë rendit të ditës, sepse mendoj që është e rëndësishme të flasim këtu për… 
RTSHShkollë, sot ora 18:00, do të transmetohen sipas këtij programi leksionet për maturantët.Pas transmetimit… 
RTSHShkollë, sot ora 18:00, do të transmetohen sipas këtij programi leksionet për maturantët.Pas transmetimit… 
Përgëzoj nxënësit që gjejnë kurajon të denoncojnë dhunën e ushtruar ndaj tyre, si hapi i parë dhe i domosdoshëm për… 
Fëmijët kanë të drejtë të jetojnë të shëndetshëm, të sigurtë, pa dhunë, pa diskriminim, me mirëqenie sociale dhe të… 
RTSH Shkollë, sot ora 18:00, do të transmetohen sipas këtij programi leksionet për maturantët.Pas transmetimit… 
RTSHShkollë - Ritransmetim i leksioneve në gjuhë shqipe nga mësueset Miranda Agolli (klasa 6-7), Dhurata Myrtoll… 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍ nga mësueset Fluturaj Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë - Leksione në TIK‍ nga mësuese Santa Roqi klasa (6-7-8) dhe anglisht nga mësuese Eleni Tagilaj (kla… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeveleksionet:abetare, gjuhë shqipe 2-5 (10:30-12:00)… 
RTSHShkollë - Leksione në gjuhë shqipe nga mësueset Miranda Agolli (klasa 6-7), Dhurata Myrtollari (klasa 8-9) d… 
RTSHShkollë- Leksione për arsimin fillor në dituri natyre nga mësueset Flutura Ramaj (klasa 1), Klarita Bërdilla… 
RTSHShkollë-Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Diana Zepisht… 
Takim me grupin e deputetëve “Miqtë e Fëmijëve” ku diskutuam mbi ecurinë e mësimdhënies online në shkollat 9-vjeçar… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipenga mësueset Nexhmije Allkja (klasa 1), Ani… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeveleksionet:abetare 1, gjuhë shqipe 2-5 (10:30-12:00… 
RTSHShkollë - Leksione në TIK‍ nga mësuese Santa Roqi klasa (6-7-8) dhe anglisht nga mësuese Olta Mema (klasa 7… 
RTSHShkollë - Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Alma Meta d… 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍ nga mësueset Fluturaj Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë - Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Alma Meta d… 
RTSHShkollë - Ritransmetim i leksioneve në anglisht nga mësuese Eleni Tafilaj (klasa 10-11-12).Leksionet e plot… 
RTSHShkollë - Leksione për arsimin fillor në dituri natyre nga mësueset Flutura Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë - Leksione në gjeografinga mësueset Florida Kumanaku (klasa 6-7) dhe Fitore Koçi (klasa 8).Leksion… 
RTSHShkollë - Ritransmetim i leksioneve për arsimin fillor në abetare dhe gjuhë shqipenga mësueset Nexhmije Allk… 
RTSHShkollë, sot do të ritransmetohen sipas këtyre programeveleksionet:abetare dhe gjuhë shqipe 2-5 (ora 10:3… 
RTSHShkollë - Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Alma Meta d… 
RTSHShkollë - Leksione në letërsi nga mësuese Orjana Osmani klasa (10-11-12).Leksionet e plota… 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍ nga mësueset Fluturaj Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeve leksionet:matematikë 1-5 (ora 10:30-12:00)letër… 
RTSHShkollë - Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Alma Meta d… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeve leksionet:abetare 1, gjuhë shqipe 2-4 (ora 10:30-12… 
RTSHShkollë - Leksione për arsimin fillor në dituri natyre nga mësueset Flutura Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë - Leksione në fizikënga mësueset Trëndelina Zhupa (klasa 7-8) dhe Lindita Brasha (klasa 9).Leksion… 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍ nga mësueset Fluturaj Ramaj (klasa 1), Klarita Bërdill… 
RTSHShkollë - Leksione për maturantët‍matematikë‍ nga Xhevdet Reka dhe Aurela Kotomelokiminga Alma Meta d… 
UNICEF mbetet një nga partnerët tanë më të mirë në mbështetje të të rinjve. Këtë herë mbështetën shkollat me përgat… 
RTSHShkollë - Leksione në gjeografinga mësueset Florida Kumanaku (klasa 6-7) dhe Fitore Koçi (klasa 8).Leksion… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
Të gjitha shkollat gati për të mirëpritur maturantët ditën e hënë  
RTSHShkollë - Ritransmetim i leksioneve në anglisht nga mësueset Olta Mema (klasa 6-7-8-9) dhe Eleni Tafilaj (kla… 
Të gjitha shkollat gati për të mirëpritur maturantët ditën e hënë  
RTSHShkollë-Ritransmetim i leksioneve për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkj… 
RTSHShkollë, sot do të ritransmetohen sipas këtyre programeve leksionet:abetare 1, gjuhë shqipe 2-5 (ora 10:3… 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍nga mësueset Flutura Ramaj (klasa 1), Klarita Bërdilla… 
RTSHShkollë - Leksione në gjuhë shqipe dhe letërsi nga mësuset Miranda Agolli (klasa 6-7), Dhurata Myrtollari (k… 
Vijon puna përgatitore në shkolla për masat që sigurojnë distancimin fizik mes nxënësve. Gjatë gjithë këtyre ditëve… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeve leksionet:abetare 1, gjuhë shqipe 1-5(ora 10:30-12… 
RTSHShkollë - Leksione për arsimin fillor në dituri natyre nga mësueset Flutura Ramaj (klasa 1), Klarita Bërdill… 
Rregulla të thjeshta që duhet të ndiqen nga maturantët gjatë qëndrimit në shkollë 
RTSHShkollë - Leksione në anglisht nga mësueset Olta Mema (klasa 6-7-8-9) dhe Eleni Tafilaj (klasa 10-11).Leksi… 
Jemi shumë falënderues për bujarinë që tregoi kompania Ecolog International, duke dhuruar 500 pajisje digjitale për… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeve leksionet:abetare 1, gjuhë shqipe 2-5(ora 10:30-12… 
RTSHShkollë - Leksione në fizikë nga mësueset Trëndelina Zhupa (klasa 6-7), Lindita Brasha (klasa 8-9) dhe Kozet… 
Nga sot, në çdo shkollë po afishohen rregullat që duhet të zbatojmë për t’u mbrojtur nga COVID-19 në shkollë. 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍nga mësueset Klarita Bërdilla (klasa 1), Tonina Dervish… 
RTSH Shkollë - Ritransmetim i leksioneve në gjuhë shqipe nga mësueset Dhurata Myrtollari (klasa 8-9) dhe Orjana… 
Këndi i Maturantit në shkollë nga Rezana Vrapi, Drejtore e Qendrës së Shërbimeve Arsimore 
RTSHShkollë- Ritransmetim i leksioneve për arsimin fillor në dituri natyre nga mësueset Flutura Ramaj (klasa 1),… 
RTSHShkollë - Leksione në fizikë nga mësueset Trëndelina Zhupa (klasa 6-7), Lindita Brasha (klasa 9) dhe Kozeta… 
Procesi i korrigjimit të testit të Maturës Shtetërore nga Rezana Vrapi, Drejtore e Qendrës së Shërbimeve Arsimore 
RTSHShkollë - Leksione për arsimin fillor në matematikë‍nga mësueset Klarita Bërdilla (klasa 1), Tonina Dervish… 
RTSHShkollë - Leksione në anglisht nga mësuese Eleni Tafilaj (klasa 10-11-12).Leksionet e plota… 
Procesi i Administrimit të Maturës Shtetërore nga Rezana Vrapi, Drejtore e Qendrës së Shërbimeve Arsimore 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësueset Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeveleksionet:abetare 1, gjuhë shqipe 2-4 (ora 10:30-12… 
Niveli i vështirësisë së testit të Maturës Shtetërore nga Rezana Vrapi, Drejtore e Qendrës së Shërbimeve Arsimore☝️ 
RTSHShkollë - Leksione për arsimin fillor në dituri natyrenga mësueset Flutura Ramaj (klasa 1), Klarita Bërdilla… 
RTSHShkollë - Leksione në gjuhë shqipe nga mësueset Dhurata Myrtollari (klasa 8-9) dhe Orjana Osmani (klasa 10-1… 
Struktura e testit të Maturës Shtetërore nga Rezana Vrapi, Drejtore e Qendrës së Shërbimeve Arsimore 
RTSHShkollë-Leksione për maturantët‍matematikë nga Xhevdet Reka dhe Aurela Kotomelokimi nga Alma Meta dhe Di… 
RTSHShkollë - Leksione për arsimin fillor në abetare dhe gjuhë shqipe nga mësuesit Nexhmije Allkja (klasa 1), An… 
RTSHShkollë, sot do të transmetohen sipas këtyre programeveleksionet:abetare 1, gjuhë shqipe 2-5, (ora 10:30-… 
RTSHShkollë - Leksione në fizikë nga mësuesit Lindita Brasha (klasa 8-9), Neritan Çaushi (klasa 10) dhe Kozeta M… 
Përmbajtja e testit të Maturës Shtetërore nga znj. Rezana Vrapi, Drejtore e Qendrës së Shërbimeve ArsimoreProgr… 
RTSH Shkollë - Leksione për maturantët‍: Matematikë nga mësues Xhevdet RekaKimi nga mësuese Alma Meta B… 
 në bashkëpunim me  dhe , kanë regjistruar qindra video të reja m… 
RTSHShkollë - Leksione në matematikë‍nga mësueset Vjollca Vladi Musha (klasa 4) dhe Entela Alushi (klasa 5) dhe… 
Vijon mësimi në kushtet e shtëpisë përmes laptop-it të familjes, telefonit të prindërve apo duke ndjekur orët mësim… 
Përgjigjet për disa nga pyetjet e maturantëveVideo e plotë 
RTSH Shkollë - Ritransmetim i leksioneve në anglisht nga mësuese Eleni Tafilaj (klasa 10-11-12).Leksioni i plot… 
RTSHShkollë - Ritransmetim i leksioneve;abetare nga mësuese Nexhmije Allkja (klasa 1) dhe gjuhë shqipe nga mësu… 
RTSH Shkollë, sot do të ritransmetohen sipas këtyre programeve leksionet:abetare 1, gjuhë shqipe 2-5 (ora 10:30-… 
Përgjigjet për disa nga pyetjet e mësuesveVideo e plotë 
RTSHShkollë -  Ritransmetim i leksioneve në gjeografi nga mësueset Fitore Koçi (klasa 9) dhe Valbona Mara klasa… 
RTSH Shkollë - Leksione për maturantët‍: Matematikë nga mësues Xhevdet RekaKimi nga mësuese Alma Meta B… 
RTSHShkollë - Ritransmetim i leksioneve për arsimin fillor në dituri natyre nga mësueset Klarita Bërdilla (klasa… 
Vazhdon angazhimi i mësuesve për mësimin në kushte shtëpie që asnjë nga nxënësit e tyre mos të mbetet prapa me mësi… 
RTSHShkollë - Leksione në gjuhë shqipe dhe letërsi nga mësuese Orjana Osmani (klasa 10-11-12).Video e plotë… 
RTSH Shkollë - Leksione për maturantët‍: Matematikë nga mësues Xhevdet RekaKimi nga mësuese Alma Meta B… 
RTSHShkollë- Leksione në gjuhë shqipenga mësueset Teuta Biçaku (klasa 3), Vjollca Vladi Musha (klasa 4), Entela… 
Komunikim i rëndësishëm mbi mbylljen e vitit akademik për arsimin e lartë.Fjala e plotë 
RTSHShkollë, sot do të transmetohen sipas këtyre programeve leksionet:gjuhë shqipe 3-7 (ora 10:30-12:00)ma… 
RTSHShkollë - Leksione në gjeografi nga mësueset Fitore Koçi (klasa 9) dhe Valbona Mara klasa (klasa 10-11-12).… 
===