 Kjo duket si kundërpërgjigje ndaj Damian Gjiknurit 
 Shiheni këtu se me kë pozon ambasadorja jonë e nderuar
   Al Tirana sa kam lidhje unë me Edi Ramën ke ti me te përndjekurit. Në rradhë… 
  Jo zonjë tranzicionin e sollën njerëzit pa shtyllë kurrizore, pse nuk e thua që shqipta… 
  Në Shqipëri për mentalitetin Shqipëtar hapja e dosjeve publikisht do shkaktonte shumë p… 
 Sa për të hequr kureshtjen sepse interesin karshi jush e kam zero, t'ju pyes diçka.- Kam dëgjuar se e… 
  Fakti që të bësh një koment në rrjete sociale nuk ke asnjë shpenzim (bojë, letër apo la… 
 Tani merruni si do paguajë avokatin, çfarë do haje në Francë apo ku do flejë. Një portal gjobvenes, mashtru… 
  Kur do arsyetoni si njerëz, gjithmonë me anë të terrorit si xhaxhi ne vakt të vet. Jo, ti… 
 Kjo që dëgjove sot është tingull i një ulurime shpërthyese që shpejt shpejt do i dëgjohet jehona. Pranda… 
 Asgjë ske bërë as me tërmetin as me pandeminë. Atë që s'thuhet ke bërë. 8 vjet katastrofë
 Silikon NDRANGHETA 20% -sh që po ngjiti nuk ka shanc të shqepet më. Ti çdo punë e bën si duhet 
 21 janari është dita që ky popull të kuptojë se si për pushtet ti, Edi Rama me shokë bëtë Kurban 4 nje… 
 Ti ha paidhaqe në Greqi ndërsa ministrat e tuaj mish floriri te Nusreti në Dubai. Me dalë më i zoti tigri se ti!? 
 Vetëm mos u lodh shumë se po na këputesh në mes. Edhe kur të shihesh sy më sy më prodhuesin mos i luaj q… 
 Një gjë nuk kuptoj, çfarë leverdie ke të emërosh njerëz si Safeti në poste primare? Ti i humbur je por k… 
 Ideatori i ndarjes së Kosovës kërkon qiqrra në hell. Raporti  doli një flluskë sepse ishin sajesa. Ti ps… 
 Ato Shqipe që qenkan vrerosur për ty duhet të jenë Elisa me Taulantin se sbesoj te ketë Shqipëtar që bes… 
 5 dite rresht në vend që të interesoheshe si të zgjidhej çështja apo të ndihmoje ata njerëz që për fajin… 
 Po meqe të pëlqen hapja, pse e do hapjen pjesërisht si tha Rama dhe jo 100% sikur propozoi Basha. N… 
 Ke të drejtë të bësh si CUB me Lulin sepse ke gjetur terren.  Jam kurioz 🤔 po të ishte Berisha a do guxo… 
 Në të vërtetë arrestimi i komisionerëve tregon vlerën e atyre zgjedhjeve. Vlera e tyre është një pushtet… 
 Si bir komunisti dhe shpirt komunisti që je nga ti çfarë nuk pritet, por ti nuk je aq budalla sa dukesh… 
 Si futen kriminelët në parlament ti e din më mirë se të gjithë, je mjeshtër për këtë. Ti s'je në gjendje… 
 Dëgjove gjë se çfarë tha KLSh për abuzimet që ke bërë, sa buxheti i shtetit në 2 vjet. O covid mo's u of… 
 O liderr po si me t'a dhi muhabetin në atë mënyrë Ramush Haradinaj. Albini as nuk del me të prite… 
  Ti qytetare Shqipëtare! Nëse modeli jot personifikon qytetarinë, është ajo shprehja- Me mir… 
 Po ne Portugali bën vaki të kenë si puna jote?
 O mr mashtrues komiteti bën çfarë i thua ti. Ti e ke çuar Shqipërinë në atë gjendje sa as një analizë nu… 
 Vërtetë Shqiperia do e fitojë këtë luftë por fitoren me të madhe do e marrë fillë mbas mbarimit të luftë… 
 O portokallist je gjasma km I vendit, mos u merr me batuta pa lidhje. 4 - 5 ditë je në karantinë dhe shi… 
  E fitove një sufllaqe në karantinë.
 Harrove ç'ke bërë vetë kur ishe ne opozitë për një kryetar qarku? Sa letra ke dërguar e sa pengesat i ke… 
  për sa kohë që do ketë të tillë &lt;qytetare&gt; si kjo luanesha që mbron Ramen do i japim epërsi… 
  O cope mishi ka boll lëpirëse Edi Rama. S'besoj se ka rënë kaq poshtë sa të mbrohet nga llapista si puna jote
 Keni folur se keni ngritur një karantinë, ku ndodhet ajo?Nëse është e vërtetë pse keni frikë të tregoni… 
 Ndërsa shumica e qytetarëve të tronditur neveriten nga ky lavazh truri që po mundoheni të bëni. Një krim… 
 Te kanë ulur rezultatin ata gazetarë kazani. Jo  12 fish por 20 fish duhet të jetë kultivimi. Në këtë dr… 
 Po ti e di dëmin që i ke shkaktuar këtij vendi, jo  vite po dekada duhen që të riparohen dëmet tua. E ke… 
 Një gjë habitem si nuk të vjen turp kur gënjen se gjoja je konsultuar për këtë projekt-ligj. Ata që përm… 
 Fiks njeriun e duhur për të administruar paratë e fatkeqësisë ke gjetur 
 Ti do investosh ne Arabi apo Arabi në Shqipëri  
 Tamam tamam me këtë paketën anti KÇK që propozon ti është si t'ja fusësh vetes sepse ti je koka e kçk-së… 
 S'ka nevojë për ligj special sepse ligje kemi. Problemi është te përkrahja që i jepni personave të inkriminuar.
Prapë në komunizëm po kthehemi. 
   Ne po kërkojmë të largojmë Ramën për më mirë. Zëvendësimi i tij me Erjon ma… 
===