 edhe në shah duhet vlejë " s'ka babë,  ka poteza" :P 
 Një urim edhe nga unë!
 Hidhet në Amsterdam shorti i Ligës së Kombeve! Shqipëria  do të përballet me Kazakistanin, Lituaninë dhe Bjellorusinë.  …
Kamenica nën 'Liqenin e mjegullës"
Rreth flamurit të përbashkuar.... ... në dhimbje e gëzim. Urime 28 Nëntori!
Me mendje e zemër - Shqipëri
Hat-trick i Rodrygo dhe garda e moçme,  për 6-0
Shqipëri e pafat :( Nga loja që zhvilloi humbja nuk qe rezultat real. ërjetësishtShqipëri
Në këto kohë tërmetesh,  askund më sigurt se në Bunk(er)Art. — feeling confident
 Presidenti Macron më shprehu ndjesën e sinqertë për gafën skandaloze të Federatës Franceze të Futbollit, me himnin e Flamuri…
 Faleminderit nga ❤ tifozerisë më të mirë në ALB⚽ ë ⚫Shihemi më  SHQIPËRI-Islandë 
Nili (nipi - që nuk i ndalet goja deri sa ta zë gjumi) dhe energjia e Erës(jo ajo e a famshmja Istrefi ☺)
Kuiz: Testoni njohurit tuaja në futboll para finales të Ligës së Kampionëve 2019 mes Liverpoolit dhe Tottenhamit 
Për shkak të sëmundjes detyrohet të tërhiqet nga futbolli,  një kampion i vërtetë!  World Cup European Champio… 
Lule pranvere në shtëpi...relaks
Njëra bëri 'muuuu',  tjetra tha 'ma more fjalën prej gojës'.... ... diku nëpër kryeqytet
Pas saktësisht 1011 ditë (2 vite 9muaj) dominim,  REAL MADRID eliminohet!  I kuptoj të gjithë ata që janë gëzuar (n… 
Gjashtë ishim...Sot bëhem 13 vite që, pesë jemi në tokë...një na shikon nga qielli....jemi sërish gjashtë - përgjithmonë! Pusho i qetë!
Nga Kaka te Luka Modrić,  në mes historia dhe rivaliteti ndoshta më i madh në historinë e futbollit!
Hëna edhe nëna,  nuk të lënë kurrë vetëm!
Me shkas....Si e humbëm respektin për njeriun,  të gjallin e të vdekurin. Sot isha në varrimin e një profesori të… 
Kafe muhabet e ajër të pastër!
Shtatori më i rëndësishëm në jetën e Bardhit dhe tonën poashtu.  Suksese Bardh,  Zoti të ndihmoftë!
Miqësisht i urime Francës!P.S në videon më poshtë është skema si mposhtet ajo ;)  
Gati për kupën e botës... 
Dasma e Besnikut &amp; Besës, në pak fotografi!
"Mësuesi është zemra e sistemit arsimor"Urime dita e jote, të faleminderit përjetësisht!
Jetë të gjatë sa FLAMURI ynë,  o i nderuar Kim! 
A po ju duket pak 'provokative' përzgjedhja e dirigjentit :P... 
Urime ditëlindja e 10-të,  FLLAD!  Të duam shumë!
Vizat në muajin mars...a nuk na e thoni dhe vitin,  që lajmi të jetë më i saktë :P
Për elektrone të lira na kanë mësu në shkollë,  por që ka neutron të lirë...na e mësoi një supergazetar?! Mos... 
Tërhiqet Shpend Ahmeti, partia Fjala del me kandidatin më të fortë për kryetar të Prishtinës - Pampress 
Numrat janë, por edhe shumë të panjohura ka "ekaucioni" i qujatur qeveri :) :P
Mirënjohje përgjithmonë,  për De Biasin. FALEMINDERIT... 
"A do të dijë liria të këndojë, siç ditën skllevërit t'i këndojnë asaj"Citat i huazuar!
Cilësia e ajrit....jashtëzakonisht e mirë!  
Një nga margaitarët e muzikës tonë! 
Përvjetori i 11-të, kur nga 6 mbetëm 5 :(  Pusho i qetë shoku jonë!
Me Aortën,  çikën më të mirë n'muhallë dhe rrethinë!  
Ndërkohë në kufirin lindor të Kosovës,  gjithçka qetë,  për më shumë një ditë e bukur me diell!
Nuk e di nëse cila anë e fotografisë të pëlqen më shumë, cila do që të jetë përgjigjja, të uroj shëndet e fat në... 
Pasi ka takim me shokun e tij të dashur- babadimrin,  edhe këmisha me kravatë nuk mungoi!  
Ma i madhi në vend 
Gjithë shqiptarëve,  kudo që ndodhen - urime festa e flamurit!
Se njeri na qenka më i fort se guri..... po bindem nga fjalët e babait (Avni Dehari) për djalin e vet (Astritin).... 
Kamenica të lë pa fjalë 
"A shkojmë në mënyrë tradicionale me dorë.... " tha Veseli, the filloi votimi.... 󾍇󾰀
Vjeshtë me aromë pranvere!
Real Madrid, nga rekordi i fitoreve si duket ia ka mësu rekordit të barazimeve :P
Gjithë besimtarëve të besimit islam-urime Kurban Bajrami!
Fishekzjarre apo armë,  krisma në Prishtinë?!
Pejës po i ec në xhudo,  por, Zveçanit nuk po i ec në tenis 󾍇  
Pejës po i ec në xhudo,  por, Zveçanit nuk po i ec në tenis 󾍇
Rogana në reuters, falë punës së trajnerit Zijadin Kryeziu  dhe atletëve. Bravo ju qoftë!!!... 
Bravo për Doruntinën edhe Shendin! Lum familjet që ju kanë. Vendi i tretë në mesin e 109 shteteve, me pothujase... 
Nga lotët e trishtimit nga lëndimi, deri te britma e triumfit!Nuk u ndal së besuari plot 12 vite, se një ditë... 
Gëzuar Fitër Bajramin!  Shëndet e bereqet, gjithmonë në shtëpitë tuaja!
Shkojmë me një kungull 󾰀󾌰
Përshkruaje vet si të duash.....unë po i gëzohem momentit!Ti Shqipëri më jep nder!
Sa shumë do të doja të shkruaja për një rezultat tjetër, por me atë që treguat në fushën e lojës  bëtë që... 
Ishte ai (përsëri ai) që morri përsipër goditjen e fundit dhe i solli të 11-en Real Madridit.RONALDO
Në konakun e Kadaresë.
Dyshja që do pushtojë botën e e futbollit!... 
Jetojmë në kohën, kur kryeministri i Shqipërisë, Kosovës dhe Maqedonisë, është shqiptar!Ah sa bukur ah...!
Tri fotografi për ditëlindjen e tretë
Fiton, barazon apo humb gjithmonë krenar me kombëtaren!Të gjithë ata që sot kritikojnë, dje mburreshin kur... 
CR7 i madh, jo vetëm në fushë! 
....tregolshi i rradhës...fillimi i mbarë i Ligës së kampionëve. 
Shpresa për kualifikim nuk shuhet...! Francë rrugës jemi.
Edhe një kroat në Real Madrid 
Copy&amp;Paste në praktikë! :) 
James 10 - sikur edhe numri që e mban! 
Nëse e keni harruar një nga asistuesit më të mirë, shiheni në pak sekonda.... 
Familja Kallaba, në festën e Bajramit! 
Atëherë kur muhabeti i mirë të bënë me harru që Iftari ka ardhë!Faleminderit! 
Pasi mbaruam klasën e II-të, me sukses të shkëlqyeshëm dhe sjellje shembullore! 
Aty ku shuhen (e zhduken) yjet francez- në Elbasan! Kombëtarja kuq e zi.
Urime të gjithë tifozëve të Juventusit.Jam me Juve(ntusin) në Berlin! 
Urime të gjithë tifozëve të Juventusit! Ta presim takimin në Bernabeu! 
Cigarja që flet shumë! :) 
Votojeni këtë djalin le të shkon me e pa finalen e ligës së kampionëve 
Sapo pranova një sms nga një studente e stmatologjisë:  "Bro it's over...e kryta vitin e katert =)) ",- që... 
Bora e Prillit në Prishtinë! 
300 gola në 287 ndeshje për Real Madridin! 
Ndihem shumë mirë, kur jam i rrethuar me njerëz të mirë si Ju. Faleminderit për kohën edhe urimet Tuaja!I feel... 
Iku edhe një vit....
Danilo Luiz da Silva - përforcimi më i ri i Real Madrid-it 
Juventus si në ditët më të mira! 
113 fakte për 113 vjetorin e klubit! 
Me një këmbë në çerekfinale! 
Askush nuk do të besonte (as këngëtari vet) që kjo këngë e viteve 90-ta, edhe sot do të ishte shumë aktuale.... 
Askush nuk do të besonte (as këngëtari vet) që kjo këngë e viteve 90-ta, edhe sot do të ishte shumë aktuale.... 
E tmerrshme, një pyetje në kuizin e radio Kosovës: Me sa vjet burgim u dënua XX personi në Kosovë?!!Hajde gazetari hajde?!!!!
10 golat më të bukur nga 61 gjithësej, të shënuar nga Ronaldo në 2014! 
Rogaçica, në ndrrimin e vitit, 31Dhejtor 2014 01 Janar 2015!
Zhol me gur n'Paris të vogël!
Bardhi në ditëlindjen e dytë!
Urime ditëlindjen e 7-të, më i shtrenjti jonë- Fllad!
Rrugës për në Hungari...pa viza... 
Ronaldo shënon 3 gola në fitoren e 18-të, me rradhë të Real Madridit-duke u bë lojtari me më së shumti "het-trik"... 
Një kujtim për kryetarin Rugova, në ditën e lindjes! 
Shqiptarë, kudo që të ndodheni, urime festa e flamurit!
Ronaldo shënon përsëri në fitoren e 15 me rradhë të Real Madridit. 
Nëse ndonjëherë, mblidhet kongresi i gjuhës shqipe, më së shumti punë do të ketë për definicionin e fjalës- tradhtar!
===