Nisen sot në Itali, Turqi,  Austri, Hungari, Spanjë, Kanada dhe Çeki dërgesat me  tekste shkollore për mësimin e gj… 
Nisen sot në Greqi, Gjermani, Zvicër dhe Belgjikë dërgesat e para me  tekste shkollore për mësimin e gjuhës shqipe… 
Vijon puna për dërgimin e teksteve mësimore për shkollat shqipe në diasporë. Qendra e Botimeve për Diasporën, për t… 
Botimi i parë i revistës “Albania” doli në qarkullim më 25 mars të vitit 1897, në Bruksel, Në këtë revistë, themelu… 
Studiuesja veneciane Lucia Nadin tregon raportet e veçanta me Shqipërinë dhe rëndësinë e studimeve që ndriçojnë per… 
Në datat 2-8 shtator 1909 u zhvillua Kongresi Kombëtar i Elbasanit, një mbledhje me karakter mbarëshqiptar që mori… 
129 vjet më parë, më 2 shtator 1892, lindi në Shkodër Lazër Shantoja, prift dioqezan, publicist, përkthyes i Gëtes,… 
105 vjet më parë, më datë 1 shtator të vitit 1916 në Shkodër, u themelua dhe filloi veprimtarinë e saj, Komisia Let… 
133 vjet më parë, më 1 shtator 1888 në Prishtinë, lindi Ahmet Gashi, gjeograf dhe historian shqiptar, profesor, aut… 
“Librat e jetës sime”, një intervistë interesante lidhur me vendin që zënë librat në jetën e tij dhënë nga autori V… 
Autori Rudolf Marku botohet në Amerikë nga “Mundus Artium Press”. Përzgjedhur e përkthyer prej vetë autorit, vëllim… 
Botimi i “Eposit të Kreshnikëve” në Harvard në një intervistë të Dr. Zymer Neziri, i cili rrëfen mbi punën e gjysmë… 
Një shkrim në lidhje me udhëtimin e profesorit francez Jean Brunhes në Shqipëri dhe takimet (bisedat) e tij me Faik… 
72 vjet më parë, më 30 gusht të vitit  1949, u nda nga jeta Sevasti Qiriazi-Dako, mësuesja,  veprimtarja, atdhetarj… 
Numrin e radhës të "Newsletter e Diasporës" mund ta lexoni të plotë këtu:  
Qendra Kulturore Shqiptaro-Amerikane në Riverdale të SHBA-së rikujton prindërit që të regjistrojnë fëmijët për viti… 
Shqiptarët në Finlandë janë një komunitet aktiv, që përfshihet në organizime kulturore, takime dhe menaxhimin e shk… 
Foto Dite/ Anjezë Gonxhe Bojaxhiu - Nënë Tereza dhe At Zef Pllumi. Dy figura historike që me fjalën e veprën e tyre… 
Më 28 gusht 1900 u nda nga jeta gjuhëtari gjerman, studiuesi i gjuhëve indoevropiane Gustav Meyer, një nga albanolo… 
Më 28 gusht, 1942 lindi në Gjakovë të Kosovës, Ali Podrimja, një ndër poetët më të dashur e përfaqësues të poezisë… 
Kursi i gjuhës shqipe në Padova të Italisë nis regjistrimin për fillimin e vitit të ri shkollor 2021-2022.… 
“Historia/ Rumania, streha dhe djepi i nacionalizmit shqiptar”, një shkrim mbi historinë  e lidhjeve kulturore dhe… 
Shkolla Shqipe “Scanderbeg” në Parma të Italisë, rihap dyert për nxënësit e saj, për të trembëdhjetin vit radhazi.… 
111 vjet më parë, më 26 gusht të vitit 1910, lindi në Shkup Anjezë Gonxhe Bojaxhiu, e njohur më vonë si Nënë Tereza… 
83 vjet më parë, më 26 gusht 1938, u nda jeta poeti dhe prozatori i dashur shqiptar i viteve '30 Millosh Gjergj Nik… 
“Elitis në shqip dhe disa probleme të përkthimit të poezisë së tij”, një shkrim mbi çështjet e përkthimit poetik, n… 
Shkolla Shqipe ''Naim Frashëri'', në qytetin e Patrës të Greqisë, lajmëron fillimin e vitit të ri shkollor 2021-202… 
“Shqiptarët në Australi”, një historik i shkurtër rreth mërgimit të shqiptarëve në Australinë e largët, sjellë nga… 
Qendra e Botimeve për Diasporën publikon falas online versionin anglisht të numrit të dytë të revistës letrare “Let… 
Një tjetër shkollë e gjuhës shqipe i shtohet rrjetit të shkollave shqipe në Diasporë, duke nisur nga data 25 gusht… 
Më 24 gusht të vitit 1913  doli numri i parë i gazetës “Përlindja e Shqipërisë”, gazetë, e cila mbështeti Qeverinë… 
Nis organizimi i një prej ngjarjeve më të rëndësishme vjetore në fushën e albanologjisë, Seminari Ndërkombëtar për… 
Më 23 gusht 1932 u nda nga jeta Marigo Posio, aktiviste e Rilindjes Kombëtare Shqiptare dhe Lëvizjes për Pavarësisë… 
Më 23 gusht 1912 lindi në Shën Petërsburg të Rusisë studiuesja e gjuhës shqipe, letërsisë dhe folklorit shqiptar, a… 
Diaspora shqiptare në Bullgari ka dhënë kontribut të çmuar për Rilindjen shqiptare, për zhvillimin e kulturës dhe t… 
35 vjet më parë, më 22 gusht të vitit 1986, u nda nga jeta në Çikago të SHBA-së, shkrimtari Bilal Xhaferri.… 
141 vjet më parë, më 22 gusht 1880, lindi Kolë Rrota, mësues, studiues atdhetar e veprimtar, i dekoruar në Vjenë, n… 
“Libër që bëhet urë kombesh”, një intervistë me autorin shqiptar me banim në SHBA, Adnan Mehmeti, me rastin e botim… 
Më 21 gusht 1924, Kongresi Arsimor i mbajtur në Tiranë, me nismën e mësuesve, themeloi “Lidhjen e Përgjithshme të A… 
“Rreth shtatë poezive apo poemës së parë shqipe për shtatë mëkate mortare të Gjon Buzukut”, një shkrim nga: prof. d… 
Foto dite/ Fotografi e vitit 1937 realizuar në Shkodër.Shkrimtarët shqiptarë që shenjuan botën e letrave shqipe: G… 
“Egnatia” ishte gazeta e parë shqiptare e botuar në Greqi. Gazeta e nisi udhëtimin e saj në prill të vitit 1993 në… 
Nis mësimdhënia për vitin shkollor 2021-2022 në Shkollën Shqipe Ostermundigen në Bern të Zvicrës.… 
SHBA/ Shkolla Shqipe “Alba Life” vizitohet nga këshilltari bashkiak në Nju-Jork të SHBA-së, Mark Gjonaj, i pari pol… 
Gazeta e përdyjavshme “Drita” (1901-1908) botohej në Sofje të Bullgarisë. Ishte një gazetë politike, shoqërore, kul… 
134 vjet më parë lindi në Vokopolë të Beratit Ferit Vokopola, politikan shqiptar, teolog, përkthyes, organizator i… 
Regjistri i mësuesve në Diasporë/ Rikujtesë për të gjithë mësuesit e gjuhës dhe kulturës shqiptare në Diasporë:Ap… 
Administrata Postare e Kombeve të Bashkuara (UN Stamps) nderon figurën e Shën Nënë Terezës, duke e vendosur në pull… 
Një foto e rrallë e Nënë Terezës në Oslo me rastin e marrjes së çmimit “Nobel”, më 10 dhjetor 1979.Në foto: Ipeshk… 
110 vjet më parë, më 17 gusht të vitit 1911, u nda nga jeta veprimtari i Rilindjes Kombëtare, publicisti e pedagogu… 
“Glasul Albaniei” (Zëri i Shqipërisë), revista politike, letrare dhe shkencore në gjuhën rumune kushtuar gjuhës, ku… 
Dramaturgu Jeton Neziraj ka lajmëruar themelimin e Teatrit Shqiptar të Diasporës, dega në Nju-Jork.… 
Revista albanologjike “Shejzat” u botua për herë të parë në vitin 1957 dhe u themelua nga Ernest Koliqi.… 
Delegatët e Kongresit Arsimor të Tiranës (gusht 1924), në mes Bajram Curri. 
Doli nga shtypi numri i ri i së përkohshmes “Hylli i Dritës”, e cila vjen te lexuesi me nji larmi shkrimesh dhe stu… 
151 vjet më parë, më 15 gusht 1870, në fshatin Reka e Epërme të Dibrës lindi Josif Bageri, arsimtar, poet dhe vepri… 
Musine Kokalari ishte një ndër shkrimtaret e para shqiptare, intelektuale dhe veprimtare politike e njohur. Një nga… 
Petro Nini Luarasi fotografuar me nxënësit e tij në Shkollën e Negovanit më 1909 dhe letra e tij e rrallë si drejtu… 
Numrin e radhës të "Newsletter e Diasporës" mund ta lexoni të plotë këtu:  
Më 14 gusht lindi Sterjo Spasse, romancier dhe tregimtar shqiptar. “Kryengritësit” (1983). Vdiq në Tiranë në vitin… 
“Nyjat në gjuhën shqipe: diakronia dhe sinkronia e një evolucioni tipologjik: prokliza binare dhe enkliza shquese”… 
Një vështrim mbi interpretimet e krijimtarisë së Gjergj Fishtës nga studiuesi e publicisti Frano Kulli.… 
41 vjet më parë, më 13 gusht 1980, u nda nga jeta Eqrem Çabej, arsimtar, gjuhëtar dhe albanolog shqiptar, një ndër… 
“Prozat poetike të Ernest Koliqit manifestojnë mjeshtërinë artistike në prozë të këtij autori, pikërisht për shkak… 
Në një rrëfim për gazetën “Dielli”, prof. Arben Prendi, shkrimtar e studiues për monografinë mbi prozën e Fatos Kon… 
“Nuk mund të flasësh për historinë e një populli pa marrë parasysh letërsinë dhe kulturën e tij”, një intervistë in… 
Lidhja e Krijuesve Shqiptarë në Mërgatë organizoi në Bibliotekën Kombëtare të Kosovës prezantimin e mbi 20 librave… 
Historia e emigrimit të autorit Gjekë Marinaj, poeti shqiptar i vlerësuar nga kritika ndërkombëtare, i cili jeton n… 
“Edukata e Re” ishte një revistë pedagogjike e përmuajshme që botohej në vitet ’30 të shekullit XX.Revista drejtoh… 
112 vjet më parë, më 10 gusht 1909, doli numri i parë i gazetës "Bashkim i Kombit" (1909), e përdyjavshme politike,… 
“Ipeshkvi Gjon Nikollë Kazazi, zbuluesi i parë i librit të parë shqip, “Meshari” dhe “Shënimet e Gjon Nikollë Kazaz… 
Revista “Mësuesi”, drejtuar nga Karl Gurakuqi, ishte një revistë didaktike në shërbim të mësimdhënies që përfshinte… 
“Hylli i Dritës” ka qenë e para revistë letrare, artistike, kulturore e studimore e botuar në Shqipëri, me program… 
Shkrimtari i njohur dhe drejtori i Programit Shqiptar Hiddai “Eddie” Bregu në Universitetin DePaul në Çikago, Gazme… 
Shoqëria e të Shtypurit të Shkronjavet Shqip në Stamboll – 1879, u bë gur themeli për botimin e teksteve shqip, si… 
108 vjet më parë, më 8 gusht 1913, lindi Vedat Kokona, shkrimtar, përkthyes dhe leksikolog shqiptar, i shekullit XX… 
570 vjet më parë (8 gusht 1451): Letër e rrallë autografe e Skënderbeut dërguar Bujarisë së Republikës së Sienës në… 
Shtypi shqiptar i viteve 1848-1939 në një studim francez të kohës botuar në revistën e Universitetit të Shkencave t… 
Një shkrim në lidhje me marrëdhënien speciale të Edith Durham me Shqipërinë dhe shqiptarët, botuar më 1912 në “La V… 
“Konstandini i vogëlith dhe kthimi i Odiseut”, nga Eqrem Çabej , botuar në “Hylli i Dritës”, nr. 2-3 më 1938.… 
Intelektuali dhe ideologu themelor i Rilindjes Kombëtare, Sami Frashëri në dhomën e tij, duke dhënë intervistë për… 
Numrin e 119-të të "Newsletter e Diasporës" mund ta lexoni të plotë këtu:  
113 vjet më parë, më 6 gusht 1908, lindi Eqrem Çabej, arsimtar, gjuhëtar dhe albanolog shqiptar, një ndër studiuesi… 
28 vjet më parë, më 6 gusht 1993, ndërroi jetë Esad Mekuli, poet e përkthyes i mirënjohur shqiptar ishte Kryetari i… 
Australi, thirrje shqiptarëve të regjistrohen me gjuhën shqipe. Shoqatat shqiptare në Australi bëjnë thirrje që gja… 
Gjon Nikollë Kazazi, i cili u nda nga jeta 269 vjet më parë në moshën 52-vjeçare, ishte klerik i njohur shqiptar i… 
Një intervistë dhe shkrim interesant me autorin dhe studiuesin Arshi Pipa, një prej penave më të rëndësishme të dia… 
Gazeta “Posta e Shqypnis” u themelua dhe u drejtua prej At Gjergj Fishtës në fillim të shekullit XX dhe u botua për… 
Shtypshkronja “Zoja e papërlyeme” konsiderohet si shtëpia më e vjetër botuese në Shqipëri. Ajo u krijua më 1870, në… 
Një lexim i poemës së Ndre Mjedës “Andrra e jetës” nga autori Sokol Zekaj.“Andrra e jetës është kryevepra e Mjedje… 
Një foto e rrallë e Parashqevi Qiriazit (1880-1970), veprimtare e Lëvizjes Kombëtare, Mësuese e Popullit dhe një nd… 
Më 3 gusht 1859 lindi në Shkodër Filip Shiroka, inxhinier, poet lirik dhe veprimtar i Rilindjes Kombëtare.… 
Ministri i Shtetit për Diasporën z. Pandeli Majko zhvilloi ditën e premte një takim me përfaqësuesit e Këshillit Ko… 
Një foto e rrallë e Shkollës Amerikane të Korçës, Shqipëri, rreth vitit 1930, shkolla e parë shqiptare për vasha dh… 
Prof. Gëzim Alpioni është specializuar në disa fusha akademike, përfshirë sociologjinë e fesë, nacionalizmin, famën… 
Revista Mësuesi, në vitin e gjashtë të botimit (1929), nr. 8-9-10, nën drejtimin e Karl Gurakuqit.… 
Më 1 gusht 1912 filloi të botohej gazeta “Atdheu” në Rumani ëjamshqiptar  
Shqipja në Zvicër/ Dr. Vaxhid Sejdiu: Gjuha e nënës është detyrim moral dhe kombëtar në diasporë… 
84 vite më parë ndërroi jetë Ndre Mjeda, prift, patriot, filolog, poet dhe aktivist i madh i Rilindjes Kombëtare Sh… 
“Visaret e Kombit, Fjalorth i ri, Fjalë të rralla të përdoruna në Veri të Shqipnis,” me autor Nikollë Gazulli, përm… 
Poeti Xhevdet Bajraj, i cili prej dy dekadash jeton ne Meksikë, do të jetë i ftuar sot në orën 14:15 në emisionin K… 
Mësuesja Mirjana Lukic në një intervistë për gazetën “Diaspora Shqiptare”, tregon për kujtimet e vendlindjes, profe… 
Numrin e radhës të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Foto dite/ Gjergj Fishta në Bibliotekën e Kuvendit, e themeluar në vitin 1875, ndër më të vjetrat në Shqipëri, e ci… 
Intervista/ Ervin Hatibi: Poezinë që më pëlqen e shkruaj vetë gjatë leximit 
Mësuesit e gjuhës shqipe në Diasporë takim në institucionet në Kosovë… 
“SHKÊNDILAT E PARA” (ABETÂR E SHTIM' I 'TÎ) është një abetare e vitit 1919.Abetarja është e shfletueshme këtu… 
Letërsia e shkrimtarëve shqiptarë në Greqi, shkrim i përkthyeses shqiptare në Greqi, Eleana Zhako.Këtë shkrim të s… 
Afërdita Hakaj, një drejtuese shqiptare në “Montessori Metropolitan School” 
Më 28 korrik të vitit 1920 lindi në Shkodër, Arshi Pipa. Ka qenë arsimtar, publicist, poet, gjuhëtar, kritik letrar… 
Epika gojore shqiptare tashmë edhe në Harvard. Ky ishte projekt i prof. Zymer Neziraj prej vitit 2002. Ky tekst për… 
Gjuha shqipe si domosdoshmëri: Rëndësia e të folurit në gjuhën amtareKa shumë arsye përse fëmijët e Diasporës duhe… 
Më 27 korrik 1919 Fan  Noli u emërua peshkop i Kishës Ortodokse Shqiptare në Amerikë, që tashmë ishte dioqezë e pav… 
Në numrin e dytë të revistës letrare “Letra nga Diaspora”,  pjesë e rubrikës “Letrat” është poetja shqiptare në Sue… 
Alban Nuredini, i cili jeton dhe punon aktualisht si mësues në Britani të Madhe sjell romanin e tij më të ri “Lost… 
Një grup shqiptarësh nga Mali i Zi që sot jetojnë në Nju-Jork kanë marrë një nismë për të mbledhur fonde për të rin… 
Shkrimtari shqiptar me banim në Londër, Rudolf Marku, sjell në numrin e njëqind  e dyzet të gazetës letrare-kulturo… 
Shkrimtari rumun, Livio Antonesei, vlerëson shkrimtarin Visar Zhiti dhe letërsinë shqipe. 
Shkolla “Alba Life” në shtator në mjediset e qendrës shqiptare “Jacobi Center” 
Përkujtojmë sot 91-vjetorin e ndarjes nga jeta të atdhetarit dhe patriotit Bajram Fehmi Topulli i njohur më së shum… 
“Tregime të moçme shqiptare” dhe revistën letrare “Letra nga Diaspora”, miratohet çmimi i shitjes dhe kategoritë që… 
Numrin 117-të të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Viti shkollor 2021-2022, miratohet vendimi për tekstet shkollore falas për DiasporënNë link-un e mëposhtëm mund të… 
Qendra e Botimeve për Diasporën publikon falas online numrin e dytë të revistës letrare “Letra nga Diaspora” Numri… 
Poetja, shkrimtarja dhe përkthyesja shqiptare Anna Kove mori pjesë në aktivitetin “Lexojmë shqip”, i cili u zhvillu… 
Dhimitër S.Shuteriqi u nda nga jeta më 22 korrik të vitit 2003. Ai u lind në Elbasan në një familje intelektuale, i… 
Londër/ Shkolla Shqipe “Ardhmëria” shpërndan deftesat për nxënësit… 
138 vite më parë u botua numri i parë i revistës “Flamuri Arbërit” Flamuri Arbërit” ishte një revistë e përmuajshm… 
Krijohet dega më e re e Vatrës në Ridgewood – Nju-JorkTakimi i themelimit të degës së re të Vatrës në Ridgewood u… 
Më 20 korrik 1997, në Uashington, SHBA, ndërroi jetë Dr. Arshi Pipa, arsimtari, publicisti, poeti, gjuhëtari, kriti… 
Itali/ Një udhëtim në vargjet e librit të Denata NdrecësAutorja shqiptare që jeton në Itali Denata Ndreca që do të… 
Më 19 korrik të vitit  1900, u lind Çiprian Nika. Ishte  frat françeskan, mësues dhe publicist shqiptar.  U lind në… 
Studiuesi shqiptar që jeton në Itali, z, Ardian Ndreca, i ftuar në një intervistë në emisionin “Portmanteau”, një e… 
Më 17 korrik u organizua në qytetin e Lezhës një mbrëmje poetike , e cila u përshëndet online nga shkrimtari shqipt… 
Në korrik të vitit 1927 doli për herë të parë Gazeta Shqiptare që shënoi dhe botimin për herë të parë të filialit t… 
Shkrimtarja shqiptare me banim në Belgjikë, Vilma Jahja, prentoi në  Bibliotekën Publike "Marin Barleti"në Shkodër… 
Studiuesi shqiptar anë Itali Ardian Ndreca ka marrë pjesë në konferencën shkencore jubilare “Papa Klementi XI dhe S… 
Gjermani / Mustafë Krasniqi, mësues i shkollës shqipe në Bavari të Gjermanisë në një rrëfim ekskluziv për gazetën “… 
U zhvillua sot një takim pune e drejtoreshës së QBD-së, znj. Mimoza Hysa dhe znj. Dorotea Kerni, drejtuese e Biblio… 
Numrin 116-të të "Newsletter e Diasporës" mund ta lexoni të plotë këtu:  
Më 16 korrik 1895 u botua numri i parë i gazetës "Shqiptari" në Bukuresht, Rumani, nga Bashkësia Shqiptare. Gazeta… 
Një shkrim mbi librin “Nënë më fol për ëndërrimtarët” të shkrimtari shqiptar që jeton prej disa vitesh në Zvicër, S… 
Shkrimtari shqiptar me banim në Itali, Durim Taçi, autor i mjaft veprave letrare në prozë, vlerësuar me çmime ndërk… 
Diplomimi i nxënësve të mësimit plotësues të gjuhë shqipe në Kantonin e Zyrihut 
Zvicër/ Shkolla Shqipe në Emmen të Kantonit të Luzern-it mbyll vitin shkollor 
Austri/ Kryetarja e Shoqatës së Mësuesve Shqiptarë “Naim Frashëri” në Vjenë të Austrisë, znj. Miradije Berishaj, në… 
Më 14 korrik, 1867 lindi Murat Toptani, atdhetar, nënshkrues i Deklaratës së Pavarësisë së Shqipërisë, poet dhe sku… 
Komisioni i Përbashkët i Shqipërisë dhe i Kosovës për Miratimin e Teksteve Mësimore për Diasporën zhvilloi mbledhje… 
Drejtoresha e Qendrës së Botimeve për Diasporën në takim me zv/ministren e Diasporës në Kosovë… 
148 vite më parë, më 13 korrik 1873, në fshatin Dardhë të Korçës u lind Sotir Peci. Veprimtaria patriotike e tij is… 
Një nga revistat e mirënjohura letrare dhe kulturore rumune, “România Literară”,  themeluar në vitin 1855, boton në… 
Më 12 korrik të vitit 1952 vdiq, Hafiz Ibrahim Dalliu, atdhetar, arsimtar, intelektual dhe veprimtar i çështjes kom… 
Si sot, më 12 korrik të vitit 1874 lindi në Janjevë të Kosovës At Shtjefën Gjeçovi, i pagëzuar me emrin Hilë, vepri… 
Mbi ribotimin e traskiptuar të fjalorit turqisht-turqisht të Sami Frashërit 
Më 11 korrik të vitit 1930 u nda nga jeta Andon Zako Çajupi, poet, dramaturg, atdhetar dhe veprimtar i Rilindjes Ko… 
Aplikacioni “Dhoma e Biznesit të Diasporës shqiptare”, zëri i biznesit në DiasporëPër më shumë kliko … 
Në numrin e njëqind e tridhjetë e tetë të gazetës së përjavshme letrare-kulturore Exlibris, shkrimtari shqiptar me… 
Shkrimtari shqiptaro-finlandez, Pajtim Statovci, sjell në gjuhën angleze romanin e tij të tretë “Bolla”. Ky roman u… 
Dhoma e Biznesit të Diasporës në bashkëpunim me Unionin e Sipërmarrësve të Rinj dhe me mbështetjen e FSHZHD-së orga… 
Zvicër / “Shkolla Shqipe” kërkon më shumë mësues të gjuhës shqipe… 
Ditën e shtunë, datë 10 korrik, shkrimtari shqiptar me banim në Nju-Jork, Ardian Vehbiu, do të marrë pjesë në festi… 
Më 9 korrik të vitit 1900 vdiq në Athinë, rilindësi i shquar shqiptar, Jani Vreto. Ishte shkrimtar, botues, figurë… 
Numrin e radhës të "Newsletter e Diasporës" " mund ta lexoni të plotë këtu:  
Në numrin e radhës të gazetës letrare “Exlibris”, vjen një shkrim mbi Poradecin dhe DeRadën.… 
Mësuesit shqiptarë në Diasporë, me misionin e tyre fisnik po kontribuojnë çdo ditë në mësimin e gjuhës shqipe dhe p… 
Nxënësit e mësimit plotësues të gjuhës shqipe në Schwamendingen të Zyrihut kanë vizituar Konsullatën e Republikës s… 
Gjermani/ Shkolla e mësimit plotësues të gjuhës shqipe në Düsseldorf, Neuss e Dormagen mbyll vitin shkollor 2020-20… 
Më 7 Korrik 1923 në gazetën "Dielli" Faik Konica përshkruan suksesin e madh që pati vënia në skenë e veprës së Shek… 
Itali/ Dy autorë shqiptarë në festivalin “Il Libro Possibile”… 
Promovohet botimi dygjuhësh në pesë gjuhë të huaja i “Tregimeve të moçme shqiptare” të Mitrush Kutelit… 
Greqi/ Shkolla e Gjuhës Shqipe në Katerini mbyll vitin shkollor… 
Shoqata “Shqiponja” në Reggio Emiglia të Italisë organizoi aktivitetin e përvitshëm me temë “Lidhja Shqiptare e Pri… 
Më 5 korrik 1987, në moshën 67-vjeçare u nda nga jeta Vexhi Buharaja, atdhetar, dijetar, poet, përkthyes, shkrimtar… 
Mbledhja e LAPSH-it të kantonit të Zyrihut me rastin e përmbylljes së vitit shkollor 2020-2021… 
Në numrin e saj të radhës gazeta letraro-kulturore Exlibris sjell një intervistë të shkrimtarit, skenaristit,  përk… 
Rëndësia historike e “Shkollës së Shqiptarëve” në Venedik… 
Shkolla Shqipe “Kongresi i Manastirit” dhe shqiptarët në Çikago… 
I biri i Mitrush Kutelit dhuron botimet origjinale të të atit… 
Numrin e radhës të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Kujtojmë 31-vjetorin e eksodit të shqiptarëve Më 2 korrik të vitit 1990, mijëra shqiptarë hynë në territorin e am… 
Vazhdojnë aplikimet për Recensentë për Vlerësimin e Tekstit Mësimor për Mësimin Plotësues në Diasporë dhe Mërgatë,… 
Më 1 korrik 1646, në Leipzig të Gjermanisë, lindi Gottfried Wilhelm Leibniz, filozof dhe matematikan, i cili ndër t… 
Më 1 korrik të vitit 1643, u nda nga jeta Frang Bardhi, shkrimtar, leksikograf, folklorist dhe etnograf shqiptar.… 
Në revistën “Shkëndija”, themeluar e drejtuar nga Ernest Koliqi, zhvillohet një ndër debatet më interesantë rreth p… 
Xhevdet Bajraj, shkrimtari shqiptar  që jeton prej 21 vitesh në Meksikë, flet për librin e tij të fundit “Me zemër… 
“Historia e Letërsisë Shqipe në Rumani, e Dr. Luan Topçiut, një Kryepunë”, është shprehur autori shqiptar me banim… 
“Historia e Letërsisë Shqipe në Rumani, e Dr. Luan Topçiut, një Kryepunë”, është shprehur autori shqiptar me banim… 
Dalin nga shtypi edhe 18 tituj të rinj të serisë klasikët dygjuhësh, seri e cila tashmë ofrohet e plotë edhe online… 
Austri, më 29 qershor 1920. Studentët shqiptarë në Vjenë, me kursimet e tyre, shtruan një darkë për nder të artisti… 
Më 29 qershor të vitit 1892 u nda nga jeta në Bejrut, atdhetari, poeti e rilindësi Pashko Vasa.… 
Më 29 qershor lindi në Vankuvër të Kanadasë albanologu, shkrimtari dhe përkthyesi i njohur gjerman Robert Elsie.… 
83 vjet më parë lindi prof. Dr. Emil Lafe, një ndër emrat më të rëndësishëm të gjuhësisë shqiptare, kryetar i  Shoq… 
Në mbyllje të vitit shkollor 2020-2021, shoqata e mësuesve shqiptarë “Naim Frashëri” në Austri, mbajti seminar pune… 
Një vështrim mbi romanin “Vera pa kthim” të Besnik Mustafaj nga Maklena Nika. 
Tregimi “Portreti” i shkrimtarit shqiptar në jeton dhe krijon në SHBA, Roland Gjoza, përcillet në rubrikën Bibliote… 
Greqi/ Kryebashkiaku i Rethimno në mbështetje të hapjes së klasave shqipNjë përfaqësi e komunitetit shqiptar në Re… 
Në numrin e njëqind e tridhjetë e gjashtë të gazetës letrare “Exlibris” përcillet një intervistë mjaft interesante… 
Drejtuesi i kurseve të gjuhës shqipe në Ilario në Kretë të Greqisë, z. Vangjel Halilaj, rrëfen nëpërmjet një interv… 
Numrin 113-të të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Mbahet edicioni i nëntë të festivalit mbarëkombëtar “Passaggi”, një ngjarje kulturore ndërkombëtare kushtuar librit… 
Francë/ Mbrëmje letrare dhe artistike shqiptare, prezantohen librat e Luan Ramës 
“Gjuha shqipe ndër shekuj”, mbahet në Prishtinë “Java e Albanologjisë”… 
Itali/ Denata Ndreca pjesë e “Passaggi Festival” në mbrëmjen kushtuar Dantes 
Në një intervistë të dhënë për Agjencinë Telegrafike Shqiptare, drejtoresha e Qendrës së Botimeve, znj. Mimoza Hysa… 
Ambasadorja shqiptare në Greqi: Mësimi i gjuhës shqipe, prioritet për ne 
Diaspora nuk njeh kufi, gjuha shqipe është një … 
Mësimi në Diasporë / Teksti i përbashkët, një vlerë morale dhe cilësi… 
Takimi i mësuesve në Diasporë, sfidat dhe problematikat e arsimit jashtë vendit 
Takimi i mësuesve në Diasporë, Majko: Jemi në fazën e miratimit të teksteve 
Intervistë e përkthyeses dhe kryetares së shoqatës “Martin Camaj”, Zuzana Finger, në gazetën e përjavshme letrare d… 
Vera Haliti shqiptarja që ndërtoi urë komunikimi për komunitetin shqiptar në Slloveni 
Një kontribut mbi shkrimin e muzikës shqiptare në histori, dhe konkretisht në fillimet e semiologjisë sipas sistemi… 
Një intervistë me poetin, shkrimtarin dhe studiuesin Gazmend Krasniqi, i cili flet për letërsinë dhe ndarjen e saj,… 
Shqipëria, në fillesat e  arsimit shqip kishte mjaft individë të nivelit europian e botëror. Në “Kisha katolike dhe… 
Shkolla Shqipe “Artur Lleshi” në Trento të Italisë merr pjesë në Festivalin Folklorik të Fëmijëve që organizohet në… 
Gazeta “Diaspora Shqiptare” sjell një historik të botimit të veprave shqiptare në Zarë të Kroacisë, me krijues të s… 
Shkolla Shqipe “Naim Frashëri” në Patra të Greqisë e mbyll vitin shkollor duke organizuar një ceremoni në terren të… 
Autori shqiptar me banim në Itali, Artur Spanjolli në shkrimin “Odiseja e një takimi me Kadarenë”, përshkruan  kont… 
Numrin e 112-të të "Newsletter e Diasporës” mund ta lexoni të plotë këtu:  
“Marlee`s Got Talent” (MGT) është një festival talentesh i fëmijëve shqiptarë të Torontos dhe më gjerë, që përfshin… 
Më 18 qershor të vitit 1904 u nda nga jeta Sami Frashëri, poliglot, shkencëtar, mendimtar enciklopedist dhe kontrib… 
Sot, në mjediset e Qendrës së Botimeve për Diasporën, drejtuar nga znj. Mimoza Hysa, u mbajt mbledhja e radhës e Kë… 
Nxënësit e mësimit të gjuhës shqipe në Goteborg të Suedisë kanë mbyllur vitin shkollor dhe  janë pajisur edhe me dë… 
Shkolla shqipe në Itali “Scanderberg Parma” ka mbyllur me sukses këtë vit shkollor me një ceremoni të thjeshtë, në… 
Më 22 qershor 2021, në orën 18:00, në selinë e  Federatës Panshqiptare  të Amerikës “VATRA” organizohet promovimi i… 
Në gazetën “The Roman Sunday Observer” më datë 24 gusht 1980 botohej shkrimi mbi gjuhën shqipe të trashëguar ndër s… 
Më 16 qershor 1832 lindi në Shkodër Kushe Mica, themeluesja e shkollës së parë për gratë dhe vajzat shqiptare.… 
Më 15 qershor 1864 lindi në qytetin e Shkodrës autori Ndoc Nikaj. Veprimtaria e tij shte fetare shkencore, historik… 
Në përfundim të vitit shkollor, nxënësit e klasave të mësimit shqip të Zagrebit dhe Velika Goricës morën pjesë në s… 
Revista tremujore kulturore-shkencore “Albanica” sjell tekste klasike dhe bashkëkohore, emra të shquar të historisë… 
Thirrje për Aplikim për Recensentë për Vlerësimin e Tekstit Mësimor për Mësimin Plotësues në Diasporë dhe Mërgatë,… 
"Shkolla shqipe në kantonin e St.Gallen, vatër e bashkimit kombëtar" është titulli i librit të mësuesit dhe veprimt… 
Një intervistë me përkthyesin Aristotel Spiro mbi njohjen dhe përkthimin e letërsisë shqipe në gjuhën greke dhe kom… 
Shoqëria kulturore artistike ”Teuta” në Lozanë të Zvicrës promovon kulturën, gjuhën,  identitetin dhe vlerat shqipt… 
Greqi/ Nisin regjistrimet për mësimin e gjuhës shqipe në Rethimno.… 
Shkolla e Gjuhës Shqipe “Besa” në Romë mbyll vitin shkollor 2020-2021… 
Mësuesit shqiptarë në Diasporë, me misionin e tyre fisnik po kontribuojnë çdo ditë në mësimin e gjuhës shqipe dhe p… 
Një intervistë e shkrimtarit shqiptar në Spanjë, Bashkim Shehu, në numrin e njëqind e tridhjetë e tre të gazetës le… 
Të diplomuarat në klasën e Sevasti Qiriazit në Kolegjin Amerikan të Vajzave në Stamboll.  
Një festë për mbylljen e vitit mësimor në shkollën “Gjuha Jonë” në Filadelfia 
Doli numri i dytë (verë 2021) në letër i “Revista Letrare” me krijimtari të pabotuar të autorëve shqiptarë brenda d… 
Numrin 111-të të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Belgjikë/ Shkolla shqipe “Faik Konica” në Namur mbyll vitin shkollor… 
Shkolla e Gjuhës Shqipe në Ostermundigen Bern në Zvicër përfundon vitin shkollor dhe u shpërndan dëftesat nxënësve… 
Shkolla shqipe në Nju-Xhersi djep i ruajtjes së kulturës shqiptare… 
Komisioni Shqipëri-Kosovë/ Ja kur nis aplikimi për Tekstet Mësimore të Diasporës 
Shkrimtari shqiptar që jeton prej vitesh në Paris, aty ku edhe u magjepse me haikun Ndonëse nuk është vëllimi i par… 
Shkrimtari dhe studiuesi shqiptar në Itali, Ardian Ndreca, sjell kontribitin e tij në vëllim “La teologia politica… 
U zhvillua sot në ambientet e Kryeministrisë një takim i rëndësishëm pune për unifikimin e politikave të mësimdhëni… 
Itali/ Shkolla Shqipe “Mësonjëtoria” mbyll vitin shkollorNxënësit e shkollës shqipe “Mësonjëtoria” në Breshia-Ital… 
Gruaja intelektuale “Book lovers” është grupi më i ri i krijuar në Londër të Britanisë së Madhe nga gratë shqiptare… 
Zhvillohet Takimi i Juristëve në DiasporëSot u zhvillua takimi me profesionistët shqiptarë të Diasporës në fushën… 
Për herë të parë nxënësit që ndjekin kurset e mësimit plotësues të gjuhës shqipe dhe japin provimin për certifikimi… 
“Merr një varg dhe eja” kurorëzohet në Athinë ëjamshqiptar… 
Ambasada shqiptare në Bernë shpërndau çmimet e fituesve të konkursit të çelur me rastin e 1 qershorit, Ditën e fëmi… 
Numrin e 110-të të "Newsletter e Diasporës" mund ta lexoni të plotë këtu:  
Gazetari dhe mësuesi shqiptar më banim në Suedi, Gerti Xhaja në një intervistë për “Diaspora Shqiptare” rrëfen mbi… 
Historiani i madh rumun me origjinë shqiptare, Nikolla Jorga,  zbuloi më 1915 në bibliotekën Laurentiana të Firence… 
Gazeta franceze “La Vie heureuse” më 1912 botoi një shkrim në lidhje me marrëdhënien veçantë të znj. Edith Durham m… 
“Jeta ime âsht nji luftë për gegnishten, një luftë për mbijetesën, frymën e qenies..."Një vështrim mbi gegnishten… 
Mësimi i gjuhës shqipe në Shkollën Shqipe për Kitchener dhe Waterloo të Kanadasë që quhet “Shqiponjat tona”, përmes… 
Shkolla shqipe Ostermundingen në Bern të Zvicrës zgjodhi një mënyrë të veçantë për festimin e ditës së fëmijëve. Nj… 
Mësuesit shqiptarë në Diasporë kontribuojnë në mësimin e gjuhës shqipe dhe përhapjen e kulturës shqiptare te brezat… 
QBD/ “Tregime të moçme shqiptare”, falas online botimi dygjuhësh shqip-anglishtPër ta s… 
Akademia e Shkencave e Shqipërisë në kuadrin e bashkëpunimit me Akademinë e Shkencave dhe të Arteve të Kosovës ka b… 
Fëmijët shqiptarë të shkollës “EPAL Tavroniti” në Hania të Greqisë, festuan Ditën e Fëmijëve me një program të  lar… 
Itali/ Nxënësit e shkollës shqipe “Scanderbeg Parma” për mbylljen e vitit shkollor punuan me tekstin dygjuhësh shqi… 
Prof. Jani Thomai: Sfida kryesore, ruajtja dhe mbrojtja e gjuhës sonë amtare, si tipar kryesor i kombit… 
Pas “Gjeneralit të Ushtrisë së vdekur” tashmë në gjuhën turke vjen dhe libri tjetër i të Ismail Kadaresë “Kronikë n… 
LAPSH, Lidhja e Arsimtarëve dhe Prindërve Shqiptarë “Naim Frashëri” në Kantonin St. Gallen, Zvicër organizon promov… 
Botime në Diasporë/ “L’Albania Letteraria” (Shqipëria letrare) ishte një revistë e përdyjavshme, e cila botohej në… 
Shkolla e Gjuhës Shqipe në Sierre të kantonit Valis në Zvicër ofron mësim plotësues të gjuhës shqipe çdo të mërkurë… 
“Shkolla Shqipe - Zvicër 2021”, një konkurs për fëmijët shqiptarë.… 
Më 1 qershor të vitit 1839 lindi Abdyl Frashëri, ideolog i Lidhjes Shqiptare të Prizrenit, atdhetar, ushtarak, depu… 
Shkrimtarë në Diasporë/ Flurans Ilia lindi në Berat më 1971 dhe jeton në Montréal të Kanadasë. Ka botuar vepra në p… 
Shkolla shqipe “Children of the Eagle” në Nju-Jork të SHBA-së mbyll vitin shkollor 2020-2021 në ambientet e “Federa… 
Kanada, një orë mësimi me ambasadorin shqiptar në shkollën shqipe në Oakville në përmbyllje të vitit shkollor.… 
Ornela Vorpsi (3 gusht 1968, Tiranë) është një fotografe dhe shkrimtare shqiptare që shkruan në gjuhën italiane dhe… 
Shqipëria dhe Shqiptarët në Arkivin Osman të Stambollit: Udhërrëfyesit në Gjuhën Shqipe 
Në datat 18-25 qershor në Fano të Italisë do të rikthehet edicioni i nëntë i festivalit “Passagi”, ngjarja kombëtar… 
Një vështrim mbi tekstet letrare/joletrare, gjuhësore/studimore të Martin Camaj, nga studiuesi Behar Gjoka në numri… 
Më 29 maj të vitit 1917 vdiq Dom Nikollë Kaçorri, atdhetar, klerik, nënshkrues i aktit të Pavarësisë.  Kaçorri lind… 
Ndër 17 anëtarët e rinj të pranuar rishtas në Akademinë e Shkencave të Shqipërisë janë edhe dy emra mjaft të njohur… 
Kënga me tekst italisht të poetes shqiptare në Itali, Irma Kurti,  në të gjitha platformat muzikore… 
Numrin e radhës të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Studiuesi dhe shkrimtari shqiptar me banim në Itali, Ardian Ndreca, do të marrë pjesë sot në një bisedë të lirë org… 
Shkrimtari shqiptar në Francë Ismail Kadare ka marrë titullin “Qytetar Nderi”i i qytetit të Fierit.… 
Vepra e panjohur e Naim Frashërit"Kiraat risalesi" është vepra e panjohur nga studiuesit, e botuar më 1895 në Stam… 
Lori Lako me performancë ligjëruese “rikthen”Lasgush Poradecin në banesën e tij në Graz 
Nxënësit e shkollës në Firmo “në kërkim” të Skënderbeut ëjamshqiptar… 
Shkrimtarja shqiptare me banim më Itali, Anilda Ibrahimi,  do të jetë e ftuar sot për një intervistë në emisionin A… 
Botime në Diasporë/ RASSEGNA ITALO-ALBANESE botohej në Napoli më 1919-ën 
Greqi/ Nxënësit Shqiptar rikthehen në klasat e mësimit të gjuhës shqipe… 
Kërkohet unifikim i shkollave shqipe në Diasporë ëjamshqiptar… 
Takimi i radhës së Këshillit Koordinues i Arsimtarëve në Diasporë (KKAD) ëjamshqiptar… 
Botime në Diasporë/ “KALENDARI AFREDITA”, botohej në Stamboll më 1910-ën… 
Më 25 maj të vitit 1846 lindi në Frashër të Përmetit Naim Frashëri poeti më i madh i Rilindjes Kombëtare Shqiptare,… 
QBD 3Ramiz Gjini u lind në Kastriot të Dibrës më 1961. Më 1992 përfundoi studimet në Akademinë e Arteve të Bukura… 
Zvicër / Fillojnë mësimet në shkollën shqipe në Lozanë. Shkolla shqipe e mësimit plotësues në qytetin e Lozanës ësh… 
Viti 1935/Fan Noli me shqiptarët e korit të katedrales “Shën Gjergji” në Boston 
“Si u fut gjuha shqipe në shkolla gjatë pushtimit turk”, një shkrim i botuar nga Gazeta “Diaspora shqiptare”.… 
Autorë në Diasporë/ Rando Devole, autor i disa librave, jeton në Romë. Zhvillon veprimtari kërkimore me institute t… 
Filluan mësimet në gjuhën shqipe, në Shkollën Shqipe në Rorschacherberg, të Kantonin  e St. Gallen-it në Zvicër. Kj… 
Lidhja e Arsimtarëve dhe Prindërve Shqiptarë (LAPSH) në Bavari të Gjermanisë, realizoi takimin e parë të vitit me p… 
Në Zvicër u hap shkolla shqipe e 49-të. Mësuesit dhe veprimtarët e Shkollës Shqipe në Zvicër” hapën dyert e Shkollë… 
Më 22 maj të vitit 1986 u nda nga jeta Mustafa Greblleshi, poet, shkrimtar dhe përkthyes.  
Pajtim i plotë i institucioneve të Kosovës dhe Shqipërisë për mësimin plotësues në gjuhën shqipe në diasporë… 
Mësuesja shqiptare me banim në Gjermani, znj. Mimoza Leka bën një prezantim të situatës së mësimdhënies së gjuhës s… 
Më 21 maj të vitit 1928 vdiq Dervish Hima atdhetar, publicist e diplomat shqiptar. 
Më 20 maj 2019, u nda nga jeta Hans-Joachim Lanksch, ambasadori dhe dashamirësi i rrallë të gjuhës, poezisë e kultu… 
Më 20 maj të vitit 1903 lindi në Shkodër, Ernest Koliqi, mësues, poet, romancier, eseist, përkthyes, gazetar, drama… 
“Extra time”, romani i shkruar nga autori shqiptar me banim në Itali Durim Taçi në mbresat e poetit dhe autorit të… 
“Zëri i Shqipërisë” ishte e përkohshme politike, shoqërore, kulturore e botohej shqip, frëngjisht, anglisht me krye… 
Darien Levani (Fratar 1982) është një avokat dhe shkrimtar shqiptar që jeton në Itali. Është themelues i blogut kol… 
Botime në Diasporë/ “Albania” ishte një gazetë, e cila nisi të botohej në Romë në shtator të vitit 1901.Në të traj… 
Haki Stërmilli, shkrimtar i njohur, atdhetar dhe demokrat lindi në Dibër të Madhe në një familje atdhetare.… 
Sot në dyvjetorin e saj, Qendra e Botimeve për Diasporën, drejtuar nga znj. Mimoza Hysa mirëpriti Ministrin e Shtet… 
Qendra e Botimeve për Diasporën - Katalogu i parë i botimeve, mbi 50 titujMëso më shumë  
Qendra e Botimeve për Diasporën në 2 vjet ëjamshqiptar… 
2 vjet Qendra e Botimeve për Diasporën ëjamshqiptar 
Mësuesit shqiptarë në Diasporë, me misionin e tyre fisnik po kontribuojnë çdo ditë në mësimin e gjuhës shqipe dhe p… 
Me rastin e 105 vjetorit të lindjes përkujtojmë Jusuf Vrionin, juristin, politologun, shkrimtarin dhe përkthyesin b… 
Botime Në Diasporë/ Revista “STUDENTI” Botohej në SHBA Më 1920-ën… 
Dramë ku lëvizin legjendat dhe shekujt ëjamshqiptar  
Numrin 107-të të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Shkrimtari Henrik S.G., emri i të cilit është Henrik Gjoka, pas daljes nga burgu në vitin 1991, jeton e shkruan në… 
Botime në Diasporë/ 1915, botohej në Lausanne “L’ALBANIE”… 
Irma Kurti është poete, shkrimtare, autore e teksteve të këngëve, gazetare dhe përkthyese. Ka filluar të shkruajë e… 
78 vjet që nga koha kur radioja “Zëri i Amerikës” foli shqip për herë të parë, duke u bërë ndërmjetës me botën për… 
Gazeta “Posta e Shqypnis” u themelua dhe u drejtua prej At Gjergj Fishtës në fillim të shekullit XX dhe u botua për… 
Publikohet numri i 11 i librit “Thesari Kombëtar i Mërgatës Shqiptare në Suedi” 
Më 13 maj të vitit 1842  lindi Mehmet Ali Pashë Vrioni, atdhetar, politikan, diplomat shqiptar e nënkryetar i Lidhj… 
Profil i shkrimtarit Sabri HamitiNë maj të vitit 1950 lindi në Dumnicë, Podujevë, poeti, kritiku dhe interpretuesi… 
110 vjet nga lindja e themeluesit të Normales së Gjakovës, Zekeria Rexha… 
Më 12 maj të vitit 1920 lindi në Berat Vexhi Buharaja, atdhetar, dijetar, poet, përkthyes, shkrimtar, historian, st… 
Më 11 Maj 1771, lindi Dhaskalina Stavri Pinoti (Bubulina), gruaja që hyri në histori për trimërinë, mençurinë, buku… 
Francë/ Arta Seiti sjell librin mbi lirinë estetike “Maja nuk më kundërshton” 
Ndryshime në Urdhrin nr. 413, datë 26.07.2019, të MASR-së: “Për përcaktimin e rregullave për aplikim, procedurat, a… 
Më 10 maj 1897, gazetari, publicisti dhe aktivisti i njohur nga Korça, Visar Dodani filloi të botojë në Bukuresht g… 
Austri/ Mësuesit thirrje prindërve për të inkurajuar mësimin e shqipes fëmijëve 
Nisin kërkesat për sigurimin e teksteve shkollore në Diasporë për vitin shkollor 2021-2022… 
49 vjet më parë, më 9 maj 1972, ndërroi jetë studiuesi  folkloristi dhe orientalisti shqiptar Tahir Dizdari.… 
“Kur historia shkruhet nga ata që kanë bërë histori”, një ese nga autori Visar Zhiti, që është dhe parathënia e lib… 
Shoqata Kulturore “Plisat” është themeluar më 2013 në Dybendorf, kantoni i Zyrihut në Zvicër me qëllim për të lidhu… 
Në një intervistë për “Diaspora Shqiptare”, gazetari i njohur shqiptar me banim në Suedi, Diamanti Salihu, rrëfen m… 
Më 8 maj të vitit 2004 vdiq në San Marko të Kalifornisë, Tomor Zavalani, veprimtar patriot në shërbim të komuniteti… 
Histori/ Vala e parë e emigrimit të shqiptarëve në SHBA në fund të shekullit XIX dhe në fillim të shekullit XX.… 
Botime në Diasporë/ “Tregtia Shqiptare” ishte një revistë e përmuajshme në gjuhën shqipe dhe pjesërisht anglisht. N… 
Alexander Thomson (1820-1899), misionari protestant skocez, i njohur për dashurinë e tij për popullin shqiptar.… 
135 vjet më parë, më 6 maj 1886, u botua vepra “Bagëti e Bujqësi” e Naim Frashërit, e cila për herë të parë doli në… 
Nxënës të shkollës shqipe në Toronto të Kanadasë, në një fotografi të botuar në gazetën “Flamuri” të vitit 1979.Sh… 
Shkrimtari i njohur dhe Poeti Laureat Rudolf Marku sjell në vëmendje "Dhjetë këngët e Sibilave" të Pjetër Bogdanit… 
Jorgji (Babë Dudë) Karbunara  ishte mësues shqiptar, nënshkrues i Deklaratës së Pavarësisë së Shqipërisë.… 
Botime në Diasporë/ “Shqipëria në orën e Rilindjes” (L’albania nell’ora del Risorgimento) ishte një revistë politik… 
Më 4 maj të vitit 1931, lindi Jovan Cico Kosturi, rilindës dhe një ndër personalitetet e njohura dhe tejet të angaz… 
Historiku dhe veprimtaria e shkollës shqipe “Udha e shkronjave” në Huston, Teksas të SHBA-së a, prezantuar nga drej… 
Komuniteti shqiptar në Breshia, Itali numëron mbi 29 mijë vetë. Një intervistë e kryetarit të shoqatës shqiptare “K… 
Të gjithë numrat e plotë si dhe të gjithë artikujt e revistës “Shêjzat” mund të shkarkohen online prej faqes web të… 
Një orë e veçantë mësimi nga shkolla shqipe “Scanderberg” në Parma të Italisë, e cila ka zgjedhur një mënyrë ndrysh… 
Më 3 maj të vitit 1877, në Janinë, nën kryesinë e Abdyl bej Frashërit, u formua Komiteti i Janinës. Qëllimi i tij i… 
Shoqata “Forum Donne Indipendenti” në Itali i ka dhënë çmimin ”Donne d’Albania 2021”  artistes dhe mësueses së Shko… 
Foto dite/ Shkolla e Gjuhës Shqipe “Skanderbeg” në Parma të Italisë… 
Visar Zhiti, poet desident dhe ato vargje tronditëse për të ringjallur të birin. 
Në numrin e saj të njëqind e njëzet e tetë, gazeta letrare Exlibris sjell disa poezi të shkrimtarit shqiptar Roland… 
86 vite më parë, lindi shkrimtari Bilall Xhaferi. Më 30 gusht 1969 u arratis nga Shqipëria për në Greqi. Në vitin 1… 
Numrin e 106-të të "Newsletter e Diasporës " mund ta lexoni të plotë këtu:  
Zvicër/Suela Jorgaqi: Jam qytetare evropiane, me rrënjë të qëndrueshme shqiptare 
Qendra e Botimeve për Diasporën përgatit materialet didaktike për platformën digjitale “Mëso shqip”… 
===