 Votimi i juaj në Shqipëri nuk e ndryshon  rezultatin, ju disa që e keni pasaportën shqiptare nuk është… 
 Qëndrojmë përkrah partnerëve tanë në Ballkanin Perëndimor, siç i thashë edhe  95.000 doza të vaksinave të fin…
  Ju faleminderit, dhe respekt për gjuhën shqipe si gjuhë zyrtare në Maqedonin Veriore!
Dita e parë e punës për Biden!!Day one for President Biden!! 
  E keni dhi punën! Larg jeni ju politika e Kosovës me standarde për drejtësi e besa edhe për jetë normale! 
 Përhajër datëlindjen, i bafshē edhe  e lumtur me ata që ti i don...
 Si mjaltë je e ëmbël❤️
 A ka prokuror Kosova a jo?! Haptas me dal kështu e mos mu akuzu ata që nxitin vrasje si zt Koci e të tjerë… 
 Kurr jo, tu i pas plazhet në Shqipëri!
 Ky është "dud" as vet nuk e din ç'ka fletë, unë dyshoj që e ka shkel traktori
 Ani, përmisoja fjalorin...o Adriatikoo ai është deputet, kur nuk din shqip çka pritet prej tij me e nxje… 
 O mytne vehtën se na morët n'qafë o politikana...kush po ju voton juve!!! Ani se qështu shkojmi në EU! 
 Urrejtjen zëvendësojeni me dashuri, libri akoma mbetet i çmuar kuptohet derisa të lexohet!
 Ta shohim se si po e hjekin këtë vendim, pra qfarë arsyetimi tash qeveria Hoti 
 Shtoji pak vitet o dreq....any way Urime, jetofshe gjatë dhe e lumtur 
 Kryeminister Rama, nëse e ndërtoni një teatër modern si kur Stadiumin e futbollit duhet të ju themi, JU LUMTË!!!
 Nëse hapet kufiti -, pas dy ditë do vijë në Shqipëri, deri në Ksamil!
 Nuk është se shkova rastësisht, por shkova enkas ta realizoj këtë fotografi të pa parë më herët nga kjo përspektivë të Ur…
   Po rren rren rren rren rren a të kujtohet o Adriatikooo
 Kur nejti kryemistri i Britanisë së Madhe i izoluar, edhe ky mundet me nejt i izoluar në konvikt ose në sh… 
 Ju e keni sjellë standardin e lartë në poltikën kosovare, tash duhet mediumet me vazhdu më këtë sta… 
 E pse këtu nuk e ka thënë Kosovë-Serbi, por e ka cekur (Beograd-Prishtinë)?!A ka sdandard të dyfishtë komunikimi nga Lajqak!!!
 Bile këtë lajm është dashur me e postu JU gazetarët, e Pacolli!Respekt për Nënat që s'kan mundësi me u shëru jashtë Kosovës!!
===