 Gjëja e vetme me të cilën duhet të merremi dhe sigurisht Taulant Balla nuk pranon të bëjë, është vjedhja më e madhe e vo…
 Sot në Kavajë dhe Durrës pashë vendosmërinë e qytetarëve për ndryshim.Nëse doni ndryshimin - votoni 9. Nëse doni një t…
 Për të sjellë ndryshimin dhe për të përmirësuar jetën e të gjithë shqiptarëve, na duhet të anëtarësohemi në Bashkimin E…
 I habitshëm nervozizmi i Rames. Unë, PD dhe shqiptarët e kemi përcaktuar rrugën tonë që në dhjetorin ‘90: ajo është rru…
 Koha e Ramës ka ikur dhe ai e ka kuptuar këtë. E vetmja gjë që i ka mbetur është të kërcënojë dhe të ndërsejë miqtë e t…
 Kohës tënde i ka ardhur fundi, Rama. Ka ardhur çasti të ndryshojmë. ëriaFITON ✌️
 Ne u bashkuam që të sigurojmë ndryshimin në Shqipëri dhe atë ndryshim do ta sjellim ne: shpresa të reja për të gjithë dh…
 Edi Ramën e ka kapur paniku, sepse ka kuptuar që sot ka nisur fundi i tij. Rama e kupton që më 25 prill do të shkojë në…
 Rama qetësohu. Ky është vetëm fillimi. E dimë se ti nuk je mësuar të përballesh kurrë me angazhime serioze që do të mba…
 Gjuha e urrejtjes dhe përpjekjet e dëshpëruara të Edi Ramës për të  fajësuar PD për 7 vitet e dështimit, premtimeve bosh…
 Çdo shqiptar është tronditur nga ekzekutimi i Klodjan Rashës në derën e shtëpisë. Dhimbja dhe zemërimi na ka përfshirë t…
 Si ministër i Transportit, kam ndërtuar Rrugën e Kombit. Edi Rama i vuri traun. Unë do ta heq traun në Rrugën e Kombit.…
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
 Indeksi i Demokracisë i  e klasifikon Shqipërinë  regjim hibrid një hap larg autoritarizmit, për shkak të munges…
 Videomesazh "Megjithë ndasitë tona, në orë nevoje, ne jemi një komb i bashkuar. Shqipëria e vërtetë është ajo njerëzve m…
 Sokol Olldashi do të ishte krenar të shikonte se si djali i tij i madh Glauku po ecën ne gjurmët e tij. Jam i bindur se…
 Ne mbështesim 100% qëndrimet e liderëve të BE. Shqipëria e meriton hapjen e negociatave. Shqipëria meriton më të mirën.…
===