Sot Kisha feston San Pietro Armengaudio, i cili kaloi nga kriminel në një shëlbues të skllevërve. 
Ajo çka më gëzon më së shumti, është kur shoh familje të bashkuara! Lus Zotin çdo ditë, ti shoh gjithmonë ashtu!
 Jezus më ndihmo, që mos të të fyej as me mendime!
Jezus më ndihmo, që mos të të fyej as me mendime!
Ndërkohë që njeriu sheh aparencën, Zoti sheh zemrën.
“Të lumët ju kur t’ju shajnë e t’ju salvojnë dhe kur, për shkak timin, t’i thonë të gjitha të zezat kundër jush, po… 
Lum kush nigjon Hyjin! Të mësuar në ëndërr prej Hyjit të mos ktheheshin te Herodi, u kthyen një rruge tjetër në… 
Nga larg duam gjithë botën, por tamam, tamam janë ata që janë brenda mureve të shtëpisë tonë, që kemi mundësinë t’u… 
“Do ta bekoj Zotin dhe Emrin e Tij të Shenjtë! Do ta bekoj Zotin, që jetën ma dhuroi!” - Antif. 
Të shfrytëzosh tjetrin apo edhe rastin është poshtërsi. Zot na ruaj (gjithmonë) nga një mëkat i tillë i tmerrshëm!
 Reflektim mbi ungjillin e së dielës (Mt 21, 28-32)"Márre nuk është me ndryshu, márre është me qëndru n't'keqen!" ©fk 
“Mjerë unë, nëse dal prej rrugës së Hyjit!” - Ekstrakt nga Ungj.
“Ligji Yt o Zot është në zemrën time!”- Antif.QËLLIMI I JETËS TIME ASHT QIELLI!
Corpus Domini - Gëzuar festën Korpit dhe Gjakut të Krishtit! 
Sa punë të mëdha e mrekulli, që ka ba shenjti Shën’Koll...Gëzuar e përshumvjet! U nimoftë Shën’Kolli! 
 Bordi i Presidencës së Këshillit Ndërfetar të Shqipërisë ka zhvilluar sot një mbledhje online me Kryeministrin e Shqipërisë…
“Familja është një oazë dashurie, ku Zoti gjen strehë dhe çlodhje.” (D. Zefi)… 
Si jeta ime, ashtu edhe vdekja të lavdërofshin vetëm Ty o Zot! 
Emri Yt është i Madh o Zot! Qoftë i bekum Zoti dhe emri i Tij i Shenjtë! Bekoji o Zot edhe ata që janë ndihmë e ma… 
Për mua janë shumë të shenjtë, ata persona, të cilët dinë me i vlerësu virtytet, me respektu e nderu të tjerët! Mirënjohje e thellë për ta!
Kam qenë gjithmonë e vetëdijshme se të jetuarit me ndershmëri, nuk është pa pasoja, e nëse Zoti dëshiron që ky Kelk… 
Krishti në Ungjill na mëson: “Bekojini “armiqtë” tuaj e lutuni për ta!” Ndërsa unë them, një njeri që beson ngultas… 
“Çfarë mbjell, korr! Nëse mbjell besim, ke çfarë të korrësh; në të kundërt...!!”- Meditim i mëngjesit
Paçim sa më shumë Ipeshkevinj e Meshtarë të shenjtë! 
Nga Veprat e Apostujve - “Por Pjetri dhe Gjoni, duke iu përgjigjur atyre, thanë: Gjykoni ju, nëse është e drejtë p… 
===