 Lulzim Basha prish gjumin e del në zyrë po avazin e ka njësoj. I trukuar si personazh i serialit "Sopranos" i kërkon KM të p…
 Hashim Thaçi ka gjjithë mbështetjen e solidaritetin e Shqipërisë në këtë betejë të radhës për Kosovën dhe për drejtësinë e p…
 Trishtim e keqardhje për goditjen nga tërmeti në Turqi e Greqi dhe lutje për viktimat e solidaritet vëllazëror me familjet e…
 Ilir ti s'ke asnjë kompetencë të fusësh hundët në punët e ekspertëve për menaxhimin e situatës mjekësore! Si fillim mos dil…
 Plani i menaxhimit tëtrafikut në nyjen e SHESHIT SHQIPONJA 
 Sulmi skandaloz i Ilir Metës mbi Alba Malltezin, bashkëshorten e Carlo Bollinos, është një tjetër zhytje e presidentit të re…
 Marsela dhe Vitmari, dy artistë e njerëz të mrekullueshëm ❤️, që gjithçka e kanë arritur vetë, ndaj janë përherë gati të k…
 Ilir, ti duhet ta kuptosh se nuk ka pasur para teje dhe nuk do ketë pas teje, as principatë, as monarki, as republikë në bot…
 Për shkak të seancës së Kuvendit të Kosovës, u dakorduam me Kryeministrin Rama që mbledhjen e përbashkët të dy qeverive tona,…
 Intervista e Ambasadorit Donald Lu për Zërin e Amerikës | Ambasada e SHBA në Shqipëri:  
 Absurd interpretimi i Lulzim Bashës për qëndrimin e SHBA që nuk luajnë me Kushtetutën. Thirrja është për datën kushtetue…
 Lulëzim sot 3 ditë që pres vendin/orën për të nisur dialogun pa kushte! Gjejmë zgjidhje votojmë Vetingun shkojmë në zgjedhje…
 Lulëzim ta kam thënë kaherë, jam i gatshëm për dialog sa herë PD do dialog dhe për gjithçka, kudo e kurdo! Caktoje vetë vend…
 Në Ulqin me faktorët politikë shqiptarë të Malit të Zi ku po bëhet një progres i madh hapash konkretë në të mirë të komunite…
 E vajtueshme sjellja e PD me partnerët ndërkombëtarë.E dëshpëruar kyçja në Çadrën e Kampingut për t'i ikur Fshesës së Veting…
 Zoti Ivanov, gjuha shqipe s'është e armikut po e një populli shtetformues në Maqedoni. Pa shqiptarët nuk ka Maqedoni i dashu…
 Pas një dite të ngjeshur takimesh në Prishtinë, sonte në 21.00 me Presidentin Thaçi të ftuar në studion e Baton Haxhiut - Li…
 U rrokanis kokën shqiptarëve për ligjin e dekriminalizimit dhe e shqelmon ligjin me të parën në mbrojtje të problematikut të…
 Faleminderit Kolonja për besimin e madhUrime Ilia StefosSuperfitore+2101 vota (+727 në 2015) janë një inkurajim e detyrim…
  - Xhaçka numëron dështimet e Bashës "Ja pse nuk e beson dot më askush" 
===