 Bëjini të paguajnë dëmshpërblim për sjelljen dhe rembursim lekësh që natyrisht duhet ti kthehen taksapag… 
  Sepse po te kesh stufjuar Anglishten e kupton mjaft mirë që shprehja në biznes nuk shkruhet që t… 
 Mirëdita. Mund të më dergoni cmimin dhe më shumë foto. Faleminderit.
  Ilir, po ti përgjigjju komentit për Kosovën. A bën Kosova tregti me Serbin? A shiten mbi 80%… 
 Zoti Cuci, a nuk duhet të jenë marrëveshjet bilaterale me përfitim të përbashkët? Që të evitohet ky emig… 
  Përderisa në Shqipëri lejohen komisionere që I perkasin forcave politike,do ketë gjithmon… 
 Zoti Kryeministër, a keni ushtri ju? Vendosini në tr gjitha pikat dhe kontrolloni makinat. Kjo metoda ju… 
     Paske fjalor të pasur por...... E para sjetoj në Shqipë… 
   Ti je me syze, shoku xixa. Fotoshop I bukur. Shif mos gjen një foto për firmat piramidale të 1997.
    Sapunin për djath e hanë ata që ju duket vetja me të mirë dhe më lart se… 
    Fiks cdo fjalë. Është e çuditshme që kta që jetojnë në Shqipri solarin k… 
   Po ti paske prova mo shok. Po he behu trim dhe coja prokurorisë. Por para së të… 
 Në çdo vend të botës nëse don të dalësh në grevë duhet të japësh 1 muaj lajmërim. Nëse kontrata sta lejo… 
   Ja ke fut kot shoku. Nëpër botë si lejohet policëve të bëjnë Greva. Jo më ll… 
  Fiks shoku. Ne Angli forcave të policisë nuk ju lejohet të dalin be Grevë. Aeroportet duhet të… 
 Shqiptari komb I çuditshëm. Përgjigjet që jepen ktu tamam përgjigje me interes personal. Pse re I harrua… 
 Kot lodhen popullsia. Po te shohësh në mbarë botën të gjithë personalitetet dhe të pasurit sjsne trajtu… 
  Juve duhet te keni prova të forta të hidhni akuza të tilla ndaj Kryeministrit tonë apo jo… 
  për mirësjellje a ka mundësi tju përgjigjeni pyetjeve të qytetarëve që ju paguajnë rro… 
 për mirësjellje a ka mundësi tju përgjigjeni pyetjeve të qytetarëve që ju paguajnë rrogën dhe ju kanë… 
 Nese kto takime do sillnin anë pozitive për të dyja palët pse jo. Së pari Greqia duhet te dëmshpërblejë… 
 Çdo njeri është përgjegjës për veprimet e tij. Kto rrëmujat na kujtojnë 90-97 e kena perjetu kur kockat… 
  Janë me mijëra përgjegjës, por asnjë sdo të dënohet. Kjo është politika Shqiptare. Premtime… 
 Zoti KM, prindrit kan votu gjithmonë PS , megjithatë problemi ynë(Shqipetar)nuk jeni ju politikanët por… 
 Përndryshe si mund tju besojnë investitorët e huaj një shteti qe bën sehir ne ketë moment? Keni forcën e… 
 Kompania është private por shteti rregullatori dhe duhet ta ndjeki privatin per thyerje kontrate sepse k… 
 Po kaq keq është shteti Shqiptar sa mos te paguajë punonjësit e zanatit më të vështirë në botë? Një qeve… 
===