 Pse e majta shqiptare është kaq anti-kosovare? Sepse e tillë u krijua nga Miladin Popoviçi dhe Dushan Mugosha. 
Çim Peka i ka lujt fenë sot. 
 2/2 …është produkt i modelit Rama që kërkon të zhbëjë të vërtetën me propagandë, korrupsion dhe dhunë. Kjo konfirmohet…
 1/2 Dhunimi i reporterit Ergys Gjençaj është një akt i turpshëm që duhet dënuar me forcë nga të gjithë. Brutaliteti nda…
 këtu në Korçë ka investuar në sektor tepër të rëndësishëm, te "kopshti japonez" i Raqkë kripës..
 “E ka fajin Europa” llomotit poshtë e lart, për të fshehur dështimin e tij dhe pengimin e Shqipërisë. Por sapo i jepet…
 2/2...lidhjet e Hakmarrjes për Drejtësi me Tushën, Braçen dhe vetë Ramën, dhe përfitimet e tyre të ndërsjellta në vite…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
  sikur na kanë rënë fuqitë këto dy javët e fundit.. pse!? nuk e di.
 Kur fillon?? është risi për Shqipërinë.  nuk kemi ku përplasim kokën.
 Dëshmitari im kryesor që flas të vërtetën është varfëria ime.Sokrati
 Voto 9 për ndryshim! 
 Nga Qëndrimi i Komunitetit Mysliman: “Ju kujtojmë gjithë qytetarëve  se, shitja apo blerja e votës, veç të tjerave, ësh…
 Sot në Kavajë dhe Durrës pashë vendosmërinë e qytetarëve për ndryshim.Nëse doni ndryshimin - votoni 9. Nëse doni një t…
 Sot në Peshkopi, Bulqizë, Burrel, Klos dhe Maqellarë takova qytetarë entuziastë dhe të etur për ndryshim.  Ndryshimi do…
 Rama e di tashmë fare mirë se do të humbasë, prandaj po përdor çdo marifet të pisët. Pas grevës në aeroport që dëmton q…
 Për të sjellë ndryshimin dhe për të përmirësuar jetën e të gjithë shqiptarëve, na duhet të anëtarësohemi në Bashkimin E…
 Sot në Opinion me  përballë gazetarëve Andi Tela, Mentor Kikia, Gerta Zaimi dhe Blendi Salaj. 
 martë Ramën me vete
 Normalizimi i politikës shqiptare do ta largojë frikën si një instrument sundimi. Njerëzit duhet të jenë të lirë të tho…
 Sot vij para jush për të shpallur një tjetër synim, një detyrë, një mision që i përgjigjet dëshirës së çdo shqiptari: k…
  Po krahason Tosin hajdut ndihmash me ish nënpunës të Kombeve të Bashkuara dhe lidera m… 
 I habitshëm nervozizmi i Rames. Unë, PD dhe shqiptarët e kemi përcaktuar rrugën tonë që në dhjetorin ‘90: ajo është rru…
 Momente të veçanta në Berat me Xhoelin që ndjek mësimet në klasën e parë. Unë dhe ekipi im do të punojmë që të gjithë f…
 Faleminderit shumë Elit për jelekun e bukur që më dhuroi. Gratë gjirokastrite janë nikoqire dhe duararta, prandaj punën…
 "Shqiptarët duhet të vendosin fatin e tyre dhe duhet të zgjedhin midis sundimtarit dhe shërbestarit. Në Shqipëri duhet…
 Vota për Partinë Demokratike është votë për fëmijët tuaj, është votë për ekonomi të fortë. Është votë që shqiptarët ta…
 Një bashkëbisedim i veçantë me aktorin e mirënjohur shkodran, Zef Deda mbi aktualitetin. Bashkë ndamë shqetësimin mbi s…
 Do të ulim koston e jetesës për familjet shqiptare. Energji elektrike dhe karburant më të lirë, tarifa studimi dhe inte…
 Mendoni sikur të ishte vajza juaj! 
 Ne do t'i përmbyllim e do t'i japim rrugë procesit të legalizimeve, sepse e kemi borxh ndaj qytetarëve dhe e kemi borxh…
 Ne do të sjellim ndryshimin për fëmijët e Elbasanit dhe për të gjithë fëmijët e Shqipërisë! Ndryshimi po vjen! 
 Me këto zonja të mrekullueshme bashkë me të cilat do të sjellim ndryshimin në Elbasan dhe në të gjithë Shqipërinë! ✌️…
 Koha e Ramës ka ikur dhe ai e ka kuptuar këtë. E vetmja gjë që i ka mbetur është të kërcënojë dhe të ndërsejë miqtë e t…
 Gëzuar Ditën e Verës! 
 Për të ardhmen tonë! Është koha për ndryshim në Shqipëri! 
 Nëse tërheqim investitorë të huaj dhe bashkojmë forcat me investitorët vendas për të hapur sipërmarrje të reja atëherë…
 Sot me dhimbje mesova për një humbje tjetër, atë të dr. Gerond Husit, një mjek e profesionist i shkëlqyer, njerëzor e i…
 "Besoj që gratë me mbështetje nga të gjitha anët me mundësinë e shkollimit me vullnet të madh dhe dëshirën për të ecur…
 "Objektivat e Partisë Demokratike në programin e saj qeverisës do të mbështesin barazinë gjinore. Pjesa e rëndësishme e…
 "Partia Demokratike i qaset zemrës së konceptit të Europës mbi gruan, por edhe mbi familjen. Ja, ajo Europë e cila ësht…
 “Sot ne jemi në një start në të cilin dua të ndalem e të pyes se kush do të guxojë të na ndalë neve?”Degjojeni nga Gr…
 Gjithë këtë sakrificë që keni bërë në jetën tuaj ne do tua shpërblejmë. Nga ne meritoni, prisni edhe do të keni një qev…
 Forcimi i shtetit të së drejtës dhe lufta kundër korrupsionit janë thelbësore për mbështetjen tonë për vende si Shqipër…
 Armin Laschet: Lufta kundër korrupsionit nuk duhet të bëhet vetëm për hir të integrimit në BE, por për të përmirësuar s…
 Tobias Rüttershof: Aktorët politikë duhet të sigurojnë që kushtet për konkurrencë të pastër midis kandidatëve të plotës…
 Kjo është listë ndryshimi, listë fitoreje, listë për normalitetin, listë për t’i dhënë fund ngecjes 8 vjeçare të Shqipë…
 Shqipëria mund të ndryshojë.Shqipëria ka nevojë për ndryshim.Ne do ta sjellim ndryshimin! 
 Dita e mësuesve mund dhe duhet të jetë shumë më e gëzuar për ta. Së bashku do të sjellim ndryshimin! 
 25 prilli do të jetë ditë ndryshimi. Për këtë duhet ndihma juaj. Shkoni derë më derë tek shokët dhe shoqet, tek bashkëm…
 Carlo Angesano, EDS: Ju duhet të prini rrugës drejt ndryshimit duke marrë në dorë të ardhmen tuaj më 25 prill. Ju jeni…
 75% e të rinjve duan të largohen nga vendi. 94% e atyre që studiojnë jashtë nuk duan të kthehen në Shqipëri. Që të fito…
 Ligji i arsimit të lartë u konceptua si një ligj për t’ju nënshtruar. Ndaj dhe akti ynë i parë është abrogimi i ligjit…
 30 vite më parë eksodi biblik i shqiptarëve drejt Italisë, shembi njëherë e përgjithmonë murin ndarës mes  dhe . 30…
 Tobbias Rüttershoff: Shumica prej jush jeni votues për herë të parë. Unë besoj se është e rëndësishme të dilni dhe të p…
 "Në 25 Prill ju të gjithë duhet të bashkoheni rreth liderit të vetëm europian në Shqipëri, rreth Lulzim Bashës. Duke fi…
 Kur është e nevojshme për të ndihmuar njerëzit, ju braktisin dhe ndodh si në Thumanë. Vdiqën 26 qytetarë sepse i lanë t…
 Ne do t’i rrisim pensionet minimalisht dyfishin e normës së inflacionit por jo më pak se 5%. Do të vendosim fashën mbro…
 Ne nuk kemi premtime, ne kemi një plan real pune. Më 25 prill kemi betejën për familjet shqiptare dhe për gjithë Shqipë…
 I vetmi që s’po bën detyrën, është kryeministri dhe qeveria. Nuk ju premtoj mrekulli por normalitet ë. Do t’ju kthej sh…
 Shqipëria meriton më mirë. 
 Me planin që shpalosëm në shtator, çdo biznes i vogël merrte një çek 1 mijë euro. Pushteti i mbledh taksat dhe ua jep n…
 Kur vjen koha e zgjedhjeve hap thesin e premtimeve boshe. Me mua s’ka premtime. Ne kemi dy vjet që punojmë për një plan…
 Së bashku do të sjellim ndryshimin dhe Shqipëria do të fitojë! ✌ 
 Ne do të ngremë një qeveri që kujdeset për njerëzit, jo për veten e saj. Rama ua shpërndan taksat oligarkëve. Nuk ka as…
 Qeveria e re pas 25 prillit do të ofrojë paketën e ndihmës anti-COVID, të gjitha taksat jo më shumë se 0.5% e xhiros dh…
 Fëmijët janë e ardhmja jonë! Për ta duhet të sjellim shpresën që u nevojitet dhe ndryshimin për të cilin kemi nevojë t…
 Sot bashkuam forcat, të sigurt për të sjellë ndryshimin në Shqipëri. Më 25 Prill ne premtojmë se Rama do të ikë dhe ne…
 Në rrugën e ndryshimit, në rrugën e suksesit, në rrugën e fitores! ✌ 
 Udhëtimi ynë i përbashkët  për të ndryshuar Shqipërinë fillon sot. Koalicioni ynë, Partia Demokratike-Aleanca për Ndrys…
 Kohës tënde i ka ardhur fundi, Rama. Ka ardhur çasti të ndryshojmë. ëriaFITON ✌️
 Ne u bashkuam që të sigurojmë ndryshimin në Shqipëri dhe atë ndryshim do ta sjellim ne: shpresa të reja për të gjithë dh…
 Edi Ramën e ka kapur paniku, sepse ka kuptuar që sot ka nisur fundi i tij. Rama e kupton që më 25 prill do të shkojë në…
 Pronarët do të shkarkohen nga kostot administrative si dhe tarifat dhe taksat gjyqësore në proceset administrative dhe…
 Koha për një cikël pozitiv në energji, për t’iu larguar ciklit negativ të këtyre 8 viteve. Potenciali i jashtëzakonshëm…
 Vasil Gjika: Unë do të kërkoja nga ju mbrojtje për investimet. Duam barazi në trajtim, duam barazi në garë, duam shanse…
 Shkëlqim Kërluku: Mbas vitit 2013 ndryshuan rregullat e lojës. Jemi cilësuar shushunja. Kjo shoqatë përfaqëson 600 mili…
 Gëzim Byberi: Këto investime që kemi bërë, 600 milion euro, janë goxha para të hedhura në tregun shqiptar. Imagjino sik…
 Sipërmarrësi Avni Durmizi: Unë do të kërkoja nga qeveria juaj nesër që çdo vendim para se të merret duhet të konsultohe…
 Kurrë mos e humbni shpresën për Shqipërinë! Nuk jeni të kënaqur me drejtuesit? Ndërrojini! 
 Sipërmarrësi Roland Jegeni: Nëse bëj një krahasim me vitet kur ne kemi filluar punë, investitorët kanë qenë shumë të in…
 Sipërmarrësja Anita Shushku: Shtimi i kapaciteteve dhe promovimi i kësaj industrie do të ishte mënyra e duhur për të pa…
 Ne do të taksojmë importin e produkteve të gatshme dhe do të zerojmë taksat mbi lëndët e para që përdoren në prodhim në…
 Me energjinë dhe dëshirën e të rinjve për ndryshimin e madh. Shqipëria fiton me rininë! 
 Mjeku Erion Dasho: Jemi në një gjendje katastrofe shëndetësore. Katastrofa ka ardhur ngaqë është shkatërruar sistemi sh…
 Ndryshimi për sa i përket pandemisë do të vijë në 3 rrafshe kryesore. E para, shteti do të marrë rolin që i takon. E dy…
 Mjeku Arben Beqiri: Është e qartë tashmë që të gjitha rekomandimet e bëra nga opozita, nga kryetari i Partisë Demokrati…
 Mjeku Ilir Alimehmeti. Për testimet jemi të fundit në Europë, kjo është një e dhënë e qartë, mund ta shohim shumë qartë…
 Mjeku Ilir Pecnikaj: Problemi kryesor është  keqmenaxhimi i pandemisë. Sot gjendemi në një kamp të minuar ku nuk ke asn…
 Mjeku Rustem Celami: Janë me qindra gra shtatzëna që nuk u është bërë asnjë test megjithëse kanë telefonuar numrat përk…
 Ne do të nxisim fuqishëm prodhimin e energjisë nga burime të gjelbërta dhe të pastra me fokusi energjinë hidrike dhe at…
 Unë angazhohem për bashkimin e tregjeve të energjisë me Kosovën duke kombinuar prodhimin nga TEC-et në Kosovë me energj…
 Ne do të ulim faturën e energjisë elektrike për 70% të familjeve shqiptare duke ngritur një sistem faturimi me dy fasha…
e-albania e qenef qeverisë nuk jep më leje për lëvizje për nevoja të qytetarëve gjatë orarit të "shtetrrethimit".R… 
 Me planin tonë fiton qytetari, punëmarrësi, i cili bashkë me familjen e tij është qendra e programit tonë. Fiton aleati…
 Ulja e taksës nga 15 në 9% do të jetë një çlirim i jashtëzakonshëm për financat e sipërmarrjes shqiptare. Më shumë para…
 Unë angazhohem të ngre Agjensinë Kundër Korrupsionit. Për të gjithë ata që pyesin ku do të gjenden paratë: paratë do të…
 Në Shqipëri, Qeveria pritet të vendosë për shtyrjen e afatit të vlefshmërisë së kartave të identitetit dhe pasaportave bi…
 Garancia e trete mund të jetë garantimi i konkurences së lirë, pa korrupsion e nepotizëm, me aftësi… 
 Garancia e dytë në radhë për nga rëndësia mund të jetë siguria, si mund të investojë pasurinë e jet… 
 ✌️✌️Z. Basha, baza e ekonomisë dhe zhvillimit të biznesit janë garancitë afatgjata.. një nga të ci… 
 Nuk mund të presësh që të sillte vaksina për të gjithë ai që për 8 vite ka punuar vetëm për një grusht njerëzish.
 Ne do të vendosim një moratorium 12 mujor mbi inspektimet qëndrore dhe lokale dhe gjobat ndaj biznesit derisa të reform…
 Faleminderit për mbështetjen tuaj të pakursyer! ✌ 
 Në çdo takim me qytetarët tanë të mrekullueshëm marr energji për të vazhduar të punoj për Shqipërinë dhe shqiptarët! Qy…
 Për ta vënë Shqipërinë në rrugën e suksesit, të vendit ku është mirë të bësh biznes, duhet të mposhtet korrupsioni. Ky…
 Kënaqësi të prisja Komisioneren për Punët e Brendshme të Bashkimit Europian, Ylva Johansson. E njoha me planin tonë për…
 Asnjë xhelat i djeshëm nuk mund të jetë një shenjtor i sotëm. Angazhohem të miratoj një ligj për pastërtinë e figurës q…
 Bashkimi Europian kërkon një partner të besueshëm dhe tek Partia Demokratike dhe tek unë ka një partner i cili ka bas…
 Shqipëria duhet të ecë në një rrugë të sigurt drejt Bashkimit Europian. Kjo nuk ndodhi gjatë 8 viteve të Ramës. Ram…
 Dua ta falënderoj kryeministrin e Kroacisë, Andrej Plenkoviç për pritjen miqësore që më rezervoi së bashku me ministrin…
 Shqiptarët nuk mashtrohen dot më. Më 25 prill Rama humb dhe Shqipëria fiton! ✌️ 
 Gëzuar Ditën e Pavarësisë Kosovë ❤️ 
 2 janë prioritetet që unë kam parashtruar me Berlinin zyrtar.Prioriteti i parë është zbatimi në kushtet e Shqipërisë i…
 Për çdo të ri që largohet nga Serbia, largohen 12 të rinj nga Shqipëria. 3 miliard euro investime gjermane në Maqedonin…
 Shqipëria europiane fillon me qeverisjen e mirë. Zbatimi do të jetë fjala kyçe e reformave të Shqipërisë drejt Bashkimi…
 Asnjë s'i beson më premtimet boshe të Ramës.Shqipëria ka mbetur në baltë me Ramën.Ne do ta ndryshojmë këtë në 25 pril…
 Ne do të mbështesim me përparësi fermat dhe sipërmarrjet e krijuara nga të rinjtë e diplomuar në arsimin e mesëm profes…
 Ne do të mbështesim me përparësi fermat dhe sipërmarrjet e krijuara nga të rinjtë e diplomuar në arsimin e mesëm profes…
===