Këshillimi Kombëtar, amnistia kërkon votat e opozitës, kanabisi vetëm të PS-së – A2 CNN  via  
 Çdo e keqe ka një të mirë dhe për Pandeli Majkon kjo e mirë ishte arrestimi i Alqi Bllakos. Çelësi i prangave të ish-deput…
 Si i vendosen prangat një deputeti? Imuniteti dhe precedenti Tahiri mund ta shpëtojnë Bllakon nga qelia!
 “Mallkimi” i socialistëve me arrestimet për korrupsion. Precedenti Tahiri është shpresa e fundit për Bllakon që mos të për…
Agresioni rus është një drame me dy akte për gratë ukrainase. Krahas largimit nga vendi, ato kanë lënë pas edhe të… 
 A2 CNN në kufi, saga e ukrainasve për të shkelur tokën e sigurt – A2 CNN  via 
 Raportimi i  nga  në , pranë kufirit me Ukrainën “Pamë varg të gjatë makinash që prisnin…
 Basha nën presion. Nga “vetingu i kapur prej Ramës”, te votat për t’i zgjatur afatin – A2 CNN  via…
72 pyetje për presidentin, Meta mesazh Kushtetueses: Në detyrë deri në 24 korrik – A2 CNN  via 
Mandati presidencial, dikur finishi i karrierës, tani trampolinë për rikthim në politikë – A2 CNN  via 
“Mallkimi” i kryetarit, si u përjashtuan në 30 vite në gjithë timonierët e PD? – A2 CNN  via… 
 Meta humb betejën e parë në Kushtetuese, "lufta" vijon të enjten – A2 CNN  via 
 Prapaskenat, si do të mbrohet Ilir Meta në gjyqin Kushtetues  via 
Vakancat në KLGJ e KLP: Katër emra për katër vende, PS-PD e nisin me konsensus – A2 CNN  via  
Në kërkim të konsensusit… zgjatja e vetingut në drejtësi, tri javë kohë ...  via  
Bashkitë pa kryetarë, pas Celibashit, Meta letër edhe Ramës – A2 CNN  via 
Përjashtimet e PD, konfigurimi i ri i deputetëve në kuvend  via  
 Në një kohë kur të dhënat sensitive e private të qytetarëve shqiptarë po dalin sheshit, qeveria parashikon të krijojë edhe…
“Qëndruam 6 orë bashkë dhe ia kaluam mirë, të dhunova gjë”, Rama përplaset në Kuvend me Bashën… 
 “Më emigruan punonjësit”, Komisioneri për Mbrojtjen e të Dhënave Personale i kërkon deputetëve rritje pagash 
 Në kërkim të konsensusit, Kuvendi nis diskutimet për ndryshimet Kushtetuese  via 
 Kuvendit i ikin dritat, kreut të OSHEE-së i ndërpritet fjala / Kredia 70 milionë euro miratohet në errësirë 
Rama replikë me Bashën: Kur të kalosh nga kopja tek origjinali, mund të bëhesh gati për bashkëqeverisje  via 
Opozita ndryshe e LSI, padi në Kushtetuese për ligjet e “parlamentit ilegjitim”  via 
Komisionet parlamentare ngelin në klasë, deputetët kanë hetuar edhe “shkulje veshi”  via 
Lindita Nikolla në A2 CNN: PD më trishtoi, gati të ndërmjetësoj një takim Rama-Basha  ❤ via 
 Ministri Propagande? Qeveria miraton vendimin, zyrat e shtypit kalojnë në varësi të Ramës  via …
Qeveria e re, Rama vendos vijat e kuqe: Jo restorante e kafene gjatë punës   
Meta dekreton qeverinë, edhe SHISH nxjerr të pastër ministrat e Ramës  via 
Pak minuta në seancë, opozita braktis sallën e Kuvendit  via 
Parlamenti me dy grupe, aleatët i kërkojnë hua Bashës  via 
 “Viktimat” e Ramës mesazhe në kod, Braçes dhe Ballës nuk i del marazi via 
 Helikopterë ka, por nuk fluturojnë. A2 zbardh kontratën kur u blenë 6 mjete fluturuese  via 
Në legjislaturën e fundit, mazhoranca socialiste shfrytëzoi mbështetjen e opozitës parlamentare për të kaluar shumë… 
 Lushnja drejtohet nga burgu. Kryebashkiaku Tushe ruan mandatin deri në vendimin e gjykatës  shpjegon...htt…
 Zgjedhjet e Kosovës, serbët e Pejës të painteresuar, pjesëmarrje e ulët në votime  via 
 Zgjedhjet e 25 prillit, Celibashi: Pak kohë për votën e emigrantëve, 800 mijë të tjerë pa ID  via @…
Socialistët propozojnë ligj për faljen e debive për minatorët dhe ushtarakët   
Katër kandidatë për një karrige, gjykata rrëzon KED-në, rifut në garën për Kushtetuesen Zhaklina Peton … 
Hetime për UÇK edhe në Shqipëri, ligji që i hapi rrugë EULEX-it të hetonte ish-udhëheqësit e luftës… 
Ngërçi me Kushtetuesen/Ardian Dvorani rikthehet vendimmarrës, KED kërkon “shpejtësi” 
Ku janë paratë e donatorëve? Dalin shifrat, 5.9 mln dollarë donacion nga të huajt për tërmetin  … 
Bonusi ndërpritet në dhjetor, të pastrehët e tërmetit do të trajtohen sipas ligjit nga bashkitë … 
===