Absolut 4/ Durrësi, qarku me rrezikshmërinë më të lartë elektorale – A2 CNN 
Formularët e dekriminalizimit, Rama rrezikon përjashtimin nga zgjedhjet, Basha me mangësi – A2 CNN 
Listat e kandidatëve, PD rrezikon të skualifikohet, më shumë emra sa kërkohen – A2 CNN 
Policia vit pas viti deri në 2050 kërkon të arrijë vizionin zero jetë të humbura nga aksidentet, numrat e humbjes s… 
Kemi 30 vjet që kujtojmë rrëzimin e vetëm një simboli, ndërsa në rronojat e tij janë lartësuar të tjerë më të mëdhenj! 
Në një rend demokratik, shkelja e ligjeve mund të çojë në privim të lirisë së individit, por në asnjë moment në pri… 
 Zgjedhje në pandemi, qeveria harron votën e të prekurve me Covid  via 
Kosova përsëri në zgjedhje, të pestat të parakohshme që prej shpalljes së pavarësisë – A2 CNN, Live nga çdo vend i… 
Nëse ka ndonjë gjë që më bën vërtetë krenar në jetën time, janë pikërisht prindërit e mi. 2 njerëz të urtë e të për… 
 Jemi thellësisht të trishtuar nga humbja e parakohshme e Dr. Arjan Pushit. Ai e dha jetën, ndërsa ishte në shërbim të të…
Yuri Kim: Reforma në Drejtësi është në një fazë kritike, ata që e duan të frymëzohen nga Skënderbeu 
 “Reforma në drejtësi ka bërë përparim që mjafton për të trembur ata që nuk e duan atë. Unë kam udhëzime të qarta nga Uashingto…
 E ndoqët intervistën e Ambasadores Yuri Kim në  mbrëmë? Teksti i plotë të intervistës në shqip  
Populli shqiptar duhet të vazhdojë të ngrejë zërin për të shprehur pakënaqësinë, për të shprehur kërkesën e tyre pë… 
  në : ëdrejtësi, diçka që populli  e do dhe për të cilën  ka investuar shumë. …
  në : ëdrejtësi ka bërë përparim që mjafton për të trembur ata që nuk e duan atë por ende jo aq sa të këna…
  në : Populli  duhet të vazhdojë të ngrejë zërin për të shprehur pakënaqësinë, për të shprehur kërkesën e…
  në : Kam udhëzime të qarta nga Uashingtoni që kjo çështje mbetet prioritet dhe unë kam në plan t’i zbatoj ato. …
 ëdrejtësi,  në : Mendoj se mund të ketë pasur njëfarë të vërtete tek ato thashetheme.  …
  Kim në : Nuk jam prift. Nuk jam polic. Jam vetëm një diplomate dhe detyra ime këtu është të forcoj marrëdhënien midis…
  në : E di që ka dëshirë për ndryshim më të madh dhe mendoj se kjo nuk është diçka që më takon mua ta vendos. Është…
  në : Detyra ime është të ndihmoj Shqipërinë të hyjë në  dhe, në këtë kuptim, marrëveshja që doli më 5 qershor e…
  në : Mendoj se Rama ka të drejtë. Pse duhet që politikanët shqiptarë të mblidhen në një ambasadë të huaj, qoftë ed…
  në : Siç po zbuloj, kompromis është një fjalë e pisët në Shqipëri, por në fakt është kyçe për demokracinë. Është p…
  në : Njerëzit duhet të mbeten vigjilentë, duhet të vazhdojnë të kërkojnë ndryshim dhe shpresoj që nuk do të dorëzo…
  në : Vë re që njerëzit në Shqipëri nuk e pranojnë se sa shumë fuqi kanë. Shpresoj që shqiptarët ta pranojnë sa të…
   | Eurobondi 650 mln euro, Caslli: Duhen shpenzuar për investime që kthejnë borxhin
   | Emetimi i , : Dalja në tregjet e huaja në momentin e duhur
Koha nuk ka ndalur, ky moment na ka bërë të kuptojmë sa e çmuar ështëNe nuk mund ta zotërojmë dot kohën, por mund… 
Virusi kinez mbërrin në Europë, konfirmohen 2 raste në Francë 
Turqia goditet nga një tërmet 6.8 rihter 
Nga Himalajet tek e moshuara fatlume, fotot më të mira të udhëtimeve     
Reforma Zgjedhore, Borchardt tregon fushat ku duhet të fokusohet Shqipëria 
Si ka ndryshuar ndër vite perceptimi i korrupsionit në Shqipëri - Angelo Haruni 
Queen, i pari që stampohet në monedhën britanike 
Tokën po e “përpin” deti, dhjetëra vila në rrezik 
Ata vranë frikën! Demonstrata e parë antikomuniste dhe historitë e torturave 
Asgjësimi i mbetjeve në Diell! 
Djemtë “shembullorë” të burgjeve. Të dënuar për krime të rënda që përfituan ulje dënimi 
Rrëzimi i avionit në Iran, në pranga personi që filmoi ngjarjen! 
Basha: Pas reformës, zgjedhje të parakohshme. Nuk ka amnisti për askënd të përfshirë në shitblerjen e votave 
Marrëveshja politike, çfarë lëshuan palët për të shkuar drejt akordit? 
Tryeza për reformën zgjedhore, Krasniqi: Përgjigje ndaj SPAK-ut, palët bëhen bashkë kur kërcënohen 
Tirana dje dhe sot, një udhëtim në kohë përmes fotove 
Marrëveshja për Reformën Zgjedhore, opozita mandaton negociatorët 
Prokuroria e Përgjithshme i kërkon KQZ-se formularin e vetëdeklarimit të Kryebashkiakut të Mallakastrës 
Gropa “përpin” autobusin në mes të qytetit 
Problem në Shqipëri jo vetëm sistemi zgjedhor, por mënyra se si funksionojnë partitë politike - Afrim Krasniqi ne A2 
Pse duhet të shqetësohemi për shiun acid? 
Ditari Ndërkombëtar - Tensionet SHBA-Iran, Australia në flakë dhe “Megxit” - Realizoi  
“Miti” kuqezi polemik ndaj “ndeshjes së yjeve”: Shumë emra kërkonin thjesht mirënjohje 
Vazhdon kaosi në Rinas, qytetarët të paqartë për fluturimet me “Fly Ernest” - Realizoi Elona Gjylmi 
A është Shqipëria e rrezikuar nga Irani? Rama: Një sulm ndaj nesh, është sulm ndaj NATO-s 
Thirrja e Papës: SHBA dhe Irani të ndjekin rrugën e dialogut   
Iluzione optike në rrugët e Milanos 
Ishte shumë e bukur për të qenë e vërtetë! 
Pasaportat më të fuqishme për vitin 2020 
Gjenerali Barbero: Jemi të përgatitur për përgjigjen e Iranit në Lindjen e Mesme, por mund të godasin edhe në vende… 
Nuk ka nevojë për aplikacione se sa ndihet i ftohti këto ditë. Më mirë se kushdo e tregojnë familjet e prekura nga… 
“Mendoj se njerëzit meritojnë që të kalojnë më shumë kohë me familjet, me të dashurit dhe me pasionet e tyre”  
Dështoi te Rangers, Grezda largohet nga Skocia për të nisur një aventurë të… vjetër 
Irani ofron 80 milionë $ për kokën e Donald Trump 
Filmi “1917” u shpall si prodhimi më i mirë në Golden Globes 
Transporti ajror në Shqipëri, sfidat, ambiciet dhe pengesat e mëdha 
Nga djegia e mandateve, te paraqitja e një alternative, aksioni i opozitës në vitin 2019 
Reforma Zgjedhore, 2 vite në pritje të ndryshimit të kodit 
Meta, Presidenti i akteve të paprecedenta 
1 janari në Tiranë, rrugë të qeta, por lokalet plot 
Nga Panucci, te Reja, një vit kuqezi… Rënia dhe ringritja e kombëtares 
DËSHMI | Diktatori i vrarë për Krishtlindje 
Po sikur të gjithë ne të jetonim në Mars? 
Ekonomia shqiptare, vështirësitë e vitit 2019 dhe sfidat për 2020 
SPECIALE A2 | Lajmi i mirë është që sot vendi ka Strukturën e Posaçme Anti krim dhe korrupsion. Përtej ankesave pol… 
A2cnn në Digitalb, kanali 45 tokësor dhe satelitor 
Durrësi mbyll sot një 2019 të vështirë 
Arena Kombëtare, zbulohen disa nga “yjet” që do të zbresin në 10 janar 
Nuk shihej që nga viti 1986, pema e Krishtlindjes kthehet në Çernobil 
Të pastrehët nga tërmeti, në oborrin e kishës së Laçit - realizoi  
“Unaza e zjarrit” mahnit njerëzit në Azi 
Përleshja e ashpër mes ujkut dhe dy qenve 
Fiton lotarinë live në TV, gazetarja i thotë shefit: Nuk vij nesër në punë 
Papa: Zoti i do të gjithë, edhe ata më të këqinjtë 
===