 Në lidhje me spekulimet që qarkullojnë mbi mbledhjen e sotme të Kryesisë së Grupit Parlamentar të PD-së, Partia Demokratike…
 1/2 Dy dekada më parë, bota u trondit nga sulmet terroriste të 11 shtatorit jo thjesht ndaj SHBA, por ndaj vlerave të l…
 Sot arti dhe artdashësit shqiptarë janë në zi për ndarjen nga jeta të aktorit të madh Paulin Preka. Pinjolli i humorit…
 Me trishtim mësova lajmin e ndarjes nga  jeta të artistit të njohur Sherif Merdani. Sherifi ishte një nga artistët më t…
 Me trishtim të thellë mora lajmin e rëndë të aksidentit tragjik të ndodhur në Kroaci, në të cilin sipas të dhënave të p…
 Ka 8 vite në pushtet dhe sot më në fund pranoi se qeveria e tij e ka zhytur vendin në korrupsion. Ajo që ai nuk thotë d…
 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 Shqiptarët e dinë që Rama në qeveri është më i dëmshëm se “Ramët” e emëruar prej tij në bashkitë e vendit. Dy gjëra jan…
 1/2 Sot pata kënaqësinë të mirëpres Ambasadorin e Japonisë në Shqipëri, z. Takada Mitsuyuki. I shpreha mirënjohjen për…
 Mund të lash duart me një kryebashkiak të korruptuar apo të bësh koka turku bedelët e tu në atë sallë, por shqiptarët e…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
 Punonjësit e ndershëm të policisë janë të tradhtuar nga regjimi Rama-Doshi. Kur vjen në pushtet me krimin, policia përd…
 Po bëhen disa ditë që kryetitujt e mediave shqiptare janë kronika të zeza. Në ditët më të nxehta të vitit, kur numri i turistëv…
 Trushpëlarë, apologjistë me apo pa qira: boll akuzuat njerëzit për të keqen që ka plasur kudo! Është vetëm pasojë e mod…
 1/2 Kur policia reduktohet në vegël të regjimit për të mbrojtur pushtetin dhe lidhjet me krimin, kur përgjigja e vetme…
  Të 2 në botë për korrupsionin,  me zyrtarë që mbushin portofolet nga taksat e shqiptarëve dhe u heqin fitimet biznesev…
 Kam dëshmi njerëzish që mund të rrezikojnë punën nëse nuk bëjnë share apo retweet postimet e shefave. Dhe për këtë monitoro…
 Kënaqësi të takoheshim me ministrat e jashtëm të Austrisë, Çekisë dhe Sllovenisë.Shqipëria nuk mund të jetë një vend b…
 Nga zemra ju uroj gjithë besimtarëve myslimanë Gëzuar Fitër Bajramin!Agjërim të pranuar, lutje të pranuara, shpresë të…
 Me hidhërim të madh mora lajmin për ndarjen nga jeta të artistit të madh Guljelm Radoja. Largimi nga jeta i artistit…
 Të gjithë besimtarëve ortodoksë ju uroj nga zemra Gëzuar Pashkët! Drita e ringjalljes i mbushtë zemrat  tuaja dhe vat…
 Ju falënderoj nga zemra për mbrëmjen e sotme në Tiranë.Një mbështetje e jashtëzakonshme drejt fitores më të madhe në h…
 Sot në Kavajë dhe Durrës pashë vendosmërinë e qytetarëve për ndryshim.Nëse doni ndryshimin - votoni 9. Nëse doni një t…
 Të gjithë masivisht në kutitë e votimit në 25 Prill! -  
 Rama e di tashmë fare mirë se do të humbasë, prandaj po përdor çdo marifet të pisët. Pas grevës në aeroport që dëmton q…
 8 vjet dështime dhe tani dështimi të troket në derën tuaj për herë të tretë. Mos e lejo të futet brenda!
 Nga zemra ju uroj Gëzuar Pashkët të gjithë besimtarëve katolikë.Kremtimi i Pashkëve shënon triumfin mbi të keqen dhe f…
 Mirënjohës  për pritjen e jashtëzakonshme nga qytetarët e Kukësit dhe rrethinave. Era e ndryshimit ndihet në Kukës si k…
 Për të sjellë ndryshimin dhe për të përmirësuar jetën e të gjithë shqiptarëve, na duhet të anëtarësohemi në Bashkimin E…
 Këto janë disa nga elementet përbërës të reformave që Partia Demokratike ka menduar për Rininë Shqiptare. Ccfarë do doni…
 Rama ndihet i frikësuar nga qytetarët e Shqipërisë që duan të sjellin ndryshimin që i nevojitet vendit tonë. Ka vetëm dy…
 Me trishtim mësova lajmin për ndarjen nga jeta të ish-kryeministrit, ish-ministrit dhe ish-deputetit Bashkim Fino. Jam…
  është të lësh mijëra qytetarë pa çati mbi kokë për një vit e gjysmë. ërgjegjshmëri është të mbash Shqipërinë në…
 I habitshëm nervozizmi i Rames. Unë, PD dhe shqiptarët e kemi përcaktuar rrugën tonë që në dhjetorin ‘90: ajo është rru…
 Të dashur besimtarë bektashinj!Gëzuar nga mot Sulltan Novruzin! Qoftë kjo ditë e bekuar një ogur i mbarë për çdo sh…
 "Shqiptarët duhet të vendosin fatin e tyre dhe duhet të zgjedhin midis sundimtarit dhe shërbestarit. Në Shqipëri duhet…
 Një bashkëbisedim i veçantë me aktorin e mirënjohur shkodran, Zef Deda mbi aktualitetin. Bashkë ndamë shqetësimin mbi s…
 Mendoni sikur të ishte vajza juaj! 
 Kemi profesioniste të zonja, pedagoge, shkencëtare, artiste, shkrimtare me reputacion ndërkombëtar. Kemi një skuadër të…
 “Sot ne jemi në një start në të cilin dua të ndalem e të pyes se kush do të guxojë të na ndalë neve?”Degjojeni nga Gr…
 25 prilli do të jetë dita kur ekipi fitues do të presë nyjën gordiane që e mban Shqipërinë të lidhur duke larguar Edi R…
 Kjo është listë ndryshimi, listë fitoreje, listë për normalitetin, listë për t’i dhënë fund ngecjes 8 vjeçare të Shqipë…
 Ndryshimi është në dorën tuaj! 
 25 prilli do të jetë ditë ndryshimi. Për këtë duhet ndihma juaj. Shkoni derë më derë tek shokët dhe shoqet, tek bashkëm…
 30 vite më parë eksodi biblik i shqiptarëve drejt Italisë, shembi njëherë e përgjithmonë murin ndarës mes  dhe . 30…
 Tobbias Rüttershoff: Shumica prej jush jeni votues për herë të parë. Unë besoj se është e rëndësishme të dilni dhe të p…
 E kemi dëgjuar zërin tuaj. Kemi bërë një plan shumë të mirë bashkë me ju. Tani duam që të gjithë bashkë në 25 prill t’i…
 Së bashku do të sjellim ndryshimin dhe Shqipëria do të fitojë! ✌ 
 Kur vjen koha e zgjedhjeve hap thesin e premtimeve boshe. Me mua s’ka premtime. Ne kemi dy vjet që punojmë për një plan…
 Fëmijët janë e ardhmja jonë! Për ta duhet të sjellim shpresën që u nevojitet dhe ndryshimin për të cilin kemi nevojë t…
 Udhëtimi ynë i përbashkët  për të ndryshuar Shqipërinë fillon sot. Koalicioni ynë, Partia Demokratike-Aleanca për Ndrys…
 Pronarët do të shkarkohen nga kostot administrative si dhe tarifat dhe taksat gjyqësore në proceset administrative dhe…
 Ne do të abrogojmë ligjin aktual të pronave dhe të gjitha aktet nënligjore në fuqi që janë të pandershme dhe do të ndër…
 Një ndjesë pronarëve, në emër të Partisë Demokratike për vonesat, problemet me të cilat jeni hasur në rrugën tuaj në ka…
 Vasil Gjika: Unë do të kërkoja nga ju mbrojtje për investimet. Duam barazi në trajtim, duam barazi në garë, duam shanse…
 Kurrë mos e humbni shpresën për Shqipërinë! Nuk jeni të kënaqur me drejtuesit? Ndërrojini! 
 Me energjinë dhe dëshirën e të rinjve për ndryshimin e madh. Shqipëria fiton me rininë! 
 Ne do të taksojmë importin e produkteve të gatshme dhe do të zerojmë taksat mbi lëndët e para që përdoren në prodhim në…
 Ndryshimi për sa i përket pandemisë do të vijë në 3 rrafshe kryesore. E para, shteti do të marrë rolin që i takon. E dy…
 Mjeku Ilir Pecnikaj: Problemi kryesor është  keqmenaxhimi i pandemisë. Sot gjendemi në një kamp të minuar ku nuk ke asn…
 Ne do të nxisim fuqishëm prodhimin e energjisë nga burime të gjelbërta dhe të pastra me fokusi energjinë hidrike dhe at…
 Ne do të ulim faturën e energjisë elektrike për 70% të familjeve shqiptare duke ngritur një sistem faturimi me dy fasha…
 Ulja e taksës nga 15 në 9% do të jetë një çlirim i jashtëzakonshëm për financat e sipërmarrjes shqiptare. Më shumë para…
 Unë angazhohem të ngre Agjensinë Kundër Korrupsionit. Për të gjithë ata që pyesin ku do të gjenden paratë: paratë do të…
 Në çdo takim me qytetarët tanë të mrekullueshëm marr energji për të vazhduar të punoj për Shqipërinë dhe shqiptarët! Qy…
 Ne do të vendosim një moratorium 12 mujor mbi inspektimet qëndrore dhe lokale dhe gjobat ndaj biznesit derisa të reform…
 Për ta vënë Shqipërinë në rrugën e suksesit, të vendit ku është mirë të bësh biznes, duhet të mposhtet korrupsioni. Ky…
 Ngushëllime familjarve!U preht në paqe
===