Shiko në se ka tek ne ndonjë rrugë të keqe dhe na udhëhiq nëpër rrugën e përjetshme. Qofsh Ti mburoja hyjnore, mesh… 
Isaia 62:1 Për hir të Sionit nuk do të hesht dhe për Jeruzalemin nuk do të pushoj, derisa drejtësia e tij të dalë s… 
 Kohë dhe energjitë që mund të humbim duke pritur ditë më të mira, t'i shpenzojmë duke i bërë më të mira ditët që na janë dh…
54:4 Mos u frikëso, sepse nuk do të ngatërrohesh; mos ki turp, sepse nuk do të skuqesh; do të harrosh madje turpin… 
54:2 Zgjero vendin e çadrës sate dhe fletët e banesave të tua le të shtrihen pa kursim; zgjati litarët e tu dhe për… 
54:1 Ngazëllo, o shterpë, që nuk lindje; shpërthe në britma të larta gëzimi, ti që nuk provoje dhembjet e lindjes!… 
Zot na fal dhe ki meshire per te gjithe te rinjte shqiptar! Nuk e besoj dot. Pranvera po vjen dhe ti, Doni... 
4:7 Ti më ke shtënë në zemër më tepër gëzim nga sa ndjejnë ata, që kanë grurë dhe musht me shumicë. 
5 Prandaj Zoti e përforcoi mbretërinë në duart e tij. Tërë Juda i çonte dhurata Jozafatit, dhe ai pati me shumicë p… 
3 Zoti ishte me Jozafatin, sepse ai eci në rrugët e para të Davidit, atit të tij. Ai nuk kërkoi Baalin,4 por kërko… 
26 Ditën e katërt u mblodhën në Luginën e Bekimit, ku bekuan Zotin; prandaj ky vend quhet Lugina e Bekimit edhe sot.
25 Atëherë Jozafati dhe njerëzit e tij shkuan për të marrë plaçkën e luftës; midis tyre gjetën një sasi të madhe pa… 
Gjoni 11: 40Jezusi i tha: ''A nuk të thashë se po të besosh, do të shohësh lavdinë e Perëndisë?''.🥰
Psalmi 27: 5Sepse ditën e fatkeqësisë ai do të më fshehë në çadrën e tij, do të më fshehë në një vend sekret të ba… 
Një gjë i kërkova Zotit dhe atë kërkoj: të banoj në shtëpinë e Zotit tërë ditët e jetës sime, për të soditur bukuri… 
27:1 Zoti është drita ime dhe shpëtimi im; nga kush do të kem frikë? Zoti është kështjella e jetës sime; nga kush do të kem frikë?
11 Zoti do të të udhëheqë vazhdimisht, do të ngopë shpirtin tënd në vendet e thata dhe do t'u japë forcë kockave të… 
32:27 "Ja, unë jam Zoti, Perëndia i çdo mishi; a ka vallë ndonjë gjë tepër të vështirë për mua?". 
Sepse unë i njoh mendimet që kam për ju, thotë Zoti, mendime paqeje dhe jo të së keqes, për t`ju dhënë një të ardhm… 
Numrat 6:24-26 Gjithe Kurbinin, Tiranen, Shqiperine:"Zoti të të bekojë dhe të të ruajë! Zoti të bëjë që të shkëlq… 
===