 2/2...lidhjet e Hakmarrjes për Drejtësi me Tushën, Braçen dhe vetë Ramën, dhe përfitimet e tyre të ndërsjellta në vite…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
 2/2  Me postimin cinik si i sotmi pas masakrës së Velipojës, përgjegjësi për këtë situatë nuk e fsheh dot përgjegjësinë…
 1/2 Kur policia reduktohet në vegël të regjimit për të mbrojtur pushtetin dhe lidhjet me krimin, kur përgjigja e vetme…
 Rama e di tashmë fare mirë se do të humbasë, prandaj po përdor çdo marifet të pisët. Pas grevës në aeroport që dëmton q…
 I bëj thirrje Ramës ta ndërpresë menjëherë grevën dhe të ndalë kërcënimet ndaj shqiptarëve që sot duan ndryshim dhe shp…
 Ne do të taksojmë importin e produkteve të gatshme dhe do të zerojmë taksat mbi lëndët e para që përdoren në prodhim në…
 Është hera e parë që një parti politike vë familjen dhe rininë në qendër të programit të saj: 30 mijë lek/muaj për çdo…
 Sot në  kujtojmë dhe nderojmë viktimat e holokaustit dhe gjithë brezat e humbur prej tij. Qëndr…
 A nuk e ndjen edhe ti këtë? Ai vetëm na grabit. Rama ka dështuar. Bashkë do të sjellim ndryshimin për të gjithë! 
 Mijëra familje shqiptare po vuajnë nga përmbytjet, ngrica, pandemia dhe kriza ekonomike, ndërsa Tirja i qeverisë e ka m…
 Pas 7 vitesh dështime dhe premtime të pambajtura, 7 vite mashtrime, vjedhje dhe dështime, 7 vite dhunë dhe terror ndaj…
 Në Europë nuk mund të hysh me hile, por vetëm me plotësim të kritereve. Liberalizimi i vizave është provë për këtë. Shq…
 Dje Rama deklaroi se nuk ka asnjë arsye për të mbyllur shkollat sepse "fëmijët nuk të infektojnë me koronavirus". Ndërs…
 Pasi denoncimit të fakteve se gënjeu për numrin e viktimave të Covid-19, Ramës ju deshën dy ditë për t'u përgjigjur. Dy…
 Kush gënjen për një çështje kaq të ndjeshme, gënjen për gjithçka. Shqiptarët kanë nevojë për një qeveri që punon për ta…
 Ndërsa vendi po thyen rekordet e infeksioneve, Rama merret vetëm me sulme politike dhe gënjeshtra. Bashkë do të sjellim…
 Kjo është përballja dramatike e Muharrem Poleshit me COVID.  Urgjenca nuk i përgjigjet 8 ditë rresht dhe kur i përgjigj…
 Rama ka humbur çdo kontroll mbi pandeminë. Kemi testimet më të ulëta në Europë, numrin më të ulët të mjekëve dhe spital…
 Rritja e numrit të testimeve, rimbursimi i plotë për mjekimin në shtëpi kundër Covid, bonusi i premtuar dhe angazhimi i…
 Kur për të mbrojtur korrupsionin tënd, mbyll PS në një vendgrumbullim plehrash, kuptohet se e ke një hall të madh. Por…
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
 Kur vjedhja galopante, keqqeverisja, ekonomia dhe shëndetësia janë sot drama e çdo shqiptari,KM fshihet si struci pas n…
 Rriten infeksionet, bien testimet. Ndërkohë që njerëzit kanë nevojë për mbështetje dhe ndihmë, Rama vazhdon me vjedhje…
 Pata kënaqësinë të pres sot  Komisionerin Europian për Zgjerimin . Pasi e falenderova për ndihmën e jash…
 Akti i sotëm antikushtetues shkatërron konsensusin e 5 qershorit dhe godet rëndë integrimin europian të vendit. Rama e…
 që na mbajti për 50 vjet larg vlerave europiane por edhe si frymëzim për rrugën plot sfida në mbrojtje të lirisë. Sot j…
 Ribashkimi i  30 vjet më parë shënoi nisjen e rënies së mureve në mbarë Europën lindore dhe hodhi themelet e bashkimi…
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
 Teatri Kombëtar nuk ishte thjesht një institucion i kulturës dhe një gjurmë elegante e trashëgimisë tonë. Falë rezisten…
 Këtë vit, Dita Ndërkombëtare e Trashëgimisë Kulturore e gjen Shqipërinë pa Teatrin Kombëtar, që u shemb nga regjimi si…
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
 Raporti i fundit i EuCham që e rendit  ndër tre vendet e fundit në  për të bërë biznes, konfirmon qartë se kjo qeve…
 Njerëz të braktisur nga një qeveri e dështuar. Turp!                           
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
 10 vjet më parë GJND konfirmoi se shpallja e pavarësisë së Kosovës ishte në përputhje me të drejtën ndërkombëtare. Sot…
 Ndarja nga jeta e dr. Hysni Shkjaut është një dhimbje e madhe për familjen dhe miqtë e tij dhe një humbje e pazëvëndësu…
 Sot pata një bisedë telefonike me  Ministrin e Jashtëm të Italisë, Luigi Di Maio. E falenderova për ndihmën e madhe që…
 të reformës zgjedhore, e cila është dhe një nga 15 kushtet për hapjen e negociatave për anëtarësim në BE. Miratimi sa m…
 që i takon për të përshpejtuar procesin e integrimit. Italia do të jetë një partner kyç i PD në qeverisjen e vendit, si…
 Çdo vonesë dhe zvarritje në emërimin e gjyqtarëve të GJK vonon daljen nga kriza politike dhe mban mbyllur dyert e BE pë…
 Nëse Rama do të kishte bërë testime si në çdo vend tjetër, ne do ta dinim ku dhe si po përhapet koronavirusi.  E kam ng…
 I kërkova të mbrojë mjekët dhe personelin në spitalet e qendrat shendetesore, të mbyllë fasoneritë dhe call centers si…
 Propozuam edhe planin për një dalje sa më të lehtë për njerëzit nga karantina, pa rrezikuar shëndetin e tyre dhe duke m…
 Por Rama e kishte mendjen tjetërkund: te shfaqjet dhe zdërhalljet me orë para ekranit si narcisti para pasqyrës, tek te…
 ...dhe jo të siguronte testimet e duhura apo të mbështeste qytetarët në vështirësi dhe ekonominë në krizë të thellë. So…
 ...pa ligj vetëm për të grabitur pronat në bregdet për oligarkët dhe krimin. Me RAMAVIRUSIN shqiptarët varfërohen e oli…
 Në ditët më të vështira për shqiptarët, kur xhepat janë të zbrazur dhe varfëria po rritet çdo ditë, Edi Rama përdor dhu…
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
 Në emër të Opozitës së Bashkuar ju shpreh falenderimet tona aleatëve dhe partnerëve tanë euro-atlantikë për ndihmën dhe…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Teksa po i afrohet fundit të qeverisjes RAMAVIRUSI ka hequr dorë nga fasada. Shkatërroi Teatrin Kombëtar duke përfituar…
 Si burracak, Rama tani përpiqet tia hedhë fajin kujdo tjetër që të shpëtojë sadopak veten. Por ai është sot mbreti laku…
 Kjo grabitje e dhunshme e pasurisë sonë kombëtare është provokim për çdo qytetar që nuk e ka marrë akoma pagën e mbijet…
 Rama e shembi Teatrin Kombëtar me dhunë, kundër ligjit dhe me qëllimin e vetëm që në truallin e tij të ndërtojë kullat…
 Gjatë takimit të koalicionit opozitar me Presidentin Meta diskutuam për krizën dhe rrugëdaljen prej saj: shqiptarët do…
 Shembja e Teatrit është prova e fundit e një hajduti ordiner që i vjedh, i varfëron, dhe i dhunon shqiptarët. Me çdo di…
 Asnjë KM tjetër në botë nuk gënjen si Rama që mos tu japë njerëzve lekët.Asnjë KM në botë nuk ka infektuar 2 bashki sep…
 RAMAVIRUSI infektoi dhjetëra vajza dhe nëna me COVID-19 sepse refuzon të mbyllë fasoneritë e të paguajë pagat e mbijete…
 Rama është hajduti që i vjedh shqiptarët, është mashtruesi që i gënjen, është xhelati që i dhunon. Nuk mund të vuajë nj…
 Ekonomia jonë pritet të tkurret me 9%, më keq se në cdo vend tjetër, sepse RAMAVIRUSI zgjodhi të paguajë me paratë e sh…
 Për 7 vjet me radhë, RAMAVIRUSI e ka gërryer ekonominë, shëndetësinë dhe mirëqenien e shqiptarëve. CORONAVIRUSI vetëm s…
 Pasi i vjedh përditë dhe i gënjen me premtime boshe, Rama përdor dhunë fashiste kundër qytetarëve edhe sot në …
 Ndërkohë që shqiptarët presin zgjidhje për krizën që ka pllakosur, Rama gjen kohë vetëm për të grabitur. Kalimi i TK në…
 Mirënjohje për ndihmën e vazhdueshme që vjen nga  dhe solidaritetin në përballjen me . Shqipëria ka shumë ne…
 Mirënjohje  dhe Presidentes  për propozimin e tyre për të ndihmuar shqiptarët dhe gjithë popu…
 Mirënjohje SHBA &amp;  për ndihmën kundër COVID-19.Falë saj, mundësohet rritja e testimeve &amp; aktivizimi i zbul…
 Në mbledhjen e KSK detajova arsyet, nevojën dhe përfitimet që kanë qytetarët nga rritja e testimeve, si dhe i kërkova q…
 Ky është angazhimi im dhe i opozitës. Gjithë energjitë dhe resurset e qeverisë duhet të shkojnë për të lehtësuar krizën…
 Fatkeqësi për shqiptarët që KM në vend që të marrë masa për të kryer pagesat që ka premtuar për familjet dhe bizneset e…
 Lugina e Preshevës po përballet me pasojat e COVID-19. Për situatën e veçantë ku ndodhen, i bëj thirrje qeverisë të ofr…
 ...e biznesit të vogël dhe pagesën e papunësisë, NUK i mbulojnë nevojat e krizës.Pas shëndetit, ekonomia duhet të jetë…
 Shqetësimet dhe propozimet e Dhomës Amerikane të Tregtisë janë të drejta. I kam kërkuar qeverisë angazhimin e të gjitha…
 Falemnderit  &amp; SHBA për ndihmën kundër .  do vazhdojë të insistojë për testim dhe dista…
 Testimi masiv është e vetmja mënyrë për të zbuluar sa thellë është futur virusi në familjet tona. Pa testuar, pa gjurmu…
 Është përgjegjësi e qeverisë që të mbrojë shëndetin e njerëzve, të pajisë me mjetet e duhura ekipet mjekësore dhe të mb…
 Sot me dhimbje duhet ti themi lamtumirë Gëzim Krujës, artistit të madh shkodran të humorit që na fali buzëqeshje në dit…
 Mbyllja e kufirit për dhjetëra shqiptarë në tokën neutrale Shqipëri-Greqi dhe ndalimi i tyre për të hyrë në atdhe e për…
 Kushtetuta e Shqipërisë e detyron qeverinë të mos lërë pa atdhe asnjë shqiptar. Ata nuk mund të trajtohen kurrësesi si…
 Teatri ynë Kombëtar është futur nga organizata prestigjioze dhe Instituti i Bankës së Investimeve Europia…
 Për tju ardhur në ndihmë njerëzve, kemi kërkuar që qeveria të subvencionojë qiratë dhe pagesat e qytetarëve dhe biznese…
 Sot përulemi me nderim para kujtimit të Arben Brocit, Nazmi Kryeziut, Besnik Cekës dhe Bujar Bishanakut, 4 të rinjve sh…
 Mirënjohje BE për ndihmën financiare në luftën kundër COVID 19. Kemi shumë nevojë për mbështetje me paisje mjekësore, p…
 Falenderime  dhe BE për shprehjen e vullnetit pozitiv për çeljen e negociatave pas plotësimit të 15 kushteve.…
 Kam kënaqësinë të uroj përzemërsisht, fqinjin tonë, autoritetet shtetërore, vëllezërit dhe motrat tona dhe të gjithë qy…
 Nuk jemi vetëm! Mirënjohje Bashkimit Europian për këtë ndihmë të çmuar për shqiptarët dhe Shqipërinë, në këtë ditë të v…
 Vendet anëtare të BE-së dëshmuan sot se e mbështesin Shqipërinë dhe shqiptarët me shprehjen e vullnetit për të hapur ne…
 Në këto ditë të vështira për Shqipërinë &amp; mbarë botën,nevoja për shpresë është edhe më e madhe. Mirënjohje  pë…
 Përpos kërkesës për shpallje të gjendjes së fatkeqësisë natyrore, kreu i ,   i kërkoi …
 Ne nuk jemi vetëm! Falemnderit për miqësinë dhe ndihmën në ditë të vështira! 
 PD e konsideron planin e masave social-ekonomike si të domosdoshëm për përballimin e krizës së shkaktuar nga pandemia e kor…
 Pas pak nga Selia e PD fakte tronditëse se si vetëm këto 2 javë qeveria ka dhënë 52 milion euro pagesa dhe tendera për…
 Kreu i , në një lidhje live me studion e  theksoi se propozimet e PD për të përballu…
 Masat ekonomike dhe sociale të propozuara nga PD janë të qarta dhe lehtësisht të zbatueshme për t'ju ardhur në ndihmë f…
 Situata emergjente kërkon masa emergjente! Ftoj qeverinë që në këtë kohë krize të mos ketë asnjë kompleks të zbatimit t…
 Kur gishti tregon hënën, i marri tregon gishtin.  ministria jote e Shëndetësisë është rrumpallë, përgatitja e…
 Nuk jemi në luftë, jemi në situatë emergjence që kërkon seriozitet dhe përgjegjshmëri. Dhe jo shfaqje me maska të skadu…
 Sa kohë ky njeri drejton Shqipërinë, aq kohë shqiptarët do zbrazin vendin e të parëve. Keqqeverisja e këtij KM që vret…
 me institucionet e kapura nga një parti. Sa më gjatë qëndron kjo qeveri, aq më keq bëhet jeta për njerëzit. Shqiptarët…
 Sonte në mbrëmje prita për një bashkëbisedim të hapur disa përfaqësues të familjeve pronare të Tiranës.  ka…
 Me tronditje dhe dhimbje ndoqa lajmin për tragjedinë në Ostren të Bulqizës ku humbën jetën një nënë dhe dy fëmijët e sa…
 Dhoma Amerikane e Tregtisë ka konstatuar (pa asnjë surprizë) se korrupsioni është problemi kryesor që e lë pas Shqipëri…
 Qeveria rrezikon borxhin publik me krijimin e Korporatës së Investimeve Strategjike. Për këtë arsye S&amp;P paralajmëron ul…
 Pas 7 vitesh dështim, një gjë është e qartë. Edi Rama dhe qeveria e tij nuk mund të luftojnë krimin dhe korrupsionin se…
 Edi Rama ka fuqizuar vetëm një biznes në Shqipëri. Biznesin e tij personal me të inkriminuar dhe oligarkë. Çdo biznes t…
 Indeksi i Demokracisë i  e klasifikon Shqipërinë  regjim hibrid një hap larg autoritarizmit, për shkak të munges…
 Takim shumë i frytshëm me z.Paul McCarthy, Drejtor i  për Europën me të cilin folēm për krizën politike &amp; int…
Miqëve të mij te besimit mysliman, në këtë pragnisje të muajit të Ramazanit, ju uroj nga zemra agjërim të lehtë e t… 
Për miqtë e mi dhe për gjithë shqiptarët e besimit ortodoks, Gëzuar Pashkët për të gjithë juve dhe familjet tuaja.… 
Për miqtë e mij dhe për gjithë shqiptarët e besimit katolikë, uroj të gjeni ripërtëritjen shpresës, shëndetit, dash… 
KUR GISHTI TREGON HËNËN, ULSIU TREGON GISHTIN!Ulsi, ta kam thënë ty dhe atij që të ka nxjerrë të shkruash sot, e… 
Ky është Bledar Dule. I arrestuar si dhunues i policisë gjatë protestës 
 Ky është fundi i qeverisë-bandë të kapur duke vjedhur zgjedhjet me kriminelët, kërcënimi nr.1 për demokracinë, sigurinë…
Të shtunën, në orën 18:00, të gjithë në Tiranë! Për standarte të vërteta, për mirëqenie për çdo shqiptar, për sh… 
 Në Asamblenë Politike të Partisë Popullore Europiane në Bruksel pata nderin të takohem me Znj. Annegret Kramp-Karrenbau…
Këtë të shtunë me 16 Mars ora 11:00 të gjithë në këmbë! Për të drejtat tona, për mirëqenien tonë, për të ardhmen to… 
Në 2 dite “vizite” në Fier, Edi Rama la pas mbi 50 të shoqëruar, dhjetra të arrestuar dhe një të akuzuar për …tenta… 
TV gjerman ZDF: Sa mund të mbahet akoma në këmbë një qeveri, anëtarët e së cilës, mbajnë lidhje të ngushta me krimi… 
===