Ministri i jashtëm Srđan Darmanović: Gjatë muajve të fundit Serbia ka destabilizuar Malin e Zi -… 
Dhënia fund e dhunës seksuale kërkon investime dhe aktivizim të mbarë shoqërisë -  - News24 
 Baza e Kuçovës në 65-vjetorin e krijimit është më pranë ringritjes se kurrë.Krenare që arritëm ta fusim këtë aset të …
Koordinatori i përhershëm i OKB në Shqipëri Williams: Menaxhimi i fazës tjetër të koronavirusit kërkon shumë vëmend… 
Koordinatori i përhershëm i OKB në Shqipëri Williams: Menaxhimi i fazës tjetër të koronavirusit kërkon shumë vëmend… 
  Intervista: Koordinatori i Përhershëm i OKB në Shqipëri, Brian J. Williams sonte në orën 20.30 i ftuar i  Ne…
 Intervistë për emisionin Diplomaticus në News 24. Krijimi i qeverisë; linja ajrore Prishtinë-Beograd; shengeni ballkanik dh…
 Disa pjesë nga intervista me  në News 24. 
Hetimet ndaj Trump, dëshmon ish-ambasadorja amerikane në Ukrainë: Zyrtarë të DASH nuk më mbrojtën nga sulmet -… 
Nga përdorimi i greqishtes, te pensionet/ Temat “e nxehta” që Mitsotakis diskutoi me minoritetin grek në Shqipëri,… 
Shqipëria, pjesë e koalicionit për mbrojtjen e ujërave të Gjirit Persik -  - News24 
 Në Diplomaticus, News 24 mbi lidershipin e ri të Bashkimit Europian, prioritet e Unionit, zgjerimin dhe rrugën e  për në…
Gledis Gjipali: Zgjedhjet për Parlamentin Europian dhe integrimi i Shqip...  via 
Ben Andoni: Gjithcka rreth samitit të Brdo Brijunit  via 
Nga SHBA në Bruksel, grabitjet më të famshme në aeroportet botërore -  - News24 
 Intervistë dhënë gazetarit  në emisionin Diplomaticus të News24. "Mundësia për një marrëveshje Kosovë-Serbi."…
Çavuşoğlu: FETO një organizatë e rrezikshme edhe për Shqipërinë –  – News24 
Mevlüt Çavusoglu: Shqiptarët në Turqi kanë orientuar politikën, diplomac...  via 
Ambasadori britanik: Bashkëpunimi me Shqipërinë, jo vetëm në fushën e sigurisë dhe mbrojtjes -  
Diplomaticus/ Afrimi me Turqinë, pengesë për integrimin e Shqipërisë? Çfarë thotë profesori turk -  
Nicola Ciraci: Parashikimet për qeverinë e re italiane  via 
Diplomaticus/ Ambasadori suedez për negociatat: Koha për punë, jo për të rënë në qetësi -  
Ndërhyrje ruse në Ballkan? Përfaqësuesja amerikane në NATO: Mbrojmë anëtarët tanë nga ndikimi i keq -  
Auron Dodi: Vëmendja e Qeverisë së re Merkel për Ballkanin  via 
INTERVISTA/ Ambasadori i Turqisë: Projektet ambicioze që kemi për Shqipërinë -  
Ndikimi rus në Ballkan, ambasadori britanik: Të shqetësuar për aktivitetin e gjerë në rajon -  
Diplomaticus/ Deputeti Italian Ciraci: Anëtarësimi i Shqipërisë në BE të jetë gradual. Çoni përpara reformat -  
Diplomaticus/ Bashkurti për votimin në OKB: Shqiptarët nuk duhet të braktisin aleatin jetik, SHBA-në -  
Klajda Gjosha: A do të marrë shqipëria dritën jeshile për në BE?  via 
Kim Mehmeti: Në fushatë partitë na shesin shqiptari, ndërsa pas zgjedhjeve na shesin hajdutëri -  
===