'Me sytë nga çatia': Sfidat e restaurimit në shtëpitë muze të Beratit 
Guroret e Tomorrit kthehen në burim aksidentesh të rënda për punëtorët 
Premtimet për vende pune joshin të rinjtë në votime në Berat 
Si e mori lumi projektin e ndërtimit të ishullit në Osum të Beratit 
Izolimi prej COVID-19 uli numrin e aksidenteve, por vdekjet në rrugë mbetën të larta 
“Ti ruajmë sa nuk është vonë”: Banorët e Beratit kërkojnë më shumë vëmendje për rrugicat e kalldrëmta, vlerën e tra… 
Tranzit në Shqipëri, për të mbërritur në Europë. Emigrantët sirianë enden rrugëve të qytetit të Durrësit -  
Standardet e Bankës Botërore ‘mbajnë peng’ rrugën e kalasë së Beratit
‘Kriza’ e mbetjeve urbane në Durrës shpërblen inceneratorin e Sharrës 
Pa mbështetje: Nënat e vetme përballen me sfida të shtuara gjatë pandemisë 
Mirëmëngjesi dhe ditë të mbarë nga AdriaNet! 
Mungesa e turistëve dhe mbyllja e tregjeve frenon aktivitetin e artizanëve në Berat 
Rriten tarifat e bashkisë në Berat, por investimet zero: Paratë do të shkojnë për borxhet -  
COVID-19 dyfishon vuajtjet e familjeve që jetojnë në çadra pas tërmetit 
Dita e zakonshme në një situatë të jashtëzakonshme e profesionistëve të terrenit -  
Pashkët në izolim u kujtojnë besimtarëve ortodoksë lutjet e fshehta në kohën e diktaturës 
Si në vitin e mbrapshtë ’97: Kriza e koronavirusit godet turizmin në Berat 
Uria mposht frikën nga virusi: ricikluesit e varfër të mbetjeve thyejnë karantinën 
Covid-19 fut Shqipërinë në karantinë 
Dimal apo Ura Vajgurore; a duhet të zëvendësohet emri i bashkisë? 
Dimal apo Ura Vajgurore; a duhet të zëvendësohet emri i bashkisë? 
Mes shkatërrimit dhe braktisjes, banorët e zonës së plazhit në Durrës, shpresojnë rimëkëmbjen për të ardhmen e turi… 
‘Me dyer të hapura’: Durrsakët rikthehen në shtëpitë e rrënuara nga tërmeti -  
Rruga e lënë përgjysmë mban pezull shpresat për zhvillim të Skraparit 
Çezmat e Beratit, si humbi tradita e hershme në qytetin muze -  
Teatri japonez ''Noh'', për herë të parë në Shqipëri 
Poliçani sheh me shpresë nga turizmi për një jetë të dytë -  
“Tinguj nga Kina”, tradita e lashtë muzikore mbërrin në Tiranë 
Rilindja urbane rrafshoi pishat dhe kujtimet mbi lulishten e dikurshme të Beratit 
Tomori, fshati nën hijen e malit që po braktiset për një rrugë -  
Mungesa e thertores dhe problemet e blektorëve, projekti i organizatës dhe bashkëpunimi me bashkinë japin rezultate… 
Dardha e Beratit, fshati piktoresk i harruar për një rrugë -  
Dhuna në familje, rritet numri i grave që kërkojnë urdhra mbrojtjeje 
Problemet disa vjeçare të Beratit në fokusin e Teatrit të Rrugës -  
Artistja Dije Bllaca prezanton në Maqedoni ekspozitën “Sinqeriteti mistik” 
Artizanet kthejnë në suvenire atraksionet turistike të Beratit -  
Zbulimi i mozaikut hedh dritë mbi jetën e Beratit në antikitetin e vonë -  
Restauruesit e ikonave nxjerrin në dritë ‘thesaret e fjetura’ të Beratit -  
Pasojat e tmerrshme të “Plepave”  
Pavarësisht premtimit, Bashkia e Urës Vajgurore nuk ka fonde për një treg të ri fruta-perimesh. -  
Muzika ruse mbërrin në Berat, “Vertograd” interpretuan këngët e njohura në të gjithë botën 
Mirush Kabashi sjellë në Berat 'Zoti Ibrahim dhe Lulet e Kuranit' 
Berati me një muze të ri për kujtesën e hebrenjve, hapet muzeu “Solomoni” 
12 vjet pas masakrës së Kozarës, gjykatat në rreth vicioz për autorësinë -  
Dënimi alternativ u jep një shans të dytë të dënuarve për krime të lehta - reporter.al: 
Art në kalanë e Gjirokastrës, celebrohet 10 vjetori i Kampeve Rajonale të Restaurimit (FOTO) 
Viktimat e dhunës në familje vuajnë për vite në heshtje - reporter.al: 
Puna me pyetsorët për efiçensën e energjisë elektrike. Mbështetur nga Rec Shqipëri. Ambasada Suedeze. 
Muzikë baroke në muzen Onufri. 
Zgjedhjet 2017, - Beteja për Beratin, disa qindra vota bëjnë diferencën - reporter.al: 
Një deputet i LSI dhe ish-drejtori i spitalit të Beratit ndiqen penalisht për blerje të votës - reporter.al: 
Top story në Berat
“Kolor” hapet në Edward Leart, edicioni i 17-të i ekspozitës të fëmijëve 
Fëmijët shqiptarë renditen të fundit në Ballkan për standardin e fëmijërisë - reporter.al: 
Emigrantët kthehen në Berat, për të investuar në bujtina turistike - reporter.al: 
"Më përqeshin, më debatojnë, më kopjojnë". E.R
Hapet ekspozita ‘100 vite më parë, Berati, udhëtim në foto historike’ në Muzeun Etnografik 
Si nuk ndihem qytetare e " Republikës së Re"...!
“Hapësirë 2017” ekspozita e artistëve të rinj vjen në galerinë e Edward Lear 
Shqipëria, destinacion i turistëve të huaj 
Mjeshtrit e peisazhit shqiptarë ekspozojnë në Berat, qytetin e tyre frymëzues  
Kukullat unike të Beratit të njohura ndërkombëtarisht festojnë 45 vjetorin e krijimit  
Se pranvera të nxit fantazinë.. 
Diana nuk është vetëm  
“Zogjtë e korrentit”: jetimet që punuan në ish-kombinatin e tekstileve “Mao Ce Dun” 
Nisin karnavalet në Berat (FOTO) 
Karnavalet në Berat, qyteti muze në atmosferë festive 
Qajeni atë grua të re edhe nëse nuk ju ‘nderoi’* 
Shtëpi shqiptare në mes të viteve 1980. Muzeu i Fierit e rikthen në kujtesë. 
Organizata mjedisore "Për mirëqënie sociale dhe mjedisore" sensibilizon qytetarët për rëndësinë e mjedisit...!
 Zbulohet shifra, ja sa shqiptarë janë sot pjesë e ushtrisë greke 
 "Muajt e ardhshëm mund të prodhojnë situata të palakmueshme” - Shekulli Online 
 Ja hakmarrja e Turqisë pas sulmit në Stamboll 
Ciceronia që i jep zë “të kuqes” së Onufrit 
Krimi dhe media, stresi dhe depresioni vijnë nga raportimi i detajeve 
Arkivi Qëndror Shtetëror sjell në Edwart Lear Galeri ekspozitën me firmëtarët e Beratit  
 Njeriu kërkon t'i besoj dikujt,Dikujt që nuk do ta bëjë të pendohet si për të parat.
Arti i kulinarisë beratase, prezantohet në Ditën Kombëtare të Trashëgimisë Kulturore 
Nesim Spahiu: Skrapari ka zhvilluar turizmin e qëndrueshëm, tërheqja e mjekëve një sfidë e vështirë 
Petrit Sinaj: Fokusi i bashkisë sonë është turizmi dhe tërheqja e fondeve për shërbimet publike 
Muzikë dhe verë në 10 vjetorin e festës së vjeljes së rrushit 
Berat, e moshuara kërkon karrocë invalidi për bashkëshortin e sëmurë 
Në gjurmët e “Eremitëve”; qytetarët beratas i japin jetë shtegut drejt kishës së Shën Mëhillit 
Dy fjalë për njerëzit me pushtet që kanë apartamente tek Laguna Blu  via 
Dashuria për traditën e gurtë të Beratit bën bashkë të rinjtë shqiptarë dhe francezë 
Festivali “Multikulturor”, në Berat tri ditë të mbushura me evente kulturore  
Orhan Pamuk: Përse ushtarët nuk janë zgjidhja e problemeve tona 
Festivali i Muzikës së Vjetër mbërrin në Muzeun Kombëtar “Onufri” 
Dashuria e ndaluar në kampin e internimit në Saver 
U shënua tetë vjetori i Beratit në UNESCO 
Restaurohen muzetë në Berat 
Prezantimi i projektit: "Krimi mjedisor në malin Tomorr" mbështetur nga Bashkimi Europian. 
Çelet zyrë e re promovuese dhe informuese për turizmin 
Me Bashkim Hoxhën gjatë prezantimit të librit të tij Gruaja e shiut. 
Kurrë nuk e kam kuptuar këtë humbjen e pamerituar në futboll.... Është lojë ose fiton ose humb, pak rëndësi...
100 artistë të rinj nga mbarë bota në katër vjetorin e Qendrës Kulturore ASA  
Sipas rekomandimeve të UNESCO, trajnohen specialistë në Berat e Gjirokastër  
Ministrja britanike: Shqipëria s’mund të jetë pjesë e BE, vend i varfër, me krim e korrupsion  via 
Hyjnesha në fron, skulptorja Arjeta Miftari sjell në Prishtinë ekspozitën “Rrugëtimi”Nga: Erjola Azizolli 
Hapet konkursi për festivalin e stripit dhe karikaturës në Kosovë 
Realiteti për Europën dhe Turqinë 
Lulet e para të oborrit për këtë stinë...!
Liceu Artistik në Berat, orë krijuese në natyrë dhe ekspozitë të hapur për vizitorët  
Zagushia ka mbërhyer ajrin. Era ngriti në këmbë papastërtinë e qytetit. Shiu na e bëri pranverën pisë...!
“Dialog mbi të shkuarën”, takim për mbajtjen gjallë të kujtesës  
Gjarpërinj hyjnorë dhe bullarë shtëpie 
 "The Economist": Ja cili mbetet qyteti më i shtrenjtë në botë:FOTO &gt;&gt;: 
“Shtegu i Goricës”, tjetër destinacion turistik për vizitorët në Berat (FOTO)  
Glikotë artizanale i ëmbëlsojnë vizitën turistëve në Berat 
Moikom Zeqo një vlerë shumë dimesionale...! 
Në protestë për shumë çka...! 
Kjo nuk duket një protestë ndaj mbrojtjes së parkut, por shpërthim i një zemërimi....! 
....shtetarë bëjeni këtë vend që të ecë...! 
Kush dhuron gjak shpëton një jetë... 
Plotë 80 vite më parë punëtorët në Kuçovë protestojnë për pagat. Sot, mijëra hiqen nga puna, të gjithë heshtim....! 
Tre orë mungova në internet. Hap cel ngjarje e rëndë, viktima në Elbasan. Dreqin, isha mirë duke lexuar librin....!
Tre orë mungova në internet. Hap cel ngjarje e rëndë, viktima në Elbasan. Dreqin, isha mirë duke lexuar librin....!
Fuqia e një nëne të jashtëzakonshme 
Shëmtia e një qyteti....! 
Ja se çfarë lë nga pas përmbytja....! 
Reagimi qytetar shmang rritjen e tarifës së çmimit të ujit të pijshëm...! 
Një protestë kundër rritjes së taksave...! 
Haxhinasto: "Reforma në ujsjellsa për shërbime më të mira ndaj qytetarëve." 
"Policë" të rrugores për pak minuta...! 
Selifet zëvendësohen, kontributi joo. Urojë ta keni më me shumë dëshirë këtë të fundit..! 
Dita e ujit të bekuar...! 
Qendra kulturore “ASA” ndan çmimet për konkursin e fotografisë ‘selifet” më të mira.   Nga Erjola Azizolli 
Qendra Kulturore 'ASA' ndan çmimet për “selfiet” më të mira -  
Fillon në Galerinë e Beratit edicioni i 19-të “Lear 2015” -  
Problemet me infrastrukrurën. Banorët në protestë përpara godinës së bashkisë..! 
Lorenc Feleqi, shqiptari që shpallet trajneri më i mirë i vitit në rajonin e Pulijas. Nga Erjola Azizolli 
Ndihmat e para për njerëzit në nevojë...! 
Artistët e peizazhit bashkohen në ekspozitë në Beratin e bukur -  
Mjeshtërat e peisazhit ekspozitë në "Eduart Lear" galeri. 
Krijuar nga fëmijët e qendrës " Unë jam si ju" 
Zyrë shërbimi për qytetarët....! 
Starton në galerinë e Fierit edicioni i parë i ekspozitës kushtuar grafikës “Shenja shqiptare” 
"Shenja shqiptare" starton në Fier edicioni i parë i ekspozitës kushtuar grafikës artistike. 
Nxënësit e shkollës artistike ekspozitë dhe koncert për të paraburgosurit -  
Frankofonët në Berat përkrah dhimbjes franceze.Nga Erjola Azizolli . 
Të varfërit e Beratit shtojnë radhët në mensën që shpërndan ushqim falas 
Klosi nga Berat: “Ministri Klosi nga Berat: “Kemi nevojë për punëtorë të kualifikuar” ”  Nga Berati Erjola Azizolli. 
Ministri Klosi: " Në Shqipëri, mungojnë punonjësit e kualifikuar." 
Muzeu i Krujës, dëshmi e ekzistencës së shtetit...! 
Trajnohen ata që duhet të na shpëtojnë nga rreziku. Forcat e zjarrfikëses dhe shpëtimit..! 
Ekspozita “Uji në arte dhe zejtari në rajonin e Beratit”, u hap në Muzeun Onufri -  
Artisti shqiptar prezantohet në Teheran me “Përpjekjet e para” Nga Erjola Azizolli -  
Kultura arbëreshe prezantohet në Berat -  
Fëmijët e festivalit Ballkanik mbërrijnë në Berat. 
Opozita takime me fermerët për tu njohur me problemet e bujqësisë...! Thua se janë të pa njohura!? 
Shkolla e re me dyerë të mbyllura, nxënësit në protestë: "Jo më mësim në turne" 
Skulptorja dhe antarja e Këshillit për Trashëgimin Kulturore në Kosovë merr çmimin “Pegasi” 
Pastronin depon, plagosen tre ushtarë në Repartin e Vërtopit, Poliçan. 
Festivali “Takimet muzikore të dy botëve” mbërrin në Berat -  
Verë dhe muzikë në festën e vjeljes së rrushit në Beratin e traditave -  
Jahjaga: Anëtarësimi në UNESCO do të ndihmojë që të ruajmë trashëgiminë kulturore në Kosovë -  
Piktori dhe regjisori Vlash Droboniku nderohet në Berat me titullin “Qytetar Nderi” -  
Mungesa e prurjeve të lumit Osum, nxjerr në sipërfaqe ndotjen...! 
 tashmë është arrestuar...le të shpresojmë që të flas ligji...!
Vrasje për një vijë uji në një fshat të rrethit të Beratit. Viktima një 28 vjeçar. Autori në kërkim....!
Fshati shqiptar e ndërton të ardhmen nëpërmjet turizmit 
Fillon në Berat festivali Multikulturor -  
Festivali multikulturor në Berat...! 
Rikonstruksioni për lulishten, shkulen pishat 100 vjeçare...! 
Shtatë vite në Unesco...! 
Rifillon numërimi dy orë me vonesë nga orari zyrtar... 
Kur ndërpritet proçesi i numërimit të votave...! 
Që mos të ketë më rradhë për ndihmave fushate...! Nesër votë me mendje jo me zemër...! 
Intervistat me kandidatët për kryetarë të Bashkisë Kuçovë 
Intervistat me kandidatët për kryetarë të Bashkisë Berat 
Intervistat me kandidatët për kryetarë të Bashkisë Poliçan - Zgjedhje 2015 
Duma tek Fevziu: " Në bashkinë e Durrësit do të punojnë vetëm durrësak.."
Sëbashku për të treguar se dhe përkujtimet i konsiderojmë festa...! 
Berati, qyteti që plaket me ëndrrën për zhvillimin e turizmit 
Vlerësohen me çmime ndërkombëtare në pikturë, ekspozitë në Berat. 
Rreth 490 monumente kulture në Qarkun e Beratit apelojnë për vëmendje...! 
Ja se çfarë ka lënë nga pas përmbytja...! 
Një nga ato ditët dhe netët kur hurren faktin që të gjendet një tv në shtëpi...!
Në breg. Pas përmbytjes...! 
Piktorët nga Malisheva prezantohen në galerinë “Edwart Lear” në Berat -  
Piktorët nga Kosova promovojnë artin e tyre për herë të parë në Shqipëri. 
Tetë femra artiste bashkohen në Turqi në një ekspozitë për gratë -  
Heqja e rrethimit të Katedrales në kryeqytet, reagojnë besimtarët. 
32 artiste shqiptare dhe të huaja bashkojnë në Fier artin e tyre -  
===