“Jepini lojtarët kombëtareve”: Infantino i del përballë Anglisë dhe Spanjës 
Shtetet europiane që kërkojnë Green Pass për turizëm – Nga ndryshon ai me Certifikatën Digjitale Covid?! 
A ka shqiptarë të bllokuar në Afganistan? Ja si përgjigjet Rama për CNN 
Tronditëse! Modelja qëllohet me armë zjarri sapo del nga festa, gjen vdekjen e menjëhershme 
U përfol se do të largohet nga Top Channel, vjen lajmi surprizë për Luana Vjollcën! Moderatorja do të ‘mbretërojë’… 
Pamjet që po bëjnë xhiron e botës, gardianët rrahin barbarisht të burgosurit, hakerat i bëjnë “gjëmën” policëve (Vi… 
Lufta me Covid, Pfizer ka gati vaksinën e re që do të mposhtë këtë variant 
Najada Çomo dorëzoi mandatin e deputetit, Ylli Manjani shpërthen në ironi: Të bënte këtë gjë të paktën sa për sy e… 
Dorëheqja e papritur e Erion Braçes pak ditë para formimit të qeverisë ‘Rama 3’, gazetari i njohur zbulon çfarë qën… 
Eli Fara në zi, mes dhimbjes së madhe jep lajmin e hidhur të ndarjes nga jeta të njeriut të saj të shtrenjtë: T’u p… 
Plas keq në Tiranë, regjistrohen të shtëna me armë zjarri, ka të plagosur 
Afati drejt fundit, CIA gjen një tjetër mënyrë për evakuimin e amerikanëve nga Afganistani 
Operacioni më i madh amerikan i evakuimeve nën kërcënimin e ISIS 
“Unë jam katolik me grua myslimane, djali i vogël ndoshta zgjedh të bëhet...”, kryeministri Rama flet për afganët:… 
Zbulohen detaje të tjera mbi ekzekutimin e Bledar Muçës, si nisi përplasja për bixhozin dhe cili ishte roli i “Tole… 
Zëdhënësi i talebanëve jep intervistë për median greke: Nuk do të prodhojmë më opium, duam një vend të pavarur 
Pas një mungese të madhe, Monika Kryemadhi shfaqet në Jalë si asnjëherë më parë (Foto) 
Rama si bamirësi që të vjen te dera me më shumë kamera sesa pako 
“Flokë hekuri” në zemër të Tokës?! – Hipoteza më e fundit mund të shpjegojë shtimin e tërmeteve në planet 
Lajm i mirë! Përmirësohet gjendja e Kosta Grillos, kolegu zbulon bisedën e komentatorit me doktoreshën në Turqi: Du… 
Nis sot Pelegrinazhi në malin e Tomorrit, Rama nxjerr pamjet e rrugës së re për të uruar fundjavë të mbarë 
Real Madrid nuk dorëzohet, mbajnë të ndezur ëndrrën Mbappe, Ancelotti nis të bëjë llogaritë 
Situatë katastrofike/ Kazanët plot me mbeturina, Shijaku përmbytet nga plehrat 
Zbulohet lëvizja e fshehtë e Erdogan në Afganistan (DETAJET) 
“Ata ishin 4”, Rudina Magjistari shtatzënë për herë të dytë? Plasin urimet për moderatoren e njohur shqiptare (FOTO) 
Nusret në gjyq/ Kuzhinieri i famshëm paditet nga punonjësit e tij, zbardhen akuzat ndaj tij: Na mban jashtë... 
Rama mban në ankth ministrat dhe deputetët, shtyn pa afat Asamblenë Kombëtare, mbetet e paqartë struktura e qeveris… 
E mbajti sekret për disa muaj! Në pritje të ëmbë të një vajze, publikohet fotografia e Marina Vjollcës me barkun e… 
Tjetër aksident në rrugët e vendit/ Përplasen dy mjete, rëndohet trafiku në zonë 
Daily Mail nxjerr prapaskenat e forta: Ky është terroristi më i kërkuar i Amerikës që ndodhet në Kabul, për kokën e… 
Të ftuarit mbeten të shokuar, burri përballet me surprizën më të keqe në ditën e dasmës, ja çfarë i ndodhi (VIDEO) 
Ndryshim drastik i motit! Ja çfarë na pret nga mesi i javës që vjen 
Vjen lajmi i bujshëm nga India për koronavirusin 
Mbushën Tiranën me kokainë dhe kanabis/ Efektivi i RENEA-s, “koka “ e klanit të drogës. Ky është Rael Luli, zbulohe… 
U gjet i pajetë brenda makinës i ekzekutuar me tre plumba i riu në Vlorë/ Identifikohet 25-vjeçari 
Tronditet Vlora që në orët e para të mëngjesit! Ekzekutohet i riu me armë, gjendet i vrarë në makinën e tij 
ANALIZA/ Një “Vietnam” i dytë: Pse dështoi Amerika në Afganistan? 
Misteri i vilës 700 mijë euro të Gjin Gjonit 
FAKTET: Kush janë talibanët dhe si veprojnë ata? 
"E verifikova, doli e vërtetë!"/ Avokati i njohur del me denoncimin e fortë: Çfarë po ndodh në këtë vend?! (FOTO) 
Skenari i çmendur, gazeta spanjolle: Real Madrid do të lërë LaLiga-n, synon regjistrimin në Premier League 
Shenjat pothuajse të sigurta që tregojnë se keni pasur Covid 
Përmbytjet në Japoni, urdhërohet evakuimi i 5 milionë banorëve 
Rama nuk e ka me Albinin, por me këdo që futet mes tij dhe Vuçiçit 
Shpërndanin kokainë në Dhërmi, arrestohen 3 persona 
“Njeriu pa kombin është asgjë, e kombi pa brezat e ardhshëm shuhet”, Meta kujton Hasan Prishtinën: Shqipëria po vua… 
Magjia e tregut të lirë 
E rëndë në Turqi/ Po shuante flakët, rrëzohet avioni ‘Beriev’ i ardhur nga Rusia, asnjë i mbijetuar 
Bie nga kati i tretë i banesës, humb jetën 25-vjeçari në Krujë 
‘Shkunden’ Haiti, tërmeti me magnitudë 7.2 i shkallës Rihter godet shtetin ishullor, raportohet për dëme të mëdha (… 
Njerëzit që flasin më shumë kanë më tepër gjasa të konsiderohen udhëheqës 
Ku fitohet më shumë nga paratë? 
Van Dijk flet pas rinovimit me Liverpool: Marrëveshja u arrit lehtësisht, të gjithë më duan këtu 
DASh kërkon një “Treg të Përbashkët Rajonal”, gjithpërfshirës dhe sipas standarteve të BE 
Antonela, gruaja e Mesit ka një mesazh për Parisin 
Çmenduri në Paris/ Për 7 minuta shiten 150 mijë bluza me emrin e Mesit 
Talibanët marrin Gaznin, një hap më afër Kabulit 
Ecja me “të kuqe”,dora mbi marsh, këmba mbi friksion… 9 zakone të këqija që dëmtojnë makinën! 
“Në auditor vetëm të vaksinuarit”/ Shkolla e Magjistraturës: Të pavaksinuarit ndaj COVID-19, mësim online 
Nga pasuria në apartamente, automjete e garazhe te transaksionet e dyshimta të bashkëshortit/ Argumentet e KPK në s… 
Wizz Air sjell avionin e gjashtë në TIA/ Kastrati zbulon detajet e bashkëpunimit 
“Gabim në kalkulim”, konspiracionistët nxjerrin datën e re: Fundi i botës sipas Maya do të vijë brenda vitit 
Siguronte prostituta për biznesmenët e huaj, jepet dënimi me burg për yllin e muzikës 
Zbardhen detaje të reja nga tmerri në Angli / Agresori vrau pesë persona përfshirë nënën e tij, më pas qëlloi veten 
Ngjarja e pabesueshme! Burri 'vë duart në kokë', nuk iu beson syve nga ajo që gjen në tualet, ja se çfarë i ndodhi.… 
Flasin ekspertët/ Kafeja ju shkakton dridhje dhe marramendje? Ç’duhet të dini në këtë rast 
Udhëtimet drejt Italisë dhe Greqisë, TIA jep njoftimin e rëndësishëm: Mund t’ju anulohet fluturimi nëse nuk e keni… 
Ilir Alimehmeti zbulon të dhënat e studimet të fundit: Sa të mbrojtur jemi nga vaksinat pas dozës së dytë dhe imuni… 
Keni rezervuar pushimet në dy javëshin e dytë të Gushtit? Kur do të nisë rënia e temperaturave, njihuni me surpriza… 
Fati i keq/ E premte e datës 13, përse quhet “dita e zezë” dhe çfarë ka ndodhur më parë 
Gruaja gjen një ‘vezë’ misterioze në tavanin e shtëpisë, i vjen paralajmërimi i frikshëm: Mos e prek, ja çfarë mund… 
“Në djall liria”, aktori i Hollywood shpërthen ndaj ndjekësve të tij në Instgram: Nëse nuk e mbani maskën jeni thje… 
Aksidentoi me makinë dy policët, flet 71-vjeçari: Makina ime s’ka lëvizur nga vendi, shpresoj të bëhen mirë 
SHBA kërkon për vendet që dëshirojnë të strehojnë refugjatët afganë, zbulimi i Reuters: Bisedime të fshehta me Shqi… 
Zbardhet ngjarje në Ksamil, policia arreston autorin e plagosjes së 33-vjeçarit (DETAJET) 
Zjarr i madh në Lapardha të Beratit, “përpin” hektarë me shkurre dhe pemë, rrezikohen banesat, çfarë dyshojnë banor… 
Aksident i rëndë në aksin Levan-Vlorë, makina përplas për vdekje këmbësorin 
Të shtëna me armë zjarri në Ksamil, 33-vjeçari plagoset në një dhomë hoteli 
Helmohen nga ushqimi ushtarakët në Vlorë 
Zonat/ 10 vatra zjarri aktive në vend, situatë kritike në 2 prej tyre 
Fiskalizimi dominohet nga kompanitë e mëdha -17,470 subjekte kanë përmbushur kushtet, 11 milionë fatura të lëshuara 
Gjermania parashikon masa të reja në vjeshtë 
Shokuese! Vëllezërit masakrojnë motrën e tyre dhe më pas e varrosin në oborr 
Pomatet, perimja e së ardhmes që ofrojnë shkencëtarët 
Hetimet zbardhin të dhëna tronditëse nga vrasja e Caroline/ Babis kishte lidhje intime me një transgjinor shumë të… 
“Më kanë shkruar shumë persona”, Spartak Ngjela paralajmëron trazira, kërkon ndërhyrjen urgjente nga Edi Rama: Do t… 
Qëllon për vdekje një grua në mes të njerëzve! Autorja “gjakftohtë” hipën e qetë në makinë dhe largohet (VIDEO) 
Zbulohen detajet e aksidentit tragjik të djalit të Michael Ballack, ja sa metra në ajër ka kërcyer mjeti 
Po raportonin për zjarret në vend, gazetari dhe kameramani rrihen nga qytetarët (VIDEO) 
Vëllai i pronarit të qendrave tregtare në Tiranë/ Trafikuan rreth 1 ton kokainë dhe iu gjetën 1.2 milionë euro cash… 
Zbardhet kush po strehon Grenellin me urdhër të Metës, ambasadori i Trump mision për të zbutur qëndrimin e Ramës nd… 
Njerëz të shtrirë në tokë, Alfred Cako publikon videon e frikshme: Shihni se çfarë do të ndodhë kur të ulet doreza… 
Virologia nga Wuhan bën deklaratën tronditëse: Variante 600 herë më vdekjeprurëse se Covid-19 do të shfaqen në të a… 
OBSH thirrje për pezullimin e dozës së tretë të vaksinës: Duhet të jepet vetëm në fund të... 
Berisha më i fortë se kurrë”, analisti bën deklaratën e fortë dhe tregon qëllimin e ish-kryeministrit: Gjë që negoc… 
Atletja bjelloruse largohet nga Tokio nën mbrojtjen diplomatike të Polonisë 
Publikohen pamjet që po thyejnë rrjetin / Burri kërcënon se do shpërthejë granatën në selinë e qeverisë 
Bashkëqeverisja PD-PS alarmon Berishën, njerëzit e Berishës mesazh Bashës të qëndrojë larg Ramës 
Shqiptarët “yxhym” drejt Turqisë: Më shumë se para pandemisë 
Laçi-Anderleht tërheq vëmendjen e menaxherëve të huaj, të enjten në ‘Elbasan Arena’ për të riun kavajas Regi Lushkja 
“Pesë vite më parë qaja nga dëmtimi”, Gega: Sot vrapoj me vajzat më të shpejta të botës 
I jepet çmimi lojtari i vitit në Hungari, Uzuni: Luani është i uritur, më e mira po vjen… 
Klan me fitimet më të mëdha në treg/ A2 dhe Euronews dalin me humbje 
Kovid apo kontroll/ Pse protestuan europianët kundër masave të reja të pandemisë 
Humbi jetën mes flakëve në Gjirokastër, Rama shpreh ngushëllimet për familjarët e 64-vjeçarit 
Fqinja tregon vendin ku vdiq 60-vjeçari në Gjirokastër: Shkoi ta ndihmojë gruaja, por nuk ja doli 
Mesila Doda humb njeriun e shtrenjtë të familjes 
Nuk flini dot rehat nga vapa? Bëni këto dy gjëra çdo natë para gjumit 
I keni parë me kostume serioze në media, publikohen fotot që po qarkullojnë me shpejtësi, si duken ‘të zhveshura’ s… 
Spartak Ngjela nxjerr prapaskenat “bombë”: Presidenti do të përfundojë shumë keq 
Gjermania ndryshon rregullat për shqiptarët/ Ambasada bën njoftimin e rëndësishëm 
INVESTIGIMI/ Ja pikat e njohura në Tiranë ku shiten akullore skandaloze dhe të rrezikshme: Me fekale, stafilokok dh… 
Këto janë katër rrugët për t’u bërë milionerë /Ja kush është më e thjeshta prej tyre 
Harry Kane nuk paraqitet në stërvitje, Tottenham kërkon zëvendësuesin e tij në Serie A 
‘Ditë të zeza do vijnë’/ Kush është gruaja e terroristit që ndalon të tjerat të kthehen nga kampet siriane 
Lajmi fantastik që e prisnim të gjithë/ E thonë faktet: Shqiptarët janë imunizuar në mënyrë natyrore për Covid-19.… 
Lajm i trishtë! Ndërron jetë ish-deputeti i njohur i Partisë Demokratike 
SHBA shpall vendimin e papritur: Me këtë shtet të Ballkanit hiqen vizat amerikane 
Ish - deputeti nxjerr prapaskenat: SPAK-u po i heton, do të përfundojnë në burg! Këta biznesmenë kanë marrë të gjit… 
Gjermania aprovon dozën e tretë të vaksinës, grupet e rrezikuara që duhet ta marrin 
E qëlloi disa herë në sy të fëmijës, ky është vrasësi i 27-vjeçares shqiptare në SHBA (FOTO+EMRI) 
Uashingtoni dhe Londra akuzojnë Iranin për sulmin e anijes çisternë 
Vrasja e shqiptares në Florida, detaje të reja nga skena e krimit 
“Grushti i shtetit Soros”/ Si e kontrollon miliarderi botën përmes OJF-ve të tij 
Makina dhe shtëpi të zhytura në ujë, ky është qyteti që rrezikon të zhduket! 
Tragjike! 24-vjeçarja i jep fund jetës në shtëpinë e prindërve, ishte nënë e një fëmije 
'Aromë' diktature! Tre shtete evropiane s’u japin rrogën mjekëve nëse nuk vaksinohen 
Pamje të pazakonta! Një pilot befasohet nga ajo çfarë sheh teksa ishte në fluturim, publikohet videoja që po qarkul… 
“Bomba” e Alfred Cakos, parashikon sa vite jetë iu kanë mbetur personave që kanë marrë vaksinën anti-Covid 
Kush është gazetari i njohur shqiptar që paguhet nga grupet kriminale për të dalë në emisione? Reagon për herë të p… 
E pazakontë! Shihni çfarë ka ndodhur sot në plazhin e Qerretit, pushuesit vrapojnë me urgjencë në det 
Shihni sa ka ndryshuar Kim Jong-un, analistët zbulojnë planin që po përgatit udhëheqësi i Koresë së Veriut 
Zbulohen të tjera detaje për vrasjen e presidentit të Haitit, e dyshuara kryesore është ish gjyqtarja e Gjykatës Su… 
Tronditëse në Tiranë, një burrë bie nga ballkoni në rrethana misterioze dhe humb jetën/ Ja çfarë thotë Policia 
Studimi: Helmi i merimangës riparon dëmet që i shkakton zemrës një atak kardiak 
Studimi: Një përqindje shumë e vogël e ADN-së sonë është “njerëzore” 
A i ndihmojmë të varfrit kur u japim para? 
Faturonin kredi të paligjshme me dokumente të falsifikuara/ Policia procedon penalisht 2 shtetas 
Mashtruesi i famshëm i Instagramit pranon fajësinë – Ja skemat miliona dollarëshe që përdori për përvetësim të ardh… 
Zbulohet kush kërkon të blejë Alpha Bank 
E tmerrshme! Sulm me armë në një parking në Gjermani, ka të plagosur 
Studiuesit të shqetësuar, tregojnë çfarë ka shkaktuar përhapja Covid-19: Po kërcënon përparimin e programeve të vak… 
Sali Berisha del me qëndrimin e prerë: Nuk e pranoj këtë sjellje të Yuri Kim. Është keqpërdorur nga qeveria 
31-vjeçarja që u masakrua me thikë e kishte denoncuar bashkëshortin dy herë për dhunë në familje, policia heshti/ M… 
Video që po ‘thyen’ rrjetin/ E gënjeu duke i thënë se po shkonte në treg, gruaja kap 'mat' burrin me të dashurën në… 
Pas mesazheve ‘pikante’ të ambasadores Kim, Sali Berisha zbulon bisedën me Lulzim Bashën: Nuk i kërkova asgjë dhe a… 
Barack Obama do organizojnë një festë madhështore për 60-vjetorin e lindjes/ Ka një kërkesë për të gjithë të ftuarit 
Aksident me vdekje në Tiranë/ Shoferi përplaset me bordurën anësore, braktis makinën 
Manjani: Çfarë i jep në këmbim opozitës ambasadore? Përveç barit.. 
EMRI/ Ja kush është 27-vjeçari i mbytur në Lezhë 
"Bomba" e Bushatit/ E dija deklaratën Kim, ma kishte thënë një rilindas çfarë do thotë 
Valë të nxehta po presin Ballkanin, temperaturat pritet të shkojnë deri 45 gradë 
Deklarata kontradiktore dhe të gabuara të Yuri Kim! Problemi është Rama! 
Befasohen shkencëtarët, NASA publikon të dhëna tronditëse, gjendet ujë në... 
Nuk do ta besoni sa kushton një copë tortë nga dasma e Princit Charles dhe Princeshës Diana nga dalja në ankand pas… 
Paralajmërimi i frikshëm nga shkencëtarët: Ju tregojmë se çfarë po e kërcënon fatin e jetës në Tokë! 
Doktori arrestohet për krime kundër njerëzimit, rëndojnë mbi të 18 akuza për torturë e vrasje çnjerëzore 
Pandemia ul me 20% numrin e “milionerëve të vegjël”; 39 mijë të dy-punësuar deklaruan të ardhurat e 2020-s dhe pagu… 
Një leje pune dhe lëvizje e lirë e mallrave, zero minuta vonesa në kufi në 2023; Marrëveshjet që u firmosën në Shkup 
Asteroidi gjigand po vjen drejt Diellit, shkencëtarët të shqetësuar mbi atë çfarë mund të ndodhë: Po lëviz me një s… 
Kushtoi 420 milionë euro, Kroacia ndërton urën që përmbush ëndrrën e gjatë për të lidhur dy brigjet e Adriatikut 
Laçi bën historinë në Europë/ Eliminon rumunët e Krajovës 
Aurela Hoxha bëhet nënë për herë të parë, fotot e ëmbla me vogëlushin në krahë konfirmojnë gjithçka 
Ky është vendi i parë që nis me dozën e tretë të vaksinës anti-Covid 
E rëndë! Gjendet skeleti i një njeriu brenda në një fuçi në Greqi, dyshohet se i përket... 
Do ketë goditje në nivele të larta shtetërore? Spartak Ngjela paralajmëron zhvillime të bujshme: Shqiptarët po pres… 
Tragjedi në Lojërat Olimpike / Sportistja ndërron jetë në vend 
Porti i Durrësit/ Lapet sërish lëndë narkotike në të njëjtin konteiner, e treta herë brenda korrikut 
Ç’do të ndodhë me PD në shtator? Berisha e Basha viktima të njëri-tjetrit, ish-kryeministri s'ka çfarë i jep më pol… 
Dhuna ndaj gazetarit Gjençaj/ Meta: Rast i përsëritur i cënimit fizik të reporterëve! Zero tolerancë 
Studimi befasues: Fëmijët e lindur në këtë muaj janë më inteligjentë sesa të tjerët 
Studimi befasues: Fëmijët e lindur në këtë muaj janë më inteligjentë sesa të tjerët 
Fallxhorja në Levan të Fierit të bën deputet me një nuskë! Marrëdhënien me vjehrrën e burri ta bën ‘grurë’! 
Zhduken provat e NASA për jetesën antike në Mars, shkencëtarët dalin në konkluzionin e rëndësishëm 
Jo vetëm filma, shumë shpejt në Netflix do të ketë edhe lojëra 
Detajet/ Kokaina në kontenierët me banane e trafikuar nga njëjti grup që e zëvendësoi me oriz në 2019 
“Kam demonë në kokë, duhet të mendoj për shëndetin”: Kampionia amerikane Biles rrëfen dramën që e nxorri nga Tokio 
Zbardhet dëshmia e drejtuesit të “Benz”-it që iu largua policisë: Nuk ndalova pasi u ndjeva i frikësuar 
Kurbin/ 31-vjeçari braktis makinën në rrugë dhe kërcënon me armë policët 
Analiza/ Ku ka çaluar reforma në drejtësi? 
Djali i tij ishte i paralizuar, babai francez bën gjestin e rrallë dhe emocionon të gjithë botën 
Ishte e infektuar me variantin ‘Delta’, koronavirusi i merr jetën një 11-vjeçareje që vuante edhe nga një sëmundje… 
Deklarata e bujshme e Haradinajt, paralajmëron zhvillime të reja politike: Ja çfarë do ndodhë shumë shpejt 
Raporti final i OSBE/ODIHR për 25 prillin, reagon Celibashi: KQZ dëshmoi paanësi spartane. Është pranuar tashmë nga… 
Nuk ka qetësi! Tërmeti shkund Shqipërinë, ja sa ishte magnituda 
Kaos në Kakavijë, shqiptarët përballen me të papriturën 
Po ndodh kaosi në këtë shtet/ Presidenti “heq qafe” kryeministrin, merr vetë pushtetin! 
Masat kufizuese i jep Rama me telefon? Shefi i shërbimit të Mikrobiologjisë shuan zërat: Ja çfarë pritet në shtator 
SPAK bën lëvizjen e bujshme në Tiranë, arrestohen 3 zyrtarë 
I sëmurë apo dehur? Dalin pamjet e Erdogan që flet me vështirësi, reagon zyrtari i qeverisë turke: E tradhtuan njer… 
Gazetarja e njohur shqiptare plas ‘bombën’, zbulon emrin e politikanit që do të 'goditet' nga SPAK: ‘Peshqit e mëdh… 
Ngjarje e rëndë! Sportisti i talentuar ndërron jetë në moshën 16-vjeç 
NASA publikon studimin, çfarë  do të ndodhë pas vitit 2030: Përmbytjet në Gjermani dhe në shumë vende të tjera ësht… 
Shumica e amerikanëve të pavaksinuar nuk duan të imunizohen 
“Lidhjet politike nuk do mbrojnë askënd nga SPAK”, Arben Kraja paralajmëron ‘tërmet’: Gati hetuesit e parë të FBI-s… 
Kush është gazetari shqiptar që paguhet nga grupet kriminale për të dalë në emisione? 
Ligji i ‘fshehtë” për trashgimëninë e VIP-ave dhe familjarëve të ish-Bllokut, zbardhet dokumenti “Tepër Sekret”: Ja… 
FOTOT: Brenda tunelit që do të shkurtojë në 3 orë rrugën Tiranë-Sarandë 
FOTOT: Dikur shiste syze në rrugët e Athinës, sot është “Perëndia greke” e NBA 
Gjendet e vrarë në rrethana misterioze vajza e zyrtarit të lartë, çfarë ndodhi me 27-vjeçaren pasi doli nga shtëpia 
Politikanët grushtohen LIVE në emision, në fund i japin dorën njëri-tjetrit (VIDEO) 
Publikohet studimi më i fundit mbi variantin Delta që po ‘bën kërdinë’, mjeku Alimehmeti: Çfarë u zbulua për person… 
Kur mund të priten arrestimet e mëdha? Ngjela zbulon se kur do të sekuestrohen miliarda Euro e Dollarë, vila luksi,… 
Shkrimi shokues i ‘The Sun’: Alienë 2 metra të gjatë do të zbarkojnë në Tokë në maj të 2022! Ja çfarë ka përgatitur… 
E papritur/ Pezullohen nga detyra 9 zyrtarë të lartë të kësaj ministrie, njoftohet konferencë urgjente 
Kush do jenë ministrat e ardhshëm të Ramës? Mentor Nazarko paralajmëron surpriza të mëdha 
"Bomba" e Spartak Ngjelës: Ky politikan nuk do të jetë në Parlament në shtator 
Nuk kanë të sosur telashet për kosovarin me ‘Lamborghini’, ja çfarë ndodhi në Borsh (FOTO) 
Vrasja që tronditi Greqinë, autopsia nxjerr detaje rrëqethëse pë vdekjen e 26 vjeçares, zbulon çfarë ndodhi para se… 
“Kanë 1 miliard euro në banka, të tjerë janë me 20-30 apartamente”, Spartak Ngjela flet hapur për pasuritë marramen… 
"Familjarët e abuzuesve na kanë kërcënuar. Kanë marë vëllain në telefon, e kanë shantazhuar", VOA jep alarmin: Mbi… 
Princeshat e Dubait kanë qenë nën përgjim nga programi i “rrezikshëm” Pegasus, njëra dyshohet se mbahet peng nga ba… 
BBC jep ALARMIN: Kjo sëmundje godet pas shërimit nga Covid! Humbin jetën 4 300 persona në këtë shtet 
Tokio 2020/ Nuk humbisnin prej 44 ndeshjesh: amerikanet shemben në debutim 3-0 kundër Suedisë 
Përkeqësohet situata te Spezia: 4 të infektuar të tjerë, shkon në 14 totali 
Tregolësh në debutimin me ekipin e parë të Barcelonës: Manaj shënon edhe me gjoks para syve të Koeman 
“Kemi ardhur këtu të respektojmë veten”: Daja i tregon “dhëmbët” Basel 
Kontrollet policore nëpër rrugë, 18 shoferë të arrestuar 
Intervista e Kurtit në “To Vima”: Çfarë ndodh nëse Greqia njeh Kosovën 
Milwaukee kampionë të NBA pas gjysëm shekulli: Një grek udhëheq Bucks përballë Suns 
PD në rreth vicioz 
TIA: Pasagjerët që udhëtojnë drejt Athinës dhe Kretës duhet të ndjekin këtë procedurë 
60% e njerëzve të hospitalizuar aktualisht në Britani janë plotësisht të vaksinuar – Pse ndodh kjo?! 
Pastrimi i parave në fokus të Europës – KE kërkon ngritjen e një agjencie të re 
Del studimi i frikshëm: Reshjet dhe stuhitë ekstreme do të na godasin më shpesh! Ekspertët zbulojnë arsyen 
Trondit politikani i njohur, qëllon për vdekje në mes të lokalit 39-vjeçarin (EMRI) 
Kina prodhon trenin më të shpejtë në botë, nuk do ta besoni shpejtësinë e tij marramendëse 
Arrestohet DREJTORI i policisë, i gjejnë në banesë tualetin e punuar me ar dhe shumën marramendëse të parave (VIDEO… 
Publikohet studimi mbi jetëgjatësinë: Së shpejti nuk do të themi më ‘U bëfsh 100 vjeç’ por... 
“Një pariziene e  vërtetë dhe shqiptare me karakter”, Blendi Fevziu publikon historinë e rrallë të Konteshës Izabel… 
1.5 milionë ryshfet nga biznesmeni, Gjykata e Apelit lë në fuqi dënimin për ish-kryeprokuroren e njohur 
Arma e fshehtë që kontrollon klimën! Shihni si njeriu arrin të ndryshojë motin, nga temperatura 50 gradë në një rre… 
Përfundon pas 17 vitesh pallati më i lartë në botë, apartamenti më i lirë kushton vetëm 275 mijë euro 
Biden, urdhër për të promovuar konkurrencën / Agjencitë shtetërore do të “luftojnë” monopolet në sektorët kryesorë 
Italia paguan 33 mijë euro për këdo që do të jetojë në këto fshatra – Ja vendet dhe kriteret për banorët e rinj pot… 
OPEC+ arrin marrëveshje mbi prodhimin / Nga muaji gusht kuotat do të rriten me 400 mijë fuçi në ditë 
“Kam mamin sëmurë, më nis ndonjë lek”/ 29-vjeçari me foto vajze bënte namin në Facebook 
Dokumenti amerikan: Kina paguan hakera kriminelë për të sulmuar kompanitë 
FOTO/ Aksion blic i policisë në Shkodër, arrestohet bisnesmeni i njohur 
Sërish protestë e bizneseve në Lungomare: Nuk i duam “karamelet” e Ramës 
Në shtator kryetar Kuvendi? Erion Braçe befason me përgjigjen e tij 
Mark Marku dhe Fatbardh Kadilli bëhen një, kërkojnë protesta: Edhe të dhunshme po të jetë e nevojshme 
“Nga humbja në humbje”, Arben Ristani kritika të forta Bashës: Unë e dua me gjithë shpirt PD-në, demokratët e kanë… 
E quajti “kriminel”? Vuçiç mesazh të fortë për Albin Kurtin 
Paralajmërimi i frikshëm i avokatit të njohur: Shqipëria do të futet sërish në karantinë! Ju tregoj pse shkolla do… 
Kim Jong-un çudit botën me vendimin më të fundit 
Incident në Rinas, ndërhyn menjëherë policia 
Zbardhen detaje nga vrasja e Armando Beqirit që “tronditi” Islandën, shqiptari i “përlyer” në botën e krimit, vrasë… 
Policia jep detaje të reja nga grabitja e furrës së bukës në Lezhë: 10-vjeçari mori paratë nga arka 
Avokati i njohur paralajmëron “tërmet” në shtator: Rama nuk do të jetë më kryeministër! Do të ketë lëvizje shumë të… 
Këngëtari i njohur shqiptar harron çantën me mijëra euro në një piceri, gazetari zbulon se çfarë bëri pronari 
Priten zhvillime "bombë"! Spartak Ngjela nxjerr emrat, paralajmëron arrestimin e dy politikanëve të njohur shqiptarë 
Çfarë po ndodh në Vlorë? Biznesmenët përplasen me policinë, disa të shoqëruar në komisariat 
Edith Harxhi dhe Arben Ristani u përjashtuan, por kush është italiani i njohur që do të jetë pjesë e Këshillit Komb… 
Kush është shqiptari që grabiti dhe më pas e vrau ish-menaxherin e bankës në Itali (FOTO) 
Nuk iu shpëtuan dot paparacëve, aktori dhe moderatorja e njohur kapen ‘mat’ më momente intime në jahtin luksoz (FOT… 
Përsëritet historia në Greqi, shkoi me pushime dhe gjendet e vdekur disa orë më vonë, i dashuri i saj zhduket 
Trashëgimtarja e ‘Top Channel’ ndan sekreti/ Po ndjek këtë traditë me fëmijët (FOTO) 
Kritikoi ashpër Bashën në Kuvendin Kombëtar të PD-së, Mark Marku zbulon çfarë ndodhi pas fjalimit të tij 
Plas ‘sherri’ mes Ramës dhe deputetit të opozitës/ Shkak bëhet videoja e kryeministrit duke pastruar mjedisin 
Zhduket 45-vjeçari në Liqenin e Farkës, dyshimet e para të policisë 
Puthje e përqafime me Bashën/ Ja kush janë 2 demokratët besnikë që nuk iu ndanë Sali Berishës (FOTO) 
Videoja e frikshme që po ‘thyen’ rrjetin/ Po jepte intervistë ‘live’, kryebashkiaku përballet me situatën e rëndë,… 
Diplomohet studenti më i vjetër në botë në Britani, nuk do ta besoni sa vjeç është 
Kush urdhëroi vrasjen e presidentit të Haitit, zyrtari amerikan jep emrat për VOA-n 
Shoferin e zë gjumi në timon, autobusi i mbushur me pasagjerë shqiptarë përfundon duke u përplasur 
Skenë horror! Burri godet me shishe në kokë gruan dhe e rreh brutalisht për arsye banale (VIDEO) 
A mund të kthehen flokët e bardha në ngjyrën e tyre origjinale? Ja ç’thotë studimi 
Zjarri në Arkivën e Shtetit, reagon KQZ: U dogjën materiale të vjetra 
Arrestohet bashkëshorti i ish-ministres së njohur të kryeministrit Rama 
Thellohet bilanci tragjik në Europën Perëndimore, krijohet një gropë gjigande nga përmbytjet 
Helmoi mijëra njerëz në Deçan, ky është bakteri që u identifikua në mostrat e ujit, ja çfarë dihet për të dhe sa i… 
Avokati i njohur jep mesazhin e fortë: Ky është lajmi që ju fshehën dje televizionet shqiptare 
“I bëj thirrje Pandeli Majkos, Mimi Kodhelit, Oriola Nebiajt....”/ Vendimi i Gjykatës Kushtetuese për zgjedhjet e 2… 
Shqipëria do të përfshihet nga stuhia! Sinoptikania jep ALARMIN dhe tregon si do të jenë ditët në vijim 
“Kam video të papublikuara të ...”, gazetari i njohur paralajmëron publikimin e pamjeve të rënda 
Bieta Sulo largohet nga ‘Top Channel’? Moderatorja i surprizon të gjithë, tregon në cilin ekran televiziv do ta sho… 
TRONDIT mjeku italian/ Ja detajet e frikshme mbi vaksinën e koronavirusit dhe çfarë shkakton në organizmin e njeriu… 
“Paraja më e madhe në Shqipëri vjen nga korrupsioni”/ Artan Hoxha nxjerr prapaskenat e frikshme: Hetimet e kanë të… 
Dronë dhe radarë nga jugu në veri, policia apel qytetarëve: Të ishte për gjobat nuk do të... 
Aksidentet tragjike në vend, Blendi Fevziu del me mesazhin e fortë për qytetarët... (VIDEO) 
Organet që dëmtohen rëndë nga Covid tek rinjtë, studimi i fundit tregon komplikacionet e mëdha 
Zyrtarja e lartë e Shëndetësisë paralajmëron: Këta njerëz po preken më shumë nga përhapja e koronavirusit 
Vrasja e shqiptarit në Mykonos, mediat greke zbulojnë detajet e reja, çfarë ndodhi ditën e ngjarjes 
Tension në Shkodër, arbitri ndërpreu ndeshjen sapo shënoi Vllaznia 
ONM kundër shkarkimit nga vetingu të prokurorit të Tiranës 
Rritet bilanci/ 58 viktima dhe dhjetëra të zhdukur nga përmbytjet në Gjermani 
Tatimet: Si të çregjistroni pajisjet fiskale në rast përdorimi të një zgjidhjeje softuerike 
Green Coast në Palasë, qeveria zgjat edhe me 10 vite shfrytëzimin e plazhit, rishikohet sipërfaqja 
Shoqëruesi i ambasadores ndërhyn me urgjencë, ja çfarë ndodhi para se të fillonte deklaratën Yuri Kim (VIDEO) 
Plas keq në Kryesinë e PD-së, zbardhet sherri i Edmond Spahos me Gazment Bardhin: Si e shpjegon t’i këtë? (REPLIKAT) 
Si të kontrolloni në e-albania Pikët e Patentës suaj? DPSHTRR: Kujdes! Heqja e tyre ju çon në ‘riedukim’ 
“SPAK ta ngrejë stekën lart, të nisë puna me...”/ Do të ketë arrestime të tjera! 
“Më detyruan të shkoja me 50 burra në një natë”, zbardhet rrëfimi tronditës i Eglantina Bucit: Më përdorin koka sht… 
Një tjetër goditje e fortë! Arrestohet ish-zyrtari i lartë, ja çfarë pritet në vijim 
“Makina e Albanit ngeli në rrugë”, Bieta Sulon tregon incidentin që iu ndodhi në mes të natës teksa shkonin për pus… 
Abilekaj tregon se nga duhet të nisë puna e SPAK-ut: Prokurorët ndjekin paranë, është turp të thuash që... 
Edvin Kulluri me tone të ashpra kundër Bashës: Meriton të jetë në krye të listës së zezë së SHBA-së vetëm për këto… 
Gaia feston 1-vjetorin e lindjes, Olta Boka i bën dhuratën e veçantë 
Konsumonte kokainë në punë/ Kolegët zhvillojnë operacionin ‘blic’ dhe i vënë prangat efektivit të policisë 
Mundësia e jetës për këdo, SHBA ofron shumën e “çmendur” për informacione që do të ndalojnë… 
10 më “të pasurit” e vendit kanë rreth 540 milionë euro në bankat e Shqipërisë 
Arrestimet e SPAK, Lubonja: Regjia është Edi Rama 
Vuçiç: Nuk di nëse do të ketë përparim në dialogun me Kosovën 
Merret peng familja me katër anëtarë në Greqi 
Serie A, prezanton kalendarin 2021/22: start i vështirë për Milan, derbi i Italisë në javën e 9 
Detaje të reja nga vrasja me thikë e shqiptarit në Mykonos të Greqisë 
OBSH: Bota është në prag të një vale të re pandemie 
Flet shitësja e moshuar: Policët e bashkisë e ndajnë mallin me njëri-tjetrin, një gruaje i marrin përditë vaj dhe v… 
I dha arkë me peshk ish-zv.ministres, kush është avokatja 30-vjeçare me 4 super-biznese në Durrës që korruptoi Rove… 
I keni hedhur gjellës shumë kripë? Ekspertët e kuzhinës iu mësojnë 5 truket që do t’i shpëtojnë nga kjo situatë 
Policia Rrugore jep mesazhin e rëndësishëm për drejtuesit e mjeteve 
Shkencëtarët japin ALARMIN: Ushqimi industrial i qenve paraqet rrezik për njeriun, ja çfarë përmban 
SPAK shkakton ‘tërmet' në Shqipëri, a do të arrestohen politikanë? Vjen mesazhi i fuqishëm i BE-së 
Këto janë tetë efektet që përtypja e çamçakëzit mund të ketë në trupin tuaj 
Spartak Ngjela lëshon deklaratën e fortë/ Parashikon ‘TËRMET’ në politikën shqiptare dhe tregon a do të arrijë të h… 
Papandreu bën bashkë Albin Kurtin dhe Edi Ramën/ Ja arsyeja e vizitës misterioze të 2 kryeministrave shqiptarë në G… 
Pushuesit panikosen/ Gjallesa detare kërcënim për qytetarët në Darëzez: Pickimi tyre shkakton fatalitet 
Kur COVID të bën super të pasur/ Drejtori i AstraZenecas blen shtëpinë luksoze me vlerën marramendëse në Sydney 
Prapaskenat! Sali Berisha bën deklaratën e fortë, flet për lidhjet e Enver Hoxhës me mafien italiane 
Një anëtar i Kushtetueses drejt përjashtimit/ DSIK i refuzon certifikatën e sigurisë si i pabesueshëm 
Kokaina në Portin e Durrësit, policia: Arrestohet menaxheri i firmës, në kërkim vëllai i tij administrator 
Mbi 53 gradë celsius, tjetër valë e të nxehtit ekstrem po përvëlon Amerikën 
Dhuna e policëve të Veliaj/ PD: Sjellje shtazarake ndaj atyre që luftojnë për bukën e gojës 
Delta bën “namin” në Britani, mbi 30 mijë të infektuar, 50 jetë të humbura 
“Ishte përgjegjës për letrën e banjos”, Hajdarmataj rebelohet me “makthin” e prokurorëve: Jam i fyer 
Tokyo 2020 humb një tjetër kampion, Federer nuk do të jetë: “Problem në gju, zhgënjim i madh” 
BIRN/ Media hapësirë “pa limit” PS dhe Edi Ramës 
Kompani "offshore" pas miliardave në Durrës/ Ja kush është avokati, ortak me kunatin e Bashës, që qëndron pas kompa… 
SHBA jep alarmin, paralajmëron për rrezikun e një sindrome të rrallë nga kjo vaksinë anti-Covid 
Nuk festoi në penalltinë e fundit që i dha fitoren Italisë, portieri Donnarumma zbulon të vërtetën: Ju betohem që... 
Toto Riina kërkoi një ekspert nga Shqipëria/ Mediat italiane nxjerrin detajet e forta: Një shqiptar i përfshirë në… 
Fundoset ish-zv.ministrja e Ramës, Klodiana Lala zbulon detajet e forta, paralajmëron të tjera arrestime në nivele… 
KPK e shkarkoi nga detyra, KPA merr vendimin drastik për drejtuesin e Apelit të Gjirokastrës 
E pazakontë kjo që ka ndodhur, një foshnje qan pas 50 vitesh në ishullin grek 
Kapja e kokainës në Durrës, vjen reagimi i para nga Ministria e Brendshme 
Shpërndarja e mandateve të deputetëve, 'Kushtetuesja' zbulon vendimin e rëndësishëm 
Aeroporti Ndërkombëtar ‘Nënë Tereza’ jep njoftimin me shumë rëndësi për të gjithë udhëtarët që duan të fluturojnë d… 
SPAK merr vendimin e papritur/ Ish-zëvendës ministrja e Brendshme e Ramës në pranga 
“Plas në verë, ngrin në dimër!”- Efektivët e Policisë tregojnë peripecitë me uniformat 2800 euroshe: S’i lajmë dot… 
Rama publikon pamjet nga ura që lidh Tiranën me veriun: Përfundon brenda vitit 
Vaksinat do të jenë të detyrueshme për…Greqia prezanton 4 masa të reja! Kryeministri Mitsotakis: Ata që nuk binden… 
Tatimet sqarojnë institucionet financiare jo bankare si të veprojnë me fiskalizimin 
Hap rrugët edhe Suedia, kriteret e shteteve që lejojnë deri tani udhëtimin e shqiptarëve 
Pas Ballkanit, tarifat roaming mund të hiqen edhe me BE-në 
Deti Mesdhe është i ‘sëmurë’, një rrjet termometrash i mat temperaturën çdo 15 minuta 
WhatsApp, në shënjestrën e BE / Ankesa nga organizatat e konsumatorit mbi ndryshimet e privatësisë 
===