 tha çdo sjellë  dhe  në Durrës? Unë po them që ato në fillim sdo i sjel… 
 LIVE - Takim me të rinjtë e Durrësit! 
 Shpreh keqardhjen e thellë për pasojat e rënda të tërmetit të sotëm në Greqi dhe Turqi, uroj për kapërcimin sa më të s…
Shoku Baton, më vjen keq që Ilir Meta jua prishi shumë qefin sot me intervistën e tij. Ju nuk jeni mesuar që politi… 
 (1/4) Dibra trime dhe e mençur, simboli i qëndresës së shqiptarëve, ka qenë përherë djepi i luftërave patriotike për li…
 KOHA PËR TË MBROJTUR DEMOKRACINË ËSHTË TANI! Zgjidhja nuk duhet të jetë më largimi, por vetëm ZGJIMI, BASHKIMI, REAGIM…
Urime të gjithë nxënësve, mësuesve dhe prindërve për këtë vit të ri shkollor, veçarërisht atyre vogëlushëve që sot… 
Shtatori erdhi me shi! Muaj të mbarë miq!  
I lumtur për ekipin e Tironës⚪Urime kampiona! 
Urime të gjithë Shqiptarëve të Maqedonisë së Veriut që të bashkuar thyen tabunë.  Si fillim  ditë, e më pas qofs… 
Nga sfidat në parlament te jeta jashtë politikës, rrëfimi ndryshe i Kejdi Mehmetajt: LSI do jetë opozita e munguar 
Erklent Krifsa/ LSI është verbuar kur ju ka vendosur ju dhe njerëz të tjerë si ju për të përfaqësuar ëndrrat,... 
'Xhemal Qefalia, do t'i tregoj në gjyq zullumet e tua' 
Erklent Krifsa/ “Shqipëria është e të rinjve dhe e shqiptarëve, jo e oligarkëve dhe kriminelave” 
"Qendrimi i LSI nuk mund të blihet me asnjë çmim"- Monika Kryemadhi 
Dëshiroj t’ju uroj me rastin e përurimit tuaj si President i Republikës së Shqipërisë! Unë dhe Qeveria ime presim... 
Meta: E gjithë jeta ime politike lidhet me të rinjtë dhe shpresoj të kem bërë më të mirën që të jenë sa më aktiv... 
Ilir Meta, uron Kryetarin e Senatit, Mike Pence dhe Kryetarit të Dhomës së Përfaqësuesve, Paul Ryan 
Deputetja e LSI: Rama bën mbledhjen e PS në Kryeministri. Kjo është e paligjshme 
Në 25 qershor Njësia 10 do të marrë notën 10 duke votuar 1️⃣ VOTO 1 VOTO LSI ✔️ ëEParë ëShansPërTëGjithë 
Erklent Krifsa/ "Diktaturë s'ka sa të ketë jetë rinia. Është koha jonë, është koha rinisë, është koha Lsi-së" 
Rinia e Shqipërisë ia jep BESËN Lëvizjes Socialiste për Integrim. Kjo është fuqia e rinise qe e cila kerkon qe... 
Sot, ora 19:00 të gjithë bashkë në sheshin "Nënë Tereza" në mbështetje të ekipit fitues të LSI Tiranë.... 
LSI dhe Ilir Meta me 15 qershor miting të madh në Tiranë (VIDEO) 
Kryemadhi në Mirditë: Edi Rama do timonin, por në fund do t’i ngelet vetëm koka e marshit 
Reagon kryetari i LRI-së në Tiranë, Erklent Krifsa për sulmet ndaj LSI-së/ "Lsi sot është forcë e parë dhe s’ka... 
Mehmetaj i përgjigjet flakë për flakë Ramës: Mos fol me arrogancë, kërkoji falje maturantëve 
Furtuna e shkarkimeve, LSI në konferencë urgjente, sulm të ashpër Ramës dhe Bashës: Marrëveshje perverse 
Elio Laze sulmon Tahirin: Me makinën e tij të përdorur nga trafikantë, ka ca kohë që shëtit Olsi Rama nëpër... 
Kejdi Mehmetaj: Rritja e LSI, panik për partitë e tjera. Ja pse dalim forcë e parë 
LSI Forcë e parë do të thotë Drejtim i ri i Qeverisë që ul taksat e hap vende të reja pune të mirëpaguara.
Agjërim të lehtë e të pranuar për të gjithë besimtarët Musliman !
Kejdi Mehmetaj/ Ja pse LSI do të dalë forcë e parë në zgjedhjet e 25 qershorit - Shekulli Online 
”Sa të ketë fjalë e besë Malësiadel e para LSI-jasup më sup lidhur si maletLSI-ja kurrë nuk ndalet”
===