 Në legjislaturën e fundit, mazhoranca socialiste shfrytëzoi mbështetjen e opozitës parlamentare për të kaluar shumë nisma li…
Parlamenti i “djegur”, protagonizmi 4-vjeçar përmes figurës dhe zërit të aktorëve  via 
 Lushnja drejtohet nga burgu. Kryebashkiaku Tushe ruan mandatin deri në vendimin e gjykatës  shpjegon...htt…
Lushnja "drejtohet" nga burgu / Kryebashkiaku Tushe ruan mandatin deri në vendimin e gjykatës  via 
Nuk kërkojnë ndihmë as për vaditje e as për subvencione. Fermerët duan ndihmë pasi ariu u  shkatërron qershitë… 
Fundi i legjislaturës kthehen PD dhe LSI, përfundon eksperimenti me opozitën në Kuvend via 
“Politika në një javë”, vjen fundi i Parlamentit të pazakontë  via 
Ambasadori i BE në Shqipëri merret në mbrojtje nga Garda e Republikës  via 
Legjitimiteti i 30 qershorit 2019, “Venecia” është shprehur që para 2 vjetësh: Bojkoti nuk i pengon zgjedhjet… 
Janë të ligjshme apo jo zgjedhjet vendore të vitit 2019? Kësaj pyetje nuk mundi t’i jepte përgjigje Gjykata Kushtet… 
 “I shkarkuar apo jo, pavarësisht çfarë qëndrimi do të mbajë Gjykata Kushtetuese, vendimi i Parlamentit duket se i shtroi…
Çfarë nuk u pa dhe çfarë do të thotë shkarkimi i Metës?  via 
Ilir Meta i shkarkuar, Kuvendi jep 104 vota pro dhe “pason” Presidentin në Kushtetuese  via 
Bechetti fitoi 108 mln euro: Qeveria pranon humbjen në arbitrazh, socialistët fajësojnë drejtësinë  via 
Politika në javë: Nga gara në PD te shkarkimi i presidentit  via 
Përgjime kundër korrupsionit, SPAK ndez “çimkat” për zyrtarët e lartë shtetëror  via 
“Politika në një javë”, shumica e vendosur për shkarkimin e Metës  via 
“Spiunët publikë”, sinjalizimi antikorrupsion në administratë nuk funksionoi  via 
KAS përfundon numërimin e votave për Beratin: Rezultati nuk ndryshon  via 
Ankimimet zgjedhore, KAS vendos të hapë 24 kuti në Berat. Rrëzon kërkesat e PD-së  via 
KAS “ngec” edhe në Berat. PD, akuza Rusmalit për mbështetje ndaj Edi Ramës  via 
PS siguron që në start votat e nevojshme për të shkarkuar Presidentin Meta. Presidenti 3 javë nën hetim parlamentar… 
Beteja procedurale për bllokimin e hetimit parlamentar, Meta: Kuvendi s'ka legjitimitet për tmë shkarkuar… 
“Politika në një javë”, mazhoranca e vendosur për shkarkimin e presidentit  via 
Listat e hapura, edhe pse me "herës", dhanë rezultat! Personi kyç i Reformës në Drejtësi, Fatmir Xhafaj… 
Dibra thyen rekord për fletët e pavlefshme të votimit  via 
Presidenti beri thirrje për të rrokur armët e ftohta, por situata u ndez pak çaste më pas - Mbrojtja e votave, Meta… 
Gjykata Kushtetuese, padia për 30 qershorin shtyhet pas zgjedhjeve parlamentare  via 
Si do të votojmë më 25 prill? Rastet kur vota quhet e pavlefshme  via 
Kolegji rrëzon PD, hiqen emrat e kandidatëve, si do të duket fleta e votimit  via 
Zgjedhjet në rrezik, kompania sllovene: Nuk ka kohë për prodhimin e fletës  via 
Vetting edhe për noterët, hiqet licensa nëse mungon integriteteti dhe besueshmëria  via 
Fleta e votimit, PS e PD të pakënaqur. Çështja shkon në KAS  via 
Formularët e dekriminalizimit, Rama rrezikon përjashtimin nga zgjedhjet, Basha me mangësi  via 
Monitorimi i zgjedhjeve, ODIHR: Do të jemi në zonat e nxehta, kemi mjaftueshëm njerëz  via 
Dekriminalizimi, 3 kandidatë në sitën e verifikimit të Prokurorisë  via 
Mbaron afati i dytë për listat, PD përsëri me emra më shumë, Koduzi jo më kandidat  via 
Listat e kandidatëve, PD rrezikon të skualifikohet, më shumë emra sa kërkohen  via 
Presidenti Ilir Meta përleshet me Policinë Bashkiake  via 
Rama në Vlorë: Lista e PD-së e paligjshme, kemi edhe "Ilir Meten" në fletën e votimit  via 
Qeveria i hap derën vaksinave ruse dhe kineze  via 
Meta i përgjigjet akuzave të Ramës: Unë nuk përdor kokainë, kryeministri ka probleme shëndetësore  via 
Loja e PS me renditjen. Çfarë duhet të bëjnë xhaketat e vjetra për të rhyrë në Kuvend  via 
Luljeta Bozo kandidate e PS në zgjedhjet e 25 prillit, Rama: Pensionistët do të kenë zërin e tyre  via 
 Patozi në “Absolut 4”: Presidenti, më i shqetësuar për zgjedhjet sesa gruaja e tij  via 
Fushata në pandemi, debati në Kushtetuese mes qeverisë dhe gjyqtarëve  via 
Brukseli zyrtar: Shqipëria ka përmbushur kushtet, testi mbeten zgjedhjet  via 
Reforma në Drejtësi, PS propozon ndryshime ligjore që prekin edhe Kushtetuesen  via 
Politika në një javë: Nga koalicionet e partive të vogla te vota e Diasporës  via 
Si do të jetë fleta e votimit dhe si do të funksionojë bashkimi i së djathtës?  via 
SHBA nuk e do në fletën e votimit, Tom Doshi rimerr drejtimin e PSD  via 
Ping-Pong me drejtësinë, KLGJ fajëson Gjonajn për stokun e çështjeve gjyqësore  via 
Kandidatët e pastër, Soreca: Kryetarët e partive mbajnë përgjegjësi për listat  via 
Teknologjia në zgjedhje, identifikimi kalon me sukses, votimi e numërimi në Njësinë 8  via 
Bisedimi me qytetarët e Vlorës, Rama sulmon Metën: Tragjedi shpërdorimi i Presidencës  via 
Komisioni për “Dick Marty”, PS kërkon 3 muaj të tjerë për të mbledhur “prova”  via 
Zgjedhje në pandemi, qeveria harron votën e të prekurve me Covid  via 
Shemsi Prençi “lë” Metën për Monika Kryemadhin  via 
Zgjedhjet e Kosovës, serbët e Pejës të painteresuar, pjesëmarrje e ulët në votime  via 
 "Absolut 4": Shqiptarët, politika dhe zgjedhjet  via 
Zgjedhjet e 25 prillit, KQZ në “kërkim” të fletës së votimit  via 
Kishin “harruar” paratë, Kuvendi jep fondet e fushatës për partitë  via 
Politika në një javë/ Programet ekonomike të opozitës dhe qëndrimi i ambasadores Kim  via 
"Dekriminalizim" edhe për shpenzimet në zgjedhje  via 
Kandidatët e 25 Prillit, SHBA kërkon “vetting” përpara zgjedhjeve. Kandidatët duhet të "gëzojnë pastërtinë e figurë… 
Zgjedhjet e 25 prillit, Celibashi: Pak kohë për votën e emigrantëve, 800 mijë të tjerë pa ID  via 
 Ndër të parët që morën vaksinën, Pipero infektohet me Covid-19  via 
Nga miniera në parlament, kandidati i pavarur: Nuk bashkëpunoj me PD-PS, ka një hile për firmat  via 
Përvjetori i 21 janarit, kërkesa për rinisje të hetimeve dhe shpallja dëshmorë e 4 viktimave  via 
“Drejtësitë” e 21 janarit, dëmshpërblim moral dhe financiar, por askush pas hekurave  via 
10-vjetori i 21 Janarit/Rama shpall “Dëshmorë të Atdheut” 4 viktimat. Nisma ishte fabrikuar që në dhjetorin e 2018,… 
Nga Ballkani në BE, përplasjet diplomatike të Ramës në 7 vite qeverisje  via 
Politika në një javë: Sesioni i ri parlamentar, marrëveshja me Pfizer dhe votimi elektronik via 
Kontrata e vaksinës, Ruçi: Deputetët s'do të votojnë qorrazi, por të ruajnë sekretin  via 
Promovimi në politikë, Rama ndryshon qasje: Nuk mjafton dija për t'u bërë deputet  via 
Fushatë me shiun / Rama dhe Basha përplasen në distancë, por nuk raportojnë në KQZ  via 
Meta “bekon” marrëveshjen PS-PD. “OK” ligjeve të “5 qershorit”  via 
 Skena të paimagjinueshme, brenda godinës së Kongresit amerikan.Ndiqni zhvillimet live në A2:  
Merkato e kandidatëve, Nasip Naço kalon me PS: Jam i bekuar në krah të Blendi Klosit  via 
Identifikimi biometrik, tenderi në pikëpyetje, vetëm një kompani shfaq interes  via 
 Kaos në SHBA, mbështetësit e Trump përleshen me Policinë para godinës së Kongresit.Ndiqni zhvillimet live në A2: 
 Kaos në SHBA, mbështetësit e Trump hyjnë në godinën e Kongresit.Ndiqni zhvillimet live në A2:  
Teknologjia në zgjedhje, Pelingu: Identifikimi biometrik i realizueshëm, s’ka "plan B"  via 
Zgjedhja e 9 anëtarëve të rinj të KED 
Zgjedhja e nëntë anëtarëve të rinjë të Këshillit të Emërimeve në Drejtësi 
Procesi zgjedhor ka nisur me akuza për zhvendosjen fiktive të popullsisë.  Komisioni Qendror i Zgjedhjeve… 
76 vjetori i çlirimit e gjeti vendin  nën një tjetër luftë, atë me  
Nisma e re e qeverisë është depozituar në Kuvend dhe parashikon ndryshimin e ligjit ekzistues për disiplinën në FA.… 
 Hetime për UÇK edhe në Shqipëri, ligji që i hapi rrugë EULEX-it të hetonte ish-udhëheqësit e luftës
 Ku janë paratë e donatorëve? Dalin shifrat, 5.9 mln dollarë donacion nga të huajt për tërmetin  
 Bonusi ndërpritet në dhjetor, të pastrehët e tërmetit do të trajtohen sipas ligjit nga bashkitë 
 Pas tre orësh diskutime intensive në Këshillin Politik për reformën zgjedhore, përfaqësuesit e partive parlamentare dh…
===