Stuhia tropikale “Elsa” drejt bregut perëndimor të Floridas 
AKU kontroll në kufi bimëve të importuara, Ministria e Bujqësisë: Të shmangen sëmundjet dhe parazitët 
Ish-nënkancelari i Austrisë, Heinz-Christian Strache, në proces gjyqësor për rryshfet 
Zyrtarët amerikanë dhe rusë do të diskutojnë sulmet kibernetike 
QKB u kujton bizneseve të dorëzojnë pasqyrat financiare deri në 31 korrik 
Qeveria meksikane shpall lotarinë për pronat e sekuestruara të El Chapos, bileta për të marrë pjesë kushton 10 doll… 
Ngjarje e pazakontë në Shëngjin, një shtetas rus vjedh targat e një makine që i përkiste një kosovari 
Sllovenia kërkon hapjen e negociatave të BE-së me Tiranën dhe Shkupin deri në tetor 
Shqipëria anëtare e Këshillit të Sigurimit në OKB, Xhaçka në pritjen zyrtare: Moment historik! Shqipëria sot ka se… 
Administrata Biden synon të ndryshojë politikën e sanksioneve 
FOTO: “Tushe sapo doli nga një mbledhje, policët i thanë ‘mos lëviz’, u pyet në zyrë për dy orë”, pamje të arrestim… 
U infektua me COVID-19, kryeministri i Luksemburgut në gjendje të rëndë 
EMRAT: SPAK dhe RENEA operacion masiv anti-korrupsion, ndalohen disa zyrtarë të lartë, mes tyre edhe kryetari i Bas… 
Një dëshmitar i akuzës tërhiqet, shpresë lirie për Julian Assange 
Lamtumirë benzinë e naftë, deri më 2035, më pas në Evropë do të ketë vetëm vetura elektrike 
Masakra në Velipojë, Pjerin Ndreu: Si i zgjidhëm konfliktet mes biznesmenëve në Lezhë. Arsyet pse turistët duhet të… 
Prodhuesit e shampanjës franceze protestojnë kundër ligjit rus 
Mbërrijnë mbi 16 mijë vaksina , pjesë e kontratës së qeverisë me kompaninë dhe mbështetje nga Austria 
Blegtoria në krizë, fermerët nuk gjejnë punëtorë edhe me pagesë 30 euro në ditë 
Kryeministri Albin Kurti: Kosova të bëjë detyrat, BE-ja të mbajë premtimet 
Aksidentet nga bombolat, furnizimi vetëm në pika të certifikuara, shtohen rastet e qytetarëve me djegie 
Frikë në Afganistan, tërheqja e ushtrisë amerikane rrit presionin mbi qeverinë afgane 
Pandemia uli numrin e azilkërkuesve që tentonin hyrjen në Shqipëri, vendi ynë i preferuari i sirianëve dhe i iraken… 
Gjermania në hall, qytetarët nuk po paraqiten për t’i marrë vaksinat 
Hakerat kërkojnë 70 milionë dollarë për zhbllokimin e sistemeve kompjuterike 
Operacioni ‘Shpirti’, në hetim edhe një prokuror i SPAK 
Kryeministri i Luksemburgut përfundon në spital, rezulton pozitiv me COVID-19 
Vrau gruan me thikë e më pas plagosi rëndë veten, çifti jetonte prej vitesh në Tiranë! Kishin një biznes në kryeqyt… 
Pandemia lë shqiptarët pa shkuar në bare e restorante, konsumi 10% më pak se para krizës 
Covid-19 do të trajtohet si grip sezonal, shteti i parë që nuk do të raportojë më rastet e reja 
Keni humbur bagazhet ndonjëherë? Për të shmangur këtë, linjat ajrore po bëjnë investime të mëdha në teknologji 
Bota po mbulohet nga plastika, por mund të na shpëtojnë…lopët 
Ndërsa plakemi, a bëhen ushqimet tona më pak të kripura dhe kafeja me aromë më të dobët? 
Shpërthim i fuqishëm në detin Kaspik, dyshohet për një anije çisternë 
Egjipti lë të lirë anijen e mbajtur peng, qeveria japoneze do të paguajë 550 milionë dollarë 
Rrëzimi i avionit ushtarak në Filipine, konfirmohen 45 të vdekur, 42 ushtarë dhe 3 civilë 
Fshihte në shtëpi deputetin që urrente shqiptarët, ukrainasja flet me pranga në duar 
Dy javë më parë i hoqën, tani rekomandohet që edhe të vaksinuarit të mbajnë maska. Varianti Delta i koronavirusit r… 
Makinat luksoze dhe të zhurmshme shqetësojnë fqinjët në dasmën që zgjati 4 ditë, njoftohet policia 
Simptoma që tregojnë se jeni alergjik ndaj pickimit të mushkonjave 
Dëshmia e dy prej të penduarve që implikoi truprojat e ministrit: Drogën e morëm në plantacionin e tyre në Tepelenë… 
“Autostrada për askund” që fut Malin e Zi në borxh, Kina mund të marrë tokë nga vendi fqinj 
Sekuestrohen 33 mijë dollarë në Rinas, procedohet penalisht një 43-vjeçar turk 
Katër të lënduar nga shpërthimi në Velipojë, QSUT: Me djegie të rënda në trup, po marrin mjekim intensiv 
“Do më hajë”, vajza e vogël afrikane  tmerrohet kur takon për herë të parë  një të bardhë 
Mitsotakis i prerë: Greqia nuk do të mbyllet përsëri për të mbrojtur disa të pavaksinuar 
Konkurrencë mes miliarderësh, Branson dhe Bezos për fluturimin në hapësirë 
Kryeministri Kurti i ofron bashkëpunim kryetarit të ri të PDK-së, për “temat me interes nacional” 
Europa e pa vaksinuar plotësisht, OBSH-ja: Varianti Delta do të jetë mbizotërues deri në gusht 
Një jetë në udhëtim, 83-vjeçari që ka vizituar çdo vend të botës 
Komisioni Evropian synon ndalimin me ligj të mbajtjes së kafshëve në kafazë 
Vatikani akuzon nëntë persona për krime financiare 
23-vjeçari shqiptar rrihet brutalisht me shkopa bejsbolli dhe shufra hekuri, ndërron jetë në spital! Iu bë pritë në… 
“Bregdeti Ynë”, Çuçi bën bilancin: U shembën mbi 130 ndërtime pa leje nga Velipoja në Ksamil 
 zgjidhet kryetar i Partisë Demokratike të Kosovës 
Bashkia e Tiranës miraton fondin për financimin e ekipit shqiptar në Lojërat Olimpike të Tokyos 
Janusz Bugajski: A do ketë një marrëveshje mes Prishtinës dhe Beogradit. Pse siguria e Ballkanit varet nga rezultat… 
Hapen me kapacitet të plotë lundrimet e trageteve për udhëtarët nga Porti i Sarandës drejt Greqisë! Ministrja Denaj… 
Nisen nga Karaburuni, por gomones i prishen dy motorët, turistët mbeten në mes të detit! Shpëtohen pas disa orësh n… 
I biri i dënuar si koka e grupit të drogës në Greqi/ Gjykata e Fierit sekuestron 3 llogari bankare të nënës së tij… 
Foto historike/ Ikën ushtari i fundit amerikan nga baza e rëndësishme në Afganistan, pas dy dekadash Bagrami është… 
U arrestua për korrupsion, gjykata lë në burg prokurorin Edmond Karriqi 
Gjykata e Lartë në SHBA nuk pranon të shqyrtojë apelin e Shkëlzen Berishës për akuzat ndaj tij 
Gjithnjë e më pak njerëz duan të kthehen në ambientet e zyrave 
Euro 2020 / Ndeshje spektakolare, Italia mposht Belgjikën dhe kalon në gjysmëfinale 
Rreziku i pandemisë, vendi arab përjashton të pavaksinuarit nga hapësirat publike 
Çfarë duhet të dini nëse udhëtoni pas datës 5 korrik drejt ishujve grekë, kushtet që duhen plotësuar 
Uji nuk skadon, atëherë pse shishet kanë datë skadence? 
Tensionet BE-Turqi, Erdogan thotë se kërkimet për naftë do të vazhdojnë 
SHBA, plane për taksa të reja; të pasurit të shqetësuar ku të “fshehin” pasurinë 
Paralajmërimi i Lames nga Pogradeci: Kush ka bërë dëm me ndërtime pa leje të mos flejë i qetë 
Me këtë makinë, mund të gatuash kudo e kurdo, e ka kuzhinën brenda 
Flet ish-shoqëruesi i Saimir Tahirit: I shokuar nga akuzat e SPAK, do vij në Shqipëri të përballem me drejtësinë! 
Sondazh / Shqiptarët mendim më pozitiv për Greqinë sesa grekët për Shqipërinë 
Ngjarje e rëndë në Kavajë / Detyroi mbesën e mitur të drogohet dhe e ngacmoi seksualisht, arrestohet 31 vjeçari 
Kushtetuesja la në fuqi prishjen e godinës, Veliaj: Të ecim përpara e të ndërtojmë shtëpinë më të madhe të Teatrit… 
Pas Shqipërisë, SHBA me ‘dorë të hekurt’ në Maqedoninë e Veriut: Sanksione ndaj personave të korruptuar 
Ngjarje e rëndë në Vlorë, vëllai qëllon motrën me armë zjarri 
TEATRI / Gjykata Kushtetuese pezullon ndërtimin e godinës së re nga Bashkia e Tiranës dhe Ligjin Special për dhënie… 
VIDEO / Policia publikon pamjet: Pa rroba dhe të kapur në befasi, 200 efektivë policie kontrolle nëpër vila luksoze… 
Shqipëria e rrezikuar nga Delta, Brataj: Vaksinohuni, vala tjetër vjen brenda verës 
NJOFTIMI ZYRTAR: Nga arrestimi i drejtorit te shoqëruesit e ish-Ministrit të Brendshëm, të gjitha detajet e ‘SHPIRT… 
Rama: Nuk do lusim Europën, as u themi nëse nuk na merr ti ka ca bushtra që duan të na marrin. Ne jemi të relaksuar… 
Pse Nënë Tereza refuzoi që të stampohej portreti i saj në kartëmonedhë? Të pathënat nga vizita e parë e Nobelistes… 
Studimi i ri: Epidemia e koronavirusit daton 20 mijë vjet më parë në Azinë Lindore 
Shefi i Sigurisë Rrugore në Policinë e Shtetit, Skënder Ismaili, tregon detaje aksidentin që shoi familjen Gushi: E… 
“Qytetarët të mos presin shtatorin, por të vaksinohen”, Manaistriliu: Asnjë rast të variantit DELTA në Shqipëri, po… 
Rikonstruksioni i kabinave, nesër në këto zona në Tiranë do të ndërpritet energjia elektrike 
Danimarka dhuron 1 milion vaksina AstraZeneca për Ballkanin Perëndimor, përfiton Shqipëria 
Një grua 82 vjeçe do të udhëtojë me Jeff Bezos në hapësirë 
Hapen për të gjithë udhëtarët Kapshtica e Kakavija, Ministria e Jashtme: Ja çfarë duhet të keni me vete 
OBSH ngre shqetësimin se grumbullimet për Euro 2020 po përhapin më tej COVID-19 
Ceremonia e Ditës së Pavarësisë së SHBA-së,  Kim bën bashkë Ruçin, Metën, Bashën! Mungon Rama 
Tentoi të ndizte makinën duke e zbritur nga kodra, shoferi në Sarandë përplas 3 automjete 
Rama poston foton: Lidhet edhe ura e fundit e bypassit të Vlorës 
Siguronin euro false në Itali dhe i hidhnin në treg në Tiranë, arrestohen dy 21-vjeçarët nga Kruja 
“BREGDETI YNË” / Vendosën shezlongë dhe çadra pa leje në bregdet, procedohen 8 administratorë në Vlorë, Sarandë, Hi… 
Rruspa dhe bikini, a është vera koha e duhur për aksionin në bregdet? Ministri i Turizmit duhet të japë një shpjegi… 
Gara për maturantët, datat kur duhet të plotësoni Formularin A2 
SHBA “i tërheq veshin” BE-së për hapjen e negociatave: Të zhgënjyer nga vendimi për Tiranën dhe Shkupin, po pengoni… 
Qëndronte prej javësh e bllokuar, Greqia hap pikën kufitare të Kapshticës, çfarë duhet të keni me vete përpara udhë… 
Nis strukturimi në Policinë e Shtetit, i pari që largohet është drejtori për Sigurinë Publike 
Meta dekreton ligjin e marrëveshjes me Zvicrën, 8.8 mln euro në projektin “aftësi për punë” 
Vala e katërt e COVID, ekspertët në Francë paralajmërojnë rrezikun nga varianti Delta 
Edhe Dhoma e Tregtisë kërkon shtyrje të procesit të fiskalizimit, të mbështeten sipërmarrjet për kostot 
Vendimi i marrë në Këshillin e Ministrave, shtyhet afati i vlefshmërisë së pasaportave diplomatike dhe atyre të shë… 
Akuzohet për marrje ryshfeti, arrestohet Kryetari i Komisionit të Mediave të Pavarura në Kosovë 
Tottenham zgjedh pasuesin e Jose Mourinho, është sërish një trajner portugez 
Vdes në moshën 88 vjeçare, ish-sekretari amerikan i mbrojtjes, Donald Rumsfeld 
Kamarieri shkodran i dorëzon nënës së Musaenit zarfet me mbi 2 milionë lekë bakshishe e ndihma 
Rihapen hetimet për vrasjen e bankierit Artan Santo, Vocaj: Kemi të dhëna të reja 
Megi Fino, vajza e ish-deputetit socialist Bashkim Fino, emërohet zv/ministre për Europën dhe Punët e Jashtme 
Sekretari i Përgjithshëm i OKB-së, Guterres i bën thirrje SHBA-së që të heqë sanksionet ndaj Iranit 
Kurti flet për Liqenin e Ujmanit: Qendrimet tona mbeten të njejta, ai është i Kosovës 
Situata e pandemisë në vend, këto janë 4 qarqet e çliruara plotësisht nga virusi 
E papritur! Merret vendimi në Europian, sfida Angli-Ukrainë do të luhet pa tifozë britanikë 
Akuzohet për korrupsion dhe përfshirje në grupet kriminale, arrestohet prokurori i Kukësit dhe shoferi i tij. Hetoi… 
Gjykata Kushtetuese rrëzon listat e mbyllura: Shfuqizon nenin që ndan mandatet sipas herësit, futet në Kuvend deput… 
Ushtroi dhunë fizike ndaj denoncueses, pezullohet nga detyra inspektori i Policisë së Himarës, e pëson edhe nënkomi… 
“BREGDETI YNË”/ Nis aksioni për lirimin e bregdetit në gjithë vendin. Në Golem evidentohen 11 parcela pa leje, hiqe… 
Gara për punësimet e reja në arsim, ja kur nis testimi i mësuesve 
Policia nis hetim disiplinor ndaj oficerëve që paditën Pjerin Ndreun: Dështuat në përmbushjen e detyrës 
Shkencëtarët nxjerrin shifrat tronditëse të mutacionit “Delta” të koronavirusit: Bota rrezikon sërish 
E mbante të fshehtë prej kohësh, Putin tregon se cilën vaksinë përdori kundër COVID 
Australi: Katër qytete të mëdha nën bllokime të reja për shkak të COVID-it 
Manjati saudit nxjerr në shitje apartamentin për 170 milionë dollarë 
Në Shqipëri për spiunazh gjatë stërvitjes Defender 21? Anti-terrori dhe SHISH nën vëzhgim 10 persona, lëvizjet dysh… 
Vuçiç paralajmëron referendum për çështjen Kosovë-Serbi: Populli do të vendosë në fund 
 për herë të parë vlerësohet me mbi 1 trilionë dollarë 
Akademia e Shkencave e Shqipërisë nderon akad. Petrit Gaçen, themeluesin e kardiokirurgjisë shqiptare në 25-vjetori… 
Gjalpë, djathë e mjaltë çdo ditë në tavolinë, turkja që pretendon se është personi më i vjetër në botë 
Blendi Gonxhja u bën apel prindërve shoferë: Mos rrezikoni jetën e fëmijëve duke i ulur në prehër në makinë, ndenjë… 
Aksident në aksin rrugor Cërrik-Belsh/ Dy automjete përplasen kokë më kokë 
Shkelja e ligjit për rojet në plazhe kushton jetë njerëzore dhe gjoba për institucionet 
Ofendoi Granit Xhakën, gazetari zviceran detyrohet të lyejë flokët e bardha 
Kufiri detar Shqipër-Greqi, kryediplomati grek Dendias: Vendimi për të shkuar në Hagë është kapitull i ri në marrëd… 
Ende s’ka ndërgjegjësim/ Nga 141 deri në 196 km/orë në Tiranë-Elbasan, arrestohet drejtuesi me patentë të hequr, në… 
Covid-19/ Konfirmohen dy raste të variantit Delta në Kosovë 
Covid-19/ MSH: Asnjë humbje jete, vetëm një rast pozitiv nga 3348 testime të kryera gjatë 24 orëve të fundit 
Nesër zyrtari i lartë amerikan, Philip Reeker vizitë në Shqipëri, takon Ramën e Bashën 
Trajneri i Holandës nuk duron presionin dhe dorëhiqet 
Pulat rikthehen në tregje, por me certifikata shëndetësore veterinare 
Rezultoi i dënuar në Greqi, KQZ vendos nesër për kryebashkiakun e Mallakastrës 
Shqipëria blen dronë të armatosur tip “SIHA” dhe tip “IHA” nga Turqia, kostoja: 10 miliardë lekë, qeveria: Rrit sig… 
Vuçiç, Rama e Zaev deklaratë të përbashkët: BE dështoi për të përmbushur premtimet, ajo ka nevojë për ne. Të forcoj… 
Maqedonia, Shqipëria dhe Greqia do të bashkëpunojnë për mbrojtje të Liqenit të Prespës 
Këshilli Kombëtar i Territorit miraton lejen për Teatrin Kombëtar në Tiranë! Veliaj: Zero kulla në territor! 
“Fajtori sot ishte pa përgjigje”, Basha: Kur vjen në pushtet me krimin, policia përdoret si vegël 
Gruaja në Tiranë hedh fishekët në kazanin e plehrave, shpërthejnë nga temperatura e lartë, plagoset nëna me 7-vjeça… 
I preu këmbën të resë, por e liruan nga burgu, Prokuroria kërkon ndryshimin e masës për 19-vjeçarin 
“Ligjin e bëj unë, ju jeni legena!” Kryebashkiaku i Lezhës paditet nga tre policë, i pengoi për shoqërimin e pronar… 
Mbyllet takimi mes Ramës, Vuçiç dhe Zaev: Prioritet zgjerimi i bashkëpunimit dhe integrimi në BE 
Çmimi i naftës rritet sërish me 5 lekë për litër, hera e tretë që pas lehtësimit të masave të pandemisë 
Seanca e parë në Gjykatën e Posaçme, caktohet data dhe gjyqtarja që ka në dorë çështjen e Adriatik Llallës 
Rama zhvillon sesionin e radhës me studentët, i tërheq vëmendjen pedagogia në Londër: Lër një takim me mua, ke kohë… 
Dështon mbledhja në Këshillin Bashkiak, Dritan Leli: Nuk e kuptoj këmbënguljen për të krijuar mizanskena në teatër 
Pikëpamje / Nëse pandemia nuk e bashkon dot lindjen dhe perëndimin e Europës, atëherë çfarë mundet? 
Përzierja e vaksinave kundër COVID-19 “ofron mbrojtje të mirë” 
Nuk kanë fund emocionet në Euro 2020, Franca dhe Zvicra shënojnë 6 gola dhe shkojnë në shtesë 
Pavarësisht kundërshtimeve, Merkel sërish në mbrojtje të propozimit për një takim të BE me Putin 
 Mbërrijnë 24,040 vaksina anti-Covid në aeroportin e Rinasit 
AMF hap garën për 4 shërbime të reja në e-Albania, edhe njoftimin me mesazh 14 ditë para se të skadojë siguracioni 
Elbasan / Shpërthim në zonën e Kombinatit Metalurgjik 
 zyrtarizon kandidaturën për kryetar të PDK 
 / Kroacia eliminohet në mënyrë dramatike, Spanja në çerekfinale me zemër në dorë! E pret Franca ose Zvicra 
Ministria e Arsimit nxjerr urdhrin, gjuha angleze pritet të fillojë nga klasa e parë 
Mbërrin në Kosovë kontigjenti i parë i vaksinave Pfizer të blera nga Qeveria 
Dhoma Amerikane e Tregtisë, 40 rekomandime për përmirësimin e klimës së biznesit 
Rama ndan pamjet: Ecuria e punimeve në zonën e Astirit, vepra më komplekse e infrastrukturës 
Plani i SHBA-BE që ka frikësuar të korruptuarit: Dosjet e pasurive të 2600 zyrtarëve do publikohen në 2021, jo më z… 
Përplasje në Ksamil për shezlonet, Policia rrethon zonën, biznesmeni: I morën pa të drejtë! 
Zaev: Vendimi për hapjen e negociatave të Shqipërisë dhe Maqedonisë së Veriut mund të merret në dhjetor 
Ditët e hapura / Mbi 23 mijë persona mbi 18 vjeç aplikojnë për vaksinë, ja dozat në dispozicion 
Greqia do t’i japë 150 euro çdo të riu që merr vaksinën anti-COVID 
Greqia do t’i japë 150 euro çdo të riu që merr vaksinën anti-COVID 
Sopranoja shqiptare, Ermonela Jaho vlerësohet me çmimin e madh në Gjermani 
Nuk ka nevojë për test dhe as për vaksinë! Pas Spanjës edhe Çekia heq kufizimet për shtetasit shqiptarë 
ILD reagon pas deklaratës së Çuçit: Mosrespektimi i vendimeve të magjistratëve po kthehet në traditë 
Nga sot, Spanja heq të gjitha kufizimet për udhëtarët nga Shqipëria, mjafton bileta, pasaporta dhe mbajtja e maskës 
Albin Kurti deklaron pasurinë, zotëron vetëm një apartament: Është blerë me kredi 
Pse varianti Delta i Covid është një kërcënim i ri për botën 
Me hartën përpara, ambasadorja e SHBA iu prezanton Shqipërinë miqve të fëmijërisë: Po i kap ‘AlbaniaMania’, kanë ar… 
Çmenduria e radhës/ I riu i dehur terrorizon lokalin në Dhërmi, nxjerr armën dhe qëllon drejt kamerierit pasi i kër… 
Çuçi: Drejtuesi e lartë duhet të kalojnë vettingun, nëse do mbajnë një pozicion në hierarkinë drejtuese të Policisë… 
Raundi i dytë i zgjedhjeve rajonale, sprovë e re për Macron dhe Le Pen 
Korçë, sulmohet çifti në makinë, policia kërkon autorin 
Dy “paligjshmëritë” e mëdha që zbuloi masakra e Velipojës 
Fermerja nga Austria me ‘tre çipa’ në dorë: Paguaj me ta, hap derën dhe kompjuterin 
Durrës, një 40 vjeçar plagos me thikë dy sirianë pas një konflikti 
Koreja e Veriut në prag të urisë, por qytetarët janë të shqetësuar për dobësimin e Kim Jong-Un 
Konkretizohet marrëveshja me Turqinë, Qeveria jep mbi 8 milionë euro për dronë superinteligjentë, për kontrollin e… 
Ka frikë përgjimet e SPAK? Berisha hap profilin e tij në një chat më të sigurtë se Whatsapp 
Lazarati, nga kultivimi marijuanës, drejt sipërmarrjeve të vogla tradicionale 
Probleme në sistemin e drejtimit, Tesla tërheq 285 000 makina të shitura në Kinë 
FORUM me lexuesit: Pse kemi degraduar në këtë pikë? Çfarë duhet të bëjmë për t’u ringritur? Tmerri i Velipojës si s… 
Dita e parë e punës iu bë e fundit e jetës! Publikohet FOTO e kamarierit 20-vjeçar, mes viktimave në Velipojë 
Shqetësim për variantin Delta, Kina së shpejti vaksinat e reja, Rusia rekord viktimash 
Përfundon Asambleja e PS, Rama: Me Vlorën nuk më ndan ndarja e mandatit. Thërret mbledhje në Ministrinë e Brendshme 
Kurti flet për dialogun Kosovë-Serbi: Bisedimet nuk janë për statusin e shtetit 
Manastirliu: Nëse jeni mbi 18-vjeç, nga sot mund të aplikoni në e-Albania për t’u vaksinuar 
Ngjarja në Velipojë,   Meta: Rendi e qetësia publike janë dëmtuar seriozisht, duhen masa të reja 
“Jeta jonë është në rrezik”, masakra në Velipojë, Basha kritikon Ramën: Postim cinik! 
Vrasja në Velipojë, dyshohet se u përdorën 6 armë, 2 persona në kërkim dhe 20 të shoqëruar 
Raporti amerikan për UFO-t ngre shumë pikëpyetje, nuk përcakton qartë, janë objekte të krijuara nga njeriu, jashtok… 
Ushtria e Kosovës dhe e Shqipërisë mision të përbashkët pastrimi, postimi i Ramës: Jena 1 
Rusia nxjerr në det nëndetësen më të madhe bërthamore, mund të shkaktojë tsunami radioaktiv, dhe dallgë shumë të la… 
Balona përplaset me shtyllën e tensionit të lartë, 4 të vdekur, 13 mijë banorë pa energji 
Kapen 17 kg heroinë në Portin e Durrësit, kishin destinacion Italinë 
Kryeministri dhe kryebashkiaku inspektojnë rrugë të ndryshme paralelisht në Vlorë 
Në samitin e tetorit apo të dhjetorit? Si i përgjigjet zyrtarja e BE pyetjes “atëherë kur” pasi pohon se Shqipëria… 
Dogana e Kapshticës do të qëndrojë e mbyllur deri më 3 korrik 
OBSH: Delta plus, rrezik i ri, po përhapet me shpejtësi në mesin e personave të pavaksinuar 
Edhe Zvicra heq kufizimet për qytetarët shqiptarë, mund të kalojnë pa test e pa vaksinë 
Konflikti mes ish-drejtorit të RTSH dhe komentatorit sportiv përfundon në polici 
Sulmi ndaj eskortës së Ramës në 2019 në Librazhd, prokuroria mbyll hetimin, ish-zyrtarët e PD merren si të pandehur… 
“Të mos vijnë në Europĕ”, BE i jep 3.5 miliardë euro Turqisë që të vazhdojë të strehojë refugjatë sirianë deri në 2… 
Zgjerimi, ministrat e Jashtëm të BE-së: Interes strategjik dhe i përbashkët 
Keni plane për në Greqi? Fqinjët hapin kufirin, sa udhëtarë do jenë brenda në autobus 
Rrugëtimi i Shqipërisë drejt BE/ Gjithnjë kanë gjetur një vjegëz ku është mbështetur refuzimi, japin detyra pas det… 
Laborator ‘Bitcoin’ në Fier, një i arrestuar dhe një i shpallur në kërkim 
Me treçerekëshe dhe çorape të kuqe, Rama shkon në Vlorë, ndjek nga afër punimet për Parkun e Shtëpisë së Pavarësisë 
U aksidentua dje në Tiranë, ndërron jetë në spital 82 vjeçari! Arrestohet shoferi 25 vjeç 
24 orë nga aksidenti me 4 të vdekur, Rrugorja zbarkon në autostradën e Vlorës: Hiqen 30 patenta 
Covid-19/ Ministrja Manastirliu: Datat 29 dhe 30 qershor ditë të hapura vaksinimi për qytetarët mbi 18-vjeç 
Ambasada e SHBA: Mbështesim KLP në vendosjen e rregullave etike për sjelljen e prokurorëve, edhe jashtë detyrës 
Të pasurit tatohen 8 përqind, ata që jetojnë me rrogë 23 përqind. Sa të varfër ka sot Shqipëria dhe si kanë ndihmua… 
“Kisha nevojë për dashuri”, i dha njeriut të Hezbollahut emrat e informatorëve të SHBA, përkthyesja e Pentagonit dë… 
“E mora në zyrën time…” Tritan Kalo tregon historinë e domates që nuk dorëzohet dhe ka disa këshilla për ata që po… 
Sot luhen Uells-Danimarkë dhe Itali-Austri, të kaltrit favoritët e mëdhenj 
Amerikania e Valbonës: Bota ka shumë për të mësuar nga Tropoja 
Fillojnë provat klinike të vaksinës kundër koronavirusit me spërkatje në hundë 
Bullgaria publikon kushtet që RMV duhet të plotësojë për të hequr veton 
Britani / Krijojnë teste pozitive për koronavirus, nxënësit gjejnë tjetër mënyrë për t’i shpëtuar mësimit 
Kryeministri Rama uron për 85-vjetorin e lindjes Profesor Rexhep Qosen: Edhe 100 heroi i mendimit shqiptar! 
Bota po dështon në furnizimin me vaksina, thotë OBSH 
Përfundon më herët se pritej samiti i BE, Gjermania dhe Franca nuk patën sukses me propozimin për një samit me Puti… 
Ambasadori austriak  i jep juristit Përparim Kalo, “Dekoratën e Artë të Nderit” akorduar nga Presiden… 
Rama “shmang” Lelin, i shoqëruar nga nënkryetari i bashkisë, ndjek nga afër punimet në Vlorë 
Veliaj publikon pamjet e transformimit të Piramidës në Tiranë 
Edhe Danimarka hap dyert për shqiptarët, por nuk njeh vaksinat kineze dhe ruse. Cilat janë kushtet e tjera që ka ve… 
Zbardhet pas 10 vjetësh vrasja e biznesmenit Ilir Rexhepi. Si u zbulua autori me dy emra dhe ‘problemi’ me Greqinë 
Zhvillohet testi i gjakut që zbulon 50 lloje kanceri pa patur ende simptomat, shkencëtarët optimist mbi saktësinë e… 
Shteti i parë evropian që heq të gjitha kufizimet kundër koronavirusit 
EMRI: Kush e drejtonte Audin luksoz me 200 km/h që përplasi dhe la të vdekur një familje të tërë. Makina në emër të… 
Rekord në vaksinim, Izraeli rikthen mbajtjen e maskave në ambiente të mbyllura pas rritjes të rasteve me COVID 
Regjistrimi në klasë të parë, aplikimi online deri më 30 qershor 
Tërhiqet Athina, hapet dogana greke për autobusët shqiptarë. Nis lëvizja e tyre në pikën kufitare të Kakavijës, Kap… 
Temperaturat e larta dhe zjarret/ Instituti i Gjeoshkencave: 3 qarqet më të rrezikuarit, por ku priten reshjet 
Shuhet në moshë të re infermierja e Urgjencës së QSUT-së 
TRAGJIKE! Dhjetëra të humbur nën rrënoja pas shembjes së një pallati në Majami 
OBSH: Vaksina e COVID çdo vit për moshat e rrezikuara, çdo dy vjet për të tjerët 
VIDEO: Aksidenti me 4 të vdekur në Vlorë, momenti kur tentohet të nxirren jashtë trupat nga makina 
‘Çmendet’ moti në Europë! 3 të vdekur dhe 60 të plagosur nga një tornado në Çeki, 5 të plagosur nga breshëri në Gje… 
TIA njofton pasagjerët që duan të udhëtojnë nga Rinasi: Tamponi PCR mund të kryet në aeroport, antigeni jo! 
FOTO: Teksa vendi vuante nga COVID, ministri i Shëndetësisë në Angli “kapet mat” duke puthur sekretaren 
Merkel dhe Macron / Gjermania e Franca duan rregulla të përbashkëta kundër variantit Delta 
Finlandë /  80 tifozë të cilët ndoqën kombëtaren e tyre në stadium në Rusi, kanë rezultuar pozitiv me Covid-19 
BE hapi kufijtë, shtetet ku lejohen të udhëtojnë shqiptarët dhe kushtet që duhet të dini 
Dy muaj pasi u largua nga posti, ambasadori amerikan kthehet në Moskë 
Kosovë / PDK mbetet pa kryetar, Enver Hoxhaj dorëhiqet deri në mbajtjen e konventës 
Si ta dallosh një burrë që nuk ka qenë me një grua për një kohë të gjatë 
EMRAT / Konflikt mes dy shtetasve për pronësinë në Gjirokastër, një person qëllohet me lopatë në kokë 
Në klasë të parë do mësohet edhe Anglisht, programi i ri nis në shtator 
Çfarë duhet të dini për variantin “Delta” të koronavirusit, i zbuluar në më shumë se 80 vende? 
Struktura anti-korrupsion e kryeministrisë kontroll blic në Kadastrën e Sarandës, sekuestrohen 9 dosje ‘të dyshimta… 
Kryeministri i Holandës, : Hungaria s’ka më punë në BE 
Vendimi i qeverisë, në listën e personaliteteve që ruhen dhe mbrohen nga Garda e Republikës te jetë edhe ambasadori… 
Arrestohet shqiptari në Itali, e denoncojnë vajzat: Na përdhunoi për vite me radhë 
VIDEO+FOTO / “Trekëndëshi i zi alien”, Pentagoni nxjerr pamjet e pabesueshme të UFO-ve: Mund të zhdukë dyshimet në… 
Do të jetë vetëm 7 minuta rrugë, rihapet gara për ndërtimin e tunelit të Llogarasë 
Mblidhen sërish Rama, Vuçiç dhe Zaev për Shengenin Ballkanik më 29 qershor, ftohet dhe Albin Kurti, por refuzon të… 
Nga dekreti i Metës për minierat, te përkthyesit dhe ligji “Për të huajt”, çfarë miratoi sot Kuvendi 
Merkel thirrje BE-së: 14 ditë karantinë kujtdo që hyn nga Britania! 
Abonetë e përgjithshme në Tiranë rikthehen së shpejti, Veliaj u heq licencën operatorëve që nuk respektonin standar… 
Ministria e Jashtme jep lajmin e mirë, Spanja lehtëson sërish kufizimet e udhëtimit për shqiptarët, ja çfarë duhet… 
Greqia ‘ngriu’ marrëveshjen e Prespës, Zaev i kërkon Federatës së Futbollit të ndryshojë emrin 
Vuçiç: Nuk është e drejtë që Shkupi dhe Tirana nuk kanë një datë për fillimin e bisedimeve me BE 
S’ka dakordësi, pas propozimit të Këshillit Bashkiak, Leli kërkon tjetër përballje online më 29 qershor 
Mbytja e pushuesve, Klosi: Aty ku nuk ka roje në plazhet private, hetim penal për pronarët! 
Monedhat false në qarkullim/ Falsifikatori: Sezoni i verës është i duhuri, kemi futur edhe në llogari bankare 
Regjistri kadastral, nis konsultimi publik për pronat në Lukovë 
Notat e letërsisë/ Maturantët kanë 5 ditë afat për të kërkuar kopjen testit të vlerësuar! 
Covid-19/ Mjeku: Imuniteti i tufës është arritur, por të mos ulet vigjilenca. Turistët dhe emigrantët mund të sjell… 
Njoftim i rëndësishëm për ata që duan të pajisen me kartë identiteti dhe pasaportë 
Sot mblidhet Kuvendi, raportojnë KQZ, AMA, KLSH dhe ILD! Në rend edhe një dekret i Metës 
‘Si ishte dhe si u bë’, Shkodra me komisariat të ri policie, Rama publikon pamjet e transformimit të godinës 
Kushtetuesja iu drejtua Venecias për zgjedhjet lokale, VOA: E kanë dhënë një herë opinionin, duket si një përpjekje… 
Kontrollet e rrepta dhe sportelet e pakta krijojnë radhë kilometrike në Kakavijë 
EURO 2020 / Ja cilat janë 16 skuadrat e 1/8 finale dhe datat e përballjeve në fazën tjetër 
Akt normativ për heqjen e gjobave të fiskalizimit deri në 31 dhjetor 2021; Pandemia ka krijuar një situatë të vësht… 
FOTOT / Arkeologët bëjnë një zbulim madhështor në Amantia, nxjerrin në dritë një varr monumental 
Këto aplikacione duhet ti fshini menjëherë në Android: Ato vjedhin të dhënat dhe paratë tuaja 
VIDEO / Ministrat e Kuvajtit përleshen me deputetët e opozitës në mes të seancës parlamentare për buxhetin 
Trup seksi apo fytyrë tërheqëse? Studiuesit tregojnë se çfarë po preferojnë më shumë meshkujt kohët e fundit 
GREQI / Po merrej një vendim për të, prifti sulmon me acid mitropolitët dhe rojën e manastirit 
Gjykata Kushtetuese do t’i drejtohet Komisionit të Venecias për të kërkuar opinion për zgjedhjet e 30 qershorit 
“Të rishihen tekstet”, çamët me kërkesë: Çamëria duhet të ketë vendin e duhur në historinë shqiptare 
Gjykata Kushtetuese pezulloi gjykimin, Voltana Ademi poston në Facebook: Kam bindjen që Gjykata Kushtetuese do të j… 
Presidenti Macron pas takimit me Kryeministrin Kurti: Kosova dhe Serbia të gjejnë një kompromis 
SHBA u propozon Kosovës dhe Serbisë:  Çështja e Ujmanit  të rregullohet sipas traktatit  të lumit Kolumbia 
  takim pune në Gjykatën e Lartë, vlerëson punën e saj: Keni bërë hap madhështor 
Kambana alarmi për kolapsin nga Vettingu në prokurori e gjykata/ Kryetari i KLP, Gent Ibrahimi: Kërkohet ndërhyrje… 
Varianti i ri i covid shqetëson Britaninë e Madhe, regjistrohet numri më i lartë i infeksioneve në 5 muaj 
Yuri Kim reagon sërish: KLGJ dhe KLP kanë kaluar shumë pengesa, merrni vendime të ashpra, të nevojshme për të zbatu… 
Turizmi ynë “shpëtohet” nga Kosova, përbëjnë 44 përqind të turistëve që hyjnë në vend 
Rama: BE mund të caktojë kushte e data, por Zoti na ka caktuar në zemër të Europës. Zaev: Negociatat me BE nuk mund… 
I nxehti përvëlues në vend, këshillat e mjekut për të ruajtur shëndetin dhe kush janë moshat më të rriskuara 
Ministria e Shëndetësisë: Asnjë humbje jete, vetëm 1 rast i ri në 24 orët e fundit 
Tentoi të hynte në Shqipëri me 17.770 euro të padeklaruara, arrestohet në Qafë Thanë maqedonasi 
Pas rekomandimit të BE, nga nesër Austria heq të gjitha kufizimet për udhëtarët nga Shqipëria, TIA: Asnjë kriter te… 
Vetoja e Bullgarisë/ Zaev në konferencë me Ramën: Ne s’jemi vetëm dhe as të izoluar 
Sot Elbasani kaloi 41 gradë, meteorologia: Nesër dhe pasnesër do jetë kulmi i vapës 
Konkurimi në 4 degë, gara për 1200 kuota, kriteret për fituesit e rinj në Fakultetin Ekonomik 
Pas vetos bullgare, Greqia “ngrin” Marrëveshjen e Prespës pas një postimi në rrjetet sociale të Zaev: Të përmbahet,… 
Merkel përzien vaksinat, merr dozën e Modernas, pas asaj të AstraZenecas 
Mblidhet KQZ, vuloset rezultati i 25 prillit, Celibashi i jep Ramës mandatin në Durrës e Vasilit në Tiranë 
“Je xheloze?” Rama batuta me gazetaren greke, e cila e pyet për marrëdhëniet me Turqinë 
Qeveria miraton fondin për ndërtimin e Teatrit Kombëtar, i hapet rruga nisjes së punimeve 
SHIFRAT / EUROSTAT: Që nga nëntori, Shqipëria me rritjen më të lartë të vdekjeve në Europë, 41% fatalitete më shumë… 
Shpikja e re e Moskës, diplomacia ruse ka projektuar një Ballkan Perëndimor si shtet unik sipas modelit të Rusisë 
“Boll me shtirje”, Yuri Kim e ashpër me KLGJ dhe ILD: E kuptojmë presionin se jemi në Shqipëri, por duhet të ecim p… 
Rama publikon portalin e punësimit: Punë të denjë dhe të ardhme të sigurt 
Kurti shkon në Francë, do të takojë sot Macron, çfarë pritet të diskutohet 
Aksident i frikshëm në Lezhë, makina përplaset me një karburant, dy të plagosur 
Aksident në Durrës, makina përplaset me motorin, 1 i plagosur 
Brazil / Adhuruesi i nazistëve urdhërohet të zhdukë simbolin e zvastikës nga fundi i pishinës 
  / Anglia merr vendin e parë në grup, festojnë dhe Kroacia me Çekinë 
Projekti 50 milionë USD për rrugët, do rinisin punimet për Thethin, gati edhe ndërhyrja në Golem 
Shitet me çmim marramedës makina ikonike që Paul Walker përdorte në “Fast &amp; Furious” 
Norvegjia ndan për Kosovën mbi 180 mijë doza të vaksinës  
“Vera s’do të jetë e qetë”, Artan Fuga: Duket sikur do të ketë pak evente të rëndësishme politike, por nëndhe luhen… 
Gjatë punimeve në shtratin e Gjanicës në Fier, punëtorët gjejnë disa predha, dyshohet se i përkasin Luftës së Dytë… 
Kryebashkiaku  : Nuk ekziston asnjë dallim mes shqiptarëve dhe grekëve në Athinë 
FOTOT / Një anije sa një qytet, gjigante e luksoze por hyrja lejohet vetëm për ata mbi 18 vjeç 
Shqipëria arrin shifrën 900,000 vaksinimeve deri më tani kundër Covid-19, ndërkohë që vazhdojnë të vijnë doza të tj… 
Përse e la sot BE në baltë Shqipërinë dhe Maqedoninë e Veriut? 
“Dita e Liqenit” bashkon kryebashkiakët e Pogradecit, Ohrit dhe Strugës, vendosin për një paketë turistike të përba… 
Kina bëhet shteti i parë që krijon zyrtarisht një monedhë digjitale 
Raporti sekret i SHBA, si UFO-t rrëzuan 10 raketa bërthamore në bazën amerikane 
Rezultatet e Maturës Shtetërore, dalin notat e provimit të Gjuhës Shqipe 
Di Maio në Prishtinë, Kurti: Zgjidhja e problemit me Serbinë është vetëm njohja 
ZYRTARE: Shqipëria penalizohet nga Maqedonia e Veriut! Ministrat e BE nuk bien dakord, nuk ka ende një vendim për ç… 
VIDEO: “Më paguani dëmin”, ikën nga hoteli të pakënaqur, pronarët e hotelit terrorizojnë familjen në Himarë, i zënë… 
Përfaqësuesi i Bullgarisë: Vlerësojmë arritjet e Shqipërisë, me RMV të hapur për dialog gjatë Presidencës sllovene 
Zhvati Policinë e Shtetit me 5.5 mln lekë kur punonte si specialist, pezullohet nga detyra nënkomisari në Tiranë 
I nxehti afrikan në Shqipëri, Urgjenca Kombëtare tregon këshillat që duhet të ndiqni 
===