Berisha më në fund foli si vrasësi i Remzi Hoxhës  
Në Kosovë ku të gjithë sillen sikur nuk ka ndodhur asgjë  
Presidenti që kërkon të ringjallë heronjtë, për partinë e tij  
Haga mund të prodhojë tërmet politik në Kosovë  
“Ra ky mort dhe u pamë në… Prishtinë”  
Socialistët s’ka pse bëhen gardianë të Lulzim Bashës  
Betejë për të ruajtur “pushtetin” e opozitës  
Pëllumb Pipero shpjegon shtimin e infektimeve: Qytetarët të kenë kujdes si në fillim, ja pse po shënohen raste të r… 
“Nuk do ketë më inspektorë të dera”, Rama: Heqim tatim-fitimin dhe TVSH-në për biznesin e vogël deri në 2029  
Arrihet marrëveshja për reformën zgjedhore, por komisionerët nuk depolitizohen: Opozita ia ngec Ramës fajin  
Ambasadorja amerikane: SHBA është krenare për marrëveshjen e arritur. Soreca: ëria tani është më pranë BE-së  
SPAK duhet të hetojë historinë që tentoi të destabilizojë Shqipërinë  
Reforma zgjedhore, si radiografi e problemeve të opozitës  
Refleksione në “të tretat e protestës”  
Përse Ilir Meta po tenton të bëj  “të fortin” e opozitës  
Pak respekt për fjalët e zemëruara!  
Shmangia e debatit për sistemin, po krijon një mit për të  
PD në kërkim të një pazari për reformën  
Përpjekja e Ilir Metës për të politizuar KLGJ  
Dikush duhet ti mbrojë shqiptarët prej Sali Berishës!  
Njerëzit që preknin pavarësinë e Kosovës  
Mos u shqetësoni  nga “Anti KÇK”, nuk është për politikanët.  
Si mund të shfajësohet Ilir Meta për videoshantazhin ndaj ambasadorit Soreca?  
Përse duhet të një Kushtet dhe kundër çmendjes Presidentit?  
Problemi I Fevziut dhe problemi I ministrave të Ramës  
Dështimi për një “aleancë patriotike” nga Tirana, kundër SHBA  
Fushata “derë më derë” e Ilir Metës në SHBA  
Aktorët shqiptarë të “Mëngjesit të Lutjeve”,  si aktorët e Lulzim Bashës  
Katër qëndrimet e PD për “Anti – KÇK”  
Sikur  ligji “Anti KÇK”, të zbatohej nga kjo opozitë.  
Nga “Vetvendosje” në “Vetadministrim”  
Lulzim Basha, ska pse shfajësohet për uljen në tryezë  
Një luftë e shkuar dëm kundër Evropës  
Në Shqipëri “Komandant” Hardianaj, është thjeshtë një ushtar I Metës dhe Berishës  
Prioritetet e ndryshme të “fitimtarëve” dhe SHBA, për Kosovën  
Të gjitha faktet përse SPAK duhet të thërrasë Berishën për 21 Janarin!  
Të gjitha faktet përse SPAK duhet të thërrasë Berishën për 21 Janarin!  
Të pagjykuarit, që guxojnë të gjykojnë të vrarët  
Një avion dhe asnjë “tradhëtar” mes Prishtinës e Beogradit  
Prestigjozia gjermane BILD zbardh lobimin rus të PD: 675,000 dollarë për të mos pranuar Shqipërinë në BE, pasi fito… 
Pse “The Times” dhe “Bild”, u zgjuan pas vendimit të Gjykatës së Tiranës    
Për entuziastët e “kopetencave” të Këshillit Politik  
Lulzim Basha dhe (pa)fuqia për të mbrojtur marrëveshjen  
Një gjobë e re, për revolucionin e dështuar  
Partitë e rreme, si vrasëse me pagesë  
Përse të gjithë ju dorëzuan sistemit?  
Mbivlerësimi I taktikave dhe “Vlerës” së Blerim Rekës nga Albin Kurti  
“Pacifistët” tanë, me molotovë nëpër duar.  
Kur lufta për pushtet konvertohet në urrejtje për Shqipërinë  
Berisha paska frikë nga ligji!  
Të gjithë po luftojnë si të mos bëjnë qeverinë. (Përveç Vjosës)  
Hipokriza e politikanëve të Kosovës me qytetarët e tyre dhe Shqipërinë  
Pse injorohet mbështetja e SHBA dhe BE për Minishengenin?  
Përballja me mitet e rreme të Sorosit, Minishengenit dhe Albinit  
Një patentë fallco “patriotizmi”, e Vetvendosjes në Tiranë  
Tre rreziqe aktuale për lirinë e shtypit, pa llogaritur ligjin “antishpifje”  
Përse opozitës I duhet që Edi Rama ti bëj karshillëk Perëndimit?  
Beteja kundër Edi Ramës, duhet ndarë nga beteja për ndryshimet ligjore në medie  
Videomania dhe  mitomania e Ilir Metës  
Dënimi ndaj Salinjit është realisht penalizim I opozitës  
Përse duhet të shkojmë në Durrës!  
Rasti kur Lulzim Basha udhëheq Berishën dhe Metën  
Një shoqëri që çuditet nga të mençurit  
Dëmi më I madh, janë viktimat që po I kthejmë në spektatorë  
Disa “tërmete histerike”, përballë fatkeqësisë natyrore  
Përpjekje për një protestë kundër Perëndimit më 8 Dhjetor!  
A do qëndroj e bashkuar opozita, në frontin “antiamerikan” të Ilir Metës?  
Mbi shfaqjen e fantazmës së Sali Berishës në Presidencë  
“Zgjedhjet e Jashtzakonshme” në Republikën imagjinare të Ilir Metës  
Presidenti “a non grata” i Shqipërisë dhe parëndësia e tij  
Gjykata Kushtetuese duhet mbrojtur nga Ilir Meta  
Histeria fallco kundër Lulzim Bashës për Unazën  
I vetmi konflikt interesi tek Kushtetuesja, është shkarkimi I Ilir Metës  
Një hetim që nis për pastrim paresh, dhe përfundon për pastrim të Bashës  
Beteja e Ilir Metës për të “çdekretuar”, Gjykatën Kushtetuese  
I dashur Lulzim, mos na lë të gënjejmë për Migenën!  
Dy pista të dyshimta rreth vilës së Lulzim Bashës  
Viti I një proteste që ka lindur e vdekur  
Lulzm Basha në përpjekje për të futur, dy vila në një thes  
Ata që duan të mos gjendet kush qëlloi mbi prokurorinë  
Luli kthehu në shtëpi!  
VIDEO/ Aktori i njohur Leonardo Di Caprio, apel për mbrojtjen e Vjosës  
Kur e kupton, se e ke kokën në sininë e Lulzim Bashës.  
Lulzim Basha nuk na gënjen ne, por demokratët që I besojnë atij  
Pse Berisha kërkon  një frymë antifranceze në Shqipëri?  
Krizat, që presin zgjidhjen e kryekrizës shqiptare  
Arsyet e Zaevit dhe arsyet tona, për zgjedhje kundër Evropës    
Të refuzuarit e mëdhenj të Perëndimit, që bëjnë si të gëzuar  
Pse ska rrezik rus apo kinez në Ballkan nga dështimi I Evropës?  
Mos çdekretimi i 13 tetorit, rrëzon çdo arsye të Ilir Metës për 30 Qershorin!  
Mos e fyeni Albinmin si çlirues të Kosovës nga Shqipëria  
Venecia ka rrëzua Ilir Metën dhe ligjin e pronave, por këtu vajtohet vetëm për Metën.  
Kushtet franceze për Bashkimin Evropian, kundër Shqipërisë e Maqedonisë.  
Fitorja e dy opozitave në Kosovë dhe pikpyetjet e bashkjetesës së tyre  
Fituesit të paqartë, por humbësit janë të sigurtë  
Pesë kushte kundër reformës elektorale ose një kërkesë për pazar.  
Një gjobë me letër, në emër të opozitës  
Refuzimi I perëndimit për tu përfshirë në pazaret e Lulzim Bashës  
Lajmi më I keq për opozitën nga Venecia, është legjitimiteti i 30 Qershorit  
Trajtimi I Venecias si “dekret për falje dënimi” për Presidentin  
Të kërkosh të jesh “I sigurtë” në opozitë  
Kriza vjen nga mungesa e paqes brenda opozitës  
Nuk ishte ishte për klikime, nuk e bën gazetarët!  
Tërmeti dhe fati që vjen nga kjo “skenë krimi”  
Për opozitën, kushtet janë më të këqija , se hapja e negociatave  
Revolucioni që po u ha kohën, bijëve të vet  
Një raport që tregon luftën e dështuar të Ilir Metës kundër shtetit  
Kopilin, që se mban askush më në prehër!  
“Normaliteti” që prodhon lajm për Ilir Metën  
Pse socialistët duhet të jenë serioz në qëndrimin ndaj Ilir Metës?  
“Pazari” që nuk bëhet pa opozitën parlamentare  
Për ata që derdhën lotë për dorëheqjen e Haradinaj  
Burri I Danicës dhe Dhëndërri I Milicës!  
Një shpjegim për idenë fikse të Bashës për lekët  
Për ata që presin  Bashën të rikthehet në sistem  
Gjithë hezitimet që mbajnë të ngrirë ofertën mes LDK e Vetvendosjes  
Ditmir Bushati po ndërton një fabulë të vetën politike  
Ambasadori austriak: Kriza politike do të zgjidhet, merreni me qetësi  
Një bisedë për Valdrinin para 30 Qershorit me Ditmirin dhe Luanin  
Mëshirë për pronarët, lotë krokodili për gazetarët?  
Filtrat e dekriminalizimit, si ato të dekomunistizimit.  
Faturat e Ministres dhe fatura që merr shtypi nga spekullimi  
Opozita e mbetur për vjeshtë  
Kosova po shkon në zgjedhje, për “hallin” me Serbinë.  
Debati brenda socialistëve të Shkodrës,  turpëron PD  
Presidenti nuk është më, me brek!  
Përsëritja e ngrehosjes së Lulit, si i “fortë”  
Opozitë me kontratë të përkohshme!  
===