 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 Mund të lash duart me një kryebashkiak të korruptuar apo të bësh koka turku bedelët e tu në atë sallë, por shqiptarët e…
·Emërimi i militantes së Ramës në krye të AMA: Akt skandaloz kundër lirisë së fjalës. Injoroi BE, OSBE për pushteti… 
Me kryesinë e PD Dega 9, ku u diskutua dhe miratua analiza e zgjedhjeve të 25 prillit. … 
 “E ka fajin Europa” llomotit poshtë e lart, për të fshehur dështimin e tij dhe pengimin e Shqipërisë. Por sapo i jepet…
Tentativa e Ramës për kapjen e AMA është e papranueshme për BE.  Plani për të emëruar zëdhënësen e tij në krye të A… 
Është koha që Edi Rama të tërhiqet nga vendimi antidemokratik për të kapur AMA përmes zëdhënëses së tij. Reporterë… 
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
Nuk është vetëm një kauzë për godinën e Teatrit Kombëtar. Jo!Është kauzë për rikthimin e rendit kushtetues dhe de… 
Zbardhja e masakrës zgjedhore të 25 prillit tashmë është mision i PD.Takime me grupin e punës dhe me kryetarët e… 
Qytetarët shqiptarë duan drejtësi dhe meritojnë drejtësi. Krimi shtetëror i kryer nga  e , provuar nga… 
Me grupin e punës dhe kryetarët e grupseksioneve të PD Dega 11, në analizën e masakrës zgjedhore të 25 Prillit.… 
Liria e medias në rrezik! Letër zyrtare trupit diplomatik dhe organizatave ndërkombëtare.ërrezik 
Liria e medias në rrezik! Letër zyrtare trupit diplomatik dhe organizatave ndërkombëtare. 
Vendimi i KKT është akt i arbitraritetit, dhunimit të ligjit, gjykatave e interesit publik,që dëshmon se masakra zg… 
 Punonjësit e ndershëm të policisë janë të tradhtuar nga regjimi Rama-Doshi. Kur vjen në pushtet me krimin, policia përd…
E nderuar që isha e ftuar në promovimin e librit të fundit të Prof Zamira Cavo me titull “HomoAlbanus” e që munda t… 
 1/2 Kur policia reduktohet në vegël të regjimit për të mbrojtur pushtetin dhe lidhjet me krimin, kur përgjigja e vetme…
Intervistë me Valentina Madani për GazetaShqiptare:- dokumentimi i masakrës elektorale të 25 Prillit- vjedhja e t… 
 Kjo është statistika e vetëm 1 viti të qeverisjes 8 vjeçare të Sali Berishës në luftën kundër korrupsionit! Është viti…
Intervistë e Amit me  në abc news.
“Me Xhaxhiun”, në FaxNews- Kauza e PD për dekriminalizimin e institucioneve, me ngadalë por po jep frytet. Të ven… 
 Kur Rama, Pjerini dhe gjithe hajdutet e Rilindjes gjejnë " ustallaret" e duhur që u tregojnë vendin...“Komiteti i Politik…
Në mbledhjen e fundit të Kryesisë së PD u miratua metodologjia e analizës së masakrës zgjedhore të 25 prillit.Çdo… 
Anëtarësia e PD votoi mbi 80% Lulzim Bashën sepse ata besojnë te ai. Më shumë se kushdo tjetër, demokratët e dinë s… 
Gara është shtyllë kryesore në PD, si një parti e ngritur mbi bazën e vlerave europiane.Pjesëmarrja e lartë në vo… 
Zgjedhjet për kreun e PD: Procesi transparent.Pjesëmarrja e lartë dhe rezulati i votimit, dëshmojnë që demokratët… 
 Hapur deri më dt 8 qershor, 10.00-12.00 dhe 14.00-16.00. E sht… 
Me znj. Gjyste dhe znj. Meleqe Petrela.Bisedë e këndshme, keku më i mirë në botë, e shpirti i bardhë.❤️❤️ 
Takim me struktura të grupseksionit 8, të njësisë 11, në Laprakë.Mirënjohje për kontributin e çdo demokrati dhe f… 
Takim me struktura të grupseksionit 8,të degës 9 në rrugën “Jordan Misja”. Të bashkuar në betejën për votën e lirë… 
Kontrolli i KDRTSH e AMA nga Rama, liria medias në rrezik! PD: të ndalojë skenari antidemokratik i parlamentit mono… 
Takim me struktura të grupseksionit 3, të degës 11, në  Institut. Të fortë, të bashkuar e të vendosur për rrëzimi… 
Takim me struktura të grupseksionit 2, të njësisë 11, në zonën “Kodër Kamëz”.Ringritja edhe më e fortë, është në… 
Takim me struktura të grupseksionit 9, të degës 9, në rrugën “Siri Kodra”.Kurrë nuk duhet të përulemi nga zhgënji… 
Takim me struktura të njësisë 9, në rrugën “Jordan Misja”Përkushtimi dhe kurajo e pakushtëzuar e cdo demokrati te… 
Ajo qe u vu re në Kryesi dhe në Këshill Kombëtar, ështe se cdo diskutim, kritik ose jo me zotin Basha, kishin një e… 
Sot, një vit më parë, Edi Rama urdhëroi shembjen e Teatrit Kombëtar. Nën terrorin e mijëra forcave të policisë, në… 
PD nuk do t’i braktisë qytetarët.Ftesa e Rames për bashkëpunim është hipokrite për të tërhequr vëmendjen nga masa… 
Intervista e plotë në Breaking, në Top News.
PD ka publikuar fakte, prova rreth ës  përgjegjësi i vetëm i së cilës është Rama.  vërtetoi… 
Fushata e PD një fushatë model.Çdo derë u hap për ndryshimin, por vullneti i tyre nuk u përkthye në votë.Krimet e… 
Me njerëz të tillë në Shqipëri ka ende shpresë.
Bashkëpunimi me LSI dhe partitë e tjera nuk ka nisur para 25 prillit, është disavjeçar dhe është i fokusuar për të… 
Rama vërtetoi se është armiku më i madh i zgjedhjeve të lira dhe të ndershme. Misioni i PD do të vazhdojë, për t’i… 
Garë e pabarabartë, Partia Socialiste dhe Edi Rama në paligjshmëri totale përdorën krimin, bandat, trafikun, paratë… 
Vota në  është një detyrë historike për cdo qytetar.Me votën tënde vendos për të ardhmen e fëmijëve!Voto… 
Mos mendoni që Rama dhe Ogerta dhe Veliaj e kanë  .Shiheni asfaltin elektoral që filloi të shtr… 
 Presidentja e Grave të PPE, Doris Pack, mesazh të fortë për shqiptarët: Të djelën votoni nr 9, votoni ndryshimin dhe Lul…
Vota në  është një detyrë historike për cdo qytetar.Me votën tënde vendos për të ardhmen e fëmijëve!Voto… 
Presidentja e Grave të PPE, Doris Pack, mesazh të fortë për shqiptarët: Të djelën votoni nr 9, votoni ndryshimin dh… 
 E drejta për të votuar është një detyrë historike të dielën! Me votën tonë vendosim për të ardhmen e fëmijëve tanë!V…
Nje kafe me zonja të njësisë 11, në Laprakë.Me probleme e sfida të shumta cdo ditë,ato sot zgjedhin alternativën… 
Takim me personalitete të fushave të ndryshme, intelektualë dhe mbështetës të Partisë Demokratike.Edhe pak orë na… 
Takime me banorë të njësisë 11, në zonën e Josif PashkosLegalizimet si problematika kryesor në këtë njësi, janë o… 
E drejta për të votuar është një detyrë historike të dielën! Me votën tonë vendosim për të ardhmen e fëmijëve tan… 
Me struktura të degës 11, në zonën e Gintash.Vendimi i duhur për një të ardhme më të mirë është vota juaj për num… 
Derë më derë duke shpëndarë programin e Partisë Demokratike.Ne po fitojmë dhe po fitojmë thellë!Ndryshimi po vje… 
Takim me mbështetës demokratë në rrugën “Llazar Shapatini”.Duke u përballur me sfida të ndryshme çdo ditë, ata kë… 
Derë më derë duke ndarë programin e PD.Edi Rama e di që do të humbasë. Edi Rama nuk ka asnjë shans për të fituar… 
Takim me banorë të njësisë 9, në rrugën “Siri Kodra”.Folëm për probleme të zonës dhe zgjidhjet e tyre mbas 25 pri… 
Takim me vajza dhe gra të njësisë 11, në rrugën “Valbona”.Ato përballen çdo ditë me probleme të shumta si varfëri… 
Një kafe me të rinj të degës 9, në bulevardin Zogu l.Një takim nga ku dola e emocionuar nga idetë që ata kishin.… 
Një kafe me mbështetës ndër vite të Partisë Demokratike.Ata votojnë numrin 9 për të sjellë ndryshimin. Votojnë 9… 
Mbledhje me struktura të degës 9.Për ti sjell një ndryshim të vërtetë vendit dhe të ardhmes sonë.Më 25 prill vo… 
Takim me lapraksa të vjetër në rrugën “Riza Çuka”.Me plot halle e probleme, dhe me një jetesë jashtë normales për… 
Me struktura të degës 11, në zonën e Gintash.Na ndajnë vetëm 6 ditë nga zgjedhjet. Vendimi i duhur për një të ard… 
Mbledhje kryesie në njësinë 11.Bashkë për të sjell vendin në normalitet, për të sjell fitoren e Shqipërisë.Më 2… 
Me struktura të njësisë 11, në zyrën elektorale në rrugën “Don Bosko”.Bashkë punojmë për të sjell ndryshimin që i… 
Takim me gra dhe vajza të njësisë 11, në zonën e Don Boskos.Ato shprehën shqetësimet e panumërta, dhunimin e të d… 
Takim me të rinj të njësisë 11, në rrugën “Don Bosko”.Të rinj  të zhgënjyer nga mundësitë e marra peng këto 8 vit… 
Takime me farmacistë të njësisë 11 në Laprakë.Edhe pse janë në vijën e parë të luftës me Covid 19, ka një shpërfil… 
Me struktura të njësisë 11, në zonën e bregut të lumit.Pavarësisht presioneve, shantazheve, vullnetin e popullit… 
Me struktura të degës 11, në zyrën elektorale në zonën e Don Boskos.Bashkë për fitoren e 25 prillit.Më … 
Me struktura të degës 9, në zyrën elektorale në rrugën “Fortuzi”.Puna vazhdon, për ndryshimin që presim.Më… 
Mbledhjet vazhdojnë në zyrën e shtabit.Ndryshimi tashmë është mes nesh.Më   ëriafiton ✌ 
Takim me komunitetin Dibran në zonën e Don Boskos.Ata zgjedhin alternativën e PD, si e vetmja rrugë për një të ar… 
Me struktura të njësisë 9, në zyrën elektorale në rrugën “Fortuzi”.Bashkë për ndryshimin e pashmangshëm, për fito… 
Një kafe me struktura dhe simpatizantë  të njësisë 11, në rrugën “Migjeni”.Ndryshimi po vjen!… 
Në një takim të këndshëm me familje autoktone tiranase me pjesëmarrjen e Z.Dashamir Shehi. Bashkë drejt  rrugëtim… 
Me struktura të njësisë 9, në zyrën elektorale në rrugën “Fortuzi”.Ndryshimi është duke ardhur!Më … 
Takim me struktura të degës 11, në rrugën “Don Bosko”.Duke punuar për zhvillimin, për një të ardhme më të mirë, p… 
 Shikojeni këtë video të dashur qytetarë! Kaq vleni ju për Edi Ramën Erion Veliajn dhe Ogerta Manastirliun! Vleni… 
Me struktura të njësisë 11, në rrugën “Migjeni”.Më    ✌ 
Mbledhje me shtabin elektoral.Cdo ditë duke punuar për ndryshimin.Më    ✌ 
Takim me banorë dhe biznese të njësisë 9, në rrugën e Barrikadave.Qytetarët mbështesin ndryshimin.Ata e dinë se… 
Kafe me qytetarë të njësisë 9, ne rrugën e Barrikadave.Folëm për problematika të kësaj zone dhe përfshirjen e tyre… 
Takim me struktura dhe anëtarë të degës 9, në rrugën “Mine Peza”.Bashkë për fitoren, bashkë për ndryshimin!Më… 
Me disa personalitete dhe miq demokratë në njësinë 11.Më   ëriafiton ✌ 
Takim me të rinj dhe qytetarë të njësisë 11, në zonën “Kodër Kamëz”.Shpalosja e programit të Partisë Demokratike.… 
Takim me banorë, mbështetës të partisë demokratike, në njësinë 11.Një pritje plot entuziazëm gjatë prezantimit të… 
Takim me të rinjtë e njësisë 11, në rrugën “Gjergj Legisi”.Rinia mbështet alternativën e PD që i ka ata në fokus.… 
Mbledhje shtabi në njësinë 11.Bashkë për të sjellë ndryshimin.Më   ëriafiton ✌ 
Çdokush në Shqipëri e di. Ne duhet të anëtarësohemi në BE për një të ardhme më të mirë.Kush mund të na çojë atje?… 
Takimet vijuan me banorë dhe biznese në njësinë 11.Infrastruktura e degraduar, papunësia dhe taksat e shumta që pa… 
Takimet nisën në rrugën “Migjeni”, me banorë dhe biznese të njësisë 11.Entuziazëm për fitore gjatë prezantimit të… 
Takim me anëtarë dhe simpatizantë të Partisë Demokratike në rrugën e “Barrikadave”, në njësinë 9.Më … 
Një kafe pune me demokratë të njësisë 11, në zonën e “ish-shkollës së partisë”.Më   ëriafiton… 
Takim me mjekë të njësisë 11, në Laprakë.“Ndihemi të braktisur nga kjo qeveri.Na thonë heronj por na trajtojnë s… 
Takim me banorë të njësisë 11, në rrugën “Don Bosko”.Problemi kryesor: mashtrimi me legalizimet.Pas 25 prillit,… 
Takim që motivon për ndryshim, me gratë dhe vajzat e njësisë 9, në rrugën “Haxhi Hysen Dalliu”.Ato besojnë në alt… 
Me struktura të njësisë 9 , në zyrën elektorale në rrugën “Sulejman Pasha”.Më       … 
Kafe pune me struktura të njësisë 11, në zonën Kodër Kamëz. Më   ëriafiton ✌ 
Takime në njësinë 11, me banorë dhe biznese në zonën e Bregut të Lumit .Probleme kryesore në këtë zonë janë rrugë… 
Entuziazëm mes qindra të rinjve të njësisë 9, në rrugën “Siri Kodra”.Të zhgënjyer nga mundësitë e mohuara në vend… 
Takimet vijuan me banorë dhe biznese të zonës së bregut të lumit, në njësinë 11.Problemet më të hasura në këtë zo… 
Takimet nisën në rrugën “Princ Vidi”, në njësinë 11.Banorë dhe biznese që mbështesin fuqishëm programin e Partisë… 
Me struktura të njësisë 9, në zyrën elektorale në rrugën “Jordan Misja”Duke punuar për t’i sjellë ndryshim të vër… 
Takim me kuksian dhe dibran demokratë të zonës Josif Pashko, në njësinë 11.Shpalosje e programit të PD per zgjidh… 
Takim me struktura të njësisë 9, në zyrën elektorale në rrugën “Bajram Preza”.Më       … 
Me miq demokratë mirditorë të njësisë 9, në rrugën “Jordan Misja”.Në   ëriafiton ✌ 
I uroj Presidentes Vjosa Osmani suksese dhe sa më shumë forcë  e motivim në përballimin e sfidave të shumta të inte… 
Me banorë të njësisë 9, në rrugën “Dine Hoxha”.E nderuar nga mikpritja e tyre, dhe besimi që kanë në programin e… 
Takime me banorë dhe biznese të njësisë 9, në rrugën “Siri Kodra”.“Çdo derë ku trokitëm, u hap në mbështetje të a… 
Në Gintash, me biznese e qytetarë.Banorë të papunë dhe biznese që nuk marrin frymë nga taksat e shumta.Por pas… 
Takimet vijuan në zonën Kodër Kamëz me banorë dhe biznese.Te lodhur nga papunësia në këtë zonë, ku edhe ditën e s… 
Duke shpalosur programin e PD tek banorët dhe bizneset e njësisë 11, në zonën Kodër Kamëz.Në  25 prill… 
Dita nisi me struktura të njësisë 11, në zyrën elektorale në rrugën “Azem Galica”.Në 25 prill … 
Takim me banorë në zonën e shinave të trenit, në njësinë 9.Legalizimi i shtëpive është shqetësimi kryesor. “Kemi… 
Takimet e sotme vazhduan në rrugën “Ndoc Martini”, në njësinë 11.Banorët dhe bizneset të lodhur nga shpërfillja 8… 
 votojmë ndryshimin për të larguar këtë qeveri që ka braktisur qytetarët e saj.
Cdo ditë jemi më shumë! Cdo ditë më shumë mbështetje. Kudo ndjehet fryma e ndryshimit, fryma e fitores.… 
Takime me banorë dhe biznese në rrugën “Azem Galica”, të njësisë 11.Halle dhe probleme të shumta rëndojnë mbi ta,… 
 Për të sjellë ndryshimin dhe për të përmirësuar jetën e të gjithë shqiptarëve, na duhet të anëtarësohemi në Bashkimin E…
Dita nisi me një kafe me struktura të njësisë 9, ku fryma dhe mbështetja erdhi edhe nga stafi i lokalit dhe kalimta… 
Takim me vajza dhe gra të njësisë 11, në Laprakë.Motivim dhe shpres gjatë prezatimit të programit të PD për ndrys… 
Takimet vazhdojnë në rrugën “Jordan Misja”. Qytetarët që mbështesin programin e PD shtohen cdo ditë. Era e ndrysh… 
Në “shtëpinë” e ngrohtë të Tironës, me miq të mirë.Në   ëriafiton ✌ 
Duke prezantuar programin e Partisë Demokratike tek banorët dhe bizneset e njësisë 9, në rrugën “Skender Kosturi”.… 
Dita nisi me një kafe pune në njësinë 11 , në zonën pranë spitalit ushtarak.  ✌… 
Dita mbyllet në takim me kryesinë e njësisë 11, në Laprakë.Në   ëriafiton ✌ 
Takim me tiranas autoktonë dhe anëtarë e simpatizant të partisë demokratike në zonën e “ish punishtes së pastave”.… 
Takimet me banorë dhe biznese vazhdojnë në rrugën “S.Buzi”, në njësinë 11.Mbështetje e gjerë për programin e Part… 
Dita nisi me banorë dhe biznese të njësisë 11, në rrugën “Marubi”.Në 25 prill  ëriafiton ✌ 
Takimet vazhdojnë me struktura të degës 11, në zonën e KMY-së. Në 25prill  ëriafiton ✌ 
Në zyrën e shtabit në zonën e Brrakës.Bashkë për ndryshimin.Në 25prill  ëriafiton ✌ 
Dita nisi me miq të degës 9. Në     ëriafiton  ✌ 
Kur dita nis me miq të njësisë 9, në zyrën elektorale të PD.   ëriaFITON ✌ 
Në mbështetje të kombëtares shqiptare ✌ 
E diela sportive me të rinjtë e njësisë 9 dhe 11  Në   ëriafiton ✌ 
Takim me të rinj të njësisë 11, në rrugën “Egnatia”.Fituese gjithmonë do të jetë alternativa që ka mbështetjen e… 
Ditë e frytshme që mbyllet me mbledhjen e strukturave të degës 9.Në   ëriafiton ✌ 
Takimet vazhdojnë në rrugët  “Lunxhëri” dhe “Genc Ndreu” në njësinë 11.Shpalosja e programit të Partisë Demokrati… 
Derë më derë duke shpërndarë programin e PD, në rrugën “Princ Vidi” në njësinë 11.“Lulzim Basha sjell shpresë të… 
Me familjen Bilo, ndër demokratët e parë në zonë. “Demokrat kam lindur, nuk jam bërë” - tha Ariani.Koha për… 
Takim me mësues të njësisë 11, në Laprakë.Gati për ndryshimin.Në 25 prill  ëriafiton ✌ 
Takime me biznese të njësisë 9, në rrugën “Don Bosko”.Biznese të cilat mbijetojnë në luftë me rënien e konsumit.… 
Takimet vazhdojnë në rrugicat pranë Xhamisë, në njësinë 9.Banorët probleme me legalizimet dhe bizneset në mbijete… 
Kjo është Tirana reale përtej fasadës së propagandës qeveritare.Në    ëriafiton ✌ 
Dita fillon me një kafe me strukturat e njësisë 11, në Laprakë.Bashkë për ndryshimin.Në  … 
Takim me banorë dhe biznese të njësisë 11, në rrugë “Bruzi”.Probleme të panumërta.Ata e kanë kuptuar se këto zgj… 
Takim me banorë dhe biznese të njësisë 9, në rrugën “Siri Kodra”. Duke treguar  problemet e shumta, ata shprehën… 
Me miq të degës 9, në rrugën “Siri Kodra”.ëriaFITON ✌ 
Takim me banorë dhe biznese në rrugën e Barrikadave, në njësinë 9. Qytetarë të papunë, me halle dhe probleme.Biz… 
Takim me vajza dhe gra të njësisë 11, në zonën e Institutit Bujqësor.Një takim që motivon, dhe që thërret ndryshi… 
Takimet vazhdojnë  në njësinë 11, në zonën “Kodër Kamëz”.Shqetësime të mëdha, halle pa fund. Të braktisur e nëpë… 
Takime me banorë në rrugën “Gani Kryeziu” të njësisë 11.Të lodhur nga kjo qeveri e papërgjegjshme.Ata janë mbësh… 
Kur dita fillon me miq të mirë, në zyrën elektorale të PD të zonës së Brrakës.Në    ëriafiton… 
Takimet vazhdojnë me banorë dhe biznese të njësisë 9, në zonën e Brrakës.Bizneset shprehen se nuk kanë mundësi fi… 
Kur ditën e nis bukur me strukturat e degës 9.Bashkë për ndryshimin dhe për një të ardhme më të mirë për të gjith… 
Takimet vazhdojnë në rrugën “Petrit Radovicka” të njësisë 11.Qytetarët të lodhur nga braktisja 8 vjeçare.Ata për… 
===