 Erion, duhet të verifikohen të gjitha bizneset prodhuese në Tiranë lidhur me masat ndaj Sigurisë &amp; Shë… 
 Besoj, që duhen falenderuar zgjedhesit anembanë Shqipërisë, që iu përgjigjën thirrjes tuaj, Z.Rama
   aktivitete të vleshfshme për jetën e Qytetit️. Urime edhe Kryetarit. Kemi n… 
Sa e mirë gjuha. Nuk përbën rrezik për asnjë komb në botë. 
 Për saktësim medikamenti i përdorur është raportuar Fentanyl: Fentanyl Citrate.
 MosNdaloni.BëjeniParkun. Protestuesit po krijojnë mbetje në park, zhurmë dhe shumë trafik-ndikim real në cilësisë së mjedisit.
 Tjetër Objektiv? LiqeniArtificial. A ka 1 Plan? Rigjenerimi i ujit të tij ndikon në Rekreacionin e Zonës dhe CilësinëAjrit.
 Urime. Vërtet sukses për shkollën Shqiptare.Tani sa më shpejt edhe laboratori i kimisë në funksionim. :)
 Përshëndetje dhe Gëzuar 2016. Ku mund të gjej në formë elektronike formularin për Komente mbi Planin e Përgjithshëm Kombëtar?
 “Skatenberg square” vepra e relizuar nga Mauri Virtanen (Ecuador) në vitin 2015, pjesë e Bienales së I të Akuarelit 
  Ju lutem mundësoni, që Laboratoret (kimi &amp; fizikë) tek shkolla e mesme "Sami Frashëri" të rifillojnë të funksionojnë
 Përshëndetje Suzana,Uroj të jeni mirë. Cfarë kriteresh duhen plotësuar për të bashkëpunuar me PECB si trajner?Genti
 Si për herë të parë, pati sukses.
  Një shqiptar më shumë që kontribuon për vendin e tij. :)
  Nëse ke dëshirën e mirë, patjetër do të gjesh një mënyrë vlefshme për të ndihmuar vendin tënd :)
 Kënaqësi të shkoje në punë sot në mëngjes. Pak Zhurma dhe Ajër më i Pastër nga mungesa e makinave. 
 Ok.Ka nisur mirë puna. Më e rëndësishme është vazhdimësia dhe arritja e rezultateteve të planifikuara. Zhvillimi i qëndrueshëm.
 Sa e përgatitur është qeveria ndaj emergjencave civile, që mund të ndodhin?
 Urime Z.Ministër për suksesin e radhës. Duhet,që Policia të publikojë numrat telefonik të emergjencës ne zonat turistike?
 Sa efektive është qeveria juaj në eleminimin e informalitetit në pagesën e kontributeve të sigurimeve shoqërore nga punëdhënësit?
 Sa efektive është qeveria juaj në garantimin e sigurisë dhe shëndetit në punë të punonjësve, që punojnë në biznese të ndryshme?
 J. Attali: Asgjë nuk  përmirësohet, sa kohë njerëzit e arsyeshëm do të besojnë se kriminelët dhe fanatikët u binden të nj…
 Djali me jetë të gjatë.
 Bukë falas për këdo që nuk ka mundësi ta blejë   via 
 Traktore dhe lule :) 
===