 ëUrimet më të mira Kryetarëve, Sekretarëve dhe N/Kryetarëve të Seksioneve d…
 Sot në ditën ndërkombëtare të gruas përkujtojmë të gjitha ato, të cilat vuajtën gjatë regjimit komunist. Me qindra u dën…
Pyetje nga kandidatët: nëse mbështetësi juaj kryesor është dikush i përcaktuar publikisht për korrupsion madhor në… 
Në vend të përgjigjes!Secili prej nesh kemi për detyrë qytetare dhe patriotike, të jemi edhe ambasadorë të Shtetev… 
Intervistë dhënë sot për Ora News:"Brava dhe bravistët" mediokër edhe në mediokritet!
Mediokër edhe në mediokritet!Kjo është shprehje e komunistëve të viteve '60 që ende shpresonin se mund të restauro… 
"Tërmet... tërmet... i q*ve nonën"...është slogani i reformës. 
 Këtë ditë në v.1905 u vra Papa Kristo Negovani; sepse në gjuhën shqipe mësonte fëmijët dhe meshonte në kishë. Bekuar qoftë…
Saimir Tahiri NUK DO TË FLASË!Dhe kjo, jo për arsyen se nuk ka gjë për të thënë; jo se nuk do të fundosë politikan… 
 Dhuna ndaj demokratëve që Lulzim Basha po mundohet ta fshehë!!! ëpiaLirisë  
"Kujdes! Barku nba ata dolën, ende nuk është shterpëzuar!"Brecht 
Kuvendi është organi më i lartë drejtues i PD, kësisoj s'mund të "verifikohet" nga vartësit e tij, ata që i emëron… 
Re-Open Tititism loading!Me vëllezërit jugosllavë u bashkuam!Presim të bashkohen edhe miqtë kosovarë! Edhe në ket… 
Është KRIM I QËLLIMSHËM i njehsimit të shtetit me "PARTINË"!Shteti i ka vënë në dispozicion "PARTISË", të gjithë d… 
✌️✌️Atë që nuk ndalet para vështirësive, s'ka vështirësi që e ndal! 
Kjo është statistika e vetëm 1 viti të qeverisjes 8 vjeçare të Sali Berishës në luftën kundër korrupsionit! Është v… 
Pse?Sepse një organizatë e krijuar, zhvilluar dhe krenarisht e pandryshuar në rrënjët e totalitarizmit, nuk ka tol… 
Narko-totalitaritarizëm!* Po shkarkojnë të vetmen kryebashkiake legjitime, të mbijetuar nga procesi monist i voti… 
 ë_Sek_1919Deputeti  në çdo moment pranë njerzve! ër…
 “Kush e blen votën duke përfituar nga varfëria e votuesve nuk është i denjë të ulet në detyrën për të cilën kërkon.”…
 ë_GrSek_4Deputeti  takim me kontributorë në vite të Partisë Demokratike në Grupsek…
 ë_Grupseksioni_11Ne kemi qenë shumë, tani jemi dhe më shumë.Deputeti  ju dorëzon  tese…
 ëDeputeti Gent Strazimiri  takim me banorët e Seksionit 1883. Të gjithë mbështesi…
 ëMe Gent Strazimiri  banorët po bashkohen të gjithë se e dinë që Partia Demokrat…
Derë më derë, duke nisur nga dyert e demokratëve qëndrestarë, atyre që në 30 vite kurrë nuk u dorëzuan e s'i përkul… 
LAJMI MË I RËNDËSISHËM i 8 viteve të fundit!!!8 vite më parë kjo thirrje-denoncim quhej zyrtarisht "dhunë verbale"… 
Ditën kur traktori i vjetër besnik, do jetë orendia më e çmuar e shtëpisë, kur duart e vrara nga puna do shenjtëroh… 
SKLEP në sy të TIRONËS! 
"Arrestojmë sot Reshatin,Hajd' kendojmë për Sigurimin" !PopulliKAQË! 
Edhe Koreja e Veriut, si ne, do vaksinoka më parë "kuadrot me vlera", "Heronjtë e Punës Socialiste", "Mjelëset e da… 
 Edi Rama është Kryeministër prej 8 vitesh dhe vetëm ai është përgjegjës për dështimin e Shqipërisë.  Përpjekjet e tij për t…
Unë e dija që k*rva krihej vetëm kur fshati digjej... por kriheshka edhe kur fshati ngrin...... punë k*rvash dmth.… 
 UNRRA që vëzhgoi "zgjedhjet" nxorri dhe një raport ku certifikoi "fitoren" e Enver Hoxhes me "votë të… 
S'paska faj ky që i thotë "e di vetë atë punë" dhe "s'pyes njeri" ...Po të jetë se prioritet është korrupsioni, ky… 
 Është hera e parë që një parti politike vë familjen dhe rininë në qendër të programit të saj: 30 mijë lek/muaj për çdo…
 Çmimet e shtrenjta të ilaçeve, energjisë, ujit dhe ushqimeve u gllabërojnë të gjithë pensionin. Kjo qeveri nuk u lejoi…
 650 mijë pensionistët shqiptarë janë në kushtet e mbijetesës. Ne do t'i rrisim pensionet sa dyfishi i inflacionit, por…
 Rama qetësohu. Ky është vetëm fillimi. E dimë se ti nuk je mësuar të përballesh kurrë me angazhime serioze që do të mba…
Nder dhe respekt këtyre burrave që në emër të BESËS së shqiptarit, dhe të vlerave më të mira bashkëkohore, i siguru… 
 Heronjtë e vërtetë që ende sot na zbardhin faqen si "të drejtët mes kombeve" !!! Dritë paçin pranë Z… 
 LAVDI!!!! Ndjesë paçim ne "të gjallët" !
 Sot në orën 17:30 në emisionin "Këtë Javë" në News24 me gazetaren Nisida Tufa. 
 Një pyetje e thjeshtë: po ti do ta pushoje nga puna këtë njeri? 
 Premtoi se do ta ulte çmimin e energjisë për familjarët. Rama gënjeu - ai vetëm i rriti faturat e energjisë për familje…
 Mbarë shqiptarët përkujtojnë sot  masakrën e Reçakut. Plaga është ende e freskët, dhimbjet nuk janë fashitur e do të mb…
 Vendi i përmbytur, në krizë ekonomike dhe shëndetësore, ministrat e Ramës shtrohen në darka luksoze në Dubai. Është koh…
 Në Fushë-Krujë kanalet nuk pastrohen prej vitesh. Këto punë mund të ishin kryer para disa vjetësh po kjo qeveri e ka pa…
 Po s'me tha qy që qjo puna e ID card s'është gjene "marifet i Saliut", unë s'e bënj!KAQË! 
 Prioriteti nr.1 i qeverisë time do të jetë punësimi veçanërisht i të rinjve Prioritet do të thotë të tregosh seriozitet…
Merr një tufë lule dhe shko në spital tani... po të presin!Janë ata që përballen çdo ditë me vdekjen duke të mbajt… 
 Sot, ora 20:45, në një bisedë me gazetarin Çim Peka në Syri TV. 
 Mbështetja e sipërmarrjes dhe inovacionit, sigurimi i financimit për projektet start-up të të rinjve shqiptarë është rr…
 Problemi kryesor i ekonomisë sot është monopolizimi. Do të luftojmë monopolet që i kanë zënë frymën ekonomisë. Do të ri…
 Domosdoshmëri unifikimi i qëndrimit mes Tiranës dhe Prishtinës në arenën ndërkombëtare për çdo çështje që lidhet me Kos…
 Policia e Shtetit do t'u kthehet qytetarëve. Reformë e thellë, për një polici që do të luftojë krimin, do të mbrojë qyt…
 Sot 10 vite më parë, ne arritëm stacionin e lëvizjes së lirë të shqiptarëve në BE, realizuam një ëndërr. Krenar që kam…
 Gjuha e urrejtjes dhe përpjekjet e dëshpëruara të Edi Ramës për të  fajësuar PD për 7 vitet e dështimit, premtimeve bosh…
 Sot kam patur disa biseda me përfaqësues të komunitetit ndërkombëtar lidhur me zhvillimet e fundit. Ndava thirrjen për…
 Do të bëj çdo gjë t’i japim fund bashkë kësaj të keqeje më 25 prill. Bashkë me shumicën e shqiptarëve, shpëtojmë dhe ri…
 Çdo shqiptar është tronditur nga ekzekutimi i Klodjan Rashës në derën e shtëpisë. Dhimbja dhe zemërimi na ka përfshirë t…
 E duam Shqipërinë si gjithë Europa! Kjo ishte thirrja e tyre, teksa kapërcenin barrierat policore dhe dhunën e regjimi…
Një këshillë nga "Marie-Antoinette" e Rilindjes, në kohë pandemie!- S'keni lekë për ilace, shtretër spitali, oksig… 
 Biznesi lezhjan është në krizë të rëndë. Pa punë dhe të lënë në baltë nga qeveria Rama, kanë shkurtuar deri në 70% të f…
 Ky qenka zbulim historik! Dita e themelimit të "medias së pavarur" me "carlo", "blusha", " frrokër" e "muhametër"... që në '45
Nderim viktimave të nazi-komunizmit!Robëria është robëri edhe kur barbari ndërron këmishën e zezë me të kuqen! 
 Kjo ditë feste i gjen sivjet Shqipërinë dhe shqiptarët përballë sfidës së pandemisë, që u ka marrë jetën shumë prej nes…
 Edhe sot 1 vit pas tërmetit, një numër i madh familjesh janë në çadra.
 Sot, ora 20.45, te Çim Peka në Syri TV me gazetarët Enton Abilekaj dhe Mentor Nazarko. 
 Urime divës shqiptare  për 6 nominimet , përfshirë Albumin e vitit dhe Këngën e vitit! Je krenaria jonë,…
 Nëse nuk ke asgjë për të fshehur, prano direkt një hetim të plotë të gjithë informacioneve që jo mjekët, por ti ke fshe…
 Ju ftoj të më ndiqni sonte ora 21:00 me  në emisionin Opinion . 
Për ç'ta lusësh Zotin:Të vdesësh nga COVID, apo të jetosh e të shohësh këtë çdo ditë...?!Kjo është dilema… 
 Nëse Rama do kishte investuar kohën e tij sot, në shërbim të qytetarëve në vend që të cicëronte gënjeshtra kundër meje,…
PO!Liria ka emër dhe quhet UÇK!PO!Tradhëtia gjithashtu ka emër, të ndërruar 4 herë që në 8 nëntor 1941 dhe sot q… 
 Jam shumë i vetëdijshëm për vështirësitë e mëdha që kalojnë personat me aftësi të kufizuara.Pandemia i ka dalë jashtë…
 Kur liderët e UÇK-së po përballeshin me gjykatën në Hagë, në Tiranë Edi Rama nënshkruante marrëveshje me ish-Ministrin…
 Mësuesit janë njerëzit më të rrezikuarit nga  pas personelit mjekësor. Në Shkodër, rrezikut për jetën i shtohet e…
 Rama je një dështim i madh. Sa shqiptarë duhet të vdesin që të ndalësh sulmet politike dhe përpjekjet për të na mbyllur…
 Ne do të të mposhtim ty dhe do t'u japim fund gënjeshtrave dhe premtimeve të tua të rreme. Do të ecim të sigurtë drejt…
 Ndërsa merresh me vizatime dhe nuk shkulesh nga Instagrami, unë e kam vënë tërë jetën time në shërbim të vendit. Për Sh…
 Kjo është përballja dramatike e Muharrem Poleshit me COVID.  Urgjenca nuk i përgjigjet 8 ditë rresht dhe kur i përgjigj…
 Qytetarët shqiptarë meritojnë më shumë. Më shumë teste,më shumë ndihmë,më shumë zgjidhje. Plani ynë ofron zgjidhje dhe…
 Cfarë lidhje ke ti me të vërtetën, Edi Rama? Premtove shëndetësi falas- gënjeve. Premtove 300 mijë vende pune-gënjeve.…
 Edi Rama leri shpifjet dhe lojërat politike, përgjigju pse nuk e hap Covid 4? Pse të infektuarit dergjen nëpër ambulanc…
Sepse LIRIA është PAQE! 
 Numri i të sëmurëve nga Covid-19 po rritet përditë, fatalitetet po shtohen dhe kapacitetet shëndetësore po shkojnë drej…
 Arti dhe artdashësit shqiptarë humbën sot Avni Mulën artistin e madh dhe kompozitorin që ndriçoi me artin e tij kohët e…
 Rritja e numrit të testimeve, rimbursimi i plotë për mjekimin në shtëpi kundër Covid, bonusi i premtuar dhe angazhimi i…
 Politika e vjetër ka erën e gropës së Hajdin Sejdisë ku nuk vure dorë 11 vjet si kryetar bashkie, ka fytyrën e zërin të…
 Pas tërheqjes së Edi Ramës nga padia ndaj BILD, çmimi i Bashkimit Europian për gazetaren Klodiana Lala për investigimin…
Dhe për ta mbyllur "siç duhet" ditën e përdhosjes së Flamurit Kombëtar me yllin e Titos dhe Stalinit, paskan arrest… 
 Lere viktimizimin për të fshehur vjedhjen. Plehrat e tua janë në çdo cep të Shqipërisë dhe 70 mil euro kanë avulluar pa…
 Dhimbjet e shqiptarëve që ke zhytur në skamje e nuk kanë mundësi as për ilaçe, shëndetësia në kolaps, ekonomia në krizë…
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
 Rriten infeksionet, bien testimet. Ndërkohë që njerëzit kanë nevojë për mbështetje dhe ndihmë, Rama vazhdon me vjedhje…
 Kodi Zgjedhor u miratua.Dy pyetje lindin në kushtet ku jemi: 1. A është ky Kod në përputhje me Kushtetutën? 2. A ka një ju…
 Ribashkimi i  30 vjet më parë shënoi nisjen e rënies së mureve në mbarë Europën lindore dhe hodhi themelet e bashkimi…
 Ky që shfaqet në video është një politikan pa ide, pa plan dhe pa vullnet për të ndihmuar realisht biznesin e vogël. Çdo…
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
 Këtë vit, Dita Ndërkombëtare e Trashëgimisë Kulturore e gjen Shqipërinë pa Teatrin Kombëtar, që u shemb nga regjimi si…
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
Të merresh me politikë, është prerogativë vetëm e PARTISË! Më mirë të jesh "ordiner" sesa "politik" ... ende sot... 
 1/1 Sapo u njohëm me vendimin e gjykatës për ish kreun e bashkisë së Lezhës zotin Fran Frrokaj. Ne jemi të bindur për pu…
 Çfarë e detyroi Edi Ramën të shkelë edhe premtimin kundër kumarit. Heshtja e tij për të dhënë shpjegime për këtë çështje…
 Pse nuk viziton  shkollën në Lalëz?? Të shohë ku do hyjnë rreth 200 nxënës (nga mosha e kopshtit deri ne klasë…
 Personalisht dhe në emër të Partisë Demokratike përshëndes marrëveshjen e arritur mes delegacioneve të Kosovës dhe Serb…
 Raporti i fundit i EuCham që e rendit  ndër tre vendet e fundit në  për të bërë biznes, konfirmon qartë se kjo qeve…
 Me  në ëm. Realitet i hidhur, varfëri e tejskajshme, shkolla të shembura, rrugë të prishura.Qindra fë…
 Rama frymëzoi, promovoi dhe kandidoi për deputetë dhe kryetarë bashkie njerëz të lidhur me krimin. Të përzgjedhurit e tij…
"Ana e duhur e historisë", në foto, dekorata dhe harta...Ka 76 vjet që "nuk është ashtu siç duket" ... 
 Po ta përsëris Edi Rama, bëj transparencë e mos u fshih pas gërrvërreve bajate. As servilët e fundit që të kanë mbetur…
 Leri dërdëllitjet prej rrugaçi Edi Rama. Bëj transparencë çfarë po ndodh me negociatat për detin. Historitë me sapun ru…
 Rigënjeshtra nuk e fsheh dot të vërtetën: godinat që duhet të ndërtoheshin janë ende vetëm projekte 3D dhe premtimet nuk…
 Njerëz të braktisur nga një qeveri e dështuar. Turp!                           
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
 Këto janë nenet e miratuara të Marrëveshjes së 5 Qershorit, që rregullojnë formulën e koalicioneve parazgjedhore me list…
 jo lojën tënde dhe të krimit që të drejton prej 22 vitesh në politikë, por hallet dhe problemet e shqiptarëve, që ti dh…
 të hajdutëve që të rrethojnë, po ta them prerë dhe shkurt: Vendi yt pas zgjedhjeve të reja është në burg, atje ku shkon…
 Koston e konfliktit të krijuar me hedhjen në erë të marrëveshjes së 5 Qershorit dhe 14 Janarit, do ta mbash vetëm ti pe…
 3/3 Opozita e Bashkuar është 100 % dakord, për hapjen 100 % të listave të kandidatëve. Për këtë jemi të gatshëm të punoj…
 ER i ra maska! Prano hapjen 100 % të listave dhe tërhiq amendamentin e njëanshëm të tmerrit tënd nga koalicioni opozitar…
 Sa herë hap gojën, Edi Rama gënjen për qëllimin e vërtetë të ndryshimit me urgjencë dhe në mënyrë të njëanshme të Kushte…
 (1/2) Në grahmat e fundit të qeverisë në largim, Edi Ramës s`i ka mbetur gjë tjetër veç të premtojë rrugë 3D.  Në ditët…
 (2/2)një shifër dy herë me e lartë se shuma e azilkërkuesve nga të gjitha vendet e tjera të Rajonit!Asnjë formë propaga…
 (1/2) 30 vite më vonë shqiptarët vazhdojnë të largohen ndërsa Rama me Gënjeshtrat, paaftësinë dhe pamundësinë që i ofroi…
 Sot pata një bisedë telefonike me  Ministrin e Jashtëm të Italisë, Luigi Di Maio. E falenderova për ndihmën e madhe që…
 Babëzia, arroganca dhe shpifja janë trinomi i pandarë i RAMAVIRUSIT që prej 7 vitesh i ka shtyrë shqiptarët drejt shpun…
 Në ditët më të vështira për shqiptarët, kur xhepat janë të zbrazur dhe varfëria po rritet çdo ditë, Edi Rama përdor dhu…
 Sot, në oborrin e familjes Petrela, një nga më të vjetrat në Tiranë, duke biseduar jo vetëm për hallet e tyre sot nga e…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Në emër të Opozitës së Bashkuar ju shpreh falenderimet tona aleatëve dhe partnerëve tanë euro-atlantikë për ndihmën dhe…
 Rama e shembi Teatrin Kombëtar me dhunë, kundër ligjit dhe me qëllimin e vetëm që në truallin e tij të ndërtojë kullat…
 Rama është hajduti që i vjedh shqiptarët, është mashtruesi që i gënjen, është xhelati që i dhunon. Nuk mund të vuajë nj…
 Ekonomia jonë pritet të tkurret me 9%, më keq se në cdo vend tjetër, sepse RAMAVIRUSI zgjodhi të paguajë me paratë e sh…
 Për 7 vjet me radhë, RAMAVIRUSI e ka gërryer ekonominë, shëndetësinë dhe mirëqenien e shqiptarëve. CORONAVIRUSI vetëm s…
 Ndërkohë që shqiptarët presin zgjidhje për krizën që ka pllakosur, Rama gjen kohë vetëm për të grabitur. Kalimi i TK në…
 Njoftimi i qeverisë për të shmangur specifikisht grumbullimet vetëm në kisha e xhami evokon kujtime të errëta të ateizimit s…
Dikush e financoi bujarisht që të mbërrinte aq lart sa të kishte në dorë jetët e "të tjerëve" ...Tani po kërkon ed… 
 Vetëm rritja e numrit të testimeve mundëson identifikimin real të të prekurve dhe frenimin e përhapjes së virusit. Izol…
"E njëjta vepër e kryer në dëm të dy ose më shumë personave, me paramendim dhe në mënyrë të strukturuar, dënohet me… 
E vetmja dispozitë qe duhej shtuar ne Kod Penal"Shtrëngimi ose vendosja e qëllimshme në kushtet e pamundësisë për… 
Edhe ne '89, vetëm për individin Havzi Nela ishte, jo për "popullin" ... "Armiku" dhe "bashkëpunimi" është po ai!!… 
 Në mbledhjen e KSK detajova arsyet, nevojën dhe përfitimet që kanë qytetarët nga rritja e testimeve, si dhe i kërkova q…
 Happy Easter!  Për shumë vjet Pashkët!
 Fatkeqësisht twitter nuk e ka emoji-n e përshtatshëm për këtë lloj pisllëku...
 Lugina e Preshevës po përballet me pasojat e COVID-19. Për situatën e veçantë ku ndodhen, i bëj thirrje qeverisë të ofr…
 Mbështes plotësisht kërkesën e drejtë të Sindikatës së Policisë për shpërblim për punonjësit e policisë. Si çdo qytetar…
 Shqetësimet dhe propozimet e Dhomës Amerikane të Tregtisë janë të drejta. I kam kërkuar qeverisë angazhimin e të gjitha…
Se në bazë të cilit ligj u ndalohet hyrja në Atdhe shqiptarëve, këtë vetëm SPAK dhe qeveria e di... 
 Mbyllja e kufirit për dhjetëra shqiptarë në tokën neutrale Shqipëri-Greqi dhe ndalimi i tyre për të hyrë në atdhe e për…
 Situata e qytetarëve shqiptarë në pikat e kalimit të kufirit është dramatike dhe kërkon ndërhyrje urgjente. Qeveria të…
 Sot përulemi me nderim para kujtimit të Arben Brocit, Nazmi Kryeziut, Besnik Cekës dhe Bujar Bishanakut, 4 të rinjve sh…
 Kreu i ,  i ka bërë thirrje  që të marrë vendim "për të mbyllur fabrikat, fasoneritë…
 Vendet anëtare të BE-së dëshmuan sot se e mbështesin Shqipërinë dhe shqiptarët me shprehjen e vullnetit për të hapur ne…
 Megjithë shtimin e kushteve deri në hapjen e tyre, ne mbështesim këtë proces jetik për shqiptarët. PD dhe Opozita e Bas…
 Në këto ditë të vështira për Shqipërinë &amp; mbarë botën,nevoja për shpresë është edhe më e madhe. Mirënjohje  pë…
 Përpos kërkesës për shpallje të gjendjes së fatkeqësisë natyrore, kreu i ,   i kërkoi …
 Në një shoqëri të lirë duhet të mbizotërojnë gjithmonë e vërteta dhe transparenca!Edhe pse ky akt i shëmtuar ka indinju…
 Sa keq për çdo shqiptar kur kryeministri në vend që të japë MENJËHERË 120 milion eurot e ppp-ve për shëndetin dhe bukën…
 Pas pak nga Selia e PD fakte tronditëse se si vetëm këto 2 javë qeveria ka dhënë 52 milion euro pagesa dhe tendera për…
 Masat ekonomike dhe sociale të propozuara nga PD janë të qarta dhe lehtësisht të zbatueshme për t'ju ardhur në ndihmë f…
 Situata emergjente kërkon masa emergjente! Ftoj qeverinë që në këtë kohë krize të mos ketë asnjë kompleks të zbatimit t…
 Kur gishti tregon hënën, i marri tregon gishtin.  ministria jote e Shëndetësisë është rrumpallë, përgatitja e…
 Më në fund e pranoi të vërtetën. Maskat janë të skaduara. Si të tilla ato nuk mund të jenë masë mbrojtëse për personeli…
 Në vend që të sulmojë opozitën  duhet të japë llogari pse ka shpërndarë 1.2 milionë maska të skaduara? Gënjes…
 Pas vendimit për mbylljen e shkollave, kopshteve dhe çerdheve, duhet që shteti të paguajë apo kompensojë me vlerë të pl…
 Të kujdesemi shumë për higjenën tonë personale, të kufizojmë udhëtimet dhe nëse nuk ndihemi mirë të rrimë në shtëpi.Sot…
 Asnjë vend nuk është imun ndaj rrezikut të CV, dhe tani që kemi rastet e para të konfirmuara edhe në Shqipëri, është më…
 Sa kohë ky njeri drejton Shqipërinë, aq kohë shqiptarët do zbrazin vendin e të parëve. Keqqeverisja e këtij KM që vret…
 Të gjitha donacionet për popullin shqiptar për dëmet e pas tërmetit të 26 nëntorit janë të bekuara dhe të mirëpritura.…
 Përshëndes deklaratën e Misionit të KiE që ritheksoi se në 30/06 nuk pati zgjedhje,se pushteti vendor sot nuk është plu…
 Shqiptarët meritojnë të dëgjohen me vëmendje. Me Entonin dhe familjen e tij të re në Tiranë, duke folur për problemet e për…
 Pas 7 vitesh dështim, një gjë është e qartë. Edi Rama dhe qeveria e tij nuk mund të luftojnë krimin dhe korrupsionin se…
 Global Talent Competitiveness Index 2020, është i dhjeti raport që evidenton korrupsionin e qeverisë si problem për sho…
 Edi Rama ka fuqizuar vetëm një biznes në Shqipëri. Biznesin e tij personal me të inkriminuar dhe oligarkë. Çdo biznes t…
 Shqipëria shënoi përkeqësim duke rënë nga vendi i 76 në vendin e 79-të. Nismat ligjore për të penguar lirinë e shprehje…
 Indeksi i Demokracisë i  e klasifikon Shqipërinë  regjim hibrid një hap larg autoritarizmit, për shkak të munges…
   : Përshëndes vendimin e marrë nga Komiteti i Monitorimit të Asamblesë Parlamentare të Këshillit të Europë…
 Me gazetarët  : Dita e djeshme shënoi hapin e parë për përfundimin e procesit të diktuar nga Bundestagu që d…
 Bashkëbisedim me gazetarët  : Reforma zgjedhore është prioriteti numër 1. Nuk duhet humbur asnjë moment për…
 Partia Demokratike mbështet angazhimin e SHBA në luftë kundër terrorit. Vendimi i presidentit Trump për goditjen e njërit p…
"Vota kundër projekt Kushtetutës është votë (...) kundër presidentit kosovar të Sali Berishës"! Edi Rama, "Koha Jo… 
   : Mesazhi për Edi Ramën është i thjeshtë &amp; i qartë: I ke bërë llogaritë gabim!
 15 dhjetor 2010, dita e parë e shqiptarëve pa viza në Europë! 
===