Një diskutim mbi dobinë e angazhimit të qytetarëve dhe forcimit të raportimit së bashku me ta...Për më shumë ndiq… 
 Media Amfora fton të gjithë qytetarët që të raportojnë mbi raste konkrete të dëmtimit tëobjekteve arkeologjike, monumenteve…
Kompania që kontrollon vend depozitimin e Sharrës i ka dhënë edhe 15 ditë kohë bashkisë së Durrësit për depozitimin… 
 Ep.2/I gjithë bregdeti i Durrësit ka qenë i banuar rreth 6000 vjet më parë. Më pas ai ishte territor edhe i fiseve ilire. P…
 Ep.2/ I ftuar, skulptori Ivo Moja, që pas tërmetit të nëntorit gjeti forcën të ulërasë për shkatërrimin e trashëgimisë...P…
Përgjatë serisë me 3 video-dokumentar u realizua një raportim i gjerë mbi problemin e derdhjes së ujërave të ndotur… 
Në “Mirëmëngjes Shqipëri”, për të folur mbi risitë e serisë së videove  “Kultura në 1 minutë” dhe podcast-eve.Për… 
 Media Amfora sjell serinë e videove “Kultura në 1 minutë”. Ndiqni videon e parë nesër, ora 20:30 në Facebook dhe Instagram (h…
Një emigrant nga Maroku u paraqit i dhunuar në media dhe akuzoi policinë, por kjo e fundit thotë se ai ishte rrahur… 
Policia dhe dogana e Portit të Durrësit sekuestruan 123 mijë paund të padeklaruara,  të fshehura në parakolpin e nj… 
 Mëngjesin e së enjtes besimtarët myslimanë kryen ritualin e faljes së Fitër Bajramit. Ajo pason mbarimin e agjërimit përgjatë…
 Projektet e rindërtimit të ndërtesave të shkatërruara nga tërmeti në Durrës, të financuara nga Fondi Shqip…
 Muzeu Kombëtar i Pavarësisë gjendet në Bulevardin e Vlorës, në Skelë dhe mund të vizitohet nga e marta në të dielën, nga ora…
Projektet e rindërtimit të ndërtesave të shkatërruara nga tërmeti në Durrës, të financuara nga Fondi Shqiptar i Zhv… 
 “Perandori i Saharasë arrestohet si hajdut në Durrës” është titulli i një artikulli në faqe të parë të gazetës Corriere della…
 Me vendimin e datës 13 shkurt 2013, Këshilli Kombëtar i Restaurimeve miratoi projektin për restaurimin e saj, hartuar nga ish…
 Pas tërmetit të 26 nëntorit që shkundi qytetin u ndez një dritë jeshile për zbulimin më tej të amfiteatrit. Akt-ekspertizat e…
  Referimi mbi përplasjen e përgjakshme në Elbasan ngre pikëpyetje se Policia jo vetëm që mb…
 Makina luksoze që hyjnë e dalin nga oborret e shkollave, përfshirë makina pa targa dhe tipa me syze diel…
Makina luksoze që hyjnë e dalin nga oborret e shkollave, përfshirë makina pa targa dhe tipa me syze… 
Nga një verifikim për  , në Durrës dhe Tiranë, kandidatë të PS janë konstatuar në shkelje të Kodit… 
 Tjetër diskutim i mirë sot me gazetarë nga ësi mbi Lirinë e Medias &amp; vështirësitë që ndeshin në punën e tyre, veçanër…
 Nga një monitorim alternativ në 4 prej qyteteve kryesore, Tiranë, Durrës, Elbasan dhe Shkodër u zbulua se Tirana dhe Shkodra j…
 Nga një seri matjesh alternative për nivelet e ndotjes së ajrit janë zbuluar shifra që shkojnë deri në 10 fish më të larta se…
 Nga analizimi i 4 prej qyteteve kryesore, Tiranës, Durrësit, Elbasanit dhe Shkodrës, u zbulua se që prej vitit 2007 janë humbu…
Ekspertët paralajmërojnë se shkelja e masave kundër përhapjes së COVID-19 gjatë tubimeve politike dhe takimeve elek… 
 12 organizata të mjedisit dhe profesorë të Universitetit të Tiranës protestuan kundër projektvendimit të Këshillit Kom…
Mijëra pacientë në nevojë kritike për oksigjen po i drejtohen tregut të parregulluar - çmimet e së cilave kanë shku… 
Prokuroria e Durrësit njoftoi dërgimin për gjykim të çështjes ndaj 19 komisionerëve dhe 2 votuesve, ndërs… 
Planet e qeverisë shqiptare për të ndërtuar një aeroport në jug të vendit kanë ecur përpara pavarësisht kërkesave d… 
Një video-dokumentar me 4 pjesë, që trajton problemet e krijuara pas nisjes së procesit të rindërtimit pas tërmetit… 
Gjatë diskutimit përfaqësuesit e medias dhe ekspertët ligjorë nga rajoni thanë se rregullimi efektiv i mediave në i… 
Perspektiva nga gazetarët me fokus raportimin lokal, për të mësuar për nevojat që ka komuniteti dhe nga ana tjetër… 
 Përhapja e përdorimit të biçikletës, e cila është shumë e dobishme si në aspektin mjedisor e shëndetësor, ashtu edhe në…
 Takimi përmbyllës i projektit “Lëviz për korsitë, pedalo i sigurt!” 
Ky është një studim i vogël, por që hedh një hap të madh drejt zhvillimit të qëndrueshëm të infrastrukturës së qyte… 
 A e dini se si erdhi në ekzistencë biçikleta e sotme? Nëse jo, atëherë këtu është një vështrim i shpejtë i zhvillimit që…
Një video-dokumentar që paraqet mungesën e infrastrukturës dedikuar biçikletave në qytetin e Durrësit. Ai sjell fak… 
 "Mbaj distancën fizike, por jo shpirtërore”, nisma për familjet në nevojë.Ndihma ndaj familjeve në nevojë që po përjet…
 Të rinjtë në qytetin e Durrësit ndihmuan familjet në nevojë, duke i dhuruar pako ushqimore dhe veshje në prag të ndërrimit të…
Masat administrative për distancimin social të marra nga qeveria për parandalimin e përhapjes së koronavirusit të r… 
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt i Financuar nga Lëviz Albania  ëvizpërkorsitë …
Një status në Facebook i kushtoi 26-vjeçares nga Durrësi 3 ditë në qeli dhe 11 muaj nën procedim për “përhapje pani… 
Ndërhyrjet e paligjshme në katet e para të pallateve të periudhës së regjimit komunist për t’i kthyer… 
 Grupimi “Bicycle Durrës” ka realizuar një video-dokumentar i cili është seria e parë nga 3 të tillë që kanë karakter gazetares…
Policia e Durrësit njoftoi procedimin penal për protestë të paligjshme dhe përhapje paniku, për katër të rinj që pr… 
Katër të rinj që morën pjesë një protestë për vrasjen e 25-vjeçarit në Durrës dhe cilësimin e saj si “ngjarje aksid… 
 BE përsërit se duhet të ketë zero tolerancë për kanosjet dhe kërcënimet ndaj medias. Është thelbësore që gazetarët në Shqi…
 E drejta e gazetarëve për të mbuluar protestat është domosdoshmëri për zhvillimin demokratik. Ne kemi besim se incidente…
Durrësi si gjithmonë surprizon dhe e ka të vështirë të qëndrojë larg gjesteve shembullore... … 
 Policia e Durrësit pas përfundimit të protestës së të premtes arrestoi 7 të rinj dhe shpalli në kërkim… 
ëPas tre vjetësh, vetëm çereku i fshatrave të përmendur në listën e qeverisë kanë përfituar projekte, ndërs… 
ëPas tre vjetësh, vetëm çereku i fshatrave të përmendur në listën e qeverisë kanë përfituar projekte, ndër… 
Shumica e qyteteve në Shqipëri kanë brenda tyre një “bërthamë energjie” të pashtershme. Nga Veriu në Jug gjenden 7… 
Në rrugën përbri plazhit të Orikumit, syri të rrok nga Gadishulli i Karaburunit deri në Vlorë. Rruga panoramike ndë… 
Në rrugën përbri plazhit të Orikumit, syri të rrok nga Gadishulli i Karaburunit deri në Vlorë. Rruga panoramike ndë… 
Grupimi “Bicycle Durrës” në bashkëpunim me arkitektë dhe urbanistë të pavarur ka bërë të mundur hartimin e një guid… 
Të dhënat e mbledhura nga BIRN tregojnë se nga qindra procedime penale të regjistruara nga Prokuroria për viktimat… 
Gëzuar festën e pavarësisë!  
Një vit pas tërmetit shkatërrimtar të 26 nëntorit, në një intervistë për emisionin “Radar”, në ABC News.… 
Një raport i Kontrollit të Lartë të Shtetit ngre dyshime mbi kapacitetet profesionale të Institutit të Ndërtimit -i… 
 Kakofonia e ekspertizave mban pezull të dëmtuarit nga tërmeti në Durrës 
Një vit pas tërmetit shkatërrimtar të 26 nëntorit, banorët e dhjetëra pallateve të dëmtuara rëndë kundërshtojnë akt… 
 Më 4 prill 1999, një peshkatar nga fshati lindor serb i Tekijas bëri një zbulim makabër në lumin Danub – një kamion frigorife…
Video-dokumentari i tretë i shkurtër nga tre të tillë, realizuar në kuadër të projektit “Qytete të sigurta për grat… 
Më 22 Tetor 2020 në Ditën Kombëtare të Aktivizmit, u bë shfaqja e dokumentarit të realizuar për Qendrën Durrësi Akt… 
Ndotja e detit nga karburantet është një ndër krimet mjedisore më të shpeshta në Durrës, por institucionet përgjegj… 
 Grupimi qytetar “Bicycle Durrës” iu bashkua  Ditës Kombëtare të Aktivizmit më 22 tetor . Ditën e enjte u bë pedalimi…
 Qytetarët e Durrësit përkujtuan një javë më parë në ditën e lindjes personalitetin e shquar të kulturës në Durrës, Vangjel To…
 Po ri sjellim hartën ilustruese mbi shtrirjen e kanaleve bujqësore të ndotura nga “ujërat e zeza”.ealizuar në kuadër të…
“Kanalet e ‘ujërave të zeza’, vatër sëmundjesh dhe ndotës të mjedisit”.   
 Sot fituam një mbështetës gjat mbledhjes së firmave për  korsi biçikletash . Faleminderit Natan“Lëviz për korsitë, peda…
 Kanalet e ‘ujërave të zeza’, vatër sëmundjesh dhe ndotës të mjedisit - Realizuar nga Qendra Durrësi Aktiv me mbështetjen…
Javën e ardhshme nis “TAW (Tirana Architecture Weeks)”. Në kuadër të saj do të realizojmë “workshop”-in me temë: ”R… 
 “Lëvizshmëria me emëtime zero të CO2 për të gjithë”.     …
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
“Mungesa e ndriçimit publik, nxitës i sulmeve dhe ngacmimeve seksuale” - Kjo është seria e parë nga 3 video-dokumen… 
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
 Unë nuk do të mendoj dy herë se cfar do të porosis në restorant, por ai që përdo makinën po . Ishte një ditë plot energ…
 Nënkryetari i Bashkisë Durrës ka pritur në një takim përfaqësues të Qendrës “Durrësi Aktiv” dhe të Klinikës së Ligjit Durrës,…
 “Parada RETRO” u zhvillua të premten e kaluar në rrugët e qytetit të Durrësit, duke zbritur në asfalt ato që njihen si automje…
Gjatë pandemisë së COVID-19 institucionet trashëgimisë kulturore akuzohen se dështuan të monitoronin e… 
 Zbulimi arkeologjik u “gërrye” me ekskavator gjatë karantinës 
 Skeptikët shprehen se Universiteti Mesjetar i Durrësit se ka qenë një keqkuptim termi, por studimet bashkëkohore kanë vërtetu…
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
 Piktorja Shpresa Milaqi-Bajko ka çelur një ekspozitë pikturash përgjatë ditëve të fundit në galerinë e arteve “Nikolet Vasia”.…
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
 Institucionet heshtin përballë ndotjes mjedisore nga ujërat e zeza | Durrës. një projekt që mbështët nga . L…
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
 “Lëviz për korsitë, pedalo i sigurt!” - Projekt iFinancuar nga Lëviz Albania, një projekt iAgjencisë Zvicerane për Zhv…
 Një shkrim i shkëlqyer nga Ervina Garo  në bashkëpunim me Klinikat e Ligjit-   mbështete…
Policia e Shtetit kërkoi ndjekjen penale të një duzine qytetarësh – shumica e tyre gazetarë dhe drejtues mediash, m… 
Nga testimi i institucioneve përgjatë 2 krizave natyrore lidhur u konstatua ulje e transparencës dhe raste të moszb… 
  Sipas Drejtshkrimit të Gjuhës Shqipe (1973) shkruhet "Rallë" dhe jo "Rradhë". 
 NVESTIGIMKoncesionarët e qeverisë, përfituesit e mëdhenj të fondit të garancisë sovraneNjë grup i vogël prej 10 bizn…
 Policia e Durrësit arrestoi 3 trafikantë të objekteve, teksa “Piratët e thesareve” ndër vite kanë dëmtuar parqet dhe zonat ar…
Policia njoftoi se arrestoi 3 persona qe tentuan të trafikonin 2 objekte të periudhës së antikitetit...… 
 Qytetarë dhe aktivistë protestuan kundër ndërtimit të hidrocentraleve në lumenjtë e Shqipërisë duke kërkuar mbrojtje t…
 Dje në protestë:“Largoni mbeturinat, “Jo plehra në qytet”. Sot Këshilli Bashkiak Miratoi propozimin e shpalljes, emerg…
Prokuroria e Durrësit i ka fokusuar hetimet për ndotjen mjedisore në Porto Romano në dyshimet se është shpërdoruar… 
 Eruditi Moikom Zeqo u shuajt në moshën 71 vjeçare mëngjesin e kësaj të hëne për tu përjetësuar në panteonin e studiuesve më t…
Këshilli Bashkiak i Durrësit miratoi propozimin për shpalljen e emergjencës mjedisore për menaxhimin e mbetjeve. Nd… 
Qyteti i Durrësit prej 1 jave përballet me mbetjet që kanë tej mbushur kontejnerët dhe kanë zënë trotuaret si rrjed… 
Dhjetra të rinj marshuan në Durrës dhe Lezhë, ndërsa denoncuan abuzimet seksuale në shkolla dhe vendet e punës dhe… 
IKMT shpërthen me dinamit pallatin e shkatërruar nga tërmeti në Durrës.    
Policia e Durrësit njoftoi kapjen e organizatorit të tentativës për të trafikuar 38 kg heroinë drejt Italisë dy jav… 
Mosmarrëveshjet midis biznesit dhe qeveris i lanë shumë punonjës të kësaj industrie pa punë dhe jashtë paketave të… 
Gëzuar festën e Fitër Bajramit për të gjithë besimtarët myslimanë! Uroj agjërim të pranuar dhe paqja e mëshira e Zo… 
 Pasditen e së mërkurës dhjetra të rinj protestuan në qytetin e Durrësit kundër kundër Shembjes së Teatrit Kombëtar dhe dëmtim…
Dhjetëra të rinj protestuan të mërkurën në Durrës kundër prishjes së godinës së Teatrit Kombëtar...… 
 “Ditë e trishtuar për trashëgiminë kulturore në Shqipëri dhe Europë”...   …
 Nëse do ishte praktikuar kjo zgjidhje do t'i linte të kënaqura të gjitha palët, PRO/ KUNDËR dhe NDOSHTA!
 TK ishte simbol i mijëra veprave të interpretuara në skenën e tij, ku njohëm artistët tanë të mëdhenj. Pr… 
Me një urdhër surprizë që duket se nuk është bazuar në asnjë vendim të ligjshëm u shembën natën e kaluar ndërtesat… 
 Autoritetet nisën në orët e para të mëngjesit shembjen e Teatrit Kombëtar, ndërsa një grup aktivistësh kundërshtojnë m…
 Korsitë e biçikletave janë gjëja më e mirë që po ndodh në ë këto 30 vjet!Para 100 vitesh  u bë kryeqytet p…
Në Durrës është konfirmuar një rast i ri infektimi nga koronavirusi i ri i një punonjëse fasonerie, duke ngritur sh… 
 Stukturat e hoteliere kanë pezulluar punën në pjesën më të madhe të tyre si pasojë e situatës së krijuar nga COVID-1…
Benaishu Karim, u nis nga Siria drejt Gjermanisë për t’u kujdesur për dy vajzat e tij, por për shkak të pandemisë s… 
Besimtarët myslimanë po e përjetojnë me trishtim mbylljen e xhamive dhe mungesën e iftareve të përbashk… 
Qyteti i Durrësit tani ka një përfaqësues të biçikletave për të përshpejtuar qasjen e qytetit ndaj çiklizmit. Klaud… 
 ëvizpërkorsitë ës ës çikleta  ë ëm
Projektet infrastrukturore të Bashkisë Durrës në disa raste, përveç kostove në disa miliona euro përbëjnë përsëritj… 
Banorët e tre kullave në Durrës kundërshtojnë planet e ndërtuesve për meremetim, ndërsa dëshmojnë se tërmeti i 26 n… 
Mbrëmjen e sotme në hapësirën shqiptare kaluan njëri pas tjetrit 60 satelitë, duke krijuar një vijë satelitësh lëvi… 
Gjashtë persona kanë humbur jetën në ngjarje të veçuara kriminale të hënën, duke lënë pas javë qetësie të ndikurara… 
Lulet shumëngjyrëshe që kanë lulëzuar me ardhjen e Pranverës në Shijak, i shoqërojnë pasthirrmat e hareshme të fëmi… 
 “Aretesi i Durrësit” ishte një filozof dhe astronom që mendohet se jetoi në periudhën e antikitetit sipas burimeve historike…
Qentë endacak në qytetin e Durrësit kanë qenë një shqetësim për aktivistët e mbrojtjes së kafshëve. Vetëm gjatë 2 m… 
Kriza e COVID-19 i mban prej 6 javësh peshkatarët e portit më të madh të vendit në tokë...… 
Policia e Durrësit ndaloi paraditen e së enjtes 1 prej 8 dyshuarve të shpallur në kërkim si përgjegjës për shtatë n… 
Kryetari i komanduar i bashkisë së Durrësit ka dhënë dorëheqjen për arsye shëndetësore dhe pritet të zëvendësohet n… 
Të paktën 61 raste të konfirmuara me COVID-19 në Krujë dhe Kurbin lidhen me një fasoneri. Punonjësit e fasonerive v… 
===