Ne korrik,1881 ndahet nga jeta Hasan Tahsini,i cili lindi në Ninat,në krahinën e Çamërisë. Drejtoi si Rektor univ… 
Masakra e Panaritit 10 korrik 1914.Si fshati më i madh mysliman i krahinës se Korces, Panariti u vu në shënjestër… 
Promovimi i librit “Korrespondencë dhe dorëshkrime të Ali Pashë Tepelenës” nga profesor Irakli Koçollari në kuadër… 
Promovimi i librit “Korrespondencë dhe dorëshkrime të Ali Pashë Tepelenës” nga profesor Irakli Koçollari në kuadër… 
Promovimi i librit “Korrespondencë dhe dorëshkrime të Ali Pashë Tepelenës” nga profesor Irakli Koçollari.
Java çame Të rinjtë në Shkup!
Fjala ime në panelin e diskutimeve "77-vjet genocid, Mos Harro Çamërinë""Nëse dikush pret që shqiptarët e Çamërisë… 
Kim Mehmeti: Dielli i Shqiptarisë vërtet lind në perëndim por kjo nuk do të thotë që ne të mos kemi dinjitetin, të… 
"Java Çame", me rastin e 77-vjetorit të gjenocidit grek mbi shqiptarët e Çamërisë, në Shkup.Arben Llalla: Popullsi… 
Java ÇameHomazh në Varrezat Monumentale " Trëndafilat e Çamërisë" në Kllogjer, Sarandë, në nderim dhe kujtim të je… 
Inaugurohet pllakata në përkujtim të 2900 viktimave të shqiptarëve të Çamërisë nga gjenodici grek.“Java Çame” kulm… 
Homazhi në Varrezat Monumentale në Kllogjer të Sarandës, ku prehen 2900 shqiptarë të Çamërisë.
“Nuk më trishton fakti që ka ikur, më trishton fakti që u largua pa marrë vesh ku janë varret e të parëve të tij dh… 
Pjesë nga fjalimi im gjatë çeljes së javës Çame në prezantimin e gravurave, pikturave dhe hartave historike të krah… 
Nesër aktiviteti i rradhës, në kuadër të “Javes Çame” do të zhvillohet në ambjentet e Akademisë së Shkencave, në or… 
Java Çame për përkujtimin e 77- vjetorit të gjenocidit grek mbi shqiptarët e Çamërisë, nisi ditën e hënë në sheshin… 
Unë dua t’i garantoj të gjithë që ne nuk e harrojmëÇamërinë, nuk i harrojmë miqtë dhe armiqtë e Shqipërisë. Të gjit… 
Të gjithë kanë heshtur për çështjen Çame, e gjithë politika shqiptare, qeveria shqiptare, mediat dhe kushdo. Mediat… 
Ne do të lodhemi të fundit! Të heshtësh për çështjen Çame do të thotë të pajtohesh për këtë padrejtësi të madhe his… 
Vijojmë me “Javën Çame”!Nesër aktiviteti i rradhës do zhvillohet në Muzeun Historik Kombëtar ora 18:00.“In Memori… 
“Java Çame” do të jetë e mbushur me aktivitete kulturore,letrare,historike dhe do kulmojë me homazhe në varrezat mo… 
Në kuadër të 77-të vjetorit të Genocidit Grek ndaj shqipëtarëve të Çamërisë,nga data 21 qershor deri në datën 27 qe… 
Arben LlallaSot doli në qarkullim edhe në gjuhën greke libri: Arvanitët Themeluesit e Greqisë së Re. Pas botimeve… 
PDIU është partia e kauzave kombëtare, e çështjes çame, e bashkimit kombëtar, e mbrojtjes së diasporës, e përfshirj… 
Klubi Patriotëve të Rinj është krahu rinor i Partisë Drejtësi, Integrim dhe Unitet.
17 maj 2017. Në forumin e Universitetit Europian të Tiranës, ku u ndala tek çështja kombëtare dhe çështja çame në… 
Uroj që ky Bajram të sjelli harmoni,solidaritet,begati për ne dhe familjet tona.Le të shërbejë kjo festë si moment… 
Gjatë Iftarit te shtruar në Vlorë, me besimtare të Komunitetit Çam.Për të gjithë besimtaret Muslimane që Agjëruan… 
Kjo është protesta që PDIU zhvilloi para Parlamenti për Rezolutën e Çamërisë. Kjo protestë, por edhe presioni i ush… 
Gazeta franceze (1881) / Zbulimi i fjalorit të shifrave të Abdyl Frashërit dhe arrestimi i shqiptarëve të Epirit (Ç… 
Migen Matraku: Një iftar i këndshëm i shtruar me xhematin e xhamisë BabrruAllahu ta pranoftë këtë punë të hajrit… 
Mbrëmjen e djeshme shtrova Iftar për komunitetin Çam në qytetin e Kavajës. Në këtë muaj të Madhërishëm e ndjejm që… 
Gëzuar Pashkët besimtarëve ortodoksë. Paqja dhe harmonia mbizotëroftë gjithmonë në familjet tuaja! Le të na sje… 
Nustret Avdullai, kandidati për deputet, i pesti në Qarkun e Fierit, i koalicionit PD-Aleanca për Ndryshim, ngre sh… 
Lumturi HasaVendosa më  mirë të luftoja  dhe ta humbja betejën, sesa të mos luftoja asnjehere!Sfidë, presion,dhun… 
Varrezat Monumentale të Kllogjerit, vend prehje e 2900 shqiptarëve të Çamërisë! Një detyrim njerëzor dhe kujtesë hi… 
Kush do ta kuptoje peshën e Çamërisë, kush do qe ta kuptoj peshën e amanetit padyshim duhet të vije ketu në varreza… 
April 22, 2017  · Sot patëm një takim shumë të suksesshëm të Forumit të Gruas të PDIU-së  ku folëm për rolin e mad… 
Lumturi Hasa8 vite,  ju dhe unë viktima të këtij sistemi të keq qeverisur! Unë jam dhe do jem me ju:-Sepse ju më… 
Nga biseda me gazetarin Bashkim Hoxha në News 24
Sot në orën 21:00  jam  i ftuar në emisionin "Real Story" të gazetarit Sokol Balla në News 24. Ju ftoj ta ndiqni!… 
Takim në Durrës në mbështetje të kandidatit të PDIU-së për deputet, Floran Tahiri duke ftuar qytetarët që të votojn… 
Në një takim shumë me përfaqësues të komunitetit Çam në Durrës.Të votojmë për NDRYSHIMIN më 25 prill! PD-… 
Ne jemi aty , si Anteu që marrim forcë më shumë dhe bëhemi më të fuqishëm 
Marrëveshja e Partisë - PDIU me Partinë Demokratike- PD. 
Fjala ime në takimin me kryesinë e Shoqatës Patriotike "Çamëria" në Kosovë 
Varrezat Monumentale të Kllogjerit, vend prehje e 2900 shqiptarëve të Çamërisë! Një detyrim njerëzor dhe kujtesë hi… 
Asnjë qeveri s’do e kalonte skandalin e të dhënave personale.
Jam krenar: që mbrojtëm shenjtërinë e luftës së UÇK-së duke dalë kundër raportit të D. Martyt në KE, që kemi marrë… 
Jam krenar, që bashkë me ju, arritëm të miratojmë një rezolutë parlamentare për çështjen e shqiptarëve të Çamërisë;… 
 Mesila Doda publikon spotin elektoral: Kemi ende një mision për të përmbushur (film)  
Emisioni  "Të Paekspozuarit" me  Ylli Rakipin, në televizionin News 24 për të folur për zhvillimet e fundit politik… 
Nustret AvdullaiFushata e këtij viti është një nga fushatat më të bukura që kemi bërë sepse ne i kemi folur njerzv… 
Kandidati i PDIU-së në Durrës, z. Florian Tahiri, i shoqëruar nga të rinj të qytetit ndërmori një aksion pastrimi n… 
Përgjigjja ime nga Saranda për kryeministrin arrogant që pranon në heshtje kur Greqia zgjerohet në Jon; që nuk flet… 
16.04.2021,ora 15:00,selia e PDIU Shoqata Çamëria Kosovë me 16 prill do të jete në Tiranë, per mbështetjen e kandi… 
Hektor Sejko ishte atdhetari i rrallë që nuk rreshti kurrë së kërkuari drejtësi për Çamërinë.
Lamtumirë Hektor Sejko!Përtej trishtimit që sjell çdo humbje,lajmi për largimin nga jeta të kryetarit të Shoqatës“… 
Hektor Sejko ishte atdhetari i rrallë që nuk rreshti kurrë së kërkuari së kërkuari drejtësi për Çamërinë. Ai ishte… 
Takimi elektoral në Lushnje për zgjedhjet parlamentare të 25 prillit.… 
Lumturi HasaNë mesin e atyre me të cilët je rrit dhe ke kaluar kohë ndihesh gjithmonë mirë.Me përkrahjen e tyre,… 
Cdo shqiptar, edhe në Lushnje, ka probleme shumë të mëdha të vafërisë. Sot 60% e shqiptarëve jetojnë me 4 USD në di… 
Jemi shumë afër Çamërisë, beteja për të drejtat tona do të vijojë.Atdheun e kemi amanet, detyra ime të ngre zërin… 
I jam shumë mirënjohës popullit të Vlorës që i kanë pritur paraardhësit tanë dhe u kanë hapur dyert, edhe Dukatit e… 
Sulmet e kryeministrit Rama ndaj PDIU-së, konfirmim i peshës sonë elektorale. Mandatet e PDIU-së dhe votat e saj në… 
Më 07.04.1811 ka lindur Hasan Tahsini një ndër figurat më të ndritura jo vetëm të krahinës së Çamërisë, por të mbar… 
Takim elektoral në Vlorë per te  prezantuar  kandidatin për deputet, Gëzim Ademaj.¨Vlora, zemra e PDIU-së dhe Çamë… 
Më 16.04.2021, ora 15:00 , në selin e PDIU, Shoqata Çamëria Kosovë do të jete në Tiranë, me qellim të mbështetjes s… 
Në Shqipëri janë prishur ekuilibrat e demokracisë,Rama po përdor të gjithë shtetin përmes punësimeve, për blerjen e… 
Ky Parlament do të mbahet mend për shumëçka, por askush, ose pak kush, e përmend faktin që në këtë legjislaturë nuk… 
Në 25 prill t´í bashkohemi zërit politik te Çamërisë, që kombëtarizoi dhe ndërkombëtarizoi çështjen came.Çamët që… 
Shqipërisë duhet t'i japim ndryshimin me 25 prill, duke votuar për Çamërinë. Kemi dy arsye të mëdha që të votojmë n… 
Sulmet e kryeministrit Rama ndaj PDIU-së, konfirmim i peshës sonë elektorale. Mandatet e PDIU-së dhe votat e saj në… 
Dëshiroj t'iu uroj të gjithë besimtarëve katolikë: Gëzuar Pashkët! Festa e Pashkëve është simbol i një fillimi të… 
Sekretarja e Përgjithshme e PDIU-së, znj. Mesila Doda ishte e ftuar këtë pasdite në emisionin “Top Talk” të gazetar… 
PDIU / Kështu ishte 10 vjet më parë varreza ku prehen 2900 shqiptarë të Çamërisë të cilët kanë vdekur gjatë eksodit… 
Është gjithmonë privilegj të bisedosh me diplomatin e publicistin e Çështjes Kombëtare Shqiptare, Shaban Murati, ku… 
Qëndrimi i PDIU-së mbi koalicionin opozitar është i qartë. Marrëveshja jonë është vetëm me Partinë Demokratike dhe… 
Kryetari i PDIU, Shpëtim Idrizi priti sot në një takim shefen e Misionit të Vëzhgimit të OSBE/ODIHR për zgjedhjet e… 
Intervista e plotë në ABC News Albania  via 
VIDEO INTERVISTË| Shpëtim Idrizi: Do t'ju japim pasaporta të shtetit shqiptar çdo personi me origjinë shqiptare… 
Me ekipin tonë fiton Shqipëria dhe ÇamëriaSe bashku me SP te PDIU-së, Mesila Doda ju bashkuam një aktiviteti sport… 
Gazeta “Çamëria” është vlerë jo vetëm e komunitetit çam, por edhe e gjithë shqiptarisë. Tashmë ky zë i rëndësishëm… 
Adrian Haruni Dikur gjatë një takimi në Durrës,komuniteti çam i kërkoi Z. Idrizi një deputet në Durrës.Kryetari u… 
Sonte mund te me ndiqni në Report TV,  i ftuar për të folur për zgjedhjet e 25 prillit 2021 , fushatën elektorale d… 
PDIU dënon thirrjet për të ashtuquajturin vorio-epir, gjatë paradës ushtarake greke, në kuadër të festës kombëtare… 
PDIU/Dega Vlorë organizojnë takim me të rinjtë e KPR Vlorë, ku i pranishëm ishte kandidati për deputet i PDIU-së në… 
===