Sa shumë të dashuruar me Amerikën sot. E prapë Amerika nuk i lejon ta vizitojnë pa vizë. E në shumicën e rasteve as u jep vizë.
Një status për dylberat që pikturojnë pleqt me tirqe e ksul tu u puth si dylbera. Ma hoqën të drejtën me postu. Shu… 
Pse asnjë vipe shqiptare nuk po del të thotë "jam përdhunuar në adoleshencë", siç bëjnë vipet amerikane? A dimë t'i… 
Jemi vend ku dekonspirohet edhe testi i Maturës Shtetërore. Që t'i dinë pyetjet e të kopjojnë. Ça tiu them unë më? Ça?
Edhe Lidhja e Prizrenit për ketë qëllim ka luftuar. Për me pas t'drejtën me dal në plazh. 
Sapo nisi stina ku nënat 40 vjeç u thonë fëmijëve në plazh: "Vieni qua, mos m'detyro me ardh unë".
Rrimë ne, gocat tu bo lek me ojf dhe mbrojtje të drejtash!
Mirë dita e fmive sot. Po dita e atyre që bëjnë si fmi, kur është? Pyes se du me uru dikë.
Shteti, prej kohësh kërcen stript në tub, shqiptarët i fusin lek në mbathje.
Po transformohem në ambasador. Ju uroj sukses të gjitha palëve por në fshehtësi jam vetëm me njërën palë!
Urrejtjen për Guradiolën ta kthejmë në shpresë për të ardhmen.
Diktaturën nuk e solla unë, atë e gjeta midis jush; tek mami që t'thotë t'raft plasja dhe tek babi që t'thotë bjere… 
Do krijohet eskatologji fetare për Shpëtimtarin që mposht Ramën: Ai do të shfaqet në Sinai(Kodër Kamëz)me 10 mijë a… 
I zhgënjyer pse nuk ka edhe PD-ja një grua që të deklarojë: "Nuk duam as buk, as ujë, as dritë, vetëm ju mos u përç… 
Në Shqipëri është më mirë të shajnë me nanë, sesa të thonë "i shkreti".
Shtyhet ora policore, bëhet 23:00 me 06:00. Le ta shtyjnë nga 02:00 deri 10:00, se në këto orë fle e dal unë.
Kosova dhe Shqipëria po hyjnë në epokën Luli-Lali-Lumiri.
Votoni kandidatin që ka platformë antistres. Të tjerat.. pa rëndësi!
Uji i Tiranës qenka shpallur i papijshëm, nga gjykata. Edhe pluhuri, derisa të shpallet, do jetë i pijshëm. Prezumimi i pafajsisë..!
"Hapni shtëpi publike", thonë. Pse kur u mbyllën? Ke dhjetra lokale në Tiranë të cilat funksionojnë si shpi publi… 
Kur pranohet kryeministër autori i librit me fjalinë "Ina, Ina hiqi brekët..", nuk është se shihen si aq shumë skandaloze parullat e tjera.
Vajza nudo, shkeli nenin 274 të Kodit Penal. Por, "mbaje brenda nenin" se ojq-të bëjnë çfarë të duan. Po të ishte… 
Protestë nudo për përdhunimin e zgjedhjeve?!Vetëm kështu të begenis BE-ja.
Nuditeti është magjepsës. Si në art, si në përshkrim letrar, si në përjetim fizik - i është dhuruar njeriut për zbu… 
Pas protestave nudo dhe parullave me organe genitale në Tiranë, përdhunimet u ulën me 50% ndërsa fondet u rritën me 100%. Suksese.
Monarko-fashistët grekë, dekllarojnë se janë në gjëndje lufte me Shqipërinë dhe nuk i japin pikë Anxhela Peristerit… 
Shoqata e Manopauzës Intelektuale, me kryetar Spartak Ngjelën dhe nënkryetar Kreshnik Spahiun.
Pas Urdhërit të Infermierëveedhe Urdhëri i Kalorësve Templarë i jep atij çertifikatë mirënjohejeje për kontributin në sistemin bankar.
Po ambasadorët pse nuk kandidojnë? Me gjithë atë dashuri e kujdes që tregojnë për popullin shqiptar, do merrnin vot… 
Edward Munch, melankoli për Llotarinë Amerikane. 
Ne sjemi as italianë që t'i duam aq shumë makaronat sa të shesim votën me makarona. Si rregull duhet të shpërndanin groshë. 🤔
Mbrëmë më kishte zënë gjumi në divan. Më shkruan mesazh patronazhistja: "Ngreu shko fli taman..". 🤔
Edhe spiunave ua ndryshuan emrin. I quajtën patronazhistë. Shqipëria nuk është më ajo që njohëm, po i tjetërsohet identiteti kombëtar. 
B.Johnson tha në parlament se në ishujt e paqësorit jeton një komunitet që adhuronte princin Filip si zot.Ju ankohe… 
Thirreni pak ushtrinë se na ka zënë njëri parkimin.
Ka që futen n'politikë edhe për tu bërë të bukura. Duan të ndryshojnë jo vetëm Shqipërinë por edhe vullnetin e Zotit. 🤔
Të gjithë janë dakord që duhen respektuar të drejtat e njeriut. Ndahen vetëm në pjesën cilin do quajmë njeri e cili jo.
Dhurata humbi kuptimin, qysh kur u nis të thuhet: "Çoi ndonjë lek, se blen vetë çtë dojë..!".Të mos e dish çfarë… 
Mos u thoni shqiptarëve "ëndrra europiane", thoni "Në BE, ka lek". Kjo kuptohet më mirë.
24 mars 1999. Atë çfarë ka bërë perandoria amerikane për ne, nuk e ka bërë asnjë perandori në histori. A e bëri për… 
Me ju shemb TEGun, të vranë. Se skanë ku me i çu fëmijët për lojëra dhe gratë për me humb mendjen. A për teatër e maternitet..!
Në Ditën Botërore të Poezisë, përkujtoj të gjitha poezitë të cilat i shkruaja dhe kur i lexoja pas disa kohësh i gr… 
Nganjëherë ndihem shumë mbi palët, pasi të gjitha partitë më respektojnë. Sikur po thonë: "Bëhu president a diçka a… 
Vazhdon refreni: "Punë ka por shqiptarët nuk duan të punojnë". Në të njejtën kohë shqiptarët po presin të hapet E… 
M'ka pas rraf iherë plaku në vitin e bukur 2000, me rrip. Ngaqë plasa një kapsoll granate. Fmi taleban. Falemnderit… 
Se harrova:këta që bëjnë sondazhe me telefon, a janë këto vajzat që të thonë: "Jemi nga kompania x, a do dyshek me… 
Kur sheh një artikull me titull "5 shenjat që tregojnë se jeni inteligjent", shenja e parë e inteligjencës është të… 
Do hap kurse private për propagandë dhe mbrojtje të të pambrojtshmes. Aplikoni. 
Oooo. Imagjinoni në 2066 të kandidojë mbesa e Elisës e të thotë: "Për mua, qeveria e Ramës kishte më shumë anë pozitive se negative". 🤔
Po t'shaj unë ndonjë, do thonë çbën ti, çështë kjo gjuhë! E.Rama i shau të gjithë dhe ndejti 8 vjet km. A mos duhet… 
Shpit Botuese po prodhojnë qindra kopjo t'Biblës e t'Kuranit, se do përdoren për me marr votat me be, me dorë n'libër t'shenjt.
Gold Ag këngë për Ilir Metën?! 🤔
Nuk është shi, janë lotët e atyre që nuk u kandiduan! 🤭
Pranoj tallje dhe ironi me temë kandidimin, nga ora 12:00 deri në 18:00.
Ambasadori Vokshi, apel grave shqiptare: "Mos u përdorni për dekor". :)
Sot është dita e atyre që shkruajnë: "Bota do ishte vend më i paqtë po të sundonin femrat". Por vend më i qetë sdo ishte, gjithsesi. 🤭🤟
Me jepni edhe mua 100.000 euro dhe të nxjerr një sondazh ku Taulant Balla del 95% tipi më simpatik.
Kozmetika dhe sondazhet, do bëhen sektorët më të mëdhenj të ekonomisë. Mesa po duket.
Intervista ime në Syri Tv.  
Shkrihet dega e LSI në Napoli. 30 italianë i bashkohen PS-së.
Po patëm pak nerv, vetëm sa ka sharë njerëzit këto 8 vjet, ky meriton të humbë thellë.
Joe Biden kur u fikën dritat në USA, deklaroi: "Skam faj unë, edhe në Shqipëri ndërpritet energjia".
 Shqipëria ka numrin më të lartë të bizneseve të mbyllura në rajon, numrin më të lartë të qytetarëve që humbën  vendin e…
E. Rama: "Kemi hapur 225 mijë vende pune".Po, i ka hapur në Gjermani ku kanë ikur 250 mijë shqiptarë.
 Fshirja e adresave të shqiptarëve në Luginën e Preshevës, duhet trajtuar me prioritet. Nuk duhet lejuar në asnjë mënyrë…
Kanë të drejtë portalet kur bëjnë lajm se Rama heq këpucët kur futet në shtëpinë e x qytetari. Se ky u futej hoxhal… 
Tallje spektakolare me studentët. U thonë bëhuni gati për shkollë, bëhen gati, marrin shtëpi, blejnë gjëra, bëjnë p… 
 Akti i sotëm antikushtetues shkatërron konsensusin e 5 qershorit dhe godet rëndë integrimin europian të vendit. Rama e…
Sot njerëzit mendohen dy herë për të blerë një palë pantallona të reja. Kjo është përgjigjja ndaj "begatisë ekonomike" ku po jetojmë.
Por çfarë është sot Kodi Zgjedhor?
Edi babi i Elisës thoshte në 2013: "Në Shqipëri janë 1 milion të papunë".Po si i punësoi të gjithë pa e marrë ves… 
Më tha një kasap një ditë: "Ma heq taksën Rama mua..! Po prapë se prapë prej 1 milion deri 2 milion në vit paguaj, se mi merr me gjoba".
A janë zgjeruar dhe forcuar liritë e të drejtat kushtetuese këto 7 vite? Jo. Shqiptari ka rrëshkitur në statusin e… 
Neni i propozuar nga Rama nuk i hap listat. Deputetët renditen prapë nga kryetari. Kandidatët e listuar në fund duh… 
Edi Rama po përdhos Shqipërinë. Shkoi në Berlin. Merkel nuk pranoi ta takojë. Wadephul bojkotoi takimin ku ishte Ra… 
Rama do me vjedh vota me ligj. Votat e partive të vogla tu llogariten të mëdhave. Ti voton PR, vota jote niset për… 
Mendoni të punoni e të mos ua japin rrogën dy vjet. Ketë u bëjnë punëtorëve të naftës në Ballsh. Gjynah e krim. Kan… 
Arsimi shqip  është themeli i Shqipërisë. Themeli i identitetit vetjak e kombëtar dhe i unitetit të kombit. Shkol… 
Një pikëpamje e imja mbi çfarë duhet të jetë PD në fushatën e ardhshme.
 tërheqëse për investime. Vendit sot i duhet një model i ri ekonomik, me taksa të ulëta,mbështetje për sipërmarrjen, sti…
Çfarë marrëveshjeje u arrit në SHBA? Analizë nga Indrit VOKSHI. ✅
A pati të drejtë Edi Rama për "Minishengenin Ballkanik"?
44 milion euro gjobë Shqipërisë nga Arbitrazhi, se Edi Rama përzuri kompaninë "Aktor". Pas 110 milion për Beketin.… 
Bisedoj me tregtarë. Shqetësimi i tyre: Rama nuk po na lejon të punojmë. Spo i kërkojmë gjë, vetëm të na lejojë të… 
Shiheni tani kur të bëjnë tender për blerje parashutash që kur të hidhen pacientët nga spitali të bien në këmbë. Se… 
Ekonomia; Shqiptarët punojnë për të mbajtur shtetin, "se shteti mbahet me taksa" - thonë. Po familjet shqiptare me çfarë mbahen, me ajër?
Mua më ka marrë malli për kohën kur na thonin "Sa të formohet SPAKU, do e shihni ju. Do pastrohet Shqipëria nga korrupsioni".
Shëtitje në fushat poshtë Mamurrasit. I mungon vetëm një simfoni e llojit Aleksandr Borodin "Në stepat e Azisë Qënd… 
Përgjigjje Edi Ramës për Kurbinin.Nga Indrit VOKSHI
"Të tjerë duam, të tjerë na duan, të tjerë votojmë."339 netët rilindase!
Shqiptarët nuk janë as të majtë as të djathtë; janë hallexhinj.
Ushtria duhet të jetë thelbi i shtetit, jo lokal dasmash! 
Leje pune, leje studimi, leje biznesi, ushtrim profesioni brenda tregut të BE për shqiptarët, pengohen nga ky që me… 
Rama nuk e gjeti Shqipërinë shumë të pasur por e bëri më të varfër se çe gjeti. E kjo nuk ka diskutim. Është aq e qartë dhe e gjithpranuar.
Edi Rama ka një zakon të keq. Vendet e punës për Lezhën i hap tek zyra e tij në Tiranë dhe i mban aty - nuk na i sjell edhe ne për t'i parë.
A mundet kush të na japë shumën zyrtare të investuar në këto 18 muaj? Se po me habit ky që thotë se në 18 muaj u bë më shumë se në 20 vjet.
Ka 2 vjet që grabitësit e bankave nuk ikin më në drejtim të paditur por ikin në drejtimin e duhur.S'kanë faj. Duhen blerë diqysh zgjedhjet.
 mund të përfaqësojë me dinjitet dekadencën e artit europian.
Edhe asgjënë e bëjmë të shtrenjtë kur i kushtojmë vemendjen dhe dashurinë tonë.
Prokuroria nga "Organ i akuzës", është kthyer në Jorgan të Akuzës (që mbulon akuzën për ta fshehur përgjithmonë).
Korrupsioni u duk nëpër tokë e nëpër dete -(Sure-i Rumë).Kaloi shumë kohë (në errësirë) ndaj u keqsuan zemrat e njerëzve - (Sure-i Hadid).
Shpirtin frënk s'mund të mos e admirosh në ketë drejtim.
Madhështia fluturon mbi kohërat. Ky është   
===