 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 1/2 Kur policia reduktohet në vegël të regjimit për të mbrojtur pushtetin dhe lidhjet me krimin, kur përgjigja e vetme…
Ne nuk duhet të jemi vëzhgues në momente si ky, ndaj ju lus që më 25 prill secili ta tregojë dashurinë e vet ndaj S… 
 Shumica dërrmuese e shqiptarëve duan anëtarësimin e Shqipërisë në Bashkimin Europian. ëriaFITON  
Të dielën që vjen, secili nga ne, ka në dorë të vendosë për rininë, për të ardhmen e për Shqipërinë! Me 25 pril… 
“VOTA është shumë e shtrenjtë, ajo nuk duhet të shitet, as të blihet.Shprehni qëndrimin tuaj ndaj alternativës që… 
 Sot në Kavajë dhe Durrës pashë vendosmërinë e qytetarëve për ndryshim.Nëse doni ndryshimin - votoni 9. Nëse doni një t…
 Çdokush në Shqipëri e di. Ne duhet të anëtarësohemi në BE për një të ardhme më të mirë.Kush mund të na çojë atje?Rama…
 Në Drishtin e Postribës me  e  dhe rininë e mrekullueshme, forcën dhe mbështetjen më të madhe t…
 Rama ndihet i frikësuar nga qytetarët e Shqipërisë që duan të sjellin ndryshimin që i nevojitet vendit tonë. Ka vetëm dy…
 Takim i mrekullueshëm me të rinjtë e Postribës. Falenderim të veçantë për të rinjtë e Postribës që gjithmonë kanë qenë…
 Shkodra ka vajza e djem me vullnet e guxim, të rinj që jetën duan ta ndërtojnë në Shqipëri. Duhet të punojmë më shumë,…
Edi Rama i ka imponuar Partisë Socialiste në Shkodër një listë pa shkodranë. Shpresa e tij nuk janë kandidatët, por… 
Nder dhe privilegj takimi me Myftiun e Shkodrës, Imam Muhamed Sytari.Bisedë e sinqertë, frytdhënëse e këshilla të… 
 I habitshëm nervozizmi i Rames. Unë, PD dhe shqiptarët e kemi përcaktuar rrugën tonë që në dhjetorin ‘90: ajo është rru…
Sonte në një takim me forcën më të madhe të Partisë Demokratike, vajzat e gratë e Shqipërisë, për të cilat, ashtu s… 
Numri nëntë, numri i ndryshimit! 9️⃣Partia Demokratike do të jetë e pozicionuar në numrin 9 në fletën e votimit n… 
Kryeministri në ikje mori guximin të vinte në Shkodër. E pritën vetëm drejtorët nga servilizmi dhe policia që ushtr… 
Ashtu si në 1946 me lëvizjen e parë antikomuniste në Shqipëri, edhe këtë herë Postriba do e tregojë dëshirën për li… 
 Vota për Partinë Demokratike është votë për fëmijët tuaj, është votë për ekonomi të fortë. Është votë që shqiptarët ta…
Krenare për frymën që vetëm shkodranët dijnë të ofrojnë. Shkodra është e bindur se ka ardhur koha për një ndryshim… 
 Udhëtimi ynë i përbashkët  për të ndryshuar Shqipërinë fillon sot. Koalicioni ynë, Partia Demokratike-Aleanca për Ndrys…
Edi Rama erdhi në Shkodër për shown e radhës! Vaksinim sa për foto propagande është ajo çfarë u bë sot!Kryeministr… 
 Edi proparama! Të gjithë e dinë që  me ty Shqipëria ka ngecur në vend. Shqiptarët e dinë shumë mirë që nuk ke bërë asg…
Kështu ndodh kur Kryeministri e ka mendjen si e si të vjedhë më shumë, dhe nuk mendon për shërbim ndaj qytetarëve!… 
Shkodra e harruar nga Rama!Me 25 Prill qytetarët do të vendosin për të ardhmen e tyre! 
 Rama i braktisi edhe ata që na sollën në jetë, prindërit tanë pensionistë. Ne nuk do t'i braktisim kurrë ata. Unë angaz…
 Faleminderit për mbështetjen e jashtëzakonshme! Në 25 prill, Shqipëri fiton dhe Rama humb. 
 Ne do të bëjmë një ndryshim thelbësor në shëndetësi për jetë më të shëndetshme dhe më të cilësishme për të gjithë, pa p…
 Kur Rama qesh, Shqipëria qan. Duket se ai e ka të vështirë të kuptojë që shqiptarët anembanë vendit janë lodhur prej ti…
 Ndërsa ekonomia po rrënohet çdo ditë, papunësia rritet dhe varfëria është ulur këmbëkryq në familjet e shqiptarëve, Ram…
 Do të bëj çdo gjë t’i japim fund bashkë kësaj të keqeje më 25 prill. Bashkë me shumicën e shqiptarëve, shpëtojmë dhe ri…
 Pas 7 vitesh dështime dhe premtime të pambajtura, 7 vite mashtrime, vjedhje dhe dështime, 7 vite dhunë dhe terror ndaj…
 Numri i të sëmurëve nga Covid-19 po rritet përditë, fatalitetet po shtohen dhe kapacitetet shëndetësore po shkojnë drej…
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
 Akti i sotëm antikushtetues shkatërron konsensusin e 5 qershorit dhe godet rëndë integrimin europian të vendit. Rama e…
 Çfarë e detyroi Edi Ramën të shkelë edhe premtimin kundër kumarit. Heshtja e tij për të dhënë shpjegime për këtë çështje…
25 Prill 2021, dita e fitores së madhe!Shqiptarët me padurim po presin të votojnë PD, si e vetmja shpresë për punë… 
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
 ER i ra maska! Prano hapjen 100 % të listave dhe tërhiq amendamentin e njëanshëm të tmerrit tënd nga koalicioni opozitar…
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
 Bajram të gëzuar dhe me fat nga Shkodra! Paqe dhe gëzim në zemrat dhe shtëpitë e shqiptarëve në këtë ditë të madhe shpr…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Teksa po i afrohet fundit të qeverisjes RAMAVIRUSI ka hequr dorë nga fasada. Shkatërroi Teatrin Kombëtar duke përfituar…
 Afera me TK është vjedhja më e dhunshme që u bëhet shqiptarëve nga Rama. Grabitja e TK në mes të pandemisë është akt lu…
 Për 7 vjet me radhë, RAMAVIRUSI e ka gërryer ekonominë, shëndetësinë dhe mirëqenien e shqiptarëve. CORONAVIRUSI vetëm s…
 Ky regjim po përdor edhe pandeminë për grabitjen e Teatrit Kombëtar dhe projektin e pastrimit të parave të krimit. Kali…
 Indeksi i Demokracisë i  e klasifikon Shqipërinë  regjim hibrid një hap larg autoritarizmit, për shkak të munges…
 Deputetja  :Rama jep një tjetër koncesion korruptiv.Kontrolli i pompave të karburantëve do t’i japë klientit të t…
 Lluksi dhe korrupsioni i Ramës me bandën e hajdutëve në qeveri është arsyeja e vërtetë pse nuk ka libra falas për të gj…
 Me gazetaret  : Nuk do të ketë një pakt Rama-Basha. Nuk do të ketë bashkëqeverisje PD-PS &amp; nuk do te kete ma…
===