Lindëm, për të qënë të lirë! 
Ngrysemi të varfër! (Monolog) | Irdi Zjarri 
Në emër të 'atit', të 'birit' dhe të 'langojve' të përulur! | Irdi Zjarri 
Irdi Zjarri: Një jetë që nuk mjafton! 
Irdi Zjarri: Një jetë që nuk mjafton! 
Irdi Zjarri: Një jetë që nuk mjafton! 
E hene, 14 Maj 2012 - Ne sollëm në Wind një ndryshim tërësor ... Bëmë të mundur ngritjen e një rrjeti të ri, më... 
Irdi Zjarri: Një jetë që nuk mjafton! 
Përshëndetje, duke dashur zhvillimin e akoma më shumë, të portalit tonë dhe kompanisë OSM Albania kërkojmë disa... 
Përshëndetje, duke dashur të zhvillojmë akoma më shumë imazhin tonë kërkojmë një vajzë per tu berë imazhi ynë e... 
Uli Hënes sulmon londinezët: Abramoviç, pjesë e mafies së naftës 
Tiranë, marshim në mbrojtje të Dinjitetit Kombëtar 
Kurti: Sulmet ndaj shqiptarëve i ndal vetëm bashkimi kombëtar 
Thaçi: Nuk do të ketë këmbime të territoreve 
Të enjten në OPINION! Ja pse ... 
Neonazistët grekë hyjnë në parlament: Fiton Demokracia e Re 
Të enjten në OPINION! Ja pse ... 
Vlera e Facebook në bursë, mes 85 dhe 95 miliardë usd 
Shqiptarët nuk janë terroristë dhe radikalë islamik 
Usain Bolt nën akuzë pse pëlqen femrat e bardha 
Lori Hoxha, protagoniste e nervozismit në Facebook! 
Gazetarët bojkotojnë institucionet dhe partitë 
Renzo Bossi blenë diplomë universitare ne Shqipëri! 
Turqia nis punën për ndryshimin e kushtetutës 
Prezantohet Fryma e Re Demokratike, zgjedhjet për kryetarin në shtator 
Prezantohet Fryma e Re Demokratike, zgjedhjet për kryetarin në shtator 
Zgjedhja e Presidentit, Rama letër Berishës dhe Metës 
Do të ketë një tjetër Titanik! 
Nuset e mitura të Kosovës 
Shqipëria: E madhe dhe e Bukur! 
Mapo: PD-ja do ta konsiderojë Nanon si kandidat, kur ky të të mbledhë 20 firmat 
Presidentja në ballo vjeneze në Ditën e të pagjeturve 
Klosi mund të ish vetëvrarë qoftë dhe prej Jozefinës 
Drake në lidhje me Rita Orën? 
Elbasan: Historia e një zbulimi të rrallë që nisi nga një bodrum dyqani 
Zidane i dhuron Shqipërisë një milion franga 
Topalli emëron drejtoreshë nusen e kushëririt 
Edi Rama: Papafingoja e krismës së thatë 
Terror në Athinë, një shqiptar tërhiqet zvarrë ndërsa një tjetër vritet me armë 
Messi, së shpejti baba 
Publicisti Ardian Klosi gjendet i vetëvarur në banesën e tij. 
Fëmijët minatorë të Bulqizës 
Zogu i kishte kërkuar Titos 8000 kosovarë për rrëzimin e Hoxhës 
Nano takon Ramën në PS 
Shkëmbim zjarri në kufi, trafikantët shqiptarë plagosin policin grek 
Sulmohen 19 website në Serbi 
Rita Ora, unikale në veshjen e saj. 
Rubi: Berluskoni më jepte 47 mijë euro në javë 
Shqipëria e Kosova pa doganë të përbashkët – Wind Albania 
Hileja e detit, Greqia do të përfitojë 5 miliardë metër kub gaz – Wind Albania 
Kush është monumenti fitues i 100-vjetorit të Pavarësisë – Wind Albania 
Virtualiteti  është një dukuri e përhapur së fundmi në internet, e cila po bën bujë gjatë kësaj periudhe... 
Virtualiteti  është një dukuri e përhapur së fundmi në internet, e cila po bën bujë gjatë kësaj periudhe... 
Në kohën e rrethimit të Sarajevës ose dëbimeve masive nga Kosova, lajmi për ndaljen e papritur të zemrës së... 
Nga Robin Hudi i Siçilisë e deri tek çifti famëkeq Bonnie dhe Clyde 
Edhe pse ishte burim inspirimi për miliona njerëz, Merilyn Monroe mbetet dikush që i përket botës së misterit.... 
“Në më pak se 3 vjet si President, Xhon Kenedi i dha botës portretin e një Amerike të re, të një kombi me një... 
50 këngët më të bukura për tu dëgjuar në makinë 
Shqipëria me ngjyra. Tetor 1913. 
===