Vazhdojmë të jemi lider në rajon sa i përket  Sipas  qeveritarët  përdorin zyrat për përfit… 
Filozofia dhe logjika si ka funksionuar Rama në 8 vite ka qenë kjo e mëposhtmja.PPP, ligje të shkruara për klient… 
 Mund të lash duart me një kryebashkiak të korruptuar apo të bësh koka turku bedelët e tu në atë sallë, por shqiptarët e…
 2/2...lidhjet e Hakmarrjes për Drejtësi me Tushën, Braçen dhe vetë Ramën, dhe përfitimet e tyre të ndërsjellta në vite…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
 Jemi vendi  në  për numrin e papunësisë së të rinjve, pasi këto 8 vjet rinia ka qenë pika e fundit në axhendën e socialistë…
Pjesëz nga intervista ime në  për buxhetin, pandeminë dhe manaxhimin e financave publike! 
Bizneset shqiptare paguajnë një taksë korrupsioni që vret të ardhmen e tyre. ❌ Mbi 30% e bizneseve sipas Dhomës s… 
 Të 2 në botë për korrupsionin,  me zyrtarë që mbushin portofolet nga taksat e shqiptarëve dhe u heqin fitimet biz… 
25 prill është një fitore e vjedhur dhe faktuar edhe nga provat që kemi çuar në KAS. Por, ne na duhet një proces an… 
Janë lënë në harresë nga qeveria por jo nga ne, zëri I shqiptarëve! Asnjë moment nuk do të harrojmë angazhimin për… 
Një qeveri që gënjen në fushatë elektorale është sëmundja më e keqe për një biznes. I takova sot bizneset e tradhët… 
Kënaqësi të vizitoja ekspozitën Ergys Zhabjakut “Njerëz Rruge”.Një qasje ndryshe ndaj fenomeneve që mund t’i shoh… 
Kënaqësi të isha pjese e delegacionit në takim kryetarin e kuvendit të Kosovës . Në një bisedë të ha… 
 duhet të dalë nga këto zgjedhje më e fortë dhe bashkuar. Vetëm kështu mund ta rrëzojmë regjimin. Ne mun… 
“Sigurimi ka shenjuar shpirtrat në një masë të tillë sa që Partisë Socialiste iu duk e natyrshme, në 2021, të krijo… 
Nuk ka politikë tjetër vetëm se ajo me njerëzit dhe për njerëzit! 
Përherë kënaqësi të jesh pranë të rinjve të degës 2. Energjia, pasioni dhe dëshira për të përmisuar veten dhe për… 
Kënaqësi të takoheshim me ministrat e jashtëm të Austrisë, Çekisë dhe Sllovenisë.Shqipëria nuk mund të jetë një v… 
Në Sauk, takimet vazhdojnë në betejën e përditshme për një  të lirë! 
Parregullsitë nuk kanë fund!
Çfarë ndodhi mëngjesin e 17 majit 2020 ishte shenja e qartë e një totalitarizmi që implementohet. Gjithçka në mën… 
“E pa dyshim se pas vështirësive është lehtësimi. Me te vërtetë pas vështirësive vjen lehtësimi” (94:5-6)Në këtë… 
Që prej 2013 Shqipëria jonë në hartën e zezë të drogës. Jo rastësisht të inkriminuarit gjejnë strehë tek qeveria dh… 
Standartet e zgjedhjeve dhe distancimi nga të inkriminuarit është çështje vullneti dhe vendimmarjes politike.… 
Këtë ditë të shënuar për Europën, le ta përkujtojmë përmes Konrad Adenauer, që riktheu demokracinë në Gjermani dhe… 
+120 mln € janë përdorur nga buxheti  për të blerë votën nga qytetarët npm pagesave për tërmetin.8 vjet abuzuan m… 
Asaj që ndodhi në 25 prill duhet t’i vendosim emrin e duhur. Shqipëria nuk mund të hyjë në një spirale kaq të rre… 
Bashkë me Saimirin votuam për Arbën, Irisin dhe Drenin! Votoni për femijët tuaj, votoni për ndyshimin! Voto 9! … 
Dy arsye përse duhet të zgjidhni sot numrin 9!   
Intervista ime e djeshme në  
Ajo çfarë u pa mbrëmë në shesh nuk ishte vetëm se preludi i ndryshimit që shihet në sytë e çdo qytetari të Tiranës.… 
 Të dielën, merrni familjen dhe miqtë dhe shkoni të votoni për ndryshimin që duam të gjithë. ëriaFITON   h…
Mesazh i qartë nga   drejtuar të gjithë shqiptarëve. Shkunde votën për ndryshimin ketë të dielë! Vot… 
Në 12 vite nuk kam ndjerë kaq shumë emocione dhe gëzim sa ditën kur pashë kaq shumë tironsa përballë dhe rreth meje… 
Faleminderit për mbështetjen  Nëse doni ndryshimin, votoni ndryshimin. Voto9! … 
Mbështetja për ndryshimin aq shumë të dëshiruar vjen dhe nga UK! Faleminderit  për mbështetjen tuaj… 
Kur fatorino të kërkon të hipësh në linjën e tij për të dëgjuar se si një qeveri mund të jetë në shërbim të të gjit… 
 “Me këtë ekspozitë kemi dashur të tregojmë se cilat janë punët që kryeministri jonë ka kryer tetë vitet e fundit, cila ësh…
Nuk mund të kemi një vend më të mirë nëse nuk kemi një qeveri të përgjegjshme!    
Në lagjet e Tiranës ndjehet ndryshimi tashmë, qytetarët presin vetëm 25 prillin për të ri prekur shpresën e burgosu… 
9️⃣ ditë nga ndryshimi! Voto 9! Voto PD!    
Edhe vetë e kanë të qartë që nuk janë më mazhorancë por një pakicë. Voto PD në 25 prill!  … 
ëhuPjesëENdryshimitPër t'u bërë pjesë e takimit, plotëso të dhënat tek linku   
 Në 25 prill shqiptarët do votojnë numrin 9 për ta larguar Ramën dhe ai nuk do jetë kurrë pjesë e qeverisjes sonë. Koha…
Krah për krah do të jemi edhe pas 25 prillit. Tani për të larguar një qeveri të korruptuar, nesër për të ndërtuar s… 
Ramazan të pranuar myslimanëve! Një muaj që na detyron të reflektojmë për veten tonë dhe veprat tona!
Mos ndal  që kërkojnë shqiptarët. Voto PD! Voto 9!     
Me të rinjtë që janë burimi ndryshimit &amp; fryma e tij.  kur  dhe  Ne 25 pr… 
Biznesi e ndjen më shumë se të gjithë sjelljen e pandershme të qeverisë. Shqipëria fiton ditën kur qeveria është pa… 
Shqipëria ka nevojë për ndryshimin që është kaq jetik dhe nevojshëm për Shqipërinë tonë.Në 25 prill Shqipëria do… 
Ka ardhur koha të mendojmë për një Shqipëri ku korrupsioni të mos jetë mënyrë jetese!Voto numrin 9! Voto PD@… 
Çdokush në Shqipëri e di. Ne duhet të anëtarësohemi në BE për një të ardhme më të mirë.Kush mund të na çojë atje?… 
Refuzoni stresin, përqafoni ndryshimin!Edhe 21 dite.  
Rinia është gëzimi me të cilin ne po shkojmë drejt 25 prillit. Ato janë motorri i ndryshimit që jetët e tyre dhe fa… 
Sot është dita botërore e ndërgjegjësimit ndaj autizmit, e përfshirë në AZHQ të  , me qëllim që askush t… 
Tirna me zemër të madhe!     
Këto janë disa nga elementet përbërës të reformave që Partia Demokratike ka menduar për Rininë Shqiptare. Ccfarë do… 
Plani   është që rrisë pensionet me 20% brenda mandatit të parë!   
Tjetër shuplakë nga ShBA për qeverinë më të korruptuar të Europës. Departamenti i Shtetit shkruan e zezë mbi të bar… 
Shqipëria ka një shtet të kapur nga korrupsioni, ku individë të fuqishëm dhe qeveria angazhohen në favorizime ligjo… 
Të rinjtë janë motorri ndryshimit dhe brezi që i prin atij, prandaj vota e tyre kësaj radhe do të jetë për nëj Shqi… 
Jorida Tabaku përgjigjet:Pyetja nga  në lidhje me  inceneratorët dhe  ndarjen e mbetjeve… 
Për një Shqipëri që fiton duhet një Familje që Fiton!  
Jorida Tabaku përgjigjet. Pyetja e parë nga Entele Begolli në lidhje me gratë kryefamiljare … 
Në shtëpinë e legjendës Shik Stërmasi.Që vitet e bukura i kaloi në ferrin e Spaçit. 
Në 25 prill Shqipëria Fiton! Në 25 prill nis misioni për një Shqipëri në BE! Misioni  është i munds… 
 Së bashku do të fitojmë!✌ 
Shqiptarët duhet të çlirohen nga prangat e qeverisë së sotme dhe të dalin nga gjëndja aktualeKa ardhur koha, të ç… 
Pata kënaqësinë e takimit dhe një bisede miqësore me Dom Marian Lumçin, famulltarin e katedrales që ndodhet në njës… 
 I habitshëm nervozizmi i Rames. Unë, PD dhe shqiptarët e kemi përcaktuar rrugën tonë që në dhjetorin ‘90: ajo është rru…
Marrëzia për të hedhur beton në çdo lulishte po shkatërron çdo pjesë të historisë dhe trashëgimise kulturore të kry… 
===