Gëzuar ditëlindjen, Mjeshtër!Vepra letrare e Kadaresë është pasuri për njerëzimin! 
Shabbat Shalom!Është një ndjesi e bukur kur nga Gjeorgjia të vjen lajmi se je përkthyer dhe botuar në një prej rev… 
Akademia e Çmimeve Nobel 2019,  ka promovuar genocid. Promovimi i qëndrimeve antihumane është po aq i rëndë sa pjes… 
 Fake news ....në fundjavë!Nëse portalet do të kontrollojnë twitter-in e sekretarit të Shtetit, të cilit i "referohen"…
 Letërsia mbetet atdheu universal i njerëzimit në të gjitha kohët  via  Koha Jone
Letërsia mbetet atdheu universal i njerëzimit në të gjitha kohët  via  Koha Jone
Letërsia mbetet atdheu universal i njerëzimit në të gjitha kohët  via  Koha Jone
Organizata ndërkombëtare mbështet Visar Zhitin: Përulemi para veprës dhe qëndresës së tij 
Visar Zhiti: Nuk mund të bëjmë demokraci me njerëzit që bënë diktaturën 
Mos hesht! Dhuna vret!  Ku është Mimoza? Ku je? Ku jemi? 
 Gazetari “plas” bombën: Avokati i njohur u mor peng për 9 orë, u fut në bagazhin e një makine dhe… 
   |  Ndërsa NATO feston 70 vjet paqe dhe zhvillim transatlantik dhe Shqipëria feston 10 vjet anëtarësi në NATO, ne d…
 Njeriu pa Zotin mund të shkojë shumë larg, aq larg sa nuk gjen më rrugën e kthimit. Ndërsa me Zotin mund të shkosh larg dhe…
 Kënaqësi të takoj sërish Presidentin e Frank-W.Steinmeier . Mirënjohës për mbështetjen domethënëse të…
 Djegja e mandateve është kallje për Edi Ramën dhe regjimin e tij autokratik! 
 Ambasadorja e  në , znj. Ardiana Hobdari, mori pjesë në pritjen organizuar nga Presidenti i Republikës Prokopis Pa…
 Ministria e Shëndetësisë: 5 policë dhe 5 protestues të lënduar,
 Çfarë lëndësh përdori garda kundër protestuesve? Shikoni gjendjen e qytetarëve…  via  Tel…
 Video ekskluzive/ Ja gjendja e të lënduarve në QSUT! 
 Mbivendosje në miniera dhe larje hesapesh mes pronarëve të kromit 
 Pas vitesh mbjellje e kultivimi, me propozim nga poshtë e miratim nga lart, po evidentohen rezultate të mira në luftën kund…
Sa nevojë që kemi për dinjitet dhe paqe, dy shtylla të njerëzimit. Sidomos për ne që kemi provuar kaq shumë vjet të… 
Entela KASI: Shqipëria e Ismail Kadaresë 
 Çështja e Universitetit prek drejtëpërdrejtë të ardhmen e vendit tonë. Nëse studentët duhet të kthehen apo jo në auditore u…
 Çështja e Universitetit prek drejtëpërdrejtë të ardhmen e vendit tonë. Nëse studentët duhet të kthehen apo jo në auditore u…
 Hajvanë të sotëm, Atdheu është vendlindje dhe për kërriçat e nesërm!
 Shkrimtari  Ismail Kadare feston sot 83-vjetorin e lindjes. Por, ky përvjetor vjen ndryshe për njeriun e madh të ✍ l…
 Një shtëpi muze e shkrimtarit, do të sjellë botën e letrave në Tiranë. Lajm shumë i mirë!
Shqipëria e përjetshme në veprën e Kadaresë do të mbetet një pasuri e çmuar për letërsinë dhe historinë.Është fat… 
 Entela KASI: Shqipëria e Ismail Kadaresë 
Entela KASI: Shqipëria e Ismail Kadaresë 
 , mungesa e tolerancës, shkeljet e të drejtave të njeriut,  &amp; veprime të tilla çnjerëzore ndaj k…
Shavua Tov!Javë të mbarë!
===