 Tatuazhi me imazhin e kryeministrit Rama, në fakt është barcode për procesin e fiskalizimit 
 Restoranti shërbente gatime me drogë, për të bërë klientë të rregullt  
 Basha: Numëruesit e PS vizatojnë mbi fletën e votimit një organ gjenital, por ja cila është fleta origjinale 
 Parathënia e librit “Dinjiteti im” është shkruar nga kolegu i Berishës, shkrimtari Lulzim Basha i cili pak javë më parë…
 Gjendet një celular pranë një lokali te Fresku. Policia lexon mesazhet për të identifikuar të zotin. 
 Kam gjet provën që vurteton se se janë vjedh vota. Kjo vajz bukuroshe kandidate për deputete mori veq 4 vota.  Si ka mund…
 Kreu i opozitës merr në patronazh një familje dhe e shpëton nga katastrofa 
 I shpreh Madhërisë së Saj Mbretëreshës Elizabetë ngushëllimet e mia për humbjen e Princit Filip, Dukës së Edinburgut. D…
 Monika Kryemadhi reagon për videon: “Duhet të më kuptoni se në atë kohë unë isha pak e , dhe ato fjalë që i tha…
 Edhe këngë, edhe valle, edhe punë. 
 Pas lahutës dhe çiftelisë, Serbia regjistron në UNESKO edhe dhallën 
 Deri tani ka patur shfaqje interesi nga disa kandidatë opozitarë të cilët kanë dëgjuar se radio ka fuqi rrezatuese për t…
 Tom Cruise publikon librin e tij të parë "Mission IMpossible" 
 Urime ! Të pres në Tiranë për ☕️ në dt.26 Prill. Më bëj një zile kur të jesh tek poshtë zyrës time tek …
 Presidentët dhe Kryeministrat nga bota po bajn vaksinën e Kovidit llajv në tv. Ndaj për t’inkurajue popllin shqiptar, si…
 Papa Françesku i bën 'like' fotos së bythëve të një modeleje braziliane 27-vjeçare   
 Ja në cilat shtete mund të shkoni pa viza (por jo pa lekë se nuk ti hedh sytë as gruaja)  | shihni listën e pl…
 Shqiptarët kur të rivendoset edhe njëherë karantina 
 Lajm i mirë: Qeveria lejon hapjen e klubeve dhe diskove. Ja mënyra e lejuar për të kërcyer. 
 Rifillon aktivitetin fast food "Mona". Zbulohet përbërësi ekskluziv i mishit për gatim. 
 10 Këshillat më të mira për të mos u mbrojtur nga Koronavirus 
 Uroj fëmrat kudo që janë Gëzuar 8 Marsin dhe kujdesuni për fëmijët që të rriten të mbarë e të mos bëhen kokëpalarë.
 Aty ku shkon kryetari opozitës duket se tërmeti ka rënë dje, aty ku shkon kryeministri duket se tërmeti ka rënë para një…
 Neser do lë vilën lart në kodër e do zbres poshtë tek qytetarët e thjeshtë. Më ka marrë malli për një copë bukë misri dhe…
 Presidenti njëherë flet dhe ja ku ra një tërmet.Them se më 13 Tetor mund të bjerë borë.
 Ky dekret hyn në fuqi menjëherë pasi të jetë botuar në fletoren zyrtare dhe të shënuar në bllokun tim
 Kshillë nga Vjena: Ja qysh duhet me i ruejt militantët demokratë se mos shkojnë gabimisht me votue të Dillën 30 Qershor.…
 Ja pra, kur vendi ka zot dhe , qetësia dhe rendi janë plotësisht të mundshme dhe të garantuara. Tani më falni…
 Pas votimit të Parlamentit, kam nevojë për reflektim dhe të risjell kujtimet kur ishim të dy të lumtur.  
 Kam dy javë që nuk shoh gruan.Jam i detyruar të shtyj datën e zgjedhjeve.
Një kompani shqiptare fiton tenderin për ndërtimin e murit SHBA-Meksikë. 
Veliaj premton: Në mandatin e dytë, semaforë me internet. Shoferët më shumë kohë për Instagramin 
 Kësaj pune i thonë  
 Ja provat e qarta që protesta e upuzitës ka mbështetjen e plotë të Gjermanisë dhe biznesit të automjeteve Auti dhe BëMëWë…
 Ska faj: kur të shpëton, të shpëton ✌️ 
 I bëj thirrje mediave të mos keqinterpretojnë fjalët e mia, pasi nuk kam thënë dorëheqje si Alende por si Alen Delon. #…
 Të ndjekim shembullin e faraonëve egjiptianë. Në kohë krizash, ata jepnin dorëheqjen në të mirën e kombit. ësi …
 Jo me dhunë por me kangë do ta shporrim  dhe  e krimit.  ë  
 Ende pa marrë pushtetin dhe plotësuam kushtin e parë të hapjes së negociatave: Këndimi i Hymnit Kombëtar me tenor profesio…
 Është e drejta jote të djegësh mandatin, por mos e digj brenda makinës  
 Sipas burimeve t’sigurta nga Brukselli dhe Strazburgu:  nuk e ka të xhatë. Ftoj t’xhithë demokratët t’bashkohem…
 Përshëndes t’xhithë simpartizantët dhe ish-deputetë demokratë me kangën “Dixhe moj dixhe mandatin e beqarit”  …
Zbulohen masat që po merren nga Ministria e Brendshme. Asnjë protestues nuk do hyjë dot brenda Kryeministrisë 
 Kryebashkiakut Veliaj i vjedhin portofolin gjatë inspektimit të linjës së autobusave të Kasharit 
 Pamje e dërgueme nga Droni Dixhital i protestës së opozitës e cila i përngjau bombës nukleare. Uikipedia shkruen se bomba…
SHBA mbështet zyrtarisht protestën e opozitës 
 Kush asht ky që refuzon ti japi dorën Kryeministrit të 16 Shkurtit? Mbajeni mend si fytyrë se ja kallxoj unë ktij socjali…
 Vendimi i parë i qeverisë Basha ditën e Shtunë do jetë heqja e fotos së plakushit të Vlorës dhe rivendosja e fotografisë…
Kryebashkiaku Lali e inaguroi, në prag rrëzimi godina studentore 
 Mbrëmë s’kam fjet hiq mirë. Pashë n’andërr makthet e mia ma të tmerrshme: sikur Edvini kishte fitue mandatin e tretë ndër…
 Ndjeva keqardhje për vdekjen e Gramoz Oz. Ishte shkrumtari jem i preferuem dhe m’kishte premtue se do shkruente nji libër…
 Gzue Berishtlindjen dhe paqja e Saliut qoftë mbi të gjithë besimtarët demokratë. Mbrona nga Satanai i Surrelit dhe ardhtë…
 Kur pashë studentat tek Kryeministria mu mbushën sytë me lot proteste. Për një moment doja të rrëmbeja batanijen e të bas…
 Sot kujtojmë njeriun e dytë ma t’randsishëm t’demokracisë se i pari jam vetë. Azemi ishte heroi ynë, ai ishte Rambo Balbo…
  dhe Sandri i Edvinit bashkë në foto?!! Nuk mund ta besoj askurrë! Kjo asht fotomontazh. …
 I parruar asht kujtimi kur takova bamirsen e Kalkutës. Për herë të parë n’histori u bashkuan Nëna e Terezës me Nonën e Ko…
 Një aksident i rëndë rrugor ka ndodhur në Himarë, por fatmirësisht pa dëme në njerëz. Automjet Ford me targa AA 114 KG…
Vandalët shkatërrojnë yllin e Donald Trump me kazëm. Mziu reagon duke vendosur yllin e Sali Berishës në Kamëz 
I ndjeri lë familjes trashëgim miliona dollarë, funerali kthehet në festë 
 Një makinë e tillë që ndot ajrin në këtë mënyrë nuk duhet lejuar të qarkullojë as nga autoritetet por as nga vetë drejtue…
 Fol Altin të lumtë megafoniFol e thuaju se Teatri asht i joni ër 
 Puna e parë që do baj kur t'vij n'pushtet osht rregullimi i Sheshit Skënderbej i cili do bahet aq madhështor sa që kur të…
 AMEN!  bën paqe me Teatrin e Vjetër ⚽️Me pak mirësi, dëshirë për ndryshim e dashuri për të renë, mund të bëjm…
 Dy gjana nuk ndalen kurrë: Drini i Bardhë dhe Sala i I-rë 
 Rama: Prej vitesh po dërgojmë mblesë tek shtetet europiane për të celebruar martesën e vajzës tonë Rilindjes me Bashkimi…
===