 Fatkeqësisht nga Facebook-u dhe dhe nga rrjetet sociale në tërësi kam përshtypjen se janë larguar… 
 Po personat me arsime të ndryshme shpesh votojnë ndryshe në bazë të interesave dhe vlerave.Si lidhe… 
 Duhet të kesh shumë probleme në të kuptuarit që të nxjerrësh këtë konkluzion nga ky Tweet.
 Vërtetë bravo, e shoh dhe vetë, rrethi im shoqëror me djem vështirë se e ka njeri mendjen për shkollë,… 
 Sidoqoftë, trendi i arsimimit të të grave më shumë se burrat po forcohet. Në doktoratura më shumë se 60% doktorantëve janë gra.
 Fatkeqësisht shohim dy efekte në veprim, nga njëra anë familjet që i mbyllin herët vajzat në shtëpi, ng… 
 Tani po që e ndriti ky patrioti i madh me sedrën e lënduar. Në rast se ky është ajka e Shqipërisë, atëhe… 
 Për çfarë fushe po fliste? Për të "paaftët" Shqipëria është vendi i mirë në fakt, këtë e sheh dhe te t… 
Banorët e Tiranës po humbasin çdo hapsirë të lirë që kanë. 
 Shkolla Normale i dha një rëndësi të madhe Elbasanit nga aspekti kulturor. Familjet e lagjes Kala në at… 
 Sidoqoftë dhe autori përmend rajone të jugut si Myzeqeja që kishin varfëri ekstreme përtej çdo imagjina… 
 Emigracioni ka pasur një rol të rëndësishëm, por lidhet me arsye të mëparshme. Jugu i Shqipërisë i posh… 
Prefekturat e 1927 kishin një ndarje të ngjashme me këtë hartë 1943, duke përjashtuar trevat e tjera shqiptare në K… 
Jeta shoqërore shqiptare e 1927 sipas studuesit dhe zyratrit të statistikave Teki Selenica me ndarje sipas prefektu… 
 Respektimi i të drejtave LGBT ndërkohë është problem që zgjidhet me ndërgjegjësim dhe me ca ndryshime ligj… 
 Nuk ka shifër fikse për madhësinë e komunitetit LGBT dhe kjo krijon dilemë të gabuar sikur interesat 30% n… 
  Shqipëria është varri i alternativave politike. Imagjino në PD-në e 2021, alternativa… 
 Ka shkuar më shumë se aq. Ata pak votues të PS-së të njoh, të gjithë e kanë inat Ramën dhe prapë ia ka a… 
 Një gjë kuptova nga këto zgjedhje, Rama dhe ekipi i tij i ka njohur mirë shqiptarët. Më mirë se çdo kundërshtar i tij.
 Detaj ndoshta i parëndësishëm, por shprehja për herë të parë me sa mbaj mend ka dalë gjatë protestave stu… 
  Sondazhi i më i fundit i UNDP-së flet për 37% fetarë praktikantë. Normalisht nuk janë shumë… 
  Pra dhe ju keni miq që shkojnë përditë në xhami. Qartazi ndikimi fetar në Shqipëri nuk është 0.
  Në universitet në Shqipëri njerëz bënin shaka se do më rrihnin në rast se nuk do e mbaja goj… 
  Ndoshta jetesa andej në Kanada të ka larguar nga realiteti shqiptar, por grupet fetare ekzis… 
 Po s'kam emër shqip, njëlloj si këta të listës.
 Vërtetë ra si bombë nga hiçi, por uroj të pasohet me figura të tjera problematike.
  Shumica e PD-së ka probleme frojdjane me qasjen e tyre ndaj Berishës, kështu që më shu… 
 Përpjekjet 2-vjeçare të Sindikatës Kombëtare të Operatorëve Telefonikë detyruan një prej kompanive call center në Tiranë që…
Sado që duket e hidhur, e vërtetë është dialektet e shumta të shqipes që lindën në kushte të caktuara shoqërore dhe… 
 Më vjen shumë mirë për këtë gjë dhe shpresoj që të hyjnë në parlament, pasi Shqipëria ka nevojë për modeli… 
 Nëse do të votoni më 25 Prill, cilës parti do i jepni votën?Na ndihmoni me perceptimet tuaja edhe në pyetësorin - 
Në këtë analizë mund të kuptosh se përtej fasadave liberale, Shqipëria e 8 viteve të fundit është shtet me tipare a… 
  Ja që tani ka dhe flamuri i komunitetit LGBT nuk do largohet gjëkundi.
  Ja që nuk e vendosni ju se ça flamuri mundet të mbajë dikush.
 Shqiposting fuqishëm.Gjegj gjëra që kur i ha të ulin urinë.
Fatkeqësisht shoqërisë dhe sidomos politikës i duhet rikujtuar nevoja e shekullarizmit dhe i faktit që politika dhe… 
===