Me ilven, gazetaren që trajton me profesionalizëm lajmin, analizën, opinionin dhe ekranin! Gratë profesioniste në m… 
Miti që lufta është për burra ra! Beteja covidiane provoi që gratë janë fituese.The myth of war being a man’s gam… 
Ne presim të pulsojë fuqishëm në karriken e lartë të pushtetit apo në fronin e lartë të profesionalizmit dhe të sip… 
Prezenca e gruas në majat vendimmarrëse rrezikon të mbetet një statistikë në harresën e kohës nëse nuk do të përkth… 
Më ndiqni sot ne oren 17:00 teksa flas për lidershipin e gruas në botën tejet konkurruese të epokës post-covid. Sam… 
E privilegjuar të jem e ftuar për një fjalë hyrëse në  Summit. Për të ndjekur samitin dhe fjalën,… 
E privilegjuar që sot në  të bashkoj zërin me  për gratë sipërmarrëse në… 
Zaho ne shkollë . Filloi sot një vit shkollor sfidues për femijët, mësuesit, prindërit. Të ndihmojmë njëri-tjetr… 
Sa më shumë bota ofron mjete të reja komunikimi, aq më alarmante bëhet nevoja për ta mbrojtur botën e vlerave e par… 
Nëse te rinjtë dhe gratë në pozicione  drejtuese nuk krijojnë një perspektivë për të tjerët që luftojnë përditë me… 
Sot 8 nga 15 ministra janë gra, 47% e zëvendësministrave  gjithashtu. 40% e institucioneve qendrore dhe 45% e Drejt… 
Në 1990 ishim të barabartë, jetonim në shtëpitë e njëllojta të shtetit, me ekonominë familjare të mbijetesës dhe mb… 
Misioni i shqiptarëve është mbrojtja e interesave të vendit që quhet Shqipëri dhe të popullit që mban emrin shqipta… 
Ne nuk e kemi shpikur ërinë. Ne nuk e kemi shpikur as ngulitjen e saj në ë. Humbja e rigjetja e kontine… 
Shqiptarët, e kanë humbur dy herë Evropën: në shekullin XV dhe nën sundimin komunist. Sot, pas përmbysjes së komuni… 
Kur ju dëgjoni emrin “shqiptar” ndoshta padashur, gjëja e parë që iu vjen ndër mend është imazhi tronditës i mijëra… 
Një tërësi domethënëse  grash qëndron sot në majat e arkitekturës institucionale në Shqipëri. Krenare për Edin, nxi… 
Një tërësi domethënëse  grash qëndron sot në majat e arkitekturës institucionale në Shqipëri. Krenare për Edin, nxi… 
Për më shumë se njëqind vjet Shtetet e Bashkuara të Amerikës kanë qenë miqtë më të mirë të Popullit Shqiptar dhe GJ… 
Një kapitull të ri hapëm në panelin "Zhvillimi i kapitalit njerëzor në Shqipëri”.  Aftësitë për jetën apo siç njihe… 
Vendet e zhvilluara po jetojnë Revolucionin e katërt industrial, ato në zhvillim do të mbërrijnë më shpejt se vonë… 
Ashtu si këndimi, shkrimi dhe arithmetika, leximi i medias duhet trajtuar si një “kompetencë thelbësore” për të gji… 
Interneti na ka mundësuar të hyjmë në një oqean me informacion, shifra dhe lajme. Ne duhet të ndërtojmë një shoqëri… 
"Soft skills" në terminologjinë profesionale njihen si "aftësi për jetën" , por unë parapëlqej t'i quaj aftësi parë… 
Çdo gruaje, natyra i ka dhënë cilësi të tilla që e bëjnë pikën më të fortë të ekuilibrit personal, familjar dhe sho… 
Vajzat dhe gratë lipset të njohin dhe të përqafojnë natyrën e tyre, së bashku me gjithë potencialin që mbartin, si… 
Të gjithë sëbashku për fuqizimin e gruas!  
Ëndrrat mbeten ëndrra nëse nuk veproni! ✨⚡️  Shihemi në Londër, 13-14 korrik, Samiti… 
Në çdo vendimmarrje me risk,duhet të guxoni. Të guxoni për të ndryshuar veten dhe të guxoni të ndryshoni ata rreth… 
Christine Lagarde, është zgjedhur të drejtojë Bankën Qendrore Europiane, e para grua në këtë pozicion. ”E para grua… 
 sot, unë GJITHMONË kam votuar! Të votosh është një e drejtë E RËNDËSISHME!ALWAYS vote! Voting is IMPOR… 
===