Sot, 16 Prill ështê një datë, që simbolikisht shënon përkujtimin e eksodit, që nis më 27 mars të vitit 1999, ku në… 
Nis dhe përfundon tek arsimimi i brezave. Ky është rankimi i universiteteve... 
Emri i Fan Nolit jetësohet në Bronx. 
Shtyllat e ndriçimit rrugor edhe si poste për karikimin e makinave. Aty ku fokusi është qytetari! 
Tirana në ditën pa makina! 
Lavdi për 4 heronjtë e demokracisë Arben Broci, Bujar Bishanaku, Besnik Ceka dhe Nazmi Kryeziu, që dhanë jetën në e… 
Sa larg misionit për të cilën janë zgjedhur. Në vend të shërbimit kanë zgjedhur "gjobën" ndaj qytetarit. 
Me nismën e ndarjes së shoqërisë ne familje të pasura e te varfëra është koha edhe për rikthimin e termit "kulak"...
Duke pregatitur zonën për *investitorin strategjik* të rradhës....Ironi, prishjet e njesive të banimit fillojne pi… 
Liqeni i Fierzes një ndër basenet më të medha pêr prodhimin e energjisë është kthyer në një lumë. Një situatë mjaft… 
Humbje e madhe për politikën botërore, shuhet Madeleine Albright, gruaja e parë që shërbeu si Sekretare e Shtetit t… 
Gëzuar festën e Sulltan Nevruzit! Begati harmoni sjelltë për ju dhe të dashurit tuaj! Gëzuar! 
Niveli i ujit në liqenin e Kukësit është një tregues për ditë te veshtira ne sektorin e energjisë. 
Gëzuar ditën e Verës!Ju uroj në këtë ditë feste shëndet e jetë më të mirë! 
Gëzuar Pavaresinë Kosova! Të kujtojmë për të mos harruar, kjo është rruga në të cilën kaloi Pamvarsia... 
Ujë 24 orë një premtim 30 vjeçar. Edhe sa... 
 1/2 Me trishtim mora lajmin e ndarjes nga jeta të Dom Gjergj Simonit, dëshmitar i vuajtjeve në burgjet e diktaturës dhe…
...sot merr njoftimin që të hënën mbyllen edhe shkollat... 
Një jetë e perndjekur...Shqipëri 2022... 
Për të mos harruar! 
Ju uroj përzemërsisht të gjithë besimtarëve të krishterë Gëzuar Krishtlindjen!Marry Christmas  
Gëzuar ditën e Rinisë! 
Rruge që i kane dalë "telat" që ditën e parë... 
Gëzuar 28 Nëntorin, festën e Pavarësisë dhe Çlirimit të vendit. Nderime të gjithë deshmorëve,që dhanë jetën në mbro… 
I trishtuar nga tragjedia që mori jetët e dhjetra qytetarëve në një aksident në Bullgari.Ngushëllimet e mia të sin… 
Në ditën e parë të shkollës, urimet më të përzemërta janë për të gjithë nxënesit e mesuesit. Në veçanti për vogëlus… 
“Unë mund të bëj gjëra që ti nuk mundesh. Ti mund të bësh gjëra që unë nuk mundem. Së bashku mund të bëjmë gjëra të… 
Kjo është "mbeshtetja" për mesuesit. Ka ngelur vetem data e provimit qe ta bejne nje jave para zgjedhjeve. 
 Falemnderit Kosovë për ndihmën dhe solidaritetin që nuk e ke kursyer kurrë! 
 25 vjet më parë u ekzekutua në një atentat kolonel Bujar Kaloshi, themelues i Shoqatës Antikomuniste Demokratike, Drejt…
 Gëzojmë për medalisten e artëNora Gjakovën dhe për Kosovën sepse ky nuk është vetëm një sport por një shtet që nëpërmj…
 Me trishtim të thellë mora lajmin e rëndë të aksidentit tragjik të ndodhur në Kroaci, në të cilin sipas të dhënave të p…
 2/3 …për shqetësimet e vogla dhe të mëdha të familjeve shqiptare, për të kapërcyer bashkarisht vështirësitë dhe për të…
 3/3 Këshilli i ri, i hapur për më shumë zonja dhe zonjusha, më shumë të rinj dhe të reja, do të jetë një urë bashkëpuni…
 1/3 Mirënjohje për delegatët që në Kuvendin Kombëtar përfaqësuan demokratët anembanë Shqipërisë. Suksese Këshillit Komb…
 1/2 Sot pata kënaqësinë të mirëpres Ambasadorin e Japonisë në Shqipëri, z. Takada Mitsuyuki. I shpreha mirënjohjen për…
 Punonjësit e ndershëm të policisë janë të tradhtuar nga regjimi Rama-Doshi. Kur vjen në pushtet me krimin, policia përd…
 Trushpëlarë, apologjistë me apo pa qira: boll akuzuat njerëzit për të keqen që ka plasur kudo! Është vetëm pasojë e mod…
 Nga zemra ju uroj gjithë besimtarëve myslimanë Gëzuar Fitër Bajramin!Agjërim të pranuar, lutje të pranuara, shpresë të…
 Të dielën, merrni familjen dhe miqtë dhe shkoni të votoni për ndryshimin që duam të gjithë. ëriaFITON   h…
Për një jetë më të mirë dhe të ardhme të sigurtë për fëmijët, dil nesër dhe voto.Voto për arsimin, shëndetësinë dh… 
Shqipëria ka nevojë për ndryshim, për rikthimin e shpresës dhe besimit tek të rinjtë dhe çdo qytetar për një jetë n… 
 Sot në 21:00, me gazetarin  në ABC News. 
Nuk ka emision e analist, që ndal ndëshkimin me votë,që do japin qytetarët me 25 prill ndaj kesaj qeverie...
 Në 25 prill shqiptarët do votojnë numrin 9 për ta larguar Ramën dhe ai nuk do jetë kurrë pjesë e qeverisjes sonë. Koha…
 Sot në Kavajë dhe Durrës pashë vendosmërinë e qytetarëve për ndryshim.Nëse doni ndryshimin - votoni 9. Nëse doni një t…
 Sot në Peshkopi, Bulqizë, Burrel, Klos dhe Maqellarë takova qytetarë entuziastë dhe të etur për ndryshim.  Ndryshimi do…
 Mirënjohës  për pritjen e jashtëzakonshme nga qytetarët e Kukësit dhe rrethinave. Era e ndryshimit ndihet në Kukës si k…
 Sot vij para jush për të shpallur një tjetër synim, një detyrë, një mision që i përgjigjet dëshirës së çdo shqiptari: k…
Së bashku do të fitojmë! 
 Statuja e Nënë Terezës merr pamje të jashtëzakonshme nga bora  Shots from Pocket 
Çelesi i fitores në 25 prill është një dhe vetem një , të gjithë bashkë   
Data 25 prill nuk është vetem data e zgjedhjeve, por edhe e zgjidhjeve.
Ky ka qenë një vit aspak i lehtë dhe të gjithë ne jemi përballur me plot vështirësi e problematika në familjet tona… 
Nuk kishte si të ndodhte ndryshe. Kur ka qeverisur 8 vjet vetem për "fasadë". Edhe lista nuk del jashtë ketij mentaliteti.
Si në kulm të pandemisë i merr nga "vija e zjarrit" dhe i fut në lista per deputet.
Shipëria fiton të ardhmen. Me 25 prill dita e ndryshimit.  
 Fëmijët janë e ardhmja jonë! Për ta duhet të sjellim shpresën që u nevojitet dhe ndryshimin për të cilin kemi nevojë t…
Sot bashkuam forcat, të sigurt për të sjellë ndryshimin në Shqipëri. Më 25 Prill ne premtojmë se Rama do të ikë dhe… 
 Ne do të ulim faturën e energjisë elektrike për 70% të familjeve shqiptare duke ngritur një sistem faturimi me dy fasha…
 Me planin tonë fiton qytetari, punëmarrësi, i cili bashkë me familjen e tij është qendra e programit tonë. Fiton aleati…
 Bashkimi Europian kërkon një partner të besueshëm dhe tek Partia Demokratike dhe tek unë ka një partner i cili ka bas…
 Gëzuar Ditën e Pavarësisë Kosovë ❤️ 
17 shkurt 2008 është dita historike kur Kosova, shteti më i ri në Europë shpalli pavarësinë duke u bërë shtet i lir… 
Puna dhe detyra e shtetit është që ajo e moshuara të mos jetë në mes të dëborës për 'vizitë shëndetësore'Kjo ësht… 
 Urime VV, Albin Kurtit dhe Vjosa Osmanit për fitoren e zgjedhjeve. Kosova ka sfida të mëdha përpara. Jam i bindur se pa…
Në  mes të Tiranës, aty ku kamerat e propagandës nuk filmojnë... 
Gjatë kohës së komunizmit në Shqipëri me ndalimin e besimeve fetare filloi edhe shkatërrimi i objekteve të kultit.… 
 Faleminderit për mbështetjen e jashtëzakonshme! Në 25 prill, Shqipëri fiton dhe Rama humb. 
Me programin “Shqipëria fiton Shëndetësinë”,paga e infermierëve do të bëhet 700 euro dhe e mjekëve 1200 euro.
 Industria prodhuese është në vështirësi të madhe. Qeveria i injoroi thirrjet tona për të ndihmuar ekonominë. Tani sulmo…
 Me kë tallet akoma ky? Për 8 vjet Rama i ka shërbyer vetëm vetes, miqve të tij, ortakëve të tij, por jo shqiptarëve. Pë…
 Aeroporti Ndërkombëtar "Nënë Tereza" do tu kthehet shqiptarëve dhe shtetit të tyre sipas përcaktimeve fillestare të kon…
 Çdo akt koncesioni, PPP apo zgjatje koncesioni i propozuar nga qeveria ne ikje, është në shkelje flagrante të ligjeve t…
 Unë sot marr barrën e përgjegjësisë përpara jush! Ka ardhur koha për ndryshim! Ka ardhur koha ta largojmë këtë qeveri d…
 Rama qetësohu. Ky është vetëm fillimi. E dimë se ti nuk je mësuar të përballesh kurrë me angazhime serioze që do të mba…
 Rinia sheh një shpresë të madhe tek ndryshimi, tek alternativa, sepse problemi më i madh që Shqipëria ka sot është larg…
 Pas 8 viteve të dështimit të Ramës, pasi kostoja e jetesës është rritur dita-ditës, ka ardhur koha për ndryshim. Rama d…
 Eurostat e renditi Shqipërinë në vendin e gjashtë në botë për emigracionin masiv. Për 8 vjet me dështimet e tij, Rama e…
Me çfarë të merret mësuesi, me drutë apo me mësimin; me nxënjen apo nxehjen?? Ky është realiteti i arsimit sot në… 
 Faleminderit për mbështetjen. Ndryshimi po vjen. Në 25 prill do të fitojë Shqipëria! 
Diferenca është e qartë dhe e madhe. Shqipëria ka nevojë për një Kryeministër që rikthen shpresën dhe forcon ekonom… 
Është shumë e rëndë mënyra se si e trajtojnë postin publik. Ata e barazvlerojnë me "pronar" të postit.
 Ndërsa vendi është nën ujë dhe shqiptarët po humbasin shtëpitë e tyre, ministrat e Ramës janë shtruar restoranteve luks…
 Ndërsa ekonomia po rrënohet çdo ditë, papunësia rritet dhe varfëria është ulur këmbëkryq në familjet e shqiptarëve, Ram…
 Në Torovicë banorët më informuan se mbi 70 familje janë të izoluara nga uji, pa asnjë ndihmë nga shteti. Qeveria është…
Kryeministri që i duhet vendit! 
Aty ku kamerat e propagandës nuk "mund" të filmojnë. 
 Për shkak të Ramës, të rinjtë tanë po largohen nga Shqipëria. Është koha ta largojmë Ramën dhe t'u rikthejmë shqiptarëv…
 Edhe sot Rama u përpoq të fajësojë të tjerët për dështimet e tij.Largimi masiv i shqiptarëve është një nga dështimet më…
Viti 2021 do tē jetë viti i ndryshimit për Shqipërinë dhe për shqiptarët.Është koha që vendi të drejtohet nga qeve… 
Në një kohë kur e gjithë Tirana është e dergjet në trafik, ata që duhet të lehtesonin sadopak këtë situate. Merren… 
Ju uroj përzemërsisht të gjithë besimtarëve të krishterë Gëzuar Krishtlindjen!Qoftë ky një vit i mbarë, plot begat… 
 Të dashur besimtarë të krishterë,ju uroj nga zemra Gëzuar Krishtlindjen! Le të shohim me shpresë përpara, sepse siç thu…
 Mjekët e ardhshëm shqiptarë nuk duan të ikin nga Shqipëria, por kolapsi i shëndetësisë po i përzë. Premtimi për shëndet…
 Mbështetja e sipërmarrjes dhe inovacionit, sigurimi i financimit për projektet start-up të të rinjve shqiptarë është rr…
E vërteta është se shqiptarët ndër vite nuk kanë mbështetje nga kjo qeveri, e cila dukshëm nuk ka patur dhe nuk ka… 
47 mijë persona janë larguar nga vendi vetëm gjatë vitit 2019 raportoi INSTAT.Shifra  që pasqyrojnë faktin se qyte… 
"Do të subvencionojmë 100% të tarifës së shkollimit për studentët nga familje me të ardhura nën 640 mijë lekë të vj… 
 Më 25 prill do të konfirmojmë se Shqipëria do të jetë demokraci, jo diktaturë. Fytyrat, sytë, shpirti dhe mendja juaj d…
 Të rinjtë shqiptarë, i ka penalizuar shumë ky 7-vjeçar dështimesh, premtimesh të rreme të Edi Ramës. Është koha ta ndry…
 Sot 10 vite më parë, ne arritëm stacionin e lëvizjes së lirë të shqiptarëve në BE, realizuam një ëndërr. Krenar që kam…
... 10 vite me parë shqiptarët fituan të drejtën për të lëvizur të lirë në BE, falë arritjes së sigurisë dhe ndërti… 
4 përfaqësues të pushtetit dhe dy analistë. Ky është paneli i "barazpeshuar" në një TV kombetar.Ndryshimin nuk ka… 
Pushteti përballe "protestuesve" ...Tiranë 2020. 
 Gjuha e urrejtjes dhe përpjekjet e dëshpëruara të Edi Ramës për të  fajësuar PD për 7 vitet e dështimit, premtimeve bosh…
 Me 25 Prill ne do ta largojmë këtë qeveri dhe do të sjellim shpresë dhe ndryshim për Shqipërinë.
 Sot kam patur disa biseda me përfaqësues të komunitetit ndërkombëtar lidhur me zhvillimet e fundit. Ndava thirrjen për…
Ky është produkti,kur pretendon të qeverisësh nga rrjetet sociale. Shteti ka nevojë për njerëz serioz dhe të pergjegjshëm.
 Qytetarët shqiptarë meritojnë një qeveri që kujdeset për njerëzit, jo për veten! 
 Çdo shqiptar është tronditur nga ekzekutimi i Klodjan Rashës në derën e shtëpisë. Dhimbja dhe zemërimi na ka përfshirë t…
Të bashkuar kundër padrejtësive.Shqiptarët meritojnë drejtësi! 
 Shumë prej jush jeni të dëshpëruar, mezi prisni ndryshimin. Ndryshimi do të mbajë përsëri firmën dhe vulën e rinisë shq…
 Zotohem se si kryeministër do të kufizoj në vetëm dy mandate postin e kryeministrit. Atë që nuk e arrin dot në 8 vjet n…
Tek Rr.El as 400m nga zyra e "punëmbaruarit" .Sa taksë paguajme për pastrimin? 
 Jam shumë i tronditur nga këto pamje që të thyejnë zemrën. Kjo është e vërteta e tmerrshme që po përjetojnë të sëmurët…
 Prodhuesit e patateve dhe blegtorët e Shishtavecit janë zënë në çark nga politikat e mbrapshta ekonomike të Edi Ramës n…
 Rinia kuksiane është lënë në baltë prej shtatë vitesh nga Edi Rama. Të rinjtë duhet të jenë shpresa jonë dhe të kenë b…
Ndërsa qytetarët presin ndihmë për dëmet e shkaktuara nga tërmeti dhe Covidi, këta bëjnë ligje kundër memeve...
 Fondi Monetar Ndërkombëtar publikoi një raport kritik mbi situatën ekonomike në Shqipëri. Raporti konfirmon atë që ne i…
 Në Europë nuk mund të hysh me hile, por vetëm me plotësim të kritereve. Liberalizimi i vizave është provë për këtë. Shq…
 Mentaliteti i propagandës mbi punën është konstantja e vetme e pushtetit të Edi Ramës gjatë 7 viteve.
"Kullat orbitale" apo "pylli orbital" ka shkaktuar këto ndotje kaq të madhe të Tiranës?!Dukshëm Bashkia ka "punua… 
 Kjo ditë feste i gjen sivjet Shqipërinë dhe shqiptarët përballë sfidës së pandemisë, që u ka marrë jetën shumë prej nes…
 Jam kritikuar që kam punuar dhe nuk i kam reklamuar. Nuk jam kritikuar asnjëherë për propagandë.Unë besoj fort se të…
 Sot, ora 20.45, te Çim Peka në Syri TV me gazetarët Enton Abilekaj dhe Mentor Nazarko. 
 U takova sot me një grup nga mjekët tanë të mrekullueshëm. Ata janë në vijën e parë të luftës me COVID. I përgëzova për…
Por për më tepër raporti i Bankës Qëndrore të Austrisë thekson dhe një herë se familjet shqiptare janë më të pamund… 
Në një kohë kur familjet shqiptare po përballen me vështirësi të mëdha ekonomike, shumë prej tyre kanë gjetur zgjid… 
 Dje Rama deklaroi se nuk ka asnjë arsye për të mbyllur shkollat sepse "fëmijët nuk të infektojnë me koronavirus". Ndërs…
Në vështirësi apo në prag falimenti janë me qindra biznese të tjera, të lënë prej muajsh pa asnjë ndihmë, pa asnjë… 
Ekonomia e vendit vazhdon të rëndohet dita ditës dhe familjet shqiptare ashtu si në këto 7 vite edhe sot janë lënë… 
 Biznesi i vogël ka nevojë për një shpresë të re. Për një qeveri që i ndihmon, kujdeset për ta, mposht sëmundjen &amp; ripër…
 Kënaqësi të prisja dje një mik të nderuar, Min. e Jashtëm të Italisë, . Diskutuam situatën kritike të pande…
 Shqipëria u rendit e katërta në Europë për Rritjen e Përgjithshme të Çmimeve këtë tetor, sipas metodologjisë së EUROSTA…
 Ne do ta bëjmë konkurrues biznesin shqiptar. Ne do ta shërojmë Shqipërinë dhe do të sjellim një shpresë të re për ven…
 Kanë pritur që qeveria t’i ndihmojë por Edi Rama s'ka kohë/para për ta. Ne do ta ndryshojmë këtë gjendje. Ne do të ku…
...asgjë tjeter, veçse një fortunë në gotë. Data 25 prill do të jetë uragani i fitores. Nuk ka "analist" e "artist" që e ndalon ndryshimin!
 Nëse Rama do kishte investuar kohën e tij sot, në shërbim të qytetarëve në vend që të cicëronte gënjeshtra kundër meje,…
 Përfytyroni një qeveri që punon për njerëzit, që jep ndihmë financiare për çdo familje. Një qeveri që ka një plan kundë…
 Me hidhërim mësova për ndarjen nga jeta të z. Selim Veizi, kryetari i parë i Bashkisë Kavajë pas rrëzimit të komunizmit…
 Me hidhërim mësova për ndarjen nga jeta të z. Selim Veizi, kryetari i parë i Bashkisë Kavajë pas rrëzimit të komunizmit…
Gjithsecili nga ne mund të japë ndihmën e tij modeste biznesit në kete kohera të veshitra. Sa nga Covidi aq nga mun… 
 Aktorët kryesorë të masakrave të Millosheviçit në vitet 90 janë sot figura qëndrore në Beograd. Nuk janë dënuar. Me Kos…
 Sonte do të rrëzoj të gjitha shpifjet e ulëta të Ramës. Jo për veten time por për Kosovën! Më ndiqni sot live, ora 21:0…
 Shumë mësues janë bërë viktima të mungesës së masave mbrojtëse nga shteti. Qindra të tjerë të infektuar në shkollat ku…
 Lushnja lëngon nën ethet e sëmundjes. Mësuesit në Lushnje janë më të pambrojturit dhe të terrorizuarit nga përhapja e f…
 Mësuesit janë njerëzit më të rrezikuarit nga  pas personelit mjekësor. Në Shkodër, rrezikut për jetën i shtohet e…
 Rama je një dështim i madh. Sa shqiptarë duhet të vdesin që të ndalësh sulmet politike dhe përpjekjet për të na mbyllur…
 Shëndetësia e Edi Ramës është në kolaps të plotë. Nëse infektohesh me , nuk të testojnë se s'ka tamponë. Kur të s…
 Ne do të të mposhtim ty dhe do t'u japim fund gënjeshtrave dhe premtimeve të tua të rreme. Do të ecim të sigurtë drejt…
 Ndërsa merresh me vizatime dhe nuk shkulesh nga Instagrami, unë e kam vënë tërë jetën time në shërbim të vendit. Për Sh…
 Kur e gjithë rroga mujore nuk të mjafton për të blerë ilaçet e  dhe shteti nuk të dëgjon... Ku i marrin paratë…
 Kjo është përballja dramatike e Muharrem Poleshit me COVID.  Urgjenca nuk i përgjigjet 8 ditë rresht dhe kur i përgjigj…
 Qytetarët shqiptarë meritojnë më shumë. Më shumë teste,më shumë ndihmë,më shumë zgjidhje. Plani ynë ofron zgjidhje dhe…
 Edi Rama leri shpifjet dhe lojërat politike, përgjigju pse nuk e hap Covid 4? Pse të infektuarit dergjen nëpër ambulanc…
 Numri i të infektuarve me covid po thyen rekordet. Me qindra njerëz kanë humbur jetën dhe fatkeqësisht shumë të tjerë j…
Ky duhej te ishte lajmi ne çdo media vizive e te shkruar.  Shqipëtarët kanë qenë,janë e do të jenë si Adem Halili. 
 Shto testimet, rimburso ilaçet për pacientët në shtëpi,shto kapacitetet mjekësore.Ndal së vjedhuri dhe jepi lekët shqip…
 Numri i të sëmurëve nga Covid-19 po rritet përditë, fatalitetet po shtohen dhe kapacitetet shëndetësore po shkojnë drej…
 Rama ka humbur çdo kontroll mbi pandeminë. Kemi testimet më të ulëta në Europë, numrin më të ulët të mjekëve dhe spital…
"Deputetët që duam" përfaqësues të Rilindjes kanë qenë fiks si "Aeroportet që u ndërtuan", gjatë gjithë mandatit vetëm në 3D!
Kjo është situata e trafikut në qytetin e Tiranës.Tirana është e paralizuar vetëm nga keqmenaxhimi.Qytetarët çdo… 
Me ftesë të EDYN ( European Democracy Youth Network) isha i nderuar të isha pjesë në intervistat dhe diskutimet me… 
Tirana 2020, një foto që rrëzon të gjithë propagandën e rilindjes.Mungon vetëm "korsia" e betoniereve... 
Nuk ka ofruar asnjë mbështetje për personelin shëndetësor që prej muajsh janë në vijën e parë të përballjes, nuk ka… 
Ndërsa ndodhemi në mes të pandemisë Covid-19, qartazi propaganda e rilindjes për kujdesin ndaj qytetarëve bie, kur… 
Qytetarëve nuk ju është oftuar asnjë shërbim, përveçse vazhdojnë të përballen me vështirësi çdo ditë për shkak të "… 
 Rritja e numrit të testimeve, rimbursimi i plotë për mjekimin në shtëpi kundër Covid, bonusi i premtuar dhe angazhimi i…
 Kur për të mbrojtur korrupsionin tënd, mbyll PS në një vendgrumbullim plehrash, kuptohet se e ke një hall të madh. Por…
 Politika e vjetër ka erën e gropës së Hajdin Sejdisë ku nuk vure dorë 11 vjet si kryetar bashkie, ka fytyrën e zërin të…
 Sot pata kënaqësinë të takohem me ministrin e jashtëm të Greqisë . Gjatë bisedës, nënvizuam domosdoshmërin…
Në vënd të 678 gjobave, sot duhet të ishin shpërndarë 678 maska. Por "rilindja" ka vizion tjetër nga interesi qytetar.
si Maqedonia e Veriut miratoi paketën e katërt të ndihmës për sektorin e turizmit, që ka qenë dhe sektori më i godi… 
Qytetarët dhe bizneset të zhytur në borxhe, pa asnjë mbështetje reale nga shteti, vazhdojnë të përballen vetëm me p… 
 Kënaqësi të prisja Ambasadoren Vasak, një mike e vyer e Shqipërisë, teksa mandati i saj vjen drejt fundit. I shpreha mi…
 Lere viktimizimin për të fshehur vjedhjen. Plehrat e tua janë në çdo cep të Shqipërisë dhe 70 mil euro kanë avulluar pa…
 Dhimbjet e shqiptarëve që ke zhytur në skamje e nuk kanë mundësi as për ilaçe, shëndetësia në kolaps, ekonomia në krizë…
Policia në Kosovë në aksion, por për të shpërndarë maska falas për qytetarët.Ështe e qartë se çfarë bën një shtet… 
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
Realiteti jashtë kamerave të propagandës! 
 Kur vjedhja galopante, keqqeverisja, ekonomia dhe shëndetësia janë sot drama e çdo shqiptari,KM fshihet si struci pas n…
Qartazi "punët" e bashkisë "lehtësojnë" çdo ditë jetën e qytetarëve. Ngushtimi i të gjitha nyjeve të qytetit në em… 
 Rriten infeksionet, bien testimet. Ndërkohë që njerëzit kanë nevojë për mbështetje dhe ndihmë, Rama vazhdon me vjedhje…
Demokratët sot në Tiranë ashtu si në çdo cep të Shqipërisë kanë treguar qytetari, shpresë dhe besim për ndryshimin… 
Kujtohet për vendosjen e maskave, kur ka 1 muaj që ka nisur shkolla.
Një pjesëmarrje e madhe e anëtarëve në proçesin e konsultimit të kandidatëve me anëtarësinë në degën Durrës. Më të… 
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
Në djepin e demokracisë! 
 Këtë vit, Dita Ndërkombëtare e Trashëgimisë Kulturore e gjen Shqipërinë pa Teatrin Kombëtar, që u shemb nga regjimi si…
Realiteti sot është shumë larg shfaqjeve të propagandës, që edhe në këtë periudhë krize kjo qeveri e gjen si zgjidh… 
Aftësia paguese e qytetarëve ka rënë me 37%, shifër kjo që tregon se është rritur drejtpërdrejt pamundësia e tyre p… 
Ështe irionike por e vërtetë. Ju nuk shikoni policë për lehtësimin e trafikut, por janë aty për shitësit ambulantë;… 
Polica bashkiake shumë larg misionit të saj që të lehtësojë jetën e përditshme qytetarëve. 
 7 vjet premtime të pambajtura, dhe përsëri vazhdon të bëjë të tjera. 
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
➡️Taksë e sheshtë 9%.➡️Biznesi i vogël deri në 14 milionë lekë të reja në vit do të paguajë 0.5 % të xhiros vjetor… 
Në mungesë totale të vendeve të parkingut ose të qëndrimit për të bërë furnizimet e nevojshme.Përveçse nuk ju shë… 
Bizneset në rrugën Myslym Shyri, drejt falimentit.Ndërkohë që u "investua" në korsi biçikletash,  dhjetëra biznes… 
Jo vetem nuk investon që t'ju shërbejë qytetarëve, por çdo ditë vështirëson jetesën e tyre.Sipas "vizionit" që ka… 
Nuk mund të ishte ndryshe veçse, Bashkia e Tiranës këtë herë surprizon me rrugën e Durrësit, që tani ka vetem 2 kor… 
Në vend të këtyre shfaqjeve, si një shtet normal duhet të merreshin masa reale, shembull i thjeshtë është Kosova, q… 
Pas formularëve të vetëdeklarimit të shëndetit, suksesi i rradhës i MASR është "zbatimi me përpikmëri" i distancimi… 
 Çfarë e detyroi Edi Ramën të shkelë edhe premtimin kundër kumarit. Heshtja e tij për të dhënë shpjegime për këtë çështje…
Kur hyrja në Tiranë të kthehet në sfidën e vitit. Ndërkohë bashkia të gjithë fokusin e ka tek "pylli orbital i beto… 
Vetëm pak ditë para fillimit të procesit mësimor ( i cili nis pa një plan të qartë dhe të zbatueshëm masash), mësue… 
Një mësues në Shqipëri jep mësim për mesatarisht 17 nxënës, duke qenë kështu ndër stafet më të ngarkuara arsimore n… 
 ...e ndërsa bashkëpunimi ekonomik dhe politik natyrisht i prijnë njëri tjetrit, është realiste të themi se përfituesit e v…
 Personalisht dhe në emër të Partisë Demokratike përshëndes marrëveshjen e arritur mes delegacioneve të Kosovës dhe Serb…
Kjo është Tirana që shikojne ne Bashki çdo dite. Tiranën e photoshop-it dhe të propagandës.Ju duket Dielli si lej… 
Ironia është që këto "punë" vijnë si një "dhuratë" për fillimin e shkollës, me trotuarë "kantierë", me rrugë plot t… 
Të kesh në fokus qytetarët dhe të punosh për t'ju ofruar atyre lehtësi në përditshmëri është një gjë krejt tjetër n… 
 do ti japim frymëmarrje ekonomisë për të sjellë investime, mundësi punësimi me të ardhura dinjitoze dhe jetë më të mirë…
 tërheqëse për investime. Vendit sot i duhet një model i ri ekonomik, me taksa të ulëta,mbështetje për sipërmarrjen, sti…
 Raporti i fundit i EuCham që e rendit  ndër tre vendet e fundit në  për të bërë biznes, konfirmon qartë se kjo qeve…
Në vend të korsive të Biçikletave do të ishte e udhës që Bashkia të bënte korsinë e Betoniereve, sepse ky është vizioni që ka!
 Rama frymëzoi, promovoi dhe kandidoi për deputetë dhe kryetarë bashkie njerëz të lidhur me krimin. Të përzgjedhurit e tij…
Të prekurit e parë, nga vendimet e kësaj qeverie që nuk ka ofruar asnjë ndihmë, janë pikërisht bizneset, të vetëpun… 
Pandemia Covid-19 shton edhe 57 mijë të papunë dhe mbyll 32 mijë biznese në vend.Çdo familje shqiptare po vuan pa… 
Kukësi një ndër qytetet më prioritare të rilindjes. Nëse të gjithë kanë nga një "investim" në 3D, Kukësi ka 2... 
Duke u përballur çdo ditë me pa barazi të mëdha; rritje e çmimeve, rritje e pagesave të qirave, rritje e kostos së… 
Qytetarët shqiptarë punojnë më orët më të gjata të punës krahasuar me vendet e tjera të Europës.Por pavarësisht kë… 
Por kurrsesi këta punonjës nuk shikojnë ata që vendosin bidonat në rrugë për të zënë vende parkimi apo ata që kërko… 
Na ka ndodhur që në përditshmërinë tonë të parkojmë makinën në Tiranë; për të bërë një pagesë në postë, për të marr… 
 Po ta përsëris Edi Rama, bëj transparencë e mos u fshih pas gërrvërreve bajate. As servilët e fundit që të kanë mbetur…
 Leri dërdëllitjet prej rrugaçi Edi Rama. Bëj transparencë çfarë po ndodh me negociatat për detin. Historitë me sapun ru…
Kjo është pasoja e drejtpërdrejtë e "qeverisjes nga fb" dhe mos pasjes të asnjë strategjie dhe plani konkret për pë… 
28 subjekte në ditë kanë ulur qepenat vetëm gjatë muajit korrikut.Mijëra familje kanë humbur të vetmin burim të a… 
Pasojë e këtyre vendimeve pa një plan të mirëfilltë është kjo pamje, sesi realisht po zhvillohet mësimi; me salla… 
Edhe sot 5 muaj pas ndërprerjes së procesit mësimor, pa një plan specifik që ju përshtatet kushteve në të cilën jan… 
Ndryshime do ndikojnë negativisht dhe në skemën e pensioneve, tregut të punës dhe ekonominë në tërësi.Në 7 vite k… 
Në vitin 2050, numri i konsumatorëve që janë mbi 65 vjeç do te jetë sa gjysma (49%) e numrit të punonjësve të të gj… 
Mbi 15 mijë familje janë larguar nga skema e ndihmës ekonomike në 5 vitet e fundit. Përveçse është bërë 0 përpjekj… 
0 mbështetje i është ofruar Bujqësisë, sektor me kontribut të rëndësishëm në ekonominë e vendit dhe në punësim, si… 
OBSH analizoi se sektori i Bujqësisë përveçse u përball me vështirësi të fuqisë punëtore, të rrjetit të furnizimit,… 
Ato pak biblioteka që kanë qenë, kanë 0 vëmendje dhe interes për të qenë në planet e Bashkisë, për t'u pasuruar me… 
Ndërtime kullash pafund vitet e fundit në Tiranë, por asnjë bibliotekë!Në kryeqytet jo të gjithë njësitë administr… 
Eurostat renditi qytetet e Gjirokastrës, Beratit, Dibrës dhe Kukësit, me rënien e popullsisë nga më të lartat në Eu… 
 Njerëz të braktisur nga një qeveri e dështuar. Turp!                           
Qindra shqiptare presin në rradhë kilometrike në Kakavijë, pa asnjë informacion apo orientim!Kjo qeveri shfaqet s… 
Tiranë 2020Faturat e kripura, nuk janë mjaftueshëm për premtimin "ujë 24 orë"!Qytetarët në këto ditë të nxehta e… 
Dita Ndërkombëtare e Rinisë i gjen të rinjtë shqiptarë pa një alternativë, pa një mundësi për të ndërtuar të ardhme… 
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
8 gusht 1991, dita kur anija shqiptare e mallrave Vlora, mbërriti në portin e Barit, e tejmbushur me refugjatë nga… 
Falë "vizionit" dhe "punës" së Bashkisë kjo është situata aktuale përtej kamerave të propagandës. Ujë 24 orë për… 
Urbanizimi pa plan, ndërtimet pa projekte po shkatërrojnë qytetin.Tirana e betonizuar nuk i shërben as qytetarëve,… 
Krejt e kundërta në vendin tonë, premtimet boshe për t'ju dhënë 1000 euro shtesë personelit shëndetësor, që ka qenë… 
Qeveria e Kosovës ka miratuar sot një shtesë prej 300 euro për personelin shëndetësor, të ekspozuar drejtpërdrejt r… 
 ER i ra maska! Prano hapjen 100 % të listave dhe tërhiq amendamentin e njëanshëm të tmerrit tënd nga koalicioni opozitar…
Shemb Teatrin Teatri Kombëtar u ndërtua në vitin 1939, u cilësua nga Europa Nostra si shembull i arkitekturës mod… 
 Shqipëria në krah të Kosovës me diplomacinë e saj dhe në koordinim të plotë me partnerët tanë strategjikë &amp;, dha gj…
 10 vjet më parë GJND konfirmoi se shpallja e pavarësisë së Kosovës ishte në përputhje me të drejtën ndërkombëtare. Sot…
 Sa herë hap gojën, Edi Rama gënjen për qëllimin e vërtetë të ndryshimit me urgjencë dhe në mënyrë të njëanshme të Kushte…
Me qeverisjen nga FB, që primare ka penalitet dhe jo ndihmën. Shumë shpejt do kemi falimentimin e shumë bizneseve.
Në më pak se 2 vite nga inagurimi i invesitimit tek Zogu i Zi. Kujtohen që kishin "harruar" të vendosnin tubat për… 
 Fatkeqësisht, fjalët e Borsellinos janë akoma të vërteta për vendin tonë. Beteja me mafian duhet të fitohet për ta bërë…
Shembull i demokracisë, zhvillimi i zgjedhjeve në Republikën e Maqedonisë së Veriut dhe fitore historike e partive… 
...erdhi me alancën e "qelbësirave" dhe po ikën me atë të turpit...
Para rreth një shekulli Bashkia kishte në fokus pastrimin e rrugëve, tani ka në fokus "pastrimin" e imazhit! 
 Ndarja nga jeta e dr. Hysni Shkjaut është një dhimbje e madhe për familjen dhe miqtë e tij dhe një humbje e pazëvëndësu…
Mirënjohjen për ndihmën dhe përkrahjen në kohë të vështira. Happy Fourth of July!  
Në ditët më të vështira, qeveria ofroi 0 ndihmë për turizmin, një ndër sektorët më të goditur dhe sektorin më të rë… 
 Sot pata një bisedë telefonike me  Ministrin e Jashtëm të Italisë, Luigi Di Maio. E falenderova për ndihmën e madhe që…
 Mbi 30 mijë mësues do të përfitojnë nga taksa jonë e sheshtë 9%. Në qeverinë e kryeministrit  TË GJITHË d…
Në 7 vite janë larguar minimalisht 515 mjekë nga vendi ynë!Ky është përfundim i raportit të Institutit të Vienës p… 
 Taksa e sheshtë 9% dhe plani ynë ekonomik do të inkurajojë investimet e brendshme dhe të huaja, do të nxisë punësimin d…
 "Taksimi Rama" zbrazi xhepat e  shqiptarëve, rriti çmimet, uli fuqinë blerëse, falimentoi bizneset dhe solli shkatërrim…
 Çdo vonesë dhe zvarritje në emërimin e gjyqtarëve të GJK vonon daljen nga kriza politike dhe mban mbyllur dyert e BE pë…
 Ushtria Çlirimtare e Kosovës luftoi për liri përballë një agresori që nuk kurseu asgjë, nga genocidi tek sprastrim etni…
Transporti publik është një ndër sektorët më të prekur nga kriza e COVID-19 dhe njëkohësisht pa asnjë mbështetje ng… 
Çeshtje vizioni qeverisës për kulturën, për shpirtin e një populli...Teatri Kombetar në 1939 dhe në 2020! 
...në 7 vite e vetmja rritje që solli Rilindja ishin kushtet e BE-së. E mori me 3 dhe sot jemi me 15 kushte të reja… 
Sipas raportit të publikuar nga Eurostat Shqipëria është sërish vendi më i varfër në rajon.Familjet shqiptare kanë… 
Nisja e sezonit turistik në Shëngjin dhe Tale! Kjo është strategjia për Turizmin. 
Varfëria ka prekur çdo familje shqiptare.Këto janë efektet dhe "sukseset" e qeverisë në 7 vite! 
 Nëse Rama do të kishte bërë testime si në çdo vend tjetër, ne do ta dinim ku dhe si po përhapet koronavirusi.  E kam ng…
 Babëzia, arroganca dhe shpifja janë trinomi i pandarë i RAMAVIRUSIT që prej 7 vitesh i ka shtyrë shqiptarët drejt shpun…
"Ne do ta çlirojmë biznesin nga taksat e rritura tash 7 vjet e të cilat kanë shkuar ne xhepat e një g… 
 Si kërcënohen mësuesit me sms nga Drejtorët e shkollave.Ai polici që dhunon gra e burra, gazetarë e artistë nuk e mban…
Qytetarët e kanë identifkuar dhe e njohin "problemin"! Tashmë ata janë të bindur edhe për zgjidhjen.… 
Sot Kosova feston 21 vjetorin e Çlirimit,data 12 qershor e vitit 1999.Falenderimi dhe mirënjohja shkon për partne… 
 Me Presidentin e Kosovës  biseduam për zhvillimet aktuale &amp; ato të pritshme në Kosovë.Forcimi i shtetit…
 Në ditët më të vështira për shqiptarët, kur xhepat janë të zbrazur dhe varfëria po rritet çdo ditë, Edi Rama përdor dhu…
Përmbytet Librazhdi dhe Berati shpat mali vetëm falë "historisë së suksesit" të rilindjes urbane.
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
Nuk janë betoniere por "makina me fidanë" për "pyllin orbital"!Nuk ka nevojë për asnjë raport për të treguar të v… 
A ishte vërtet në interesin qytetar ky investim?Të gjithë e dimë fare mirë situatën e infrastrukturës në çdo lagj… 
 Një e dielë e veçantë për nënën time dhe një nga ditët më të lumtura për mua, vëllain tim dhe babain tonë, tek i uruam…
 Sot, në oborrin e familjes Petrela, një nga më të vjetrat në Tiranë, duke biseduar jo vetëm për hallet e tyre sot nga e…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Në emër të Opozitës së Bashkuar ju shpreh falenderimet tona aleatëve dhe partnerëve tanë euro-atlantikë për ndihmën dhe…
 Konsolidimi i shtetit, integrimi euroatlantik, mbrojtja e integritetit dhe sovranitetit të Kosovës, janë sfidat, përbal…
Shqipëria është më e madhe se parku Rinia në Tiranë.Realiteti është një, familjet shqiptare po rrisin fëmijët në… 
===