Ati është në të djeshme...Të gjitha të djeshmet janë të parishkelshme,Në asnjë prej tyre nuk rikthehesh dot kur… 
Asketit i shkojnë të gjitha elegjitë, por më së shumti si lëkurë i ri heshtja.
Botës së sotme i duhen dy elegji tronditëse: njëra për humbjen e ndjeshmërisë së madhe njerëzore dhe e dyta për tra… 
Sa i tmerrshëm është koncepti dhe projekti putinian për denazifikimin e Ukrainës! Tejkalon  procedurat naziste. Bot… 
Ai burri i heshtur që iku në padukshmërinë e përjetshme, la një det me sjellje të drejtë Njeriu. Tani do jetoj me d… 
Bota e tradhëtoi detin!Nuk ka më asgjë prej kaltërsie, humbi krejt epikën e stuhisë, zezoi shpirtin e bukur të var… 
Një komb si ky yni, do ta ushqejë shpirtin e vet më shumë me personalitetin e të ikurve dhe sot më pak me të paktët… 
Në një sqep pulëbardhe unë shoh lakminë e një bote tjetër jashtë nesh, për detin. 
ArtistiAi besonte se graviteti i këngës e linte në hije atë të Tokës. Lidhja e shpirtit me këngën ishte martesë e… 
Kur konsultohej në ditën e 75 vjetorit të ditëlindjes së tij me arkitektin, për memorialin e Grupit të Pilurit. Një… 
Vetëm në thellësi të njeriut mund të flerë një heshtje si natë e bukur. Ndërsa nata e bukur në natyrë, nuk ka thell… 
Në fjalën publike njeri, mbështetu mbi këmbët e përgjegjësisë për korrektesë dhe estetikë ligjërimi, sepse je në sy… 
Të gjitha ditët e shkelura janë prag i ditëve që s'mund t'i shkelësh.
Lëngatat e një populli të gjakuar aq tmerrësisht si ukrainasit e sotëm, kanë vulosur qenësinë e një kombi ukrainas.… 
 Më fal!  Në 2020
Të gjithë ambasadorët e BE-së në Shqipëri në raportet e tyre periodike të nisura nga Tirana, flasin për një vend me… 
Intervistë nga Akri Çipa
Gjithmonë e kam menduar se për Gjon Shllakun shqiptarët do të duhej të kishin materializuar me kohë një mirënjohje… 
Vuno, fshati " që e ka historinë me kate", siç thoshte im At. Këtu bisedat kanë një humor të qelqërimtë dhe në pak… 
Protesta disa ditore në sheshin kryesor të Shqipërisë e ka ulur në gjunjë qeverinë, por nuk kapitalizohet për kryet… 
Kjo ngjau në PilurKish kohë që bora nuk bënte vend për gjurmë,Dhe gjurmët në të bardhë nuk dëshmonin ecje. 
Kujtesa është sfidante e përhershme e kohës që vetëm vdes dhe vjen.
Zëri qiellor i këngëtarit pa një këngë të vetme është magjia e një uniku shqiptarKëtë zë, e zgjodhi Doktor Flori t… 
Është e vërtetë që rusët i kanë quajtur dhe i kanë ndierë si vëllezër ukrainasit. Kështu ka ngjarë para 11 ditëve.… 
Njerëzit vdesin, shoqëritë ndërrojnë, qiejt dhe Atdheu nuk vdesin. Ukraina nuk vdes dhe Rusia do të vuajë plagosjet vijuese të Ukrainës.
"Cari" që po gremis Rusinë dhe po shkatërron EuropënNga Aleksandër Çipa
Driteroi tek " Lypësi i kohës" 
Njerëzit që e kanë shtëpinë përballë malit, e ushtrojnë intelektin përmes imagjinatës. Ata që e kanë përballë detit, përmes horizontit.
 Në kuptimin eufemik e kisha, pasi Rusia e artit dhe kulturës, nuk ka lidhje me krimin i luftës dhe të mar… 
Ukraina me qëndresën e vet, po i jep leksionin unik botës sonë të sotme. Një popull që lufton për Atdheun e vet, me… 
Kur gazetari i nis pyetje politikanit për t'ia bërë politikanit tjetër, atëhere gazetaria, që ai përfaqëson, quhet parapolitike.
Kur brezi i ri i artistëve heq shiritin e zisë për Poetin e Pilurit.(Traditë unike arbërore) 
Zogjtë shtojnë një fluturim, kur tërmet ka Bota.
Gëzuar 80 vjetorin, aty në qiej Lefter Çipa! " Edhe rrushi që të piqet/ kërkon një behar të tërë/ dhe dy zemra q… 
Ildise ndërgjegjen me frymë dhe fije lirikash, të zotërosh artin e dashurisë për jetën njerëzore.
Mos i bëj zhurmë natyrës! Jetoje qetësinë e saj! 
E kujt i duhej provë e dhimbjes për ikjen tuaj të njëkohshme, babë e bir, Arben dhe Denis Duka?!?!! Na latë në varf… 
 Isha në Pilur tek Ati.
Për t'u afruar ku fle një burrë, nuk të  pengon madhështia e natyrës kurrë. 
Nga libri im : Krishti dhe unë 
Në akull fshihet vlimiMë thyhet trishtimi me gaz të një syri,në akull të shpirtit,fshihet vlimiNga libri "Zhurma e qetësisë"
Dy zotërinjë që më kanë vendosur në mes në këtë foto, janë dy emra të mëdhenj të kinemasë shqiptare. Janë të rrallë… 
Në kufijtë e çdo Atdheu, atdhedashuritë janë më të maturuara se kudo.
Kaos i çmuar që më je rregulli im/Në ty, koha e pafund vlen sa një shkurtimë... 
Një sinonim i rrallë: JashtëneshiNë Pilur përdoret një fjalë e rrallë si sinonim i fjalëve: Djall, Hije, Fantazmë… 
Busti i Poetit Lefter Çipa në Artgalery të qytetit të Fierit.Urime skulptorit, artistit Mikel Temo! 
.....***......E përjetshmja është e fshehur tek njeriu,/Që del e shpallet botës si një vlerë./E përkohshmja është… 
Prindërit.....Ngarkohem heshtje në kohë perëndimi të tyre,Veshur i gjithi me trishtim të qelqtë si loti.Prit… 
Atje tek zjarri mungon vargu i tij: " Unë e zjarri të dy bashkë, jemi duke kuvenduar..."Por Ti, në pikëllimin tënd… 
Kryembushuri i kombit Fan Noli, sot ka ditëlindjen. Përjetësia përshëndetet, nuk urohet. Mendjelarti  Noli ynë,/k… 
Se kur çel e shton fidani/e merr shtesë ndërgjegjia jote/ do ketë dritë e jetë vatani/shenjë e vlerë e kësaj bot… 
Dielli një fashë dritë hodhi mbi det/ e kaltra me të bardhën bëri pasqyrë/ Kalaja e Vasiliqisë në ishull bëri profi… 
Gëzuar Vitin e Ri 2022!Koha që na vjen përparaNjëzet e dy ka për emër,Të gjitha ditët i pastë të mbara!Këtë ur… 
Petro Markos Nga Jamarbër MarkoQytetin e fundit E vendose pranë detit Të gjeje të ardhëmen Me duar fëmijeQi… 
Me një gur në shpinë të mendjes udhëtojmë kudo: Është vendlindja.Me një qiell në hapësirë të mendjes, jemi përherë… 
Gjyshërit na thanë se jetuan në kohë të Luftës. Prindërit në kohë të punës. Ne jetojmë në Kohë të vaksinave. Në ç'k… 
Krishtlindjet kanë në zanafillë të tyre një lindje providenciale; e pakrahasueshme. Prej atëherë lindjet janë e ard… 
***Nga balta që të spërkat në rrugë e sipër,Nuk merr ndotje dhe thelbi yt nuk preket,Në të gjitha udhët lehjet… 
 Mohimi i masakrave si kumt i zymtë revizionist i Serbisë
E kam hapin të vogël për distanca të shkurtra, e kam dëshirën të përhershme për distanca të largëta.
 Më 11 dhjetor 1947, në Bukuresht të Rumanisë ndërroi jetë Aleksandër Stavre Drenova, i njohur si ASDRENI, një nga poetët më…
Serbia ka shpërndarë një dokumentar si opcion të vetin, të përkundërt me atë të vërtetë që njohu Bota si masakër të… 
 Sot në një intervistë për vizitën e Zv. Ndihmës Sekretarit Gabriel Escobar dhe ofensivën amerikane  në luftën…
Të gjitha provat shkojnë si dëshmi e plakjes dhe humbasin si shans për rinim. Dialektika është pasqyra më e saktë e… 
 Faleminderit për reagimin ndaj gjuhës në poezinë time!
Dy ditë që lëviz nëpër zona periferike të trojeve amtare. Më trishtojnë, deri në pikëllim të thellë, pamje dhe gjen… 
Elita nuk është ajo që mundëson inflacionin e fjalës në publik.(Jo gjithmonë fjala në publik është fjalë publike).… 
Ëndrrat kanë vendlindje gjumin.
"Nuk ka për të patur kuvend të PD që shqyrton vendimet e qeverisë amerikane",-. Më shqip nuk mund t'i thuhej Bashës… 
Një mesazh epifanik prej Atit tonë, Lefter Çipa, për artin dhe këngët e Atdheut tonë.
"Jemi popull që lotin e kthejmë në këngë dhe këngën kurrë nuk e kthejmë në lot. Kjo është forca jonë" Lefter Çipa 
 Mbi "Open Balkan" dhe zhvillimet e ardhshme në rajon.
Ju e dini se pas çdo nate, porta prej nga hyn dita,/është një e vetme,- agimi./Besoni se në sy të njerëzisë,/Çelës… 
Është shumë e vështirë beteja e njeriut, mes planifikimit dhe spontaneitetit. Programimin e bën njeriu, planifikimi… 
Për me qenë poet, duhet të jesh krenar,- thotë Ernest Koliqi.
Tehut të fjalës, pa pretenduar lëndim... 
Sa për ty Sokrat, që shan/ Perënditë shtetërore,/Dhe përhap ide të reja/Dhe zgjon masat popullore/Thonë se do të dë… 
Jeta është kohë dhe shpirt. Mbushi të dyja njësitë me më të mirën gjë që ke. Të parën me punë dhe gjurmë, të dytin… 
Faleminderit zonja Lindita Nikolla, Kryetare e Kuvendit të Shqipërisë për praninë dhe fjalët-mesazh për gazetarët d… 
Nuk ia dola dot kurrëT'i bëj portretin armikut,Asnjëherë s'e pashë plotësisht,Asnjëherë nuk mu shfaq tërësisht.… 
Me të madhin Birçe Hasko i cili më thotë në këtë të dielë: 400 lek për të ardhur me autobus. Asnjë lek për t'u sjel… 
Unë dua të dua si me shpirtin e Nënës dhe të flas si me gjuhën e Babait.
Tek Preçi, për librin poetik, i saposjellë prej tij: "Një e tretë, Dashuria" 
Unë e kam parë detin të qajë/ kur në breg të tij ka ndalur dallga. 
Pema e zogjve që pranojnë vjeshtën, në Sarandë 
Shtëpia e Poetit me flamur në Himarë 
Shtëpia e Poetit me flamur në Himarë 
Sot artistja shkodrane dhe nuse e Bregut, fantastikja që udhëton përditmërisht me sqimën dhe mirësinë e artistes së… 
Jam një gur i vogël, për shkak të Diellit, as i ftohtë, as i ngrohtë. Dua të dëshmoj, me heshtjen time prej guri, s… 
Në frymë mund ta ndjesh detin dhe në gjumë ta shohësh, malin Por njeriun mund ta shohësh dhe provosh vetëm në jetë.
Në thellësinë e dukshme fshihet.Vetmia e njeriut prej njeriut.  Nuk mërgohet në vise të tjera,/Por tek qenia e tij.
Ka mijëra vjet që thuhet, në libra dhe çdo profeci/ se shpirtrat ngjiten edhe mbesin/ kur trupi tretet, bëhet hi. K… 
Njeriu është kohë dhe tejkohë. Është kohë, si qenie e mishtë, me afat të përcaktuar ekzistence. Është tejkohë kur b… 
Sa më shumë kalon koha nga dita e ikjes së të dashurve tanë, aq më shumë na dhemb ikja e tyre. Kur vjen koha e ftoh… 
Ekzistojnë tejkaluesit për çdo gjë dhe në çdo kohë.
Dhe kur hyn në ditët dimërore dhe të shirta, njeriu si ai sqepi i kthyer nga vetja i shqiponjës, më shumë flet me v… 
Rrugët e fitimit dhe formimit të ndërgjegjes janë të shumta, por ndërgjegjia kur është, shfaqet dhe dëshmohet si e vetme.
Qiejt e bukur do të jenë të tillë dhe për njerëzit e ardhshëm. Dhimbjet njerëzore kanë për të qenë dhe për njerëzit… 
Ky është mermeri që mban emrin dhe eshtrat e Neço Muko Marjotit, poetit të përjetshëm të polifonisë dhe poezisë him… 
Si një Hënë e jetës po mpaket Nëna ime/ dritë e verdhë e saj më bën lot në sy/ tej në skaje ardhjesh fshehur At i i… 
E vesh dhe e mbath përditë mungesën tënde, por askush ndër të njohur, nuk më thotë sa trashë jam veshur!
Në një tunel padrejtësish po shtyhet turmë e njerëzisë/ në horizont të mbyllur ec, dhe ngricë të terrtë ka për këmishë...
Artistët e vegjël devollinj në vallen e Osman Takës. 
Kur qytetit i ndryshon një rrugë, atëhere banorët janë në trishtimin e ikjes nga trashëgimia.
Në Turan. Në paraqitjen e librit autobiografik "Rikthim në vendlindje" të Prof. Ethem Ruka. Një ditë me emocione dh… 
Rëndom e humbet njeriu rrugën, por kur rruga humbet njeriun, shndërrohet thjesht në vijë gurësh.
Në PilurNjë vetëtimë që bëri dritë në Pilur,Mori një këngëT'ia çonte Zotit.Retë e fshehën përkohësisht, atë frymë.
 Në dijeninë time ka një deklaratë zyrtare të Minisyrisë sonë Për Europën dhe Punët e Jashtme
Heshtja e shteteve të rajonit dhe e Brukselit apo BE, për sjelljen arrogante ushtarake të Serbisë ndaj Kosovës ësht… 
 Skepticizëm për Agjencinë e Informimit. Dilemat për strukturën dhe funksionin: Kthim pas në kohë  via…
Vetmi nateE madhe errësira në këtë natë,më shumë se disa perandori së bashku.Heshtja sa një regjim mbinjerëzor.… 
Niko Nikolla ka qenë kryeredaktori jetëgjatë i revistës së vetme humoristike e cila inkurajoi dhe mbështeti shkrimt… 
Poradeci: Zgjohu poet se natyra sot, si lot kristal e bëri veten në pritjen për ty. 
At dhe bir, Aleksandër dhe Akri Çipa në një panel analize: Merkel në lamtumirë nga Tirana tek "Shqip". 
Tek ky libër është dhe ky varg:"... Ka mbulime që e shtojnë ftohtësinë..."! 
Mbretëron prezencaKoha jote e ndarëNë dy kohë të tjera.Koha e vërtetë,Mbetet vetëm Vetja. E ndoqe flamurin,… 
Errësira është imazh i thellësisë së pafundme. Sytë janë pasqyra e thellësisë që e shton sipas shikimit. 
Me hap dhe përkulje drejt së shkuarës së nderueshme, me të njëjtin gjak dhe frymë gjenealogjie. E ardhmja s'është d… 
U ngrit në qiell Një lot u ngrit në qiell,Dhe deti u kthye përmbys..Dallgët i mori nën vete,Natyra ndërroi fis… 
 Në një bisedë me  në  për samitin Biden-Putin si dhe, më gjerësisht, për impaktin e turit në…
Natën përdore për të shtuar ëndrrat / Aleksander Çipa 
... Më jep, së paku, vrull mëria!!
 Shkatërrimi i raketave të Hamasit, Akri Çipa: Sistemi “Iron Dome”, një bashkëpunim Izrael-SHBA…
Nuk ekziston mbushja prej kujtimesh dhe boshi pa ato nuk gjendet kurrë.
Nuk ekziston mbushja prej kujtimesh dhe boshi pa ato nuk gjendet kurrë.
 "Fantazmat e lëvizjeve të kufijve aviten përsëri në Ballkan. Më pak se një vit pasi u përmbyll zhurmnaja në lidhje me dialogun…
Gjuha e trupit të liderëve politikë në këtë fushatë elektorale.
 "Një debat i ekzagjeruar ka dominuar diskursin publik në Kosovë këto ditë në lidhje me hapjen e ambasadës në Jeruzalem në vazh…
 Çfarë e shtyu kryediplomatin e BE-së të udhëtonte drejt Moskës? Përse preferoi të injoronte mesazhet skeptike për këtë veprim?…
 Për boshllëkun e retorikës së Bashkimit Europian dhe politikën e jashtme pa bosht strategjik.Poshtërimi i shmangshëm i Mosk…
 "Vendosja e marrëdhënieve të plota diplomatike me Izraelin shënon një nga momentet më të rëndësishme të diplomacisë së Kosovës…
Ben Okri///I këndoj një lirie të re//I këndoj një lirie të re/lirisë me disiplinë./...Qëndro besnik ndaj vetvetes/… 
 Lënia në harresë e shqiptarëve të Luginës së Preshevës është një mëkat i madh që nuk duhet të rëndojë më mbi politikëbërësit…
 Ju uroj nga zemra te shkuara dhe sherim te shpejte i dashur Kryetar! Miqesisht, Sandri
 Javën e kaluar i ftuari jonë  vazhdoi diskutimin me ne rreth lidershipit në media.Një lider duhet të zotërojë…
 Ne kete rast po ndjekim logjiken e  problemit te shtetit si e drejte e dyfishte; dhe shteterore, dhe kombetare.
Nëpër shkollat e frikës udhëton njerëzimi jetë pas jete dhe universitet për Frikën nuk bën kurrë.
 AtdheuAtdheu im i vogël,Nuk u lodh kurrë  nga bëmat.E bënë me gjak e mundim idealistëte ndukën si qeverisës ...Hie…
 Një intervistë në lidhje me zhvillimet në Uashington: çfarë u arrit dhe çfarë mbeti pezull në atë (mungesë) marrëveshjeje.ht…
Në kishën pa prift besohet më tepër/Se prifti, së pari është njeri që kollitet...!
 Kujdesuni për veten dhe për të tjerët me Hap-pas-HapiShkarkimi aplikacionit nëApp Store: Google Play…
 Viti 2021, viti i shkollave të reja!Shkolla e re te rreth-rrotullimi "Shqiponja" do të mbajë emrin e Andrea Stefanit.…
Nën shiKjo rrjetë e ujtë shiu na mbylli veçmas sot.Si një diktaturë që nuk e luftojmë dot.Po shoh filxhanin ti… 
-Me ndershmërinë e një përralle/ ushqehen poetët... Fatos Arapi
Kohë pakënaqësishKanata pakënaqësish janë ditët tona,ku nuk vlen hyrja dhe as dalja si në dhoma.Kanatë mërzish… 
Minoritetit nuk i përmendet kurrë privimi, për të mos qenë kurrë shumicë.
Horizonti dhe e Ardhmja janë territore të dilemave dhe të së panjohurës. Të parin do ta shkel utopikisht përherë, t… 
Ah!!!! Në vendin tim gjen ministra që e mbyllin urimin me pikë dhe jo me pikçuditëse ne fund.(!!!!)
Çfarë dedikese e At-krijuesit tim për Vlorën! Një kujtim i përjetshëm për familjen tonë, nga dita kur Vlora e ndero… 
Të paktën shkruajeni shqip, siç e ka shkruar Im zot Fan Noli: Shën Sofi!!!!! Mos e shkruani ne gjuhën e tjetërkujt.
Zgjedhjet janë një grackë për budallenjtë. Kipling
Bota është kaq e bukur! Njeriu veçanërisht është aq i bukur, sa një univers. Ndoshta u tregova i kursyer!!!! Nj… 
Dyshoj si i verbërAleksandër ÇipaBota është një, e re dhe e vjetër/(Fetë iluzivisht na përshkruajnë një tjetër… 
Vlora, kryeqendër e kaltërsive dhe e unit njerëzor. 
Sa barrë e rëndë mendimesh në sytë e fytyrat e njerëzve në këtë mëngjes! Një eksploziv buzëqeshjeje do të doja të h… 
Sikur, (ama sikur?!!!) të ndodhë kryengritja e të heshturve, do të fitojë sadoqoftë, dëgjesa e të maturve.
AtdheuAtdheu im i vogël,Nuk u lodh kurrë  nga bëmat.E bënë me gjak e mundim idealistëte ndukën si qeverisës ...Hienat.
Nën qiejt me shiQiejt janë piktorë surealistë,I krijojnë gjithë imazhet që s’i shpik dot njeriu.Nën ta, nën re… 
Në ç’kohë, ç’vend dhe ç’mjet së prapthi e bën udhën Sanço?!?! Stacioni i gishtit arrihet vetëm me orën kokëposhtë t… 
Çështja e Teatrit Kombëtar është një  premierë e pambyllshme, prej së cilës goditjen jofitimprurëse  e pëson vetë r… 
Atdheu ynë listohet, qysh kur nuk dihet, si vend i prapambetur. Ky përcaktim i ka hequr mundësinë e mburrjes çdo qe… 
 Fondi  hap thirrje të reja për gazetari investigative ndërkufitare: 1 milion euro për projekte në Europë për vit…
Popujve demografikisht të mëdhenj, u falet të mos ta kenë shkollën e atdhedashurisë të hapur dhe funksionale për çd… 
 Dita Botërore e Lirisë së Shtypit përkrah veprime që nxisin gazetarinë e pavarur. Sepse shtypi i lirë &amp; i paanshëm ngr…
Perceptimet dhe dëshirat e turmave popullore, imazhin më të rremë, kanë atë për drejtësinë që premtohet se do të ndodhë.
Ndërsa revolucionarët e përmbysin sistemin, shërbëtorët e kalbin atë.
Njeriu nuk ka ardhur në jetë të administrojë përhershmërinë, por përkohësinë e tij.
Në shekullin XXI, shteteve ju ra "maska" kur u gjendën në paaftësi për të pasur apo blerë maska anti-virus për mjekët dhe infermieret. (!)
===