Qoftë ky vit i mbarë për tërë Shqiptarët dhe Komunitetin Musliman brënda dhe jashtë Shqipërisë. Urime Kurban Bajram… 
All-llahu e ka nderuar këtë ditë me falje dhe begati dhe i ka dhënë vlerë të madhe. Për këtë Muhammedi (a.s.), i dë… 
Përgatitjet në vend janë të paimagjinueshme për Festën e Kurban Bajramit në Komunitetin Musliman kto ditë në Shqipë… 
Flijimi (therja e kurbanit) jo për Allahun e lartësuar  via 
Lutje për Deçanin. O  ndihmoj vëllezërit dhe motrat tona në çan të Kosovës nga ky rast i rëndë të helmimit… 
“Sikur të kishte dashur Zoti yt, nuk ka dyshim se të gjithë njerëzit në tokë, pa përjashtim do të kishin besuar. A,… 
Ujoj që bashkëpatriotët tanë  kudo që ndodhen të mos ndjekin rrugën e keqe. Allahu i Mëshiroftë ata dhe ngushellime… 
Më vjen keq kur dëgjoj dhe lexoj lajme të atilla që të japin një imazh të papëlqyer kur dëgjojm për viktima njerëzi… 
Sulmi me 4 të vrarë në Vjenë, policia gjermane bastis shtëpitë e dy shqiptarëve të dyshuar si bashkëpunëtorë të gru… 
Je Ti që adhurojmë dhe Ti që kërkojmë ndihmë. El-Fatihah, Ajeti 5 
" është me ërthyerët. Kur të thyhet , është një gjë e mirë-thyerja është ajo që e hap zemrën për të… 
Atëhere ai person që i ka marrë  e tij si , do të thotë u bindet  të tij, u bindet epsheve të t… 
Dikur ishte Dyrrahu dhe sot Durrësi i Shqipërisë dhe thash të bëj një kujtesë për kët qytet kaq të bukur. Kur Dyrra… 
Që nga viti 1900 qyteti është përhapur në verilindje, larg pazarit të tij, i cili dikur ishte i rëndësishëm për shk… 
Sa kujtim i bukur ku qyteti i Shkodrës i vendosur në buzë të një fushe të gjerë të rrethuar nga male të larta dhe ë… 
I Dërguari salAllahu alejhi ue selem thotë: “Fjalët më të dashura për Allahun janë katër: subhanAllah, elhamdulilah… 
Nëse dikush humb besimin nga rruga e drejtë, është mire të mësojmë nga Sureja e el-Fatiha ku thuhet: "Rruga e vetm… 
të mos rrëshqas [nga e vërteta]e as të shkaktoj rrëshqitjen e dikujt; kërkoj mbrojtjen Tënde që të mos e dëmtoj ask… 
Shpreh një keqardhje tepër të madhe kur mësova për humbjen e jetës së këtyre të rinjve që u bënë pre e një grupi sa… 
“Grupet satanike kanë gjetur ‘parajsën’ në Shqipëri”/ Vdekja e mistershme e ekonomistit 32-vjeçar, gazetarja: U gje… 
Sa bukur kur kujtojm qytetet e bukura Shqiptare...."Për rreth e rrotullshpejt Kosovës i rashë,qytet më të bukur… 
Edhe pse bukuria qëndron në sytë e shikuesit dhe dashuria mbetet në zemrat e tyre, neve njerëzit duhet të falendero… 
Sa kujtim i bukur i Tiranës së vjetër dikur. Pamvarsisht se sot ka ndryshuar tërësisht kjo pamje por megjithatë ky… 
Kurani ka shumë ajete që na tregojnë për veçorit shkencore – gjeografike, të cilat e vërtetojnë se Kurani është me… 
Sipas vlerave dhe pasurive natyrore që gjinden në trojet Shqiptare, një e tillë është pema e ullirit dhe domethënja… 
Disa nga veçoritë e artit dhe arkitekturës islame: 
Motra dhe Vëllezër, ky është lajmërimi i Komunitetit Mysliman të Shqipërisë i cili njofton të gjithë besimtarët se… 
Kur drejtësia dhe reflektimi i saj janë në heshtje,i jep mundësinë atyre individidëve të anojnë nga udha e padrejtë… 
===