Fluturimi i parë hapsinor për turistë arrihet me sukses!
Trazira në Afrikën e Jugut! Ushtria zbarkon në terren!
Presidenti i Kubës i vë fajin sanksioneve të Washingtonit për mungesën e ushqimeve! 
Sipas Kombeve të Bashkuara 131 milion njerëz më shumë vuajnë nga uria!
Demonstrata në Havana për shkak të mungesës së ushqimit dhe rritjes së çmimeve
Serbia firmos marrëveshjen e tregtisë së lirë me Unionin Ekonomik Euroaziatik!
Zbulohen shifrat e frikshme të ikjes/ 207 mijë shqiptarë kërkuan azil në BE
VIDEO/ Çollaku: Rama ka refuzuar të dënojë gjenocidin serb në Kosovë për shkak të Vuçiçit
Lajmet nga Bota në Shqip      
Zjarri në fabrikën në Bangladesh lë të paktën 52 persona të vdekur! 
Disa persona të arrestuar për vrasjen e presidentit të Haitit!
Lituania fillon ndërtimin e gardhit me Bjellorusinë për të ndaluar emigrantët!
Biden i thotë Putin të ndërmarrë veprime për kriminelët kibernetikë në Rusi!
Greqia dhe Maqedonia e Veriut do ndërtojnë rrjetin e përbashkët të gazit natyror!
Çmimet e naftës rriten me 3 lekë për litër, hera e katërt pas hapjes së ekonomisë e dyta për 10 ditë
Lajmet nga Bota në Shqip      
Vazhdon përplasja në Irak mes Amerikanëve dhe milicisë pro Iraniane!
Sistemi shëndetësisë në Tunizi në kolaps nga COVID-19, mungesë shtretërish dhe oksigjeni!
TikTok do fillojë një program pilot ku përdoruesit kanë mundësinë të bëjnë një video CV! 
Organet e të drejtave të njeriut thonë që ka pasur dhunë të tepërt nga policia në protestat në Kolumbi!
Pas vrasjes së presidentit të Haitit, 4 persona ekzekutohen!
VIDEO/ Boiken Abazi: Pastrimin e vërtetë të krimeve të Serbisë po e bën Rama
Njohin pavarësinë e Kosovës 6 deputetë të Kuvendit të Serbisë, kryeministri Kurti i pret në takim
Parlamenti Kosovës miraton rezolutën për njohjen dhe dënimin e gjenocidit në Srebrenicë! 
Numri i të vdekurve nga COVID arrin 4 milion!
Luftëtarët talebanë vazhdojnë të avancojnë! 
Kina do përdorë teknologjinë e njohjes së fytyrës që ti ndalojë fëmijët të luajnë nga ora 22:00 deri në 08:00… 
Haiti në shtetrrethim pas vrasjes së presidentit në shtëpinë e tij private! 
Stefan Löfven riemërohet kryeministër i Suedisë!
Gjenden disa trupa të viktimave të përplasjes së avionit në Rusi!
Rezoluta për gjenocidin serb në Srebrenicë, Meta: Përgjegjësit të marrin dënimin e merituar!
Pekini i zemëruar pas deklaratës së zëvëndës kryeministrit japonez se "do të mbështesim Tajvanin me Amerikën në ras… 
Gjeten mbetje të avionit të zhdukur në lindje të Rusisë!
Arrestohet shkenctari politik gjerman me akuzën se ka bërë spiunazh për Kinën!
Punëtorët e metrove në Athinë në grevë urie për shkak të kushteve të punës!
“Minishengeni Ballkanik” ndan Shqipërinë me Kosovën në Berlin/ Rama në sintoni me Brnabiq
Hakerat kërkojnë 70 milionë dollarë për t'iu rikthyer të dhënat websiteve të cilat i hakuan dhe i bënë të paaksesue… 
Në Nigeri persona të armatosur rrëmbejnë 140 nxënës shkolle!
Shpërthimi i baltës vullkanike në Azerbajxhan bën që të marrin flakë puset e naftës dhe gazit aty pranë!
Talebanët vazhdojnë të marrin territor në Afganistan pas fillimit të tërheqjes së trupave të NATO-s!
50 persona humbin jetën në aksidentin ajror më të rëndë për Filipinen!
Japonia në kërkim për dhjetra persona të zhdukur pas rrëshqitjes së tokës në një qytezë!
Anulohet marshimi LGBT në Tbilisi të Gjeorgjisë pas protestave të dhunshme kundër marshimit! 
Franca i rikthehet bashkëpunimit me Malin pas kërcënimit terrorist në rritje!
Narko-policia/ Roli i truprojave të Tahirit në trafik dhe si fikeshin radarët për gomonet me drogë
Aleanca kërkon në SPAK arrestimin. Veliaj humbet qetësinë: “Janë hajvanë dhe budallenj”
Libani pas rritjes së çmimit të bukës do rrisë edhe çmimin e naftës!
Incident përplasjesh mes policisë dhe qytetarëve në Izrael!
Rbelët në Tigray në Etiopi arrijnë të avancojnë duke marrë disa zona nën kontroll
Vuqiç dekorohet për Vidovdanin
Nicosia refuzon ofertën e Kombeve të Bashkuara që Qipro të konsiderohet rajon i vetqeverisur!
Këshilli Kombëtar i Territorit miraton lejen për ndërtimin e objektit të “Teatrit Kombëtar”
Vetëvendosja: Mini-Shengeni i Serbisë dhe Vidovdani i Grenellit janë antishqiptarë
Kombet e Bashkuara kritikojnë përdorimin e fëmijëve ushtarë në Burkina Faso
Biden kritikon Pekinin për mbylljen e Apple Daily dhe kërkon lirimin e gazetarëve dhe ekzekutivëve të medias!… 
Europa përgatitet për valën e variantit Delta të Covid!
Ndodh një shembje në një ndërtesë në Miami, deri më tani 1 person ka humbur jetën, dhjetra të tjerë janë të zhdukur… 
Qindra varre të tjera zbulohen ne Kanada të indigjenëve! … 
Danimarka pikas 5 raste të variantit Delta të Covid pas ndeshjeve të Euro 2020!
Varianti Delta i Covid pritet të dominojë në Greqi rreth fundit të Gushtit!
VIDEO/ Radhë të gjata në zyrat e gjendjes civile, qytetarët: Na sëmurën, mungojnë punonjësit
Qeveria alokon fondin për Teatrin e ri/Aleanca kërkesë GJK të shpejtojë vendimin
Vjen një moment që historia përsërit vetveten për arsye që gjithkush e ka fare të lehtë t'i kuptojë... Vjen sërish… 
Varianti Delta i Covid-19 rritet me shpejtësi në Francë!
Zelanda e Re pranë masave të reja kufizuese anti-covid!
Goditja ajrore nga ushtria Etiopisë lë disa persona të vdekur!
Irani rrit retorikën kundrejt Shteteve të Bashkuara të Amerikës!
Detyrohet të mbyllet gazeta e fundit pro demokracisë në Hong Kong Apple Daily!
Lajmet nga Bota në Shqip      
Libani rrit për të pestën herë brënda vitit çmimin e bukës! 
Kombet e Bashkuara thonë që 41 milionë njerëz janë në prag të urisë!
Variant i Covid-19 Delta Plus raportohet në disa shtete të Indisë!
Përplasje mes policisë dhe protestuesve në Francë!
Kina dhe Rusia kërkojnë investigim për varret masive të indigjenëve në Kanada!  
Raportohet për luftime në Tigray!
Kombet e Bashkuara të shqetësuara për përparimin e talebanëve!
Talebanët marrin disa distrikte në Afganistan!
OBSH e shqetësuar për lehtësimin e masave gjatë Euro 2020
‘Nuk ka çelje negociatash për Shqipërinë’/ Zv. Presidentja e BE e konfirmon: Nuk është rënë dakord për datë
Protesta në Tunizi pas dhunës policore! 
Astronautët kinezë bëhen gati për fluturimin e parë historik!
Zbulohen dy qeliza të reja në trurin e një miu që mund të ndihmojë në riparimin e trurit!
Përgjimet tregojnë për ndërhyrje të amerikanëve në grushtin e shtetit në Bolivi!
Kim Jong Un pranon që Korea e Veriut po përballet me mungesë ushqimesh!
Hong Kong-u dërgon 500 policë për të bastisur zyrat e gazetës Apple Daily
Probleme me internetin për disa momente nëpër botë!
Kurti thotë që "nuk ka mundësi të formimit të bashkive të komuniteteve serbe"  
Greqia pritet të lehtësojë më tepër masat e kufizimit!
Holanda voton ‘pro’ me kushte për Shqipërinë: Nëse nuk bëhet progres, sanksione
Skenari i plehrave: Si u dhjetëfishuan kostot e menaxhimit të mbetjeve të Durrësit
Korea e Veriut gjendet në situatë të vështirë për ushqim pas fatkeqësive natyrore dhe "virusit malinj"
Joe Biden dhe Vladimir Putin takim në Gjeneve! 
Vuçiq zbulon detaje të tjera për takimin e dialogut me Zotin Kurti!  
Sindikatat në Greqi protestojnë ndaj ligjit të ri për punën!
Ekzekutohet një i dënuar Saudit pas arrestimit kur ishte 17 vjeç për shkelje ligjore të lidhura me protesta!
Kina provokon Tajvanin me fluturim avionësh ushtarak në hapësirën e tyre ajrore!
Shefi i ekspeditës në Arktik thotë që mund të kemi kaluar pikën e kthimit pas!
Mbi 600 000 të vdekur në Amerikë nga COVID!
Mitsotakis dhe Erdogan bien dakort që tensionet e 2020 nuk duhet të përsëriten!
Albin Kurti kap në befasi Vuçiçin/ 4 kërkesa në tryezë presin përgjigje nga serbët
Lajmet nga Bota në Shqip      
Vëzhguesi i armëve thotë që ka më pak mbledhje të armëve nukleare por një numër më i madh prej tyre është në gatish… 
Në brigjet e Jemen një varkë përmbyset dhe disa persona mendohet se kanë humbur jetën!
NATO paralajmëron për sfidë ushtarake që vjen nga Kina!
Nesër takimi mes Vuçiç dhe Albin Kurtit për negociatat mes Kosovës dhe Serbisë!
Rizgjedhja e Bashës/ “Fitore” mes akuzave për manipulim, Berisha në zyrë, Nishani: Maskaradë elektorale!
Lajmet nga Bota në Shqip        
Albin Kurti"22 vite mëparë, pas 78 ditësh bombardimi ajror të shënjestrave ushtarake Serbe dhe kryeqytetit të Beogr… 
Pamjet nga Marsi me rezolucion të lartë nga mjeti kinez!     
Ish shefi Mossadit thotë se Izraeli ishte pas shpërthimit në fabrikën nukleare iraniane dhe vrasjen e shkenctarit!
Një 15 vjeçar vritet nga izraelitët gjatë një proteste!
33,000 fëmijë në Tigray rrezikojnë të vdesin nga uria! 
Emiratet e Bashkuara mund të jenë duke torturuar aktivistë thonë Kombet e Bashkuara!
Hungaria propozon ndalimin e promovimit të materialeve homoseksuale tek të rinjtë! 
Deklaratat e papranueshme të Brnabic!
Shqipëria zyrtarisht anëtare e Këshillit të Sigurimit të OKB-së për dy vite
Ndonëse ekonomia po rimëkëmbet, papunësia rritet, arrin të njëjtin nivel si në kulmin e karantinës, efekti nga të r… 
VIDEO/ Rama godet Kosovën në televizionin serb: Nuk duhet padi për gjenocid, por dialog
Rama qetëson Vuçiçin/ Sulmon padinë e Kosovës për gjenocid nga Serbia
Lajmet nga Bota në Shqip      
Kina përgatitet për lëshimin e një rakete të komanduar!
Në një mision të forcave izraelite vriten 2 oficerë palestinezë! 
Shefi Kombeve të Bashkuara thotë që uria ka goditur Tigray!  
Rusia dënon me gjobë Facebook dhe Telegram pasi nuk kanë arritur të ndalojnë materiale të cilat cilësohen të ndalua… 
Greva e përgjithshme në Greqi pritet të shkaktojë ndërprerje në shërbimet e transportit!
Bernabiq: Kosova territor serb. Kurti: Koha që Serbia të shpallë pavaresinë nga Kosova
Lajmet nga Bota në Shqip      
Al Jazeera thotë që kanë arritur të zmbrapsin sulmet kibernetike që synonin të merrnin akses, dëmtonin apo kontroll… 
Gjermania investigon 17 oficerë policie për shpërndarje të materialeve neo-naziste!  
Edhe mediumi RT shkruan për shkarkimin e Presidentit Meta!
Nëntë persona humbin jetën në Korenë e Jugut pasi ndërtesa shembet mbi autobus!
Dhjetë persona që pastronin mina sulmohen nga njerëz të armatosur duke bërë që të humbin jetën, ndërkohë që ISIS me… 
Policia në Nikaragua arreston edhe dy kandidatë të tjerë opozitarë!
Euronews shkruan për votimin për shkarkimin e Presidentit Meta!
Dialogu mes Kosovës dhe Serbisë më 15 Qershor në Bruksel! 
Lehtësohen masaz e kufizimeve në Greqi!
Parlamenti një ngjyrësh voton kundër Metës/ 104 vota për shkarkimin e presidentit
Lajmet nga Bota në Shqip      
Parlamenti i Izraelit të Dielën do votojnë duke bërë që ndoshta ti japin fund regjimit prej 12 viteve të Netanyahut… 
Probleme me internetin dhe aksesimin të disa nga faqet më të mëdha!
Kombet e Bashkuara dënojnë zhvendosjen që ushtria e Myanmar ka bërë të 100,000 personave!
Pas konfliktit në Tigray rajoni është i goditur nga mungesa e ushqimit!
Federatga e Sindikatave të Tregtisë së Zvicrës do protestojnë javën e ardhshme për rritjen e moshës së daljes në pe… 
"Oferta" e Gjermanisë: Kosova dhe Serbia si dy shtete në BE!
Gjykata e Hagës dënon me burgim të përjetshëm Ratko Mladiç
Lajmet nga Bota në Shqip      
17 raste të përdorimit të armëve kimike në Siri!
Kryepeshkopi gjerman i ofron dorëheqjen papës për shkak të rasteve të shumta të abuzimeve seksuale!
Facebook pezullon për dy vite llogaritë e Facebook dhe Instagram të Donald Trump!
Lajmet nga Bota në Shqip      
Kryeministri danez thotë që marëdhënie e Danimarkës me aleatët europianë nuk ka nevojë për riparim pas akuzave se k… 
Opozita e Izraelit ka pak orë që të formojnë qeverinë e re nëse arrijnë marrëveshje!
Gjermania ndalon fluturimet Ruse në një lëvizje kokë më kokë!
Njohja e Kosovës ka pak shanse thotë analisti pavarsisht mbështetjes Amerikane për dialogun!
Një non paper i ri mbërrin në Bruksel!
Kurti: Në Bruksel do të ketë takim për kapitullin e ardhshëm të dialogut
Shkenctarët izraelitë arrijnë ti zgjasin jetën minjve me 20% dhe thonë që mund të aplikohet dhe tek njerëzit!… 
Hakerat sulmojnë fabrikat e përpunimit të mishit!
Kurti: Negociatat do jenë të bazuara në principe dhe të drejta!
Greqia deklaron se qëndrimi për mosnjohjen e Kosovës nuk ka ndryshuar!
===