 ëriaBuzëqeshMbërrijnë 8190 doza të vaksinave Pfizer dhe sigurohen në kushtet specifike -80 gradë në   #…
 ërkombëtareeGjuhësAmtareFaleminderit mbi 450 mësuesve, të cilët në 19 vende të botës kontribuojnë që gjuha shqipe…
 Një ditë e madhe për Kosovën ! Urojmë për një garë të qetë e qytetare, siç e meritojnë qytetarët kosovarë. Kjo është një…
 Një lajm i hidhur ndarja nga jeta e z.Thimjo Kondi, ish ministër i Drejtësisë, ish-anëtar i Gjykatës Kushtetuese, ish-Kry…
Gjyshja ime e shtrenjte... Njeriu qe me rriti 
 Mëngjes lulesh!E pamundur të mos e kthesh kokën nga sheshi “Frederik Shopen” ‍♂️me të gjitha ngjyrat dhe freskinë e…
 Urime në këtë vit të ri shkollor!Po i japim dorën e fundit shkollës më të re dhe më të bukur “Servete Maçi”. Ndërkohë…
 Live:  në Detyrë  në : “Vendimi i Parlamentit holandez duhet të kuptohet në dy drejtime: zgjedhjet…
 Sot, në orën 17:00, Ministri në Detyrë për Evropën dhe Punët e Jashtme  në një intervistë në , mbi ecur…
 Sonte, ora 20:00, në , Ministri në Detyrë për Evropën dhe Punët e Jashtme  përballë gazetarit …
Të dhënat e fundit Bankës së Shqipërisë tregojnë se në fund të tremujorit të katërt te 2018 Zvicra renditet si inve… 
   takon krerët e partive shqiptare; "Dialogu dhe bashkëpunimi mes partive vlerë e shtuar për të ardhmen…
 ëria merr Kryesinë e . : "Këtë Nismë bashkë me përkatësinë në Trojkën e , do ta kombinojmë d…
 Ministri  në një komunikim të posaçëm për mediat, së bashku me Ambasadorin  njofton heqje…
 Këtë prag festash, stafi i  kartolinën e urimit e nisi për ë, në mbështetje të Qendrës Sociale të murgeshave…
 Në bisedën telefonike Sekretari  përgëzoi Ministrin  për marrjen e kryesimit të OSBE-së për 2020…
 Nga nisja e Shërbimit Konsullor Online  e deri më sot, një numër gjithnjë e më i madh shtetasish shqiptarë marrin s…
  prej muajsh ka nisur publikimin për herë të parë të  të diplomacisë shqiptare, të aksesueshëm pa asnjë kosto. Ke…
 Ministria për Evropën dhe Punët e Jashtme uron të gjithë besimtarët e krishterë Gëzuar Krishtlindjen. Paqja e dashuria m…
 Përfaqësitë diplomatike të ërisë në botë bashkojnë zërin e tyre për t'i uruar të gjithë shqiptarëve kudo janë Viti…
 Përfaqësitë diplomatike të ërisë në botë bashkojnë zërin e tyre për t'i uruar të gjithë shqiptarëve kudo janë Viti…
 Në studion e  në emisionin ,  i përgjigjet analistëve të interesuar mbi fatin e mar…
 "Në qershor presim shiritin e çeljes së negociatave me BE-në; ka një kalendar të caktuar nga vetë vendet anëtare të BE-s…
 .: "Fakti që Shqipëria linjëzon qëndrimet &amp; politikën e saj të jashtme 100% me nuk është një proces meka…
 Fjala e Ministrit  në konferencën e përbashkët për shtyp me përfaqësues të lartë të BE-së, gjatë takimit t…
 Mid’hat Frashëri u përcoll për në tokën amë nga  me një ceremoni zyrtare plot përkujdesje e përkushtim të …
  reflekton rëndësinë dhe vëmendjen që  i kushton vijimit të proceseve integruese në nga "screening…
 Ruajtja &amp; kultivimi i identitetit tonë fillon nga pasuria jonë më e madhe, . Me fillimin e vitit të ri shkoll…
  ka shpallur praktikën e punës për të rinjtë:➡️Plotësoni formularin  ➡️Dërgojeni në adres…
 Mirëmëngjesi nga Kalaja e Ali Pashës në Butrint   …
 Në Ditën Ndërkombëtare të Rinisë, i uroj të rinjtë shqiptarë që me guxim e këmbëngulje të mos rreshtin së ndjekuri ëndrr…
 Thellësisht të prekur për ndarjen nga jeta të politikanit, bashkëshortit dhe babait, Profesor Luan Hajdaraga, ish-Minist…
 Vendi ynë është kthyer në një destinacion të preferuar për turistët e huaj. Male të larta , plazhe të kristalta , njerëz…
 Sot është dita kur bujaria dhe përkushtimi ndaj atyre në nevojë, toleranca ndaj njëri-tjetrit dhe reflektimi shpirtëror…
 "Harmoninë ndërfetare e kultivuan paraardhësit tanë, të cilët e kuptuan rëndësinë e bashkimit në vlera dhe jo të përçarj…
 "ëria përveçse e bekuar me bukuri natyrore, mbart edhe ë shekullore qytetërimi e cila duhet promovuar, si m…
 Data 5 maj na kujton edhe përpjekjet e shqiptarëve për t'u nda nga veset që e mbajnë peng shoqërinë drejt një jetë më të…
 Dhe nuk ka mbaruar jo, të tjera do pasojnë në javët që vijnë e jo se e kërkon Gjermania a bota,po se ne themi atë që bëjmë e…
 Sonte në ora 21 do të jem me Arian Çanin në ëeLirë në TV Klan. Për të folur lirshëm natyrisht!
 “Rekomandimi i qartë i Komisionit Evropian drejtuar vendeve anëtare për vendimmarrjen finale, të cilat bëjnë edhe një gj…
 “Fillimi i bisedimeve për anëtarësimin në  është meritë e të gjitha institucioneve të shtetit si shpresë e vokacionit…
 Në Panarin e Punës në ër me  dhe përfaqësues të sipërmarrjes e aktorë të arsimit profesional. Siner…
 Protesta e uljes së qepenave në tregjet bashkiake tallje e madhe me njerëzit nga politikanët pa atdhe!Sepse tregjet JANE JAS…
 Vlerësim i veçantë për Policinë e TR,që megjithë ngarkesën e madhe ditët e fundit,me mbështetjen aktive dhe të Drejtorisë…
 Falënderojmë qytetarët për durimin e treguar, duke mos shkaktuar asnjë incident, me gjithë  vonesën dhe problemet që iu s…
 Për rreth 2 orë qindra qytetarë mbetën të bllokuar në 4 akse kryesore rrugore, për shkak të protestës së paligjshme të zh…
 MJ të ërisë &amp; ë  dhe  diskutuan sot në Tiranë për çështjet dypalëshe në vazhdim…
 Zbatimi i regjimit të vulës apostille me ë për dokumentet  filloi të japë frytet e veta. Vetëm në mua…
 Në aktivitetin organizuar në kuadër të 70-vjetorit të Deklaratës Universale të të Drejtave të Njeriut ë punën në…
 Fjala e Ministrit për Evropën dhe Punët e Jashtme  në Këshillin Kombëtar të Integrimit  
 Në Uashington për një vizitë zyrtare. Së bashku me mua edhe Drejtori i Përgjithshëm i Policisë dhe një ekip nga MB e Poli…
 Darkë pune me Presidentin Erdogan për ecurinë e bashkëpunimit ekonomik mes dy vendeve;projektet e nisura për aeroportin ndër…
 Një pritje shumë e përzemërt dhe miqësore në Mynih nga Ministri i Brendshëm i Landit të Bavarisë z.Joachim Herrmann.Një t…
 Sot në takim me Kryetarët e Dhomave të Tregtive në qarqe për të diskutuar për më shumë ndërveprim mes biznesit dhe shtet…
 Pas pak në  ërballë  për mekanizmin e dialogut me Greqinë dhe dritaren e mundësisë që ofron viti 20…
===