Albin Kurti po bën me Bregoviçin,  atë që ka tentuar të bëj  Milosheviçi, apo Shesheli  
Beteja e “berishëve” për të ndryshuar Amerikën!  
Kryengritja në gotë e Sali Berishës kundër SHBA.  
Pse SHBA po palajmëorn bojkotin e parlamentit të ri?  
E vetmja fabul që e ringre PD është ajo që lidhet me Sali Berishën.  
Prapavija e sulmeve të berishëve ndaj ambasadores amerikane në Tiranë.  
Ku ngjajnë kundërshtarët shqiptarë të projekteve perëndimore në Ballkan?  
Përse të gjithë duan të vrasin Berishën me dorë të Bashës?  
Me këtë deklaratën "No coment" për Berishën, Luli e ka zgjidhur hallin e tij. Amerikanëve u thotë: -E patë, nuk e m… 
Demokratët duhet të rivotojnë nëse janë me Berishën apo SHBA.  
Klima e përkeqësuar ndaj investimeve amerikane dhe Reforma në Drejtësi.  
A po fillon kryengritja e dytë e Pollos në PD?  
Drejtësia shqiptare konsolidoi “pandëshkueshmërinë” e “berishëve” dhe shokëve te tyre.  
Iluzioni i Ilir Metës për të blerë SHBA, tregon  shumë për të.   
Do të isha më i kënaqur që Mediu të rrëfehej para Gjykatës për Shkëlzenin se sa për Eli Farën  
Para se të pyesni për efektet e Reformës në Drejtësi, shikoni fotot e Metës dhe Berishes  
Opozita me sytë nga  brenda PS.  
Tri arritjet e mëdha të Reformës në Drejtësi.  
Pakënaqësitët jopolitike ndaj Lulzim Bashës në PD.  
Me këtë kuvend fitojnë të gjithë  
Kuvendi nën Hijen e fantazmës së Berishës.  
Misioni i pamundur i shfajësimit të Bashës.  
Përse i duhet “armik” ambasadori Soreca, Berishës dhe Metës  
Përse Bashës i duhen “letrat dhe vula e partisë”.  
Ky është një shembull se nuk ka rëndësi si dhe sa zhytesh, por rëndësi ka të biesh gjithmonë në këmb 
Përse gjithë këta të shqetësuar nga arrestimet e SPAK  
Aleati më i madh i korrupsionit është mbipushteti politik.  
SHBA i shkund Berishës hirin e “Vatrës” .  
Leximi i detyurar qe në kohën e Shokut Gramoz i Parë. Tek i dyti eshtë i lirë 
Iluzionistët e ndryshimit të PD.  
Humbjet e gjyqeve në SHBA, janë arsye pse Shkëlzen Berishës, duhet t’i hapen gjyqet në Shqipëri  
Lajm i mirë që opozita po mburret me institucionet e Reformës në Drejtësi.  
Kushtetuesja “pastron” gërmadhat ligjore të Teatrit.  
Listat realisht të hapura imponojnë ose “veting” për politikanët, ose marrëveshje të re PS-PD  
Basha duhet zgjedhë mes Amerikës së Philip Reeker dhe Amerikës së “Vatrës” së  Sali Berishës  
Grenell i “mashtruar” nga serbët, si shqiptarët nga Albini.  
Për të shmangur turizmin me kallshnikov në dorë  
Albini në kërkim të “armiqve” që e shpëtojnë nga diaalogu.   
Fotot e Berishës me amerikan, si ato të Edi Ramës me “djem problematik” ¨në fushatë.  
Një zyrë postare, në vend të Gjykatës Kushtetuese  
Si “Berishët”, po justifikojnë betejën kundër SHBA, si një “interes” të SHBA.  
Shqipëria dhe Maqedonia janë pasqyra ku BE sodit nacionalizimin dhe egoizmin e vendeve anëtare.  
Për të ardhmen e dyshes Berisha – Doshi.  
Ilir Meta është duke pritur Sali Berishën.  
Portalet e Kosovës që çdo fillim sezoni zbulojnë “antikosovarizmin” në Durrës.  
Basha po bën gati kamikazët, për fatin e Berishës në shtator  
Tani që “ëndrra” e Ilir Metës po bëhet realitet.  
Zgjedhjet e vërteta në PD do të mbahen në Shtator.  
Diferenca me të shkuarën në takimin Blinken Rama.  
Me rikthimin e Berishës, “fitojnë të gjithë”  
Ilir Meta është presidenti më konsensual në botë, si president I shkarkuar.  
“Berishët” kanë të drejt të heshtin!  
Frika e lobistëve të Berishës për të lexuar dosjen e tij në Uashington  
Si po justifikon Berisha, garën e pandershme të Bashës në PD  
Dy gënjeshtra të panevojshme të Lulzim Bashës  
Përpjekje e Berishës, për të ambientuar shqiptarët me “anti-amerikanizmin”  
Si Berisha dhe Meta po sponsorizojnë “konspiracionin” e Perëndimit kundër opozitës  
Dy mite të rreme të Lulzim Bashës, që po ja shfryjnë kundërshtarët  
Përpjekja për tu shfaqur “faqebardhë” në “Listën e Zezë”  
SHBA nuk e kanë me Berishën, por me ne!  
Rivalët e “duan” Bashën, edhe spiun të SHBA, edhe armik të SHBA  
Lulzim Basha kërkon “unitet” për të nënshtruar partinë  
21 Janari duhet rihapur si një çështje e Sali Berishës  
Kryetari i ardhshëm i PD, nuk po kandidon më 13 qershor  
Gjykata Kushtetutese çertifikon shkeljen e Kushtetutës nga Ilir Meta  
Përse PD është larg Partisë së Punës, së Qershorit 1991  
Berishës i kanë ngelur ende dy vetë!  
Mes njërit që e shet partinë për vila, e tjetrit që mund të shes vilat për të blerë partinë, nuk ka ndonjë diferenc… 
Gjyqi i Berishës në Francë si gjyqi i Fazlliçit në Londër  
Berisha ka marrë një dënim të përjetshëm. PD duhet ta përjashtojë nga grupi parlamentar.Me Ylli Rakipin ne emision… 
Një vendim për të marrë peng  PD  
Ka pas thënë Tom Doshi: Drejtësi ka por është pak e shtrenjtë.Po doktori i ka lekët
Ironi e fatit është se dorëheqja e Berishës, çon në Kuvend Ori Nebiaj. Edhe ashtu i takonte, se mori më shumë vota… 
Shtypi pro Berishës, po përpiqet ta zbus ndëshkimin e SHBA për familjen Berisha, duke e paraqitur si heqje vize për… 
Lulzim Basha foli si një i marrë peng. Ai është i terrorizuar nga një anë, se mos Berisha e akuzon se e ka shitur t… 
Sot është dita që mund të ringrihet Partia Demokratike  
Kishte kaq kohë që nuk e hiqte nga goja Noreigën. Tani e ka shok liste 
Tomka dhe shokët e tij 
INTERVISTA e plotë e Yuri Kim: Nga zgjedhjet e 25 prillit, tek përplasja me Ilir Metën  
Ata nuk janë të mundur, janë të fyer.  
Sot është dy vjetori i Samitit Brdo-Brijunit që shënon dhe fillimin e mesazheve mistike të Ilir Metës. Që atëhere n… 
Korrektësia e zgjedhjeve dhe KQZ si shërbim psikologjik për Lulin  
Askush nuk ua ka privuar demokratëve të drejtën e votës, më shumë se Lulzim Basha  
Përse Berisha do një alibi “amerikane” për humbjen e Bashës?  
Një zgjidhje orgjinale e Albin Kurtit si mund të kursej vaksinat. Me këtë dyndje të moshuarish pas pak ditësh mund… 
Të mësohesh me humbjen!  
PD ka kaluar nga  parrulla "votat janë brenda në kuti" në parrullën "faktet janë brenda në kuti", por na i gjeni.
Një opozitë që i kërkon gjyqtarit, ti gjej prova për ankesat e saj  
Tre mite të rreme të PD, për humbjen e 25 Prillit  
Transparenca e zgjedhjeve, është armiku real I Lulzim Bashës  
Që opozitën të mos e “ndryshoj” drejtësia  
Partia që udhëheq kryetarin  
Fatmir Mediu ka nje shans ti shpëtoj drejtësisë. Të përdor këtë pasaportën me mbiemer fallco që përdorte kur ishte… 
Fatmir Mediu është mbrojtur për të shpëtuar Shkëlzen Berishën  
Rihapja e dosjes së Gërdecit është shansi i fundit që Fatmir Mediu ende i pagjykuar të shkojë para drejtësisë. Tani… 
Lulzim Basha e ka fjalën për “mosnjohje të humbjes”, jo për “mosnjohje të zgjedhjeve”  
Dilemat e PD për “bashkëpunimin me bandat”  
"Episod" gjatë stërvitjes më të madhe historike të NATO në Shqipëri. 
Donika Gërvalla duhet të mësohet me idenë se është Ministre e Jashtme e Kosovës dhe duhet të njoh flamurin e Kosovë… 
Jam duke vrarë mendje, si ka mundësi që Kavaja paska tre banda dhe të treja i kanë bërë ofertë Gridës. Pse si kanë… 
 Lulzim Basha vendosi mos të njoh zgjedhjet dhe të nis mbledhjen e provave. Njësoj si ta dën… 
Mbështetja e shkarkimit Ilir Metës është test dhe për Lulëzim Bashën  
I vetmi urim që presin gazetarët nga Ilir Meta, në Ditën e Lirisë së Shtypit, është që të mos jetë më president dhe… 
Lulin e duan te gjithë, përveç demokratëve  
Për të kuptuar se kush e ka pushtetin në PD mjafton fakti që sa herë troket dikush tek dera i revoltuar pas humbjev… 
Perëndimi po vë në provë Lulzim Bashën!  
E dëgjoi dhe SHBA thirrjen e Metës dhe Berishës për zgjedhjet 
Sali Berisha më në fund doli nga shpella. Po ulëret pse nuk ka gjetur në kuti votën e Kim Kardashian dhe mendon se… 
E vetmja pik ku ka të drejt Ilir Meta është se do jepte dorëheqje nëse Rama merrte 71 mandate. Ai e ka tepëruar ka… 
Ilir Meta nuk na zhgënjeu. Frika ishte se mund ti hiqte mundësinë shumicës ta shkarkonte për të mbrojtur dinjitetin… 
Nga gjithë liderët opozitarë që garuan më 25 Prill, vetëm Ilir Meta e ka njohur humbjen. Lulzim Basha dhe Albin Kur… 
Atë që Rama dhe Basha nuk bën dot kundër LSI më 2017 me Marrëveshje e bën më 25 Prill me Mosmarrëveshje 
Një milionë e gjysëm vizita (1 509 557) sot  në gazetën Tema tregojnë sa shumë interes kanë pas zgjedhjet në Shqipë… 
Po! Zgjedhjet ishin vërtet një referendum dhe Shqipëria fitoi  
Në Tiranë mendohet të kenë votuar rreth 5 mijë shtetas nga Kosova. Deri tani Vetvendosja ne Tirane i ka marrë 300 v… 
Rezultat e dhjetra qendrave qe jane numuruar te parat ne Tirane flasin per nje fitore te thellë të socialistëve ne… 
Lajm i mirë që Kryeministri i Kosovës votoi në Shqipëri për partinë e tij. Se më lodhën këta militantët e tij çfarë… 
Ilir Meta ka një orë në Elbasan dhe nuk ka ndodhur asnjë vrasje. 
Një tjetër blerje nga LSI në Durrës. Sapo janë kapur 21 zarfa me leket brenda fletën e votimit LSI.Ua tregon qejfi… 
Kjo që është kap duke blerë vota në Elbasan qenka kjo që fuste 12 ballokume e nxirrte 6. E paska ves 
Gjatë kësaj ore nuk do ketë njoftime shtypi nga Ilir Meta. Por mos u shqetësoni se po ha dark me njerëz votash tek… 
Lajmi për çmëndjen e Ilir Metës raportohet dhe nga “Washington Post”: Presidenti i vendit të vogël thotë se do e vr… 
Tani ezheja e kokës së Presidentit lexohet nga gjithë bota. E arritëm këtë ditë
Mes Shqipërisë normale nga një anë dhe Ilir Metës e  Xhelal Mziut nga ana tjetër  
Drama që i ndodhi dje Ilir Metës me ambasadoren Kim mund të ishte shmangur sikur të mos kish gazetarë idjot që në p… 
Ilir Meta më në fund e ka gjetur shpjegimin për sulmin ndaj SHBA dhe ambasadores Kim. Ajo qenka agjente e Serbisë q… 
Lulzim Basha duhet ti kërkoj ndjesë ambasadores Yuri Kim në emër të opozitës për  degradimin e Ilir Metës. Jo për a… 
Ne kemi një tjetër Kim që është më popullore se Yuri Kim 
Këtu është pjesa kir SHBA do ta vras tek Mali me Gropa 
E dëgjoi SHBA ankesen e Metës për ambasadorin Donald Lu. Sapo u emërua Ndihmës Sekretar Shteti 
Ilir Meta kërcënon Shba me Rusinë.SHBA ta dij mirë se aeroplanmbajtëse nuk kanë vetëm ata . Ka dhe Rusia. Le ta pr… 
Ilir Meta pretendon se SHBA ka ndërmend ta vras dhe se ai ua ka thënë këtë gjë. Tani po e morëm seriozisht duhet të… 
Që ta.mbyllim sot me Xhelalin. Ai ka reflektuar dhe pasi kërkoi ndjesë për Elbasanin premtoi se të gjithë të majtë… 
Krushqit e Xhelalit mbritën më në fund tek Skënderbeu. Dilni nga shtëpia po jua mbajti 
Krushqëve të Xhelalit ju nxeh motorri në rrugë për të pushtuar Tiranën. Kaq mbajti 
SI mund të kërkosh falje në Dibër, për një krim që mburresh në Elbasan  
Ky është momenti kur krushqit e Xhelalit msyjnë drejt Tiranës 
Ja ngazëllimi që ka ngjallur Xhelali në Kamëz sot 
Mendo pak për ekipin izrealit të PR të Bashës. Kanë gjashtë muaj kanë prodhuar një Bashë të butë, që gatuan, bën më… 
Deklaratat e Berishës kanë gjetur mbështetje të gjerë në Kinë Indi dhe mbarë Azinë. Shikoni kush i bën like 
Dhe pas gjithë kësaj duhet të ndjehemi të qetë se Xhelali ka kërkuar ndjesë, por Berisha, Basha, Noka, Meta, etj., nuk kanë dëgjuar gjë.
Lulzim Basha lavdëron vrasësin e Elbasanit, Mziu i jep zemër militantëve të vrasin këdo që dyshojnë, Flamur Noka be… 
Sot është Dita e Librit. Tirana duhet të  mësojë nga Xhelali dhe Flamuri“Do vrasim si në Elbasan”, Flamur Noka mb… 
Cubi i Dibrës Xhelal Mziu po lexon me sforco një deklaratë ndjese që ja kanë shkruar. Duket sikur i kanë pistoletën… 
Agimi i Artë në Greqi doli jasht ligjit për më pak se kaq. Grupet e tyre terroriste pretendonin se mbronin të moshu… 
Ky është Xhelal Mziu drejtuesi politik i PD në Dibër i cili dëshmon me zë dhe figurë se PD ka ngritur një strukturë… 
Lulzim Basha ka lavdëruar vrasësin e Elbasanit si ushtarak shembullor. Në fakt të gjithë biem dakord që si qitës is… 
FOTOT: Mijëra qytetarë të Elbasanit përcjellin në shi Pjerin Xhuvanin të ekzekutuar nga truproja i Gazmend Bardhit  
Të justifikosh vrasje nga një paramilitar i armatosur nga PD, do të thotë të justifikosh sot thyerjen e vilës se Il… 
Axhenda ditore e presidentit tregon gjithçka për të  
Gazmend Bardhi ka pranuar se PD ka ngritur një strukturë të armatosur për "mbrojtjen" e votës. Pra ne paskemi param… 
Presidenti ka një dimension sinqeriteti. Zgjedh gjithmonë ata që vrasin 
Luli po flet për një ngjarje të errët që i takon periudhës 101 mijë vjet më parë. Sipas periudhave gjeologjike ësht… 
Kjo është skena e krimit. Ilir Meta ka nis përpjekjet për të ndryshuar faktet duke akuzuar policinë dhe SHISH në El… 
Vrasja e fundit e Sali Berishës dhe Ilir Metës, që do të gjykohet më 25 Prill  
Ndërsa një mjek i njohur është vrarë në mes të ditës nga badigardi i Gazmend Bardhit Sekretarit të Përgjithshëm të… 
Kur reklama shfaqet në kohën e duhur me njeriun e duhur 
Një portret I pautorizuar i Monika Kryemadhit: Gruaja që tremb edhe opozitën, edhe Perëndimin  
Nëse do ishte për zgjedhjet, Komiteti duhet të mbyllte kufirin me Kosovën dhe të linte hapur atë me Greqinë.  
Si Basha, I bën reklamë me zor avionit të Ramës në Kukës  
Lëreni presidentin të “votohet”  
E rëndësishme është të shpresojnë tek SHBA  
Ilir Meta nuk na “turpëron” si President, por si banditi që do të prish zgjedhjet  
Vlora është skaneri psiqik I Ilir Metës  
Ose është lista e 2005, ose do të jetë diversion I Ramës, për të përçarë demokratët. Ndërkohë Luli më dërgon çdo di… 
Unë 15 vite që kritikojë Partinë Demokratike dhe sulmoj Berishën dhe këta socialistët më quajnë votues të pasigurt.… 
Më në fund një lajm I mirë. Ilir Meta e paska gjetur godinën e spitalit të vet në Vlorë. Paska dërguar dhe stafin t… 
Të vdesësh Kosovën për Bojkenin  
Ose duart e Monikës, ose të policisë  
Në zyrë eshte Serjan Mazreku dhe Ardi Kërtusha duke aderuar në Aleancën për Ndryshim. Luli i prezanton; zoti Serani… 
“Sirenat” që tërheqin Ilir Metin drejt Vlorës  
Kriza e Rinasit reflekton “stresin” e Ilir Metës dhe Sali Berishës për 25 Prillin  
Palmer teston objektivat politike ndaj Reformës në Drejtësi  
Qeveria duhet të sfidojë, imitimin e Berishës, nga Albin Kurti  
Më lehtë pazar me serbët dhe hajdutët, se sa me shqiptarët  
Ilir Meta sulmon SHBA-në, të dëgjojë Lulzim Basha!  
Të kërcënosh një të mbytur në oqean, se do ta lagësh me ujë!  
Përpjekje për të rrezikuar ditën e zgjedhjeve  
Berisha i bën nder Ramës, më shumë se vaksinat  
Një raport që I ngjan epikrizës së Ilir Metës  
Të gjithë kanë pasur iluzionin se Albini, pasi I lexon librat, I ka ato në kokë. Por Ai  paska nevojë për shtëpi 40… 
Njeriun, që e shpëtoi e vërteta  
Kostua e opozitës nga politizimi I vaksinimit  
Një parti që ka turp nga babai I saj  
Fatmir Mediu e ka gjetur mënyrën si ti kujtoj Berishës borxhin që i ka për djalin e tij në Gërdec. I ka çuar djalin… 
Presidenti në krye të shtabit elektoral tek Rruga "Fortuzi" duke mbrojtur kushtetutën në një tavolinë me verë birra… 
Librat më të lexuar të javës 
E mori më qafë Edi Rama këtë. Ky beson se ai fitoi pse shkruajti librin "Kurban". Dhe ka porositur një libër tek Fa… 
Djegja e mandateve i ka hequr sot opozitës PD dhe LSI dhe aleatëve të tyre, avantazhin që mund të kishin më 25 Pril… 
Mos ja merrni për ters djalit. Ai ngatërroi datëlindjen e tij, jo më të Shënandoit. Lutuni të mos harroj ditën e zg… 
Dy palë mezi presin fitoren e Lulzim Bashës: Shtypi grek që e quan si investim të Athinës zyrtare dhe shpreson se d… 
Një fushatë parazgjedhore, mes Ilir Metës dhe Lulzim Bashës  
E meriton plotësisht këtë këngë. Pas Skënderbeut që mbrojti Kalanë e Krujës, ky është heroi i ri kombëtar që arriti… 
Më në fund kemi një sukses, të Frymës së Re Demokratike  
Kur fle me frikën se do të çojnë në burg dhe zgjohesh me ëndrrën, se po fut njerëz në burg 
Ky tipi që punon paradite roje objekti, e mbasdite president, ka shqetësim pse ikin njerëzit nga Shqipëria. Me këtë… 
Ilir Meta paska thënë që telefonata që ka sjellë Ramën nga Parisi në Tiranë, është një komplot 20 vjeçar i Bllokut… 
Ja çdo të thotë të jesh me LSI. Fut 12 ballokume në furrë, e nxjerrë 6 prej saj. E paskan çu 50 për qind bakshishin… 
Gjithë gratë e PD të shqetesuara për talljet e Edi Ramës me Gridën më kujtohen kur duartrokisnin Berishën që quante… 
“Të fyerit” nga Edi Rama, humbën një rast të dukeshin njerëz normal.  
Pse Berisha ka diktuar listën e kandidatëve të PD?  
Ndyshimet  që tani mund të lënë gjurmë  
Eduard Halimi, një shishe bosh, në “radhën e qumështit”  
Diferenca në debatin mes listës së PS dhe opozitës  
Partia që ka “shpresë” Saliun dhe mërzitet nga Luljeta Bozo!  
Në Kosovë si Murgeshë, në Shqipëri si Prostitutë  
Rasti Sarkozi dhe Basesku, përballë aferës së Klubit “Partizani”  
Shqipëria padyshim ka nevojë për ndryshim, por jo për kthim mbrapa. Nëse në Kosovë, Kurti lavdërohet që ka nxjerrë… 
Albin Kurti ka në dorë vetëm të refuzojë njohjen nga Izraeli  
Pse opozita nuk zbutet nga lavdërimi i ambasadores për Lulzim Bashën?  
Është hera e parë që reforma në drejtësi po ndan vetë opozitën  
SHBA nderoi gjyqtarin që mbrojti reformën nga  Ilir Meta dhe Sali Berisha  
Mbi leksionet e gazetarisë nga Ilir Meta  
Hipokriza e Albin Kurtit me vrasjen e Xhemail Mustafës dhe “Lista Vjosa” që nuk guxon të hap gojën  
Lerini Ilir Metën të bëj fushatë për LSI !  
Skandali I “Klubit Partizani” dhe një guidë për “karrierë” në PD  
PJESA II/ Privatizimi i 'Kompleksit Partizani', si Berisha nisi eliminimin e zyrtarëve që nuk firmosën në favor të… 
Sot, dita kur Lulzim Basha duhet t’u kërkojë ndjesë demokratëve  
Lefter Çipa e ngriti polifoninë e Bregut aty ku se arrinte dot më askush, duke e bërë pronë të vetën. Shpresojë mos… 
Si po korruptohet besueshmëria e opozitës  
Njerëzit që preknin pavarësinë e Kosovës  
Sali Berisha është kapur duke vjedhur dhe të vetët  
LDK ka nevojë të rithemelohet!  
Përgjegjësia ka emër: Vetvendosje  
Mandati që vjen nga Revolucioni I Diasporës  
Vlera reale e arrestimeve të sotme të SPAK  
Lulzim Basha paska filluar fushatën nga Japonia duke sponsorizuar edhe nje dyqan orësh. Po t'i fusë edhe një sushi… 
Vendimet e KAS dhe standarti për gjobën ndaj Veliaj  
Strasburgu çimenton Reformën në Drejtësi në Shqipëri  
Kambanat e letrës për Beogradin, duhet të dëgjohen në Prishtinë  
Vetvendosja premton se mund ta heq ambasadën nga Jerusalemi nëse ja kushtëzon BE. Kjo do të thotë se janë gati ta z… 
Presidenti sot nuk ka shpërndarë asnjë lajm të keq!  
I skualifikuari i madh është “Komisionit Ruli Nishani”  
Pse Basha prezanton Tiranën, me ekipin e tret rezervë të PD?  
Dita që nderon Kosovën dhe mërzit njeriun “popullor” të Kosovës  
Nëse sot bën sondazh në Kosovë sa i janë gëzuar marrëdhënieve me Izraelin, të del me siguri të plotë 90 për qind "p… 
Albin Kurti nuk ka një plan, për të ardhmen e serbëve në Kosovë  
Maratona çerek shekulli e një gënjeshtre për t’u bërë kryeministër  
Njeriu që futi shqiptarët, në listën e popujve të pavdekshëm  
Vajza 10 vjeçe gjithë ditën me Ipad, duhet të dëgjoj një libër për fëmijë 3 vjeçar, nga babai kandidat për kryemini… 
Një listë për 26 Prillin  
Një hordhi osmane kundër shtetit të Kosovës  
Të gjitha faktet përse SPAK duhet të thërrasë Berishën për 21 Janarin!  
Të premtosh “shkapjen” e shtetit, për ta gjunjëzuar atë  
Njeriu i Kosovës në politikën amerikane  
“Shkëmbyesit” e rinj të  teritorit… me Shqipërinë  
Keqpërdorimi i ligjit dhe Ilir Metës nga socialistët  
Erion Veiaj duhet ti kërkojë ndjesë Lulzim Bashës!  
Pse kaq e vështirë për Lulzim Bashën të tregoj faturën e vilave?  
I vetmi argument që ka Luli se do ti pasurojë shqiptarët është se ai ka ditur të bëj lek në opozitë jo më në pushtet. Sdi pse se përdor!
Lista opozitare nën shantazhin e të përdorurve prej Bashës  
Të gjitha arsyet e sulmeve fallco, ndaj fillimit të vaksinimit  
Mes Turqisë dhe Greqisë është, edhe Edi Rama, edhe Shqipëria!  
Fillimi i vaksinimit dhe një kërkesë për Sali Berishën  
Përpjekje për ti ngjarë Trumpit, edhe si viktimë  
Konspiracioni shqiptar për vizitën Tiranë-Ankara-Athinë.  
Berisha thotë se Rama iku nga Durrësi nga frika Lulit. Monika thotë se iku nga frika e Elonës. Paloka thotë iku nga… 
Buzëqeshjet e ngrira të Tiranës për ngjarjet në Uashington  
Shqipëria e “vaksinuar” nga sëmundja e pazareve me Perëndimin  
Një opozitë e frustruar nga afrimi I zgjedhjeve  
Beteja politike e dështuar e vaksinën  
Për të lehtësuar zotin Gurakuqi para Vitit të Ri  
Me kë pale është Meta e Berisha në Gjykatën Ndërkombëtare për Detin?  
Gjejini një “agjenturë” serioze Edi Ramës  
Dy makthe të Berishës që po e plakin para kohe  
Tani në T7 dhe Abc News. Raportet Tiranë Prishtinë
Një muze që persekuton kundërshtarët  
Gjykata Kushtetuese, dhe dëshpërimi i Ilir Metës  
Si Meta dhe Basha, përdorin Berishën, si “dordolecë” për të trembur Perëndimin  
Ka një lajm pozitiv. Sali Berisha për herë të parë kërkon ndjesë për përbaltjen e tij ndaj zonjës Calavero që monit… 
Brukseli zyrtar reagon pas sulmeve të Berishës dhe opozitës: Pavarësisht presioneve, reforma në drejtësi nuk ndalet… 
Për  “Bonnie and Clyde” të Kosovës dhe të tjerët në Tiranë  
Keqpërdorimi i dytë i dosjes 184  
Pas antarësimit të këtij  radikalit islamik në "Vetvendosje"  realizohet ëndrra e Albinit për tu reformuar  si idht… 
Goditja e dyshes Berisha-Meta, ndaj arbitrit të Brukselit për Shqipërinë  
Disa gjëra që qartësoi, vizita e Vjosa Osmanit në Tiranë  
Për dy jenicerët e rinj, Kur(d)i dhe Osmani   
Një delirant populist dhe dy presidentë pa popull !  
Disa fitore të Bashës këtë javë  
Protestuesit që po i nxjerrin “turpin” opozitës  
Kompleksi i krimit të kryer  
Paska reaguar Voltana. Nuk është ndonjë turp të mërzitesh pse shkatërrohet një qytet edhe pse nuk është qyteti yt.… 
Në historinë botërore, se shqiptare jo e jo, kjo fytyrë, do të mbetet si e vetmja kryebashkiake e mbetur në zyrë, … 
Jo më në emër të Klodianit!  
Sa më e vogël protesta aq më primitiv dhe barbarë pjsemarrësit. Si puna e LSI 
Kjo e sotmja është një Shqipëri më e mirë.  
T’i lutesh Edi Ramës mos të marrë tre mandate!  
"8 dhjetori ngjarja më e madhe e këtyre 120 viteve nga pavarësia , 118 viteve jo 112". Ne fakt është 108 vjet nga p… 
"8 vite të humbura në këto 4 vjet". Ka hequr 4 vjetët e LSI me PS se nuk do sherr me Monikën 
Dy rreziqe për plotësimin e Gjykatës Kushtetuese deri në Dhjetor  
Jepini ca të vdekur Lulzim Bashës ti ketë për hall!  
Komplekset e “Berishës” tek partitë “bija” të PD  
Heshtja ndaj Llallës është radiografi e kapjes së politikës dhe shtypit nga krimi  
Për ata që festojnë nga “mërzitja” për negociatat me BE  
Podujeva një sinjal për të ndryshuar humbësit  
29 Nëntori që bën qesharak Ilir Metën  
Pse sot Adem Jashari, la në hije Ismail Bej Vlorën?  
Provoni të bëni betejë politike me tërmetin!  
Maradona iku. Tani i mbetet barra Monikës të vazhdoj rrugën e vetme 
Leksione nga “udhëheqësit paralelë” të Pandemisë  
Të dashur mjekë! Lulzim Basha po ju mbron, siç do të mbrohej, po të ishte në vendin tuaj.  
Kur katandisesh të të mbrojë Agim Bahtiri  
Bashkim Kopliku, ose raca në zhdukje e politikanëve që besonin tek logjika  
PD ka dy spote të famshme këtë vit. Një spot ku nxjerr foton e Baton Haxhiut si tradhetar i kombit dhe një tjetër s… 
Lulzim Basha e ka gjetur si ta lidh COVID me inceneratorët. Ata të vdekurit që nuk raportohen ka mundësi çohen tek inceneratorët
Përse Lulzim Basha ka mbetur pa aleatë në betejën për të shkuarën e tij  
Të njohësh Kosovën në Shqipëri përmes Luzlim Bashës dhe hallit të tij   
“Komiteti antiqeveritar për Covid19” dhe kryetari Ilir Meta  
Eshtë gabim, nëse gjesti ndaj Kastriot Islamit, nuk ka qenë politik  
Pse Lulzim Basha nuk ka qëndrim politik ndaj akuzave të UÇK  
===