 Cënimi i votës së çdo kandidati do të ketë si pasojë sanksion penal deri në 7 vite burgim, për këdo nga numëruesit apo kom…
 Foto e vitit 1945...historia përsëritet dhe dikaturat zënë fill atëherë kur pakkush e mendon se liria mund ti ketë ditët e…
 Të thuash "Mos shit votën!" është e thjeshtë dhe racionale. Çështja është: kujt po ia themi? Po ia themi një njeriu shqip…
Gazetarët që këto ditë kanë nisur punë part time si psikiatër dhe u shqetësuan për sjelljen e presidentit, ftohen t… 
 “Infektimet kanë një tendencë në rritje” – ISHP bën bilancin e situatës me COVID 
Policia arreston anëtarët e Aleancës për Mbrojtjen e Teatrit 
E.Hatibi: Jeta publike,reduktuar gati tërësisht në variantin e vet mediatik, keqkuptohet më së shumti si privilegj… 
 A janë këta ndërmarrja e organizuar kriminale? 
 Një gjë nuk po e kuptoj: a duhet të bëheshim ne si Amerika, apo Amerika si ne?
 Si sot, lindi në Kretë Odhisea Eliti. Poeti i Greqisë, i njohur si poeti i Egjeut, u nderua në 1979 me Çmimin Nobel në…
Hëna blu në Tiranë   LSA 
Koshat e plehrave në Athinë 
 "Dielli duket që në mëngjes" është një shprehje. Nuk është komunikim në bilardo, por në nivelet më të larta: sapo nis dita…
Vetëm KM është kompetenti për të futur hundët kudo 
Arkiva e  Ndalohen nga policia tre gazetarë të “Zërit të Popullit” 
Në kulmin e një çmendurie politike një analist shqetësohet për metodikën....
!!!Një pikë e marrëveshjes ishte që marrëveshja të mos kishte ndryshime.... 
 Rama përjashton gazetaren e  Ambrozia Meta nga konferenca për shtyp.Censura mediatike është pla…
 Analizë nga ambasador i Italisë në Tiranë  : Shqipëria dhe perspektiva e saj evropiane 
 Jam shumë i lumtur që do të jem ambassadori i Britanisë së Madhe në Shqipëri. Unë shpresoj se do të forcoj më shumë marrëdh…
 SerbiPushteti : Marrëveshja forcoi Serbinë pa e njohur KosovënOpozita : Marrëveshja forcoi subjektivitetin ndërkombëtar të…
Veton Surroi: Çfarë ndryshon për shqiptarët pas humbjes së Gjukanoviçit 
 Kujtimet edhe të një vere mashtruese 
 Ky është kufiri, këtu përfundojnë të gjithë të keqkuptuarit me pushtetin, që pasi nuk u dalin lloga… 
Kosova duhet t'i ruajë përkrahësit -  
 Antifa në USA ka shkuar përtej një proteste kundër racizmit. Reagimi i tyre është në shpërpjestim me kauzën antiraciste. I…
 Qindra policë (mes tyre dhe forca speciale të armatosur) nxituan në mes të natës, por nuk mundën ta pengonin shembjen e…
 Po po. I ke rëne me të. E gjitha ndodhi për punët e zotit dhe lekët e atij robit..
 S'ishte muhabet demokratësh dhe socialistësh kjo pune. Po nejse e ka fajin Luli qe e la ta prishnin dhe jo ata qe e prishën.
Studiuesi shqiptar në Akademinë e Shkencave të Hungarisë: Shqipëria shmangu skenarin apokaliptik, por masat nuk duh… 
 Situata e shkaktuar nga Covid-19 nuk është luftë. Përkufizimi i luftës është: "Dukuri kolektive që ka trajtën e saj dallue…
 Mesazh i Përbashkët nga Organizata Ndërkombëtare dhe Partnerë Zhvillimi në Shqipëri.Ne jemi pranë jush për të kapërcyer kë…
 Faleminderit atyre që janë në vijën e parë të luftës kundër . Flm nga zemra!  …
Ministria e Shëndetësisë: Arrin në 51 numri i të prekurve me koronavirus 
  Çfarë dihet deri tani për COVID-19? Analiza e studjuesit shqiptar në institutin e Akademisë së Shkencave…
 Çfarë dimë në lidhje me ? Si mund të mbroni veten dhe të tjerët nga infeksioni? Kontrolloni broshurën e realizuar…
 Betejë e pabarabartë mes virologëve dhe panikologëve gjitholog...!
 Po a është infektuar apo jo? Nëse ka pasur veshjen e duhur si ndodhi?
 Debati po bëhet a është mjeku votues i PD apo a është infektuar se pacientët i kanë orientuar gabim?
 3/10 PËRKUJDESI për “higjenën e të teshtiturës dhe të kolliturës”
 2/10 MOS GRUMBULLIMI jo i domozdoshëm në mjediset publike e në të tjera mjedise,
Artur Zheji: “Boshi” i Ramës dhe shpërthimi popullor i Metës 
Ylli Rakipi: Ilir Meta ka të drejtë, por nuk lejohet… Çfarë absurdi?! 
Ministrja e Shëndetësisë: Shmangni lajmet e rreme. Nuk ka asnjë rast të koronavirusit në Shqipëri 
 mos e bli atë vilën që ke në plan 
 Grenelli, njeriu i Kadri Veselit në CIA  via .com
 Me 20 shkurt para 29 vjetësh ne rrëzuam një bust. E meritonte patjetër. Ishte një simbol i së keqes. Rrëzuam bustin e nj…
 Ata që thonë se gazetarë dhe media në Kosovë bëjnë propagandë kundër Shqipërisë s’di si s’e kuptojnë se propaganda më e keqe…
 Për të “të kulluarit” e medias shqiptare, të “showbizit”, të grupit të “vipave” shqiptarë... Unë mund të mos jem krenare…
 Fakti merret me gjithë këto gjerat e tjera nuk do te thotë qe nuk bën edhe pazar:)
 Lule të zeza me copëza gjakuMbi borën e bardhë kishin rënëNjë gjëmë e ftohtë e shekullitHënën dhe Diellin e kishte zënë.#…
 Urime për paketën antishpifje. 
35 organizata ndërkombëtare kundër ligjit të qeverisë “Rama” për mediat 
Shoqata e inxhinierëve: Të pezullohen pallatet në ndërtim 
 Po roja është këtu?
 Detyra parësore e psikologëve është të trajtojnë disa të ftuar në studio- pse jo edhe ndonje moderator/moderatore 
 Zoti nuk dërgon tërmete për të na bindur se ekziston e se ne duhet të sillemi mirë. Ky është një vizion shumë primitiv i Z…
 Ai është vetëm një nga shumë fëmijë shqiptarë që ndodhen në kampin famëkeq ku mbahen gratë dhe fëmijët e luftëtarëve të ISIS.…
 Faktet kanë rëndësi. “Gazetaria” shkel e shko dhe çorientuese, që synon të shtrembërojë politikën e Shteteve të Bashku…
 Po mendohet, ka dhe 24 ore afat të ndyshoje mendim:)
 Karaxhiçi ka qenë poet. E meritonte më shumë se Handke Nobelin për letërsinë!
 nuk e kisha ndërru shtëpinë tem me krejt karrikat e Parlamentit.natën e mirë! 
Ristani: 3 pikat e opozitës për të rrëzuar Ramën. E para të jetë alternativë e besueshme  via  Koha Jone
 Ja renditja e vendeve që kërkojnë azil në BE sipas Monitor:1. Shqipëria2. Siria3. Gjeorgjia4. Venezuela5. Afganistani…
 :  dhe  i dhanë oksigjen  në opozitë duke demonstruar konsistencë e pathyeshmëri,…
 Do takohen sërish në Samitin Euro-Arab ne Athinë. Vet emri i samitit i thotë të gjitha 3)
Panik nga lajmet e rreme në Tiranë   
 Gjynah që s'fitoi ky. I ka idetë të qarta :)
7 fakte interesante qe u prezantohen gjermanëve për Shqipërinë. 1-Kryeministri i Shqipërisë është artist. - - -… 
Mihal Kokëdhima do jetë temë për emisionet televizive dhe pas pushimeve dimërore. 
 “Nuk e ndryshojnë botën ata që organizojnë kryengritje, botën e ndryshojnë ata që çohen kundër të keqes në veten e tyre.…
 Ti ndjen se duhet të punosh e të japësh ndihmën tënde për shoqërinë. E bën këtë gjë çdo ditë duke menduar, vepruar dhe shk…
===