 39 ankesa të reja ndaj magjistratëve mbërritën pranë ILD javën e fundit. 3779 totali i ankesave1080 të trajtuara269…
 Që ankesa juaj të plotësojë kushtet ligjore të pranueshmërisë✅, konsultoni faqen e ILD-së, mbi mënyrën e paraqitjes së ank…
 Për të lehtësuar edhe më shumë procesin e ankimimit, ILD sjell një formë të re, më të thjeshtuar të ankesës, që qytetarët…
 Ja cili është rrugëtimi i një ankese në Zyrën e  të Lartë të Drejtësisë⚖️ësi ë …
 Përditësim i ë hënës.Shifrat javore ankesat/procesi disiplinor ⚖️34 ankesa të reja (total 3704)1009 të trajtuara…
 Shkarkimi i Enkeleda Kapedanit, Metani: Pozicioni i gjyqtarit ka peshë të madhe, duhet të artikulojë drejtësi edhe në sjel…
Tekst dhe video ne  
 (2/3) ...Unë për vete, e di cila është detyra ime. Detyra ime është të përfaqësoj , të përfaqësoj pozicionin e vendi…
 Miti i të “paprekshmëve” thyhet, Metani: Goditet çdokush që shkel ligjin 
 Nga fjala gjatë aktivitetit të Ditës Kombëtare të Drejtësisë.  ⚖️ 
 "Unë dëshiroj t’u them gjyqtarëve, se nëse ata vetë nuk janë të ndërgjegjshëm për forcën e madhe, që i jep pavarësia e dhë…
 Mesazhi i Inspektorit të Lartë të Drejtësisë Artur Metani në Ditën e Drejtësisë. ⚖️…
 Dita e Evropës na shërben për të parë se sa shumë është arritur, që prej deklaratës së Shumanit e sa shumë mund të arrihet…
 Përgëzoj Këshillin e Lartë Gjyqësor për miratimin e Kodit të Etikës Gjyqësore. Ky dokument i shumëpritur është një mjet i…
 Procesi i hetimit disiplinor mbi akuzat për sjellje të papërshtatshme të magjistratëve në Shqipëri ishte tematika e parë q…
 I lumtur nga nisja e bashkëpunimit me misionin  për forcimin e kapaciteteve të ILD-së. Sot: vlerësimi i sjelljes së…
 Po ndodh: Misioni OPDAT dhe Inspektori i Lartë i Drejtësisë, tryezë virtuale: hetimi disiplinor mbi akuzat për sjellje…
 E falenderova për gatishmërinë e OSBE-së për të asistuar në fuqizimin e kapaciteteve të zyrës së ILD-së.⚖️
 I kënaqur që takova sot Ambasadorin Vincenzo del Monaco, kreun e ri të Prezencës së OSBE në Shqipëri. OSBE ka qenë gjithmo…
 Dita e dytë e trajnimit mbi praktikat e punës para fillimit të një hetimi disiplinor. Konsolidimi i praktikave të reja për…
 Po ndodh:  dhe  V, trajnim mbi hetimin disiplinor ndaj magjistratëve. Puna para fillimit të një hetimi di…
 Takim pune mbi rregulloren e brendshme të organizimit dhe funksionimit të zyrës së Inspektorit të Lartë të Drejtësisë. …
Inspektori i Lartë të Drejtësisë është përgjegjës për verifikimin e ankesave, hetimin e shkeljeve disiplinore dhe f… 
 (2/2) Gjatë diskutimit të tyre, Zv. Ndihmës Sekretari Palmer ritheksoi mbështetjen e  për zbatimin e reformës në dre…
 (1/2) Gjatë “vizitës së tij virtuale" në Shqipëri dje, Zv. Ndihmës Sekretari i Shtetit Matthew Palmer u takua me Kampi…
 Këshilli i Lartë i Prokurorisë pranoi sot kërkesën e Inspektorit të Lartë të Drejtësisë për shkarkimin nga detyra të mag…
 I lumtur që takova sërish Inspektorin e Lartë të Drejtësisë Artur Metani në ambientet e tij të reja. E përgëzova për vitin…
 Mirënjohës deputetëve të komisionit të ligjeve për mbështetjen për propozimet e Inspektorit të Lartë të Drejtësisë për ame…
 në raport me punën e prokurorëve e gjyqtarëve në vend. Kthimi i besimit të publikut tek drejtësia ishte dhe mbetet motivi…
 Raportimi i parë në Kuvend, para komisionit të ligjeve për punën e ILD-së për vitin 2020. Garantova deputetët, se Inspekto…
 Këshilli i Lartë Gjyqësor pranoi sot kërkesën e Inspektorit të Lartë të Drejtësisë për masën disiplinore shkarkim nga dety…
 Sistemi disiplinor në një këndvështrim të përgjithshëm. Trajnim i Inspektorëve mbi kuadrin e ri ligjor mbi përgjegjësinë d…
 Një ditë pune në ILD. Takim i Inspektorit të Lartë të Drejtësisë me Inspektorët magjistratë mbi procedurat disiplinore të…
 “Kjo është luftë, që do dojë kohë dhe për mua nuk ka rëndësi nëse verdiktin final të kësaj lufte e bën ILD, KLGJ, KLP apo…
 “ILD po monitoron lirimet para kohe me kusht. Secili të bëjë llogaritë e veta tani”. Inspektori i Lartë i Drejtësisë Artur…
 Falenderime të posaçme për profesionistët e nderuar të Këshillit Konsultativ për Çështjet e GJEDNJ-së për asistencën e çmu…
8 Inspektorë magjistratë e jo magjistratë i bashkohen ekipit të Zyrës së Inspektorit të Lartë të Drejtësisë. Për më… 
 “Suksesi apo dështimi i një institucioni të drejtësisë varet nga të tëra institucionet e drejtësisë. Për të patur sukses r…
...Kemi shkuar në bashki por nuk na japim bonus qiraje. Këtë e thotë edhe Kryeministri Edi Rama që ska bonus për ne… 
Politika e te Shtunes..."Për herë të parë një kryeministër i Shqipërisë nuk kursehet publikisht ndaj homologut të K… 
Politika e te Shtunes...Në momente delikate politike për të, Edi Rama i është kthyer vazhdimisht medias me paralajm… 
Gazetarët shqiptarë, mediat shqiptare, organizatat e medias dhe ato të... 
Në Komisionin e Helsinkit, shqetësim për paketën anti-shpifje në Shqipëri 
Shqipëri, liria e shtypit në rrezik. FNSI: “Qeveria italiane dhe BE të ndërhyjnë” – Këshilli Shqiptar i Medias 
Politika e te Shtunes..."Edi Rama e kapërceu fazën e parë delikate të pas tërmetit të 26 nëntorit. U impenjua si ku… 
Hero! Qeni i trajnuar i Ushtrisë së Kosovës ka shpëtuar deri tani 3 persona 
Vetë kryeministri, nuk kapi as standardin e Saimir Tahirit, të cilin e përjashtoi nga rradhët e PS brenda 24 orëve… 
 Dëgjoni vetë: Kështu mafia ble vota në Shqipëri  :   manipuliert Wahlen. Das ze…
Politika e te shtunes. Shtyrja e zgjedhjeve nuk duket më një utopi politike apo ligjore.... 
===