 Amb. e ShBA-së në Kosovë, z.  të shoqëruar nga këshilltarja e tij për çështje politike Amy Carnie, i priti n…
Të gjithë familjarëve, miqëve dhe shokëve ju uroj festën e Kurban  Bajramit. Paqja dhe mëshira e Zotit qoftë në Ju… 
 A është ndëshkim, sprovë apo fatkeqësi, çka të duhet ty dhe kush të autorizoi të konkludosh?Merr mësim nga çdo ndodhi dhe sh…
 Shitësi i krembananeve në Prishtinë sapo i dhuroi në shesh 5 Euro për Shqipërinë. Ndoshta krejt fitimin e ditës! Me kajt m…
Lajme të tmerrshme nga Shqipëria për shkak të tërmeteve të njëpasnjëshme. Lutemi për shpirtin e viktimave, për fami… 
 Të gjithë miqtë e Shqipërisë po aktivizohen me shpejtësiKryeministri Conte e kryeministri Mitzotakis nisën avionët me skuad…
 Nëse ndonjëherë kam urryer vendin tim është pikërisht momenti kur të vranë në gjithë ato "masa sigurie". Njejtë ndihem sa he…
 LAJM I MIRE! Faleminderit të gjithë deputetët e CDU/CSU që më në fund VOTUAN PRO HAPJES SË NEGOCIATAVEAta qē votuan KUNDË…
 Erdhi dita e fitores për Lëvizjen, koha e ndryshimit që i duhet Kosovës. Prandaj javët e fundit po i bashkohen Lëvizje…
 Inovacioni dhe teknologjia: Oferta e Qeverisë  KurtiLëvizja VETËVENDOSJE! do të jetë mbështetje e jashtëzakonshme për…
 Në qeverisjen e Lëvizjes nuk do të tolerohet asnjë keqpërdorim. 
Të dashur familjarë, miq dhe të afërm Zoti ua pranoftë agjërimin. Ju uroj shëndet dhe gëzime në familjet tuaja.- P… 
 Me rastin e hapjës së objektit të ri tëELEGANT-it Kërkohet puntor për mi fry jemekve ( Gjellrave ) Orari i punës 8 or…
Të dashur familjarë, miq dhe të afërm Zoti ua pranoftë agjërimin. Ju uroj shëndet dhe gëzime në familjet tuaja.- P… 
 Sot, shumë aktivistë e anëtarë bënë homazhe te 59 varret në kompleksin memorial të Jasharajve në Prekaz. Me rastin e 20…
 14 vjeç dhëndër -Andon Zako Çajupi 
Gjuha jonë - Naim FrashëriGjuha jonë sa e mirë,sa e ëmbël, sa e gjerë,sa e lehtë, sa e d'lirë,sa e bukur, sa e… 
 Miratimi nga parlamenti në Shkup i ligjit të gjuhës shqipe një arritje historike për shqiptarët që demokratizon e forcon vet…
 5,000 € në muaj ndihmë për Johan Tarçullovskin, kriminelin e denuar nga gjykata nderkombetare e Hages Edhe kerkon vote…
 Gjatë ditës së sotme,  priti delegacionin ndërkombëtar të organizimit të lutjeve të mëngjesit. 
 Asnjë organizim asnjë detyrim asnjë festë sonte në 18.30 në sheshin Skënderbej për fjalën e fitores! Kush të dojë është i mi…
 Ditë e bukur në Lipjan, jo vetëm prej qiellit të hapur me diell, por më shumë prej fytyrave të çelura e buzëqeshjeve të qyt…
 Një portal qe as emrin sja përmendi ka dy lajme në dhjetë minuta për mu. Jaaa, sja u kthej dashninë që e kanë për mu.
 Domethënë sipas Lulzim Bashës kanabisi po bleka dhe Amerikën prandaj nuk u shihka fare çadra që andej! Keqardhje për Par…
 Njohja e diplomave shqiptare në Serbi është kry ka kohë Lulëzim✌Aman mbaje kufirin e rrenave brenda Shqipërisë se na turpëro…
 Njohja e diplomave shqiptare në Serbi është kry ka kohë Lulëzim✌Aman mbaje kufirin e rrenave brenda Shqipërisë se na turpëro…
 Në sondazhet e reja, Lëvizja ËVENDOSJE! është subjekti i parë në ë 
 Të gjitha grave të vendit tim e të gjithë botës i uroj gëzuar Ditën Ndërkombëtare të Gruas, 8 marsin.
 Mirëukthefsh në Prishtinë i dashur RamushMbyllet episodi absurd por beteja për fshirjen e listës së urdhër-arresteve te vje…
 Femrat janë si macet. Kur i ushqen të gërvishtin. Kur i nxjerr jashtë, qajnë pas dere. ~Sokrati
 Të rinjtë e shohin Kurtin model të politikanit, pas tij Thaçin e Veselin 
 , politikani model për të rinjët në ë 
Tu na than gjithë lshoja rrugën budallës, dojn mu ba tash krejt kryetarë e presidenta.  ë
Nese pretendon qe je "lider" i shqiptareve nuk ka logjike qe te mbrohesh me polici nga shqiptaret. 
 Me shqetësim morëm informacione se , po terrorizohet psiqikisht në mënyrë të vazhdueshme nga autoritetet e bu…
 Astrit, pse vëlla?  Pse me u ndal në këtë moshë me aq energji e ideal që na  motivonte të gjithë neve.  Ende spo mundem me bes…
 Në vend se me i blloku mallrat e Serbisë për shkak të arrestimeve, Kosova e bën Zv. KM importuesin më të madh të mallrave të S…
 Ngjyrat mbeten dhe pse ti shkove pergjithmon..
Gëzuar festën e Fitër Bajramit të gjithë besimtarve Musliman, paqja dhe meshira e Allahut qofshin mbi ju dhe Familjet tuaja ☝️❤️
===