7 Prill 2009 Në selinë e Aleancës në Bruksel u zhvillua cermonia zyrtare e ngritjes së flamujve të Shqipërisë në NA… 
AT GIOVANNi FAUSTI S.J.Që atdhe të dytë zgjodhi Shqipërinë. Pushkatohet dhe pse ishte me nënshtetësi italiane nga… 
2 Prill 1943 Krimineli Mehmet Shehu në luginën e Ramosit Mallakastë vret 83 rober italian, me urdhër të Enver Hoxhe… 
Urime Ramazani muaj i mëshirës dhe i begatisë! Urojmë shqiptarët kudo ndodhen muaj i Ramazanit t’ju sjell harmoni,m… 
1 Prill 2009 Shqipëria antarsohet në NATO.Duke u bërë pjesë e këtij Traktati. Shqipëria përmbushi një synim strateg… 
Me 27 mars 19448 Gjykatorja Popullore e Tiranës vendos heqjen nga qarkullimi të librave të “dëmshëm”për shoqërinë.U… 
25 mars 1945 Shkodra do të ndiqte e tmerruar pushkatimin e parë nga diktatura komuniste të klerikut katolik poet e… 
Ëndrrën e popullit shqiptar të Kosovës  për  të qënë i lire e bëri realitet Madelein Albright! Faliminderit o zonjë… 
Gëzuar Festën e Sulltan Nevruzit, ditëlindjen e Imam Aliut!U bashkohem sot lutjeve për shëndetin tuaj dhe të çdo a… 
22 Mars 1992 fitore e PD.Një forcë politike që u krjua nga intelektuale të ideollogjizuar nga komunizmi.Bilanci i k… 
18 Mars 1947 Një vrasje e trefishtë ndodh mbrenda Kryegjyshatës së Bektashinjve në Tiranë.Komunizmi urrente fenë.Ba… 
Me 15 Mars 1991 u rivendosën marrdhënjet diplomatike midis Shqiperisë dhe SH.B.A.Pas një ndërprerje gjysëm shekullo… 
Te dashur shqiptar kudo që ndodheni Kosove. Maqedoni e Veriut, Mal të Zi, diasporë:          # Gëzuar ditën e Verës… 
Me 11 Mars 1948 pushkatohet në Zallin e Kirit At Mati Prenushi O.F.M.Në orën 5 të mëngjezit ai tha: Jam i pafajshëm… 
9 Mars 1997 10 partitë politike nga kryengritja e armatosur e PS arritën marrveshje për ti dhënë fund krizës politi… 
Ta duash nënën siç të don ajo ty. Zoti i bekoftë nënat tona të bekuara nga i madhi Zot! 
 Dashuria e një nëne është gjithçka! Nëna ime: Ajo është e mirë, e bukur, e qeshur, e fortë. Mikja ime e parë, mikja ime më…
Shkodra votoi një të përndjekur politikë,Shkodra e urren fasadën komuniste 30 vjeçare,votoi kundra partisë që i urr… 
6 Mars 1946 me vendim të Këshillit Ministrave mbyllën të gjitha institucjonet shkollore të drejtuar nga kleri katol… 
Me 5 Mars 1944 terroristi Mehmet Shehu në fshatin Peshk Martanesh pushkatoi 22 fshatarë të pafajshëm dhe sot kjo da… 
4 Mars 1946 pushkatohen në Zall të Kirit në Shkodër 7 martirët:Patër Gjovani Fausti,Patër Danjiel Dajani, Patër Gjo… 
Me 1 Mars 1945 Gjygji Special gjykoi në 31 seanca me 1mars deri në 13 prill 1945,60 nacjonalistë të akuzuar si krim… 
Me 1 Mars 1921 Nisi punën parlamenti i parë shqiptar. Ishte një parlament me 78 deputet i dalun  me zgjedhje të lir… 
Diktatura komuniste shqiptare vriste shkenctaren e shquar Sabiha Kasimatin dhe intelektuale të shquar vetëm për bes… 
Ne bamë luftën, Ju ndërtoni Paqen!”Bill KlintonGëzuar Kosovë mvetësinë si shtet i pamvarun.Mirnjohje SHBA engjëlli… 
Në komisionin e ligjeve duke paraqitur performancën time për kanditatë për Antar i Autoritetit të hapjes dosjeve të… 
Iku nje ikone, një qendrestarë, një klerikë nje kronikan per krimet e komunizmit Dom Gjergj Simoni. Ai shkoi në bot… 
Politikan shqiptare! Ju që po luftoni me marr drejtimin e PD, ju që trashëgoni  PPSH alias PS. ditë kujtoni të… 
Postkomunizmi 30 vjeçar mban peng elektoratin e djathtë. Dje ishte dita e zezë e gladiatorve komunistë për të vazhd… 
GËZUAR 2022 !Desha t’ju uroja sonte gjithë të mirat,Juve të dashurve,Juve të mirëve,T’u uroja maleve pleqëri të… 
Bashkombasve të mi, ku do ndodheni ju Uroi: 
Shqiptarët kurrë nuk do ta harrojnë Senatorin Dole kur në krye të delegacionit amerikan në gusht të 90 deklaroi në… 
Ish Z/Kryeministri deputeti i Parlamentit Erjon Braçe në një status i bashkohet kolegut te tij Bujar Cela që përdho… 
Kur do të distancohet Shqipëria njëherë e mirë nga djalli komunist dhe tu bashkohet vlerave të shënjtorëve, viktima… 
Me 29 nëndor 1944 u vendos diktatura komuniste e cila për 50 vite vrau firmtarët e pamvarsisë, dhe elitën që kundër… 
Të dashur bashkatdhetare! Urime e gëzuar ditën e mvetësisë së kombit.Gëzuar ditlindjen Baca  Adem.Zoti  të lindi n… 
Iliaz Vrioni – Firmëtari i Pavarësisë që u flak në Osum  
At Anton Harapi dhe At Gjon Shllaku, viktima të barbarizmit më ekstrem komunist 
Ambasadori William Walker: Punoni për kauzën që bashkon të gjithë shqiptarët  
Unë gjithmonë gëzohem jashtëzakonisht shumë nëse një sulm është veçanërisht i plagosur, sepse mendoj, mirë, nëse at… 
Faliminderit o heroi i fjales lirë.Ti na mesove si të sakrifikojmë dhe të duam e të besojmë në Zot.Ti qëndrove në k… 
Sot mbushen 7 vite që nëna ime e dashur u nda nga ne. Malli dhe dashuria për nënën time të dashur është çdo sekondë… 
“Cofi një kriminel, në vend të vdiste në qeli, vdiq me të gjitha nderimet”, Ndregjoni për vdekjen e Aranit Çelës: S… 
120 vjetori i lindjes Pjetër Mëshkalla!Kur në Shkodër po zhvillohej Revolucioni kulturor, ai i dërgoi një letër Meh… 
Në ditën ndërkombëtare të paqes ne duhet të përulemi përpara 7344 burrave e grave që i vrau stalinizmi enverist shq… 
ë mos heshtim ndaj krimit komunist# Të falenderoi Fran Shkreli që nuk hesht por publikon çdo ditë të vërtetën ku… 
Stalinizmi komuniste në Shqipëri është në politikbërje. Ky regjim frikson me presione e kërcnime  premtime e pushim… 
40 vjet nga zhdukja e DON MARK HASI!Kur të zhdukurit e komunizmit do të kenë një Parcelë Kombetare të Kujtesës në… 
‘Liria nuk është kurrë më shumë se një brez larg zhdukjes’ 
“Shko përpara, dhe kur të gjith presin rrëzimin tënd”Krenari që ishim bashkohës, dhe jemi bashkombas të Shejtës Në… 
Nuk mund të jetë popull i vogël Ai që ka dhënë një Nanë kaq të Madhe. Kardinali Paskal! 
23 gushti dita europiane e kujtesës për krimet e komunizmit! Politika shtetrore shqiptare zyrtarisht,në këtë ditë,n… 
Aktuale!Unë nuk kam nevojë të jem komuniste të dua vendin tim.E dua vendin tim edhe pse nuk jam komuniste.Unë e dua… 
Një analizë e thellë, e saktë, dhe me u treguar shqiptarve të vërtetën mbi planet hegjemoniste serbe për serbizimin… 
Sot në 33 vjetorin e varjes së Poetit martir Havzi Nela “Nderi i Kombit” Faliminderit gjimnazistëve Havzinelasve që… 
Mos u shqetsoni vëllezër shqiptarë të Kosovës nga “Balilët”komunistë,dhe “Zuzarët”enveristë që duan serbin antishq… 
Të mos i zhgënjejmë shqiptarët, zonja ambasadore  
Istog Kosovë! Kosova e bukur, me shqiptarë të ndershëm e patriota! Kombëdashës të mrekullushëm! 
Çikat e Kosovës, Shqiponjat që fluturojnë në lartësitë botrore, dhe i tregojnë botës shqiponjat i përkasin lartësiv… 
Krenaria e shqiptarve Distria! Çika e Kosovës përulemi me venerim për krenarinë që ju dhe Shqiptarve! Faliminderit… 
 Bashkohu misionit për të ndërtuar Parcelën Kombëtare të Kujtesës në Tiranë! 
 demaskim i vonuar: Katovica, Fazlliçi e të tjera.....Po u lanë të gjallojnë e të shumohen rrenat publike i hapet rruga ed…
 Urime Irena! Punoni që Partia Demokratike të jetë konservatore e djathtë! ka domosdishmëri për të… 
I madhi. i pavdekshmi At Pjetër Mëshkalla do të deklaronte me 16 korrik 1967 në sallë e gjygjit në Shkodër:Ju më d… 
Sot u nda nga jeta ikona e qëndresës,28 vjeçare në burgjet komuniste, poeti i lirisë, kampjoni i fjalës së lirë Ura… 
Masakra e Sebrenicës nuk duhet harruar! Sot pashë politikanët Shqiptar të bëjnë statuse për Sebrenicën,dhe kan 30 v… 
‘SPAK, shpresë ASPAK’/ Bushati: Nga epoka e pandëshkueshmërisë, jemi në atë të ndëshkueshmërisë me leje... 
“Një KURS I GABUAR! Erërat e izolacionizmit, edhe sot si dje, po na vijnë nga veriu historikisht armiqësor i Ballka… 
Sot pata kënaqësinë të takonja Arqpeshkvin e Arqipeshkëvis Metropolitane të Tiranës-Durrës Imzot Gergo Frendo i cil… 
A mund t'i kompensojnë dëmshpërblimet mëkatet e së kaluarës? 
Gëzuar mvetësinë mikja e shtrejtë e shqiptarve SHBA!Sot në ditën e pamvarsisë së SHBA, Unioni Mbarkombëtar i të Bu… 
Mirnjohje Komuniteteve fetare shqiptare që firmosën dhe mbështeten ngritjen e “Parcelës Kombëtare të Kujtesës”mbas… 
Kur të nderojnë institucjonet e paqes dhe të lirisë!
Mirnjohje dhe krenari ndaj këtyre personaliteteve që përkundër politikës 30 vjeçare që heshtën nderuan Misionin ton… 
Për të mësuar të Vërtetën – Për të kërkuar Drejtësinë – Për të ruajtur Kujtesën”. 
Letra tronditëse: Kë përfaqësoni ju zonja ambasadore? Tom Doshin, Edi Ramën apo Presidentin e Shteteve të Bashkuara… 
'Për të ngritur flamurin, pa yllin komunist, vendosëm të çanim duart dhe me gjak të lyenim copën e bardhë...', dësh… 
Këta historian të diktaturës do të na rishkruajn historine e Shqipërise!Turp, kombëtar të i tregojsh opinionit hist… 
Unë nuk bëj pjesë në asnjë parti, por mendoj që socialistët nuk duhej të vinin në pushtet, pasi diktatura që lamë p… 
Të zhdukurit e periudhës komuniste në Shqipëri kërkojnë drejtësi! Turp për qeverinë shqiptare dhe për diplomatët pe… 
Dëshmitë e rralla të organizatorit të Revoltës së Spaçit, në maj ‘73: Të dënuarin e lidhnin pas ndonjë shtylle heku… 
“Në hetuesinë e Shkodrës, pasi ia dogjën mishin me hekur të nxehtë e qëlluan me plumb në kokë dhe...”/ Dëshmia trag… 
Përse Akademia e Shkencave të Shqipërisë nuk mund të bëjë një rishkrim objektiv të Historisë së Luftës së Dytë Botë… 
Urime dhe me fat ju qoftë festa e Fitër – Bajramit të gjithe vëllezërve dhe motrave shqiptare kudo që jetojne! Agje… 
Cdo shqiptar që u vra gjatë luftës së dytë botrore kundra fashizimit e nazizmit,meritojnë venerim ata që Partia Kom… 
Very happy !ëllezër shqiptar të besimit ortodoksë! “Për shumë mote Pashkët!” Krishti u ngjall! 
Urime për zgjedhje të lira dhe të drejta më 25 prill 2021 | Panorama ONLINE | lajm i fundit, lajmet e fundit, lajme 
Po kur policia qeveria bashkëpunojnë në vjedhjen e blerjen e votës na tregoni ju lutem çfar duhet të bëjmë? Qeveria… 
Kreu i Unionit të të Përndjekurve Politikë, Besim Ndregjoni: 25 prilli bumerang për qeverinë e krimit! Merrni pjesë… 
Gëzuar vëllezër shqiptar me besim mysliman muajn e shejtë e të madhrureshëm të ramazanit! Agjërim të lehtë e të pra… 
Frank Shkreli: “Kampionët e Reformës në Drejtësi” të Shqipërisë  via  Telegraf
Me 9 Prill 1961, kombi shqiptar humbi burrshtetasin më të madh të kombit Mbretin Zogu i Parë,Ai që krijoj shtetit m… 
Në këtë ditë të gëzuar për mbarë komunitetin katolik siç jan Pashkët kam kënaqësinë që në emrin tim personal dhe të… 
30 vjetori i masakrës së 2 prillit të 1991! 
Ndërkohë që në SHBA kujtohen viktimat e komunizmit, në Shqipëri glorifikohet regjimi i Enver Hoxhës 
2021 viti i At Pjetër Mëshkalla kundërshtarit, qëndrestarit, predikuesit të palodhur të identitetit shqiptar. I pa… 
Sakrifica e tyre amanet për të mbrotjur Lirinë, për të ndëruar paqen!Ata do jenë dritë për gjithë shqiptarinë! Ata… 
Forumi në gazetën “Telegraf”: Enver Hoxha, a kishte më shumë të mira, sesa të këqia?  via  Telegraf
Sot është 8 marsi dita e gruas!Diktatura komuniste këtë datë e shpalli ditë feste, në realitet është ditë proteste… 
Këto foto tregojnë se si shqiptarët para 30 vitesh kërkonin të shpëtonin nga regjimi kriminal komunistë! Mbas 30 vi… 
Martin Luther King-u për drejtësinë - Sipas fjalëve të tija 
27 shkurt 1967 barbarët komunist hodhën në erë me lëndë plase kineze Kishën monumentale të Vaut të Dejës pranë Shko… 
15 shkurt 1945 krimineli Mehmet Shehu mbasi e preu në besë  Preng Calin i u drejtua:Te thafshin krahet Preng Cali,… 
Ja sa bukur i këndon Kadareja borës që zen rrugët dhe dashurisë që pret.... 
Ja sa bukur i këndon Kadareja borës që zen rrugët dhe dashurisë që pret.... 
Tirana ime e dashur sot në ditën e të  dashuruarve ngjan si nuse e bukur me vello të  bardhë. Të parët tonë kan thë… 
Nuk kam nevojë që të jem komuniste për ta dashur vendin tim. Unë e dua vendin tim edhe pse nuk jam komuniste... Unë… 
Presheva dhe shqiptaria krenar me JU. Juve na krenuat si Presheven dhe shqiptarinë.… 
Urime Prof. Zef Çoba për nderimin me dekoratën e lartë    “Mjeshtër i Madh” Ju që keni kompozuar këngën hymn Xhamad… 
 Qoftë e parajsës! Rrofshi e kujtofshi!
Sot ditlindja e Ismail  e bëri letërsin shqipe të nderohet në botë!Kadare, Fishta ja lartësu… 
27 janari Dita boterore e kujtesës!Mirnjohje shqiptarve që qëndrojnë të parët në botë për humanizmin dhe strehimin… 
Gëzuar dilindjen ëlliqi edhe 100 të uron Unioni Mbarkombetar i te Burgosurve dhe te Perndjekurve Politik te… 
Sot është 89 vjetori i lindjes së burrit të ndritur të Kosovës, mendje ndrituri, zemërbardhi, paqëdashsi, mentari b… 
Ana Ahmatova - Kjo grua madhështore me të drejtë nga disa quhet Safoja e dytë - Perqasje 
15 vite më parë Kosova humbi politikanin vizjonar udhëheqësin e dimensioneve të larta, dijetarin e madh, qëndrestar… 
Sot mbushen 30 vite që u rihap xhamia e E’tehem Beut në Tirane.Mbas 24 vitesh ne qytetarët e Tiranës bëm faljen e… 
Abaz Kupi,Patriot,politikan, ushtarak.Udhëhoqi Me 7 prill 1939 qëndresën  e ushtrisë shqiptare kundër pushtimit ita… 
Dita për të mos e harruar Abaz Kupin, vdiq më 9 janar 1976 në Nju Jork 
 E pamundur mos të ndaloj te busti Havzi Nelës , para gjimnazit që mban të njëjtin emër ku unë u formova për 4 vite dhe mos të r…
Viti 2021 viti i ndërtimit të Parcelës Kombëtare të Kujtesës kushtuar 4500 shqiptarve të vrarë nga diktatura enveri… 
Unioni Mbarkombëtar i të Burgosurve dhe të Përndjekurve Politikë të Shqipërisë uron: Gëzuar e për shum mote 2021!M… 
80 vjet 1920-2020 At Gjergj Fishta është mendja zemra e shpirti i shqiptarve.Një vend që nderon poetët e vërtetë e… 
Më 30 dhjetor mbushen plot 80 vjet që At Gjergj Fishta është ndarë nga jeta.I pari shkrimtar shqiptar i nominuar pë… 
Miku im Bujar Kapexhiu në këtë natë më dërgon këtë karikaturë!Me nënshkrimin: janë gjërat që po i dëmtojnë shë… 
Keqpërdorja e Frrok Çupit, kthimi i tij në "servilin dezhurn" të të gjitha pushteteve - Gazeta Express 
Shkruan Mehmet Kraja: Vrasja e dinjitetit dhe idesë së lirisë  via 
Sot, në ditën ndërkombëtare për përkujtimin e viktimave të Gjenocidit. 4500 shqiptarë të vrarë nga diktatura enveri… 
10 dhjetor 1990!30 vite pas një gjë është e qartë: Në Shqipërinë postkomuniste ka ndodhur dështimi më i hidhur dhe… 
‘Mirënjohës përjetë Kasem Hysenbelliut’, Unioni i të Burgosurve dhe të Përndjekurve Politikë mesazh ngushëllimi pas… 
Lamtumirë Engjell! U njohëm në kohët e bukura e shpresëdhënse të  intelektual shërbeve si mi… 
Ndregjoni: Parcelë Kombëtare Përjetësimi për 4500 shqiptarët e pushkatuar që u zhdukën edhe kufomat nga diktatura e… 
Etrit e pamvarsisë që  i dhanë këtij kombi mvetësinë kombëtare i vrau e ju zhduki dhe kufomat diktatura enveriste q… 
Bashkombasit e mij kudo që ndodheni ju uroi: Gëzuar ditën e shejt të mvetësisë së kombit tonë të dashur 28 nëndorin… 
Kapiten Ded Gjonmarkaj pinjoll i familjes fisnike të njohur Gjonmarkaj të Mirditës me histori e lavdi ndër shekuj.I… 
Tahir Prençi radisti i kualifikuar në Gjermani pjestar i kompanisë 2000 vrare nga xhelatët komunist, sot pa varr.Xh… 
Një frymë e re anti-socialiste/anti-komuniste në kongresin e ardhshëm të Shteteve të Bashkuara 
Lamtumirë Valter! Miqësia jonë u ndërtua mbi vlerat njerzore dhe jo mbi bindjet politike që i kishim të kundërta në… 
Mos shikoni kisha e xhamia feja e shqiptarit është shqiptaria!                            VASO PASHA Historia për… 
Terroristi me viktimën kurrë skan barazim. Dhe vargjet e Fishtës kan aktualitet të përhershëm: Moj europë oj k....… 
Po për Holokaustin komunist shqiptar kur do të flitet? 
“Im atë komunist, ka qenë në anën e duhur të historisë”- Ish i burgosuri politik, Sami Repishti replikon me Edi Ram… 
Vlerat e një organizate që ka 30 vite që mbron dhe dokumenton krimet e komunizmit pa asnjë ndihme financiare nuk mu… 
Studjuesi,Agron Tufa sulmohet çdo ditë nga një gazet enveriste në Shqipëri.Sulmohet se thotë të vertetën me dokumen… 
Sot është 100 vjetori I lindjes së luftëtarit antifashist ,humanistit që shpëtoi familjen hebreje dhe qëndrestarit… 
Në institucjonet më të larta të shtetit që nga Presidenca, Parlamenti e institucjone qëndrore në media etj, jan të… 
Urugani i të përndjekurve politik për ngritjen e ës kombëtare të martirve të lirisë# 4500 shqiptar mbasi i p… 
Amelia në ditën e tretë të shkollës zbaton me përpikmëri masat e protokollit ndaj Covid-19. E kundërta prindërit e… 
14 shtator 2020 dita e pare shkollës për Amelian. Gezuar mbesa ime e dashur. Te uroi në rrugën e dijes të bëhesh e… 
Shenjta Nënë Terezë: “Është e bukur jeta”Jeta është mundësi, pranoje!/ Jeta është bukuri, sodite!/ Jeta është lumt… 
Kënaqësi të ju urojsh ty Dom Gjergji.Zoti qoftë i kënaqur me punën tënde! 
 familje shqiptare  prej 30 vitesh gjetjen e eshtrave të të zhdukurve nga regjimi enverist. Kosova kërk… 
Unë gjithmon e kam në zemër popullin tem shqiptar! Lutja e saj u pranofte në këtë kohë të vêshtire qe po kalon popu… 
 KOHËN E BËJN NJERZIT!Në ditën që përkujtohen viktimat e sistemeve totalitare!Unë nuk i urrej kriminelët enveristë.Un…
KOHËN E BËJN NJERZIT!Në ditën që përkujtohen viktimat e sistemeve totalitare!Unë nuk i urrej kriminelët enveristë… 
Joe Biden:Dashuria është më e fuqishme se urrejtja.Shpresa është më e fuqishme se frika.Drita është më e fuqi… 
9 gusht 2020 buze liqenit të Pogradecit! Pamje të mrekullueshme dhe manhitse. 
Në Pogradecin e Lasgushit e te Mitrushit! Cfar krenarie ndjen si shqiptar me këta gjikand të letersise shqipe e me… 
Nane Tereza, Mbreteresha Gerlandinë janë xhevairet e kombit që do të shëndrisin si historinë e këtij kombi në sheku… 
Po Baca Adem,ti e deshe Shqipërin  Ti u trondite kur vizitove ekspozitën  shqiptarë të zhdukur nga regjimi env… 
Cdo vit zgjedhor në Shqipëri ka ndryshim të kodit zgjedhor! Pse???PS&amp;PD ka 30 vite që eksperimentojnë kode zgjedho… 
Avokati Stringa:Nuk mund të gjykohet,Zotrinj Gjyqtarë,askush pa u dijtur ekaluemja e tij,këtë e lyp ekiteti i së D… 
Një postulat i Homerit shqiptar, fatkeqësisht i realitetshëm për sot. 
Urimi i Unionit Mbarkombëtar Integrimit të Burgosurve dhe të Përndjekurve Politik të Shqipërise drejtuar Zotit Elez… 
Emrimi i Zotit Elez Biberajt në postin e Drejtorit ne detyrë të Zërit të Amerikës është lajm shum i gëzuar dhe kren… 
Ishte një ditë e lumtur për kombin shqiptar, Familja Mbretërore i dha kombit shqiptar kontribute të qënsishme jetik… 
Gëzuar Amelia ime e shtrejtë 1 Qershorin .Gëzuar 1 qershorin festën e vogëlushve të të gjith Shqipërise dhe në veca… 
Një shqiptar i madh që me zërin e tij kumbues e të vecante mbajti peshë shpresat e një populli që priste… 
Mirnjohje në jetë të jetve revoltës së burgosurve politike të 21 majit që u treguan barbarve se" Liria nuk ka cmimi… 
Kjo këngë më lumturon dhe më krenon që jam Dibran.
Mirnjohje e venerim për Hafiz Sabri Kocin  Kryetarin e Komunitetit Musliman shqiptar mbas diktaturës komuniste,në k… 
Vetëm partizanët nuk kan qene kurre antifashista! 
9 Maji!Asnjëherë mos u dorëzo, kurrë mos u dëshpëro,kjo është mesazhi i Ditës së Europës.Krenar për shqiptarët ant… 
Urime mikja ime! E meritoni se jeni një grua shembullore, një intelektuale e denje per detyrat që të caktohen dhe i… 
Lamtumire Maks!Linde në Paris ku nderohesh për mendimin ndryshe, ndrrove jete në Tirane që mendimi ndryshe të etiko… 
Sot eshtë dita  botrore e lirise se mediave!Do të dëshironja që mediat e vendit tim të ishin  zëdhënset e realiteti… 
Gëzuar vëllezër shqiptar mysliman kudo që ndodheni. Le të shërbej ky muaj i shejte, ër sakrificë në këtë pandemi… 
Gëzuar Pashkët vëllezër shqiptar ortodokse kudo që jetoni e punoni.Le të kujtojmë në këto pashke Kryepeshkopin e pa… 
Miq! Po ju përcjell një poezi nga lajmëtarët e Europës që përballuan me stojcizëm të paparë diktaturën e egër stali… 
Dje në Sh.B.A u nda nga kjo jetë Elez Hoxha Ish i burgosur politike nga Tropoja që vuajti 25 vite në burgjet e komu… 
Për shumë mot Pashkët!“Vërtetë ne kemi Bajram e Pashkë, por Shqiptarinë e kemi bashkë” At Gjergj Fishta" Ju uroi v… 
Në këto ditë të pandemisë globale shikoi TV shqiptare se si promovojn cdo ditë elementet të diktaturës që për 50 vi… 
Poezi nga poeti martir i lirisë Havzi Nela që diktatura komuniste mbas 25 vitesh burg dhe internim e varin në litar… 
Poezi të poetit martir Havzi Nela mbas 23 vitesh burg politik dhe në internim Arren Kukës e varin në litar në Kukës… 
Bashkombasve të mij kudo që ndodhen në Botë!Ne këtë situat të rëndë që po kalojmë, pranoni nga ana ime dhe e famil… 
Mbas koronavirusit, një lajm i keq nga Prishtina.LDK e administruar nga Isa Mustafa, në këtë pandemi globale bëhet… 
Nuk ka turp më të madh për Tv Klan Kosovën që ditën e vdekjes së xhelates, bashkëshorte e diktatorit Hoxha ky Tv pë… 
GëzuarJu nana të ish Përndjekurve dhe qëndrestare të diktaturës komuniste e postkomuniste.Ju ishit bashkëshorte të… 
Foto e rrallë e vitit 1915, kur shqiptarët protestonin për Kosovë e Çamëri - dhe Ahmet Zogu në krye të protestês 
Ish-i përndjekuri politik: Çfarë keqardhje mund të ndjesh për një xhelate 
Gëzuar shqiptare të Kosovës 12 vjetorin e pamvarsise. Mirnjohje Presidentit vizionar Ibrahim Rugova.. dhe heroizmit… 
Sot 100 vite më pare Shtetformuesi atdhetari patrioti i madh i kombit Ahmet Zogu në baze te vendimit të Kongresit t… 
Urime e dalshi faqebardhëShpresojmë të komunikoni me ish të përndjekurit politikë të njihi me krimet që ka kryer d… 
Lamtumire Ikona magjepse e kengës shqiptare. Zëri i jot na e sjellte Kosovën në Shqpëri, pamvarsishtë se atdheu mëm… 
ZOT shtoja shqiptarisë djem e vajza si ky yll që në këtë moshë thot Jam shqiptar i Kosovës. Zoti e ruajt këtê Yll. 
Gezuar ditlindjen e 84 Homeri i letërsisë shqipe me përmasa botërore Ismail Kadare! 
Ndregjonët e Dibrës, kulla fisnike nga Lukan i Katër Grykë, që mbrojti dhe strehoi shtatë hebrejtë e familjes së Em… 
75 vjetori i Kryengritjes Antikomuniste të Malësisë së Madhe 
Edhe në ditët e vështira që po kalojme lutemi tek i madhi Zot faliminderit që na jep jetë. 28 nëndori 2019 bashkoi… 
Një analizë prefekte me të vërtetën e luftës ndaj ideologëve dhe mashtruesve të historisë së luftës të ashtuquajur… 
Rrëfime që na ftojnë të reflektojmë dhe të mos harrojmë sepse një komb që harron është i destinuar të përsërisë his… 
Akademia e çmimit botëror të "Nobelit" në 2018 u përfshi në një skandal seksual dhe nuk pati çmim. 2019 çmimin për… 
Elitat në PD, Tomorr Alizoti dhe Gjermania partnere strategjike! 
JETËN JETOE!                            E SHEJTA TEREZE!Krenari që jam bashkombasi dhe bashkohësi i të Shejtës Tereze.
Malësi e Madhe, Përkujtohen 4500 të zhdukurit e periudhës së komunizmit 
Demokraci europiane! Atë që se bëjnë Prokuroret dhe Gjygjtarë e komunizmit në Shqipëri, e bëjnë gjygjtarët italian… 
Shqipëri: Rivlerësimi i gjyqtarëve dhe prokurorëve, mes kritikash dhe debatesh  
ë përgjigje brilante ndaj Adhamudhave të demokracise shqiptare Bejko!“Isuf Kalo, doktor Adhamudhi i Bllok… 
Analisti amerikan David Phillips: Të përsëriten zgjedhjet vendore 
Hafiz Ibrahim Dalliu:Po të duash paqen, të bashkojnë me krimin,Po të duash familjen, të japin burgimin,Po kërkov… 
Nga Hafiz Ibrahim Dalliu: Komunistët.Po kërkove bukën, të japin urinë,Po kërkove jetën, të japin patërdinë,Po kë… 
Vëllezërve shqiptarë muslimanë kudo që ndodhen: 
Analiza të tilla do të ju çjerrin maskat këtyre hijenave që kan dalë në mbrotje të fasadave ideologjike e kriminale… 
Replika për 7 Prillin-‘Gënjyet për luftën, dëshmorët, njeri-tjetrin, armiqtë e vrarë…me të njëjtën lehtësi si tani’ 
80 vite me vonë Shqiperise i mungojne keta shqiptare te medhenj!Zëri autentik i Konicës, çfarë thoshte në Radio NB… 
Jetojmë kohën e  barbareve!Agroni i kulturës dhe Taku i diktaturës 
Krenare qe kam qene pjesmarres! të harrojmë# 
Më 10 shkurt 1917 lindi Musine Kokalari, shkrimtare e shquar shqiptare dhe veprimtare politike 
===