Opozita bojkoton Kuvendin, Murrizi i vendosur për të mos votuar
Test: Kafsha që shihni më parë mund të zbulojë diçka të re për personalitetin tuaj
6 Korrik 1946 – Lind në New York, Sylvester Stallone. Stallone, është një aktor amerikan, regjisor, skenarist, prod… 
Vdes një person në Malishevë nga ethet hemorragjike 
Mendohej se u zhduk 100 mijë vite më parë, rishfaqja e ‘Aldabra-s’ trondit shkencëtarët 
Më 3 korrik 1927, në Fushë Krujë, vdiq Shote Galica e lindur si Qerime Halil Radisheva (në foto me Azem Galicën), H… 
Marrëveshja me Turqinë, gati ndërtimi i 522 banesave në Laç
Sa më shumë të kalojnë vitet, aq më pak njerëz do të arrijmë të kuptojmë, mbase do të vijë dita kur nuk do të gjejm… 
Për 14 vjet, fotografi Sergio Tapiro ka kapur imazhe të vullkanit Colima, derisa më në fund një ditë ai fotografoi… 
Besiana Kadare zv/presidente e OKB/ Elez Biberaj zgjidhet në krye të Zërit të Amerikës
Kontrolli i Lartë i Shtetit: Godina e Teatrit të rindërtohet siç ishte 
COVID19/ Ministria e Shëndetësisë: Humb jetën një tjetër pacient
Parada e Ushtrisë Popullore në  30 vjetorin e Çlirimit të Atdheut. Nëntor 1974. 
Agjensitë Hapësinore në SHBA, Evropë dhe Japoni njoftojnë ‘Panelin’ e COVID-19 
Hefesti, Metal-punuesi Pellazg dhe Adem Jashari, Hero Kombëtar Shqiptar, në të dyja fotot nuk mungon plisi hyjnor,… 
Bizneset fshehin të prekurit”/ Inspektorati: Gjoba nga 100 deri në 700 mijë lekë
Figura e parë që shihni tregon personalitetin tuaj të fshehur; zbuloni pjesët e panjohura të karakterit
 Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
 Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
 Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
 Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
 Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
Afrikë e Jugut/ Gorilla në ndërhyrje kirurgjikale
Më pak turistë të huaj/ Në Dhërmi të gjitha shpresat te vendasit
Për herë të parë 4 shqiptarë në parlamentin serb, Vuçiç merr 63% të votave
NASA kërkon prova të teknologjisë jashtëtokësore në hapësirë
Akullnaja në Itali/ Mbulohet me mushama gjigande
Video/ Shfaqet ujku në bregdetin e Otrantos, pamjet
Momenti që përloti botën, çfarë i tha kosovari amerikanit
SR-71: Avioni i kohës së Luftës së Ftohtë që ende mban rekordin e shpejtësisë                            
Të fundit nga lloji i tyre, brenda fisit indian që prisnin kokat e rivalëve të tyre (FOTO) 
Malësia e mban gjallë këngën folklorike burimore me breza
Lëvizja ‘Djemtë e Labërisë’ djeg flamurin terrorist Vorio-Epirit, ultimatum për heqjen e lapidarit të ushtarit grek
SKANDALI/ U përurua vetëm një javë më parë, përmbytet parku "Rinia" (FOTO&amp;VIDEO
“Pika kulmore e një lufte është çorientuese, duhet ndjerë pasiguria (rreziku). Atëherë kujdesi dhe guximi do të ju… 
Mjekët shpjegojnë se si drita e telefonit humbet rritjen e trurit tek fëmijët
Njihuni me 22 fotografitë më të bukura të planetit 
Peticioni/ Diaspora kërkon të votojë: Të implementohet kjo e drejtë para zgjedhjeve të ardhshme
 NASA vëren një vorbull të çuditshme në liqenin e Shkodrës 
 NASA vëren një vorbull të çuditshme në liqenin e Shkodrës 
 NASA vëren një vorbull të çuditshme në liqenin e Shkodrës 
NASA vëren një vorbull të çuditshme në liqenin e Shkodrës 
Kastriot Berishaj: Shqipëria e Bashkuar nuk bëhet me pseudopatriot që falen në drejtim të Athinës, Beogradit dhe St… 
Gazeta zyrtare e Vatikanit konfirmon se katër Papë kanë pasur origjinë shqiptare 
Trazirat, plaçkitjet e zjarrvëniet po ndodhin kryesisht gjatë natës”, situata në dhjetra shtete amerikane e tension… 
Jeni për rindërtimin e Teatrit siç ka qenë apo sipas projektit të Bjarke Ingels? 
Me 28 Nëntor 2020 bëhet promovimi i librit “Filozofia Kombëtare për Shqipëri të Bashkuar”, me autor z. Kastriot Ber… 
Kur dashuria është e pastër/ “Më mirë me një në karrocë se sa me një drogaxhi”
Infektoi gjithë botën, shihni çfarë po ndodh në “tregun e ferrit” në Kinë (FOTO) 
Shkarkohet gjykatësi i përdhunimit që pyeti akuzuesen nëse “i mbylli këmbët” 
“Ai që nuk bënë gjithçka dhe nuk jep gjithçka për ta bashkuar Shqipërinë; ai i ka mohuar gjithçka vetvetës dhe fami… 
E dhimbshme/ Nëna i kishte ndërruar jetë, vogëlushi luan rreth trupit të saj
Këta yje braktisën role të mëdha
Faik Konica; Sa e sa marrëzi, sa e sa poshtërsi e krime janë bërë në emër të së gjorës Shqipëri!
 Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
 Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
 Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
 Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
 Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
Vendi më i tmerrshëm në botë ku anijet gjigande shpërbëhen në skrap 
Pamjet/ Prifti bën lutjen e çuditshme për të ndalur koronavirusin, varroset dhe ndez flakën rreth vetes 
Vanessa Bryant rigjen buzëqeshjen: video e hapave të parë të vogëlushes Capri bëhet virale 
Boll luajtët'', Yuri Kim trondit politikën shqiptare 
Reklama për biznesin tuaj
Maliqi: Këtij Parlamenti i ka ardhur fundi, të shembet
Basha premton të mos i ndahet Ramës me protesta: Do t'a ketë fundin e shpejtë!
"E ke me të dëgjuar nga TV", Rama mohon dhunën e policisë ndaj qytetarëve (FOTO LAJM)
Basha hapi lokalin e u ul me mbi 10 vetë, Rama: Mirë t'i bëhet, të gjobitet sipas ligjit! 
Ua mori jetën natën e Vitit të Ri, çfarë po ndodh me shqiptarin që vrau vajzën dhe dhëndrin 
Merkel thotë se ka prova të forta dhe akuzon Rusinë: Kjo është mizore!
 Qyteza “e mallkuar” italiane që dhe banorët kanë frikë t’i përmendin emrin 
 Qyteza “e mallkuar” italiane që dhe banorët kanë frikë t’i përmendin emrin 
Qyteza “e mallkuar” italiane që dhe banorët kanë frikë t’i përmendin emrin 
Ministria e Shëndetësisë i kërkon FSHF: Përmirësoni protokollin
Nuk na rruhet k***", të rinjtë në Tiranë dalin nga makina luksoze dhe rrahin dy agjentë të krimeve 
 Hajdari pas mbledhjes së Këshillit Politik: Jemi në këtë derexhe si pasojë e sistemit
Hajdari pas mbledhjes së Këshillit Politik: Jemi në këtë derexhe si pasojë e sistemit
Gati të hidhet në treg 10 mijë lekëshi i ri, elementët e sigurisë që i shtohen 
Çfarë është kozmetika e gjelbër për të cilën po flasin të gjithë?
 Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
 Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
 Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
 Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
  Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
 Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
Si mund ta ndërrojë çipi i Apple përdorimin e iPhone-it përgjithmonë 
 Cilat ishin fjalët e Ibrahim Rugovës kur kishte kuptuar për vrasjen e Aganit? 
 Cilat ishin fjalët e Ibrahim Rugovës kur kishte kuptuar për vrasjen e Aganit? 
 Cilat ishin fjalët e Ibrahim Rugovës kur kishte kuptuar për vrasjen e Aganit? 
Cilat ishin fjalët e Ibrahim Rugovës kur kishte kuptuar për vrasjen e Aganit? 
 Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
  Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
 Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
 Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
  Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
 Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
 Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
Si asnjëherë më parë, shihet në Nartë shpendi i rrallë për Shqipërinë (FOTO LAJM) 
Virus”, filmi kosovaro-italian që kishte parashikuar ardhjen e një virusi vdekjeprurës 
Gai Plin Secundi: Romakët i kopjuan monedhat e argjendit nga epirotët dhe ilirët 
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
  Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
Profesoresha maqedonase shpreh gjuhë të urrejtjes ndaj shqiptarëve (FOTO LAJM)
 U infektuan me COVID-19, gruaja shtatzënë dhe djali 2 vjeç nisen drejt Tiranës
  U infektuan me COVID-19, gruaja shtatzënë dhe djali 2 vjeç nisen drejt Tiranës
 U infektuan me COVID-19, gruaja shtatzënë dhe djali 2 vjeç nisen drejt Tiranës
U infektuan me COVID-19, gruaja shtatzënë dhe djali 2 vjeç nisen drejt Tiranës
 Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
  Dua Lipa artistja femër më e dëgjuar në botë
    Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
 Dua Lipa artistja femër më e dëgjuar në botë
Dua Lipa artistja femër më e dëgjuar në botë
===