 Komplimente për denoncimet shumëvjeçare zotëri!
 Që të mos hyjnë Saliu and co
Kujdes se po del kundër ShBA-së e cila e qortoi këtë vendim të BE-së. Kujdes zotëri! 
 Edhe pse kanë difekte janë shumë herë më të besueshëm se sa klasa jonë politike.
 Po, po të ishte Ristani tek dhoma VAR-it!
Në regjimin e tij, Ebrahim Raisi (Iran) fiton me 61.95% të votave ndërsa në partinë e tij Lulzim Basha (PD) fiton m… 
 Komplimente për atë sy dhe për atë vetull.
   E keni fjalën për kleptokracinë kur punonit në dogana?! E di ju mungon shumë ajo kohë!
 Secili po ndjek interesat e tij në PD dhe askush nuk po hap gojë për farsën që ka pllakosur. Politika është… 
 Ne 2021 duhet të kuptoni se gjithsekush ka të drejtë të ketë pasionet e tij dhe jo ti caktojë partia si dikur.
 Tëmën çbëet, ore! Se kur i hipin nervat çomes i thyen të tëra ai; me pjata me filaxhana...
Një ditë do paguani për këtë lluks, cent më cent. Jeni të rrethuar. Gjeni avokat të aftë! 
Ç'është fajsia?Se duhet të jetë i fajshëm që ta shkarkojë gjykata. Fajsia është qëndrimi psikik i personit ndaj ve… 
  Uroj që rinia shqiptare të arsimohet në universitetet më të mira botërore dhe të kth… 
 Eshtë një mësim i mirë për ata që shkelin ligjin.
  Po punoni mirë për mos-hapjen e negociatave. Nga të paktat gjëra që  dhe "kryetari" e bën shumë mirë.
Presidenti ka një shpëtim: - Aty ku nuk hyn matematika fjala është e fuqishme, domethënë avokatia.
Eshtë vendim i politikës Amerikane. Nuk e di çe ka atë avokat Saliu por këto janë koshiencë fëminore. Kryetari i De… 
Kanë dalë të gjitha çfarë kam thënë. Prisni, nuk kanë mbaruar, do kemi lajme të tjera në kohën e duhur. Kujdes edh… 
   Zotëri nuk ke kuptuar asgjë sepse jemi në disbalancë. Ndaj respekto me kontin… 
   Politika është interes zotëri dhe mbi të gjitha interes mbi tregun, nuk është… 
 Doni demokraci por nuk pranoni mendim ndryshe. E pra meritojmë ekzaktësisht këtë qeveri që kemi dhe këtë opozitë që kemi.
   Zotëri varet nga konteksti dhe koha.
Dëgjoni këtu...Kush mendon se është i domosdoshëm dhe i pazëvendësueshëm në shoqëri, ju them se varrezat e botës ja… 
Një udhëheqësi kurrë nuk i mungojnë justifikimet legjitime për të mos e mbajtur fjalën e dhënë.N. Machiavelli 
 Hetimet për tragjedinë e Gërdecit/ Reagon Mediu: Sjellja e SPAK ka pikëpyetje, janë tejkaluar afatet!,
Këtyre ja u ka thënë Virgjili: "Una salus victis, nullam sperare salutem" - Vetëm një gjë mbetet për të mposhturit,… 
 Urime z. Xhafaj! Ky është një mesazh i qartë i popullit shqiptar për atë çka ju keni punuar dhe jeni… 
Kur do vijë dita që të kemi një "concession speech"?Nuk ka ligj që thotë se një fjalim i tillë duhet të ndodhë. T… 
 Kjo është demokracia zotëri. Ndryshe ma hiq të drejtën të votoj dhe thuaj pastaj se zgjodhe për mua Perëndimin.
Duhet të merremi me thembrën e Akilit. Nuk janë programet zotëri. Demokraci zotëri nuk do të thotë program, do të t… 
Kështu kemi votuar gjithmonë në Shqipëri dhe kemi arritur këtu. Mos ka ardhur koha të votojmë realisht të lirë?! Të… 
 Ne shqiptarët, ne që na referohej Maks Velo.
 E kemi kollaj të konstatojmë, por në pushtet "harrojmë" të veprojmë.
Nëse sje në grevë zonjë atëherë ske kërkesa. Nëse ske kërkesa por ke stres shkoni tek mjeku, merrni pushim e kuroni… 
 Jemi në pandemi or zotëri, çfarë Reagan na tregon?! Ku keni parë skllever ju që paguhen më shumë se Presidenti i Republikës?!
 Kinezët kanë thënë një shprehje, kush nuk di të buzëqeshë nuk hap sot dyqan, unë e kam ndryshuar si… 
  Mjafton të mos e plaçkisin e të largohen
Erdhën në politikë me kostum turk dhe me sandalle, tani janë me vila në bregdet. I tremb reforma në drejtësi. I kës… 
 Nuk ju takon të flisni kështu se jeni edhe mjek. Po çfarë i pandehni ju shqiptarët? Low level?
Brenda konceptit amerikan të politikës, dakort jemi?!Të 2 çuan të korruptuarit në shtëpi dhe kanë mundësi të krijo… 
Demokracia Amerika ka ardhur nga Kapitali zotëri, financiar dhe njerëzor. Gjithë kjo mrekulli vjen edhe si pasojë e… 
Po të kishim një popull të mirëarsimuar, që e njeh kapitalin ashtu siç e njeh Bill Gates, zgjedhjet në Shqipëri do… 
Kafsho gjuhën dhe hesht për të madhin RN. Po të ishte me ju do flisje ndryshe.Kur të mungon verbi politik zotëri,… 
E dini ju se çka thënë John Smith? Dy janë shtyllat e demokracisë: Liria, ligji e drejta. Je me këto, je me mua sje… 
Po të ketë pushtet gjyqsor të pavarur dhe të drejtë, nuk ka korrupsion. Mori fund ajo... Po të ketë gjahtarë të zot… 
Logjika shkon nga një moment general, në një moment partikolar dhe nga një moment partikolar në një moment singolar. 
Dy gjëra ka; Politika amerikane nuk mundet ndonjëherë në vendet ku ka interes dhe aq më tepër ku është prezent. 
 Që të dy janë otomanë Rama-Basha. Nuk pranojnë kritikë dhe mendim ndryshe. 
   Xhafaj me kontributin e tij në reformën në drejtësi ka mbështetjen amerika… 
 Politika është verb zotëri, nuk është mediokritet. Kur të gjithë hezitonin, Churchill-i mobilizoi gjuhën a… 
Ka kishë që nxjerr një gjuhë të mallkuar?! 
Tani dëgjoni me vëmëndje, bën gabim që sjell njerëz me pa intelekt profesional në studio! Kjo është e para. Profesi… 
Freud-i ka thënë: Arti është erotikë e kamufluar. 
Niset për në Romë, përfundon në Kostandinopol. Nuk shpëton dot të prishësh marrëveshjen me amerikanët. E di çdo të… 
Tani vijmë këtu; Zonjë: Shteti është nocion serioz. Baballarët e mëdhenj të shtetit na kanë thënë: midis anarkisë d… 
Dëgjoje zonjë ta kesh nga unë, superiori nuk fyen. Tani, të vazhdoj unë... 
Mor zotëri, unë bëj vetëm monolog, nuk bëj dialog! 
  Adam Smithi na thotë që bollëku (oferta) përcaktohet nga kërkesa dhe vice versa. Në një treg… 
 Po pse kështu bëhet politika zonjë?- Me llafe dhe gossip baresh të Tiranës? Politika është verb zonjë.
Dëgjo si është problemi, dëgjo ti zotëri... Dëgjo të them një gjë, të jap një këshillë!Respekto me kontinencë dmt… 
===