 Shqiptarët e dinë që Rama në qeveri është më i dëmshëm se “Ramët” e emëruar prej tij në bashkitë e vendit. Dy gjëra jan…
 1/2 Sot pata kënaqësinë të mirëpres Ambasadorin e Japonisë në Shqipëri, z. Takada Mitsuyuki. I shpreha mirënjohjen për…
 Mund të lash duart me një kryebashkiak të korruptuar apo të bësh koka turku bedelët e tu në atë sallë, por shqiptarët e…
 “E ka fajin Europa” llomotit poshtë e lart, për të fshehur dështimin e tij dhe pengimin e Shqipërisë. Por sapo i jepet…
 Aeroporti Ndërkombëtar "Nënë Tereza" do tu kthehet shqiptarëve dhe shtetit të tyre sipas përcaktimeve fillestare të kon…
 Çdo akt koncesioni, PPP apo zgjatje koncesioni i propozuar nga qeveria ne ikje, është në shkelje flagrante të ligjeve t…
 Pavarësisht prej të kaluarës, çdokush që është i/e vendosur me sinqeritet për projektin e ndryshimit që unë drejtoj, jo…
 Shqipëria ka numrin më të lartë të bizneseve të mbyllura në rajon, numrin më të lartë të qytetarëve që humbën  vendin e…
 Në Torovicë banorët më informuan se mbi 70 familje janë të izoluara nga uji, pa asnjë ndihmë nga shteti. Qeveria është…
 Edhe sot Rama u përpoq të fajësojë të tjerët për dështimet e tij.Largimi masiv i shqiptarëve është një nga dështimet më…
 Pas 7 vitesh dështime dhe premtime të pambajtura, 7 vite mashtrime, vjedhje dhe dështime, 7 vite dhunë dhe terror ndaj…
 Mësova me hidhërim për ndarjen  nga jeta të ish-ministrit dhe ish-deputetit Marko Bello. I shpreh ngushëllimet e mia fa…
 Kjo ditë feste i gjen sivjet Shqipërinë dhe shqiptarët përballë sfidës së pandemisë, që u ka marrë jetën shumë prej nes…
 Angazhimi i tij si ligjvënës dhe zëvendëskryeministër gjatë qeverisjes së Partisë Demokratike pas rënies së komunizmit,…
 Me keqardhje mësova për ndarjen nga jeta të Bashkim Koplikut, politikanit që dha mbështetjen dhe kontributin e pakursye…
 Kush gënjen për një çështje kaq të ndjeshme, gënjen për gjithçka. Shqiptarët kanë nevojë për një qeveri që punon për ta…
 Pasi denoncimit të fakteve se gënjeu për numrin e viktimave të Covid-19, Ramës ju deshën dy ditë për t'u përgjigjur. Dy…
 Ndërsa vendi po thyen rekordet e infeksioneve, Rama merret vetëm me sulme politike dhe gënjeshtra. Bashkë do të sjellim…
 Nëse Rama do kishte investuar kohën e tij sot, në shërbim të qytetarëve në vend që të cicëronte gënjeshtra kundër meje,…
 Përfytyroni një qeveri që punon për njerëzit, që jep ndihmë financiare për çdo familje. Një qeveri që ka një plan kundë…
 Pas 7 vitesh plot dështime, ku Rama vetëm e shkatërroi ekonominë dhe shëndetësinë, shumëkush priret të mendojë se nuk…
 Rama vazhdon cicërimat në vend që të bëjë detyrën. Shqipëria është në kulmin e infektimit ndërsa Rama është mbërthyer p…
 Unë jam nip Kosove. Gjyshi im është nga Likovci i Drenicës dhe është larguar nga masakrat serbe bashkë me djemtë e Shab…
 Sonte do të rrëzoj të gjitha shpifjet e ulëta të Ramës. Jo për veten time por për Kosovën! Më ndiqni sot live, ora 21:0…
 Shqipëria ka nevojë për shpresë të re. Vendi ka nevojë për një qeveri që kujdeset për qytetarët e tij dhe fuqizon ekono…
 Shumë pak, shumë vonë. Ka mbi 6 muaj që kemi propozuar plan masash për të përballuar pandeminë. Fatkeqësisht Rama nuk e…
 Bashkë do ta mposhtim Ramën, do të shërojmë Shqipërinë, do të ndihmojmë familjet shqiptare dhe ekonominë e do të sjelli…
 Lushnja lëngon nën ethet e sëmundjes. Mësuesit në Lushnje janë më të pambrojturit dhe të terrorizuarit nga përhapja e f…
 Kur e gjithë rroga mujore nuk të mjafton për të blerë ilaçet e  dhe shteti nuk të dëgjon... Ku i marrin paratë…
 Kjo është përballja dramatike e Muharrem Poleshit me COVID.  Urgjenca nuk i përgjigjet 8 ditë rresht dhe kur i përgjigj…
 Premtove se do ulësh çmimin e energjisë - gënjeve. Po vjen dita të largohesh gënjeshtar. Është koha për një të ardhme t…
 Edi Rama leri shpifjet dhe lojërat politike, përgjigju pse nuk e hap Covid 4? Pse të infektuarit dergjen nëpër ambulanc…
 Rama ka humbur çdo kontroll mbi pandeminë. Kemi testimet më të ulëta në Europë, numrin më të ulët të mjekëve dhe spital…
 Sot pata kënaqësinë të takohem me ministrin e jashtëm të Greqisë . Gjatë bisedës, nënvizuam domosdoshmërin…
 Në emër të Partisë Demokratike dhe opozitës shqiptare e falenderova atë për mbështetjen e çmuar që Greqia po i jep vend…
 përfshirë edhe lehtësitë për shqiptarët që jetojnë e punojnë në Greqi. Riktheksova qëndrimin e shprehur prej 10 vitesh,…
 Dhimbjet e shqiptarëve që ke zhytur në skamje e nuk kanë mundësi as për ilaçe, shëndetësia në kolaps, ekonomia në krizë…
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
 Kur vjedhja galopante, keqqeverisja, ekonomia dhe shëndetësia janë sot drama e çdo shqiptari,KM fshihet si struci pas n…
 Rriten infeksionet, bien testimet. Ndërkohë që njerëzit kanë nevojë për mbështetje dhe ndihmë, Rama vazhdon me vjedhje…
 Akti i sotëm antikushtetues shkatërron konsensusin e 5 qershorit dhe godet rëndë integrimin europian të vendit. Rama e…
 që na mbajti për 50 vjet larg vlerave europiane por edhe si frymëzim për rrugën plot sfida në mbrojtje të lirisë. Sot j…
 Ribashkimi i  30 vjet më parë shënoi nisjen e rënies së mureve në mbarë Europën lindore dhe hodhi themelet e bashkimi…
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
 Këtë vit, Dita Ndërkombëtare e Trashëgimisë Kulturore e gjen Shqipërinë pa Teatrin Kombëtar, që u shemb nga regjimi si…
 Teatri Kombëtar nuk ishte thjesht një institucion i kulturës dhe një gjurmë elegante e trashëgimisë tonë. Falë rezisten…
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
 Shpreh shpresën dhe besimin se kjo marrëveshje do të përbëjë një hap të rëndësishëm drejt normalizimit të marrëdhënieve…
 Personalisht dhe në emër të Partisë Demokratike përshëndes marrëveshjen e arritur mes delegacioneve të Kosovës dhe Serb…
 do ti japim frymëmarrje ekonomisë për të sjellë investime, mundësi punësimi me të ardhura dinjitoze dhe jetë më të mirë…
 tërheqëse për investime. Vendit sot i duhet një model i ri ekonomik, me taksa të ulëta,mbështetje për sipërmarrjen, sti…
 Raporti i fundit i EuCham që e rendit  ndër tre vendet e fundit në  për të bërë biznes, konfirmon qartë se kjo qeve…
 Leri dërdëllitjet prej rrugaçi Edi Rama. Bëj transparencë çfarë po ndodh me negociatat për detin. Historitë me sapun ru…
 Po ta përsëris Edi Rama, bëj transparencë e mos u fshih pas gërrvërreve bajate. As servilët e fundit që të kanë mbetur…
 Njerëz të braktisur nga një qeveri e dështuar. Turp!                           
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
 jo lojën tënde dhe të krimit që të drejton prej 22 vitesh në politikë, por hallet dhe problemet e shqiptarëve, që ti dh…
 Koston e konfliktit të krijuar me hedhjen në erë të marrëveshjes së 5 Qershorit dhe 14 Janarit, do ta mbash vetëm ti pe…
 Shqipëria në krah të Kosovës me diplomacinë e saj dhe në koordinim të plotë me partnerët tanë strategjikë &amp;, dha gj…
 10 vjet më parë GJND konfirmoi se shpallja e pavarësisë së Kosovës ishte në përputhje me të drejtën ndërkombëtare. Sot…
 Lulzim Basha ka qenë sot në Pogradec për të parë nga afër situatën e biznesit të vogël të këtij qyteti dhe gjendjen e tur…
 Sot pata një bisedë telefonike me  Ministrin e Jashtëm të Italisë, Luigi Di Maio. E falenderova për ndihmën e madhe që…
 Pata kënaqësinë të mirëpres sot ish nënkryetarin e Kuvendit të Kosovës, z. Xhavit Haliti dhe ish zv/kryeministrin e min…
 Me taksën e sheshtë 9% do të përfitojnë TË GJITHË të punësuarit si në sektorin privat ashtu edhe në atë publik, dhe do…
 ëri është e do të jetë gjithmonë në krah të Kosovës dhe popullit të saj.
 Kam bindjen se Hashim Thaçi, Kadri Veseli e të gjithë bashkëluftëtarët e tyre do ti dëshmojnë sërish botës drejtësinë e…
 Taksa e sheshtë 9% dhe plani ynë ekonomik do të inkurajojë investimet e brendshme dhe të huaja, do të nxisë punësimin d…
 Çdo vonesë dhe zvarritje në emërimin e gjyqtarëve të GJK vonon daljen nga kriza politike dhe mban mbyllur dyert e BE pë…
 Ushtria Çlirimtare e Kosovës luftoi për liri përballë një agresori që nuk kurseu asgjë, nga genocidi tek sprastrim etni…
 Sot ekspeditë alpine nga Valbona në Theth: Një mrekulli e papërshkrueshme me fjalë. Nuk ka vend më të bukur se i yni! L…
 ...dhe jo të siguronte testimet e duhura apo të mbështeste qytetarët në vështirësi dhe ekonominë në krizë të thellë. So…
 Nëse Rama do të kishte bërë testime si në çdo vend tjetër, ne do ta dinim ku dhe si po përhapet koronavirusi.  E kam ng…
 Këto të vërteta dhe bashkimi më i madh i shqiptarëve kundër mjerimit ekonomik dhe padrejtësive të RAMAVIRUSIT, do ta la…
 E vërteta e vetme e këtij KM dhe bufonëve të tij është plaçkitja e shqiptarëve për interes të banditëve dhe oligarkëve…
 Babëzia, arroganca dhe shpifja janë trinomi i pandarë i RAMAVIRUSIT që prej 7 vitesh i ka shtyrë shqiptarët drejt shpun…
 Me Presidentin e Kosovës  biseduam për zhvillimet aktuale &amp; ato të pritshme në Kosovë.Forcimi i shtetit…
 Në ditët më të vështira për shqiptarët, kur xhepat janë të zbrazur dhe varfëria po rritet çdo ditë, Edi Rama përdor dhu…
 Ka ardhur koha për ta larguar RAMAVIRUSIN që e zhyti ekonominë në krizën më të thellë, që mbylli bizneset, shpunësoi e…
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
 Një e dielë e veçantë për nënën time dhe një nga ditët më të lumtura për mua, vëllain tim dhe babain tonë, tek i uruam…
 I uroj punë të mbarë qeverisë së re të Kosovës dhe kryeministrit Hoti në plotësimin me sukses të objektivave strategjik…
 Në emër të Opozitës së Bashkuar ju shpreh falenderimet tona aleatëve dhe partnerëve tanë euro-atlantikë për ndihmën dhe…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Konsolidimi i shtetit, integrimi euroatlantik, mbrojtja e integritetit dhe sovranitetit të Kosovës, janë sfidat, përbal…
 PD dhe Opozita e Bashkuar janë të vendosur për kontributin tonë për zgjedhje të lira dhe të ndershme. Ato janë në inter…
 Teksa po i afrohet fundit të qeverisjes RAMAVIRUSI ka hequr dorë nga fasada. Shkatërroi Teatrin Kombëtar duke përfituar…
 .  Shqipëria të ecë para, të mos mbahet peng i së shkuarës, por të hapë rrugën e integrimit europian!Fjala e…
 Në mbyllje të Muajit të Shenjtë të sakrificës, lutjeve dhe përkushtimit ndaj Zotit, uroj harmoni, solidaritet, begati për…
 Gëzuar Fitër Bajramin, festën e madhe të shpresës dhe besimit!Zoti e bekoftë Shqipërinë dhe mbarë kombin shqiptar! htt…
 Bajram të gëzuar dhe me fat nga Shkodra! Paqe dhe gëzim në zemrat dhe shtëpitë e shqiptarëve në këtë ditë të madhe shpr…
 Giovanni Falcone është frymëzim për çdo magjistrat të përkushtuar ndaj drejtësisë së vërtetë dhe përparimit të vendit t…
 Shembja e Teatrit është prova e fundit e një hajduti ordiner që i vjedh, i varfëron, dhe i dhunon shqiptarët. Me çdo di…
 Ai shfrytëzoi edhe pandeminë për të vjedhur, për të shkaterruar teatrin, për të grabitur pasuritë publike dhe i la njer…
 Rama nuk e sheh më vizën e korrupsionit dhe as vizën e dhunës. Ai është peng i krimit, dhe sillet si kriminel me njerëz…
 Rama është varrmihësi i paqes sociale në vend,varrmihësi i ekonomisë së shqiptarëve,hajduti i pronave publike dhe një k…
 Me shembjen e paligjshme të TK për të pastruar paratë e pista të klientëve të tij, Rama i vuri kazmën themeleve të shoq…
 ✔️Teatri Kombëtar nuk është vetëm një godinë që duhet ruajtur por simbol i demokracisë në vend, ka të bëjë me dëgjimin e…
 Mashtrimet nuk hahen. Fjalët boshe nuk e ndihmojnë ekonominë. Gënjeshtrat dhe sajesat e shtetit prej kartoni nuk i fshe…
 Kjo dhunë, kjo krizë, kjo vjedhje dhe batërdi me pronat publike, kjo padrejtësi ndaj shqiptarëve, kjo varfëri ekstreme…
 Dënoj me forcë dhunën barbare ndaj një të mituri. Dhuna është fytyra e shtetit të Ramës, është oferta e tij e vetme për…
 Asnjë KM tjetër në botë nuk gënjen si Rama që mos tu japë njerëzve lekët.Asnjë KM në botë nuk ka infektuar 2 bashki sep…
 Fatkeqesisht, edhe këtë vit vendi bëri hapa mbrapa në indeksin e lirisë së medias në botë duke zbritur përsëri disa ven…
 RAMAVIRUSI infektoi dhjetëra vajza dhe nëna me COVID-19 sepse refuzon të mbyllë fasoneritë e të paguajë pagat e mbijete…
 Afera me TK është vjedhja më e dhunshme që u bëhet shqiptarëve nga Rama. Grabitja e TK në mes të pandemisë është akt lu…
 Ekonomia jonë pritet të tkurret me 9%, më keq se në cdo vend tjetër, sepse RAMAVIRUSI zgjodhi të paguajë me paratë e sh…
 Për 7 vjet me radhë, RAMAVIRUSI e ka gërryer ekonominë, shëndetësinë dhe mirëqenien e shqiptarëve. CORONAVIRUSI vetëm s…
 Pasi i vjedh përditë dhe i gënjen me premtime boshe, Rama përdor dhunë fashiste kundër qytetarëve edhe sot në …
 Me amb  në : mirënjohje për mbështetjen e çmuar të BE për  kundër  dhe për krizën ekono…
 Ndërkohë që shqiptarët presin zgjidhje për krizën që ka pllakosur, Rama gjen kohë vetëm për të grabitur. Kalimi i TK në…
 Sot në ditën botërore të lirisë së medias përshëndes të gjjthë gazetarët dhe median që në këtë periudhë të vështirë kun…
 Lavdi përjetë Dëshmorëve të Kombit! Kjo ditë sot më shumë se kurrë na fton të reflektojmë mbi vlerat e vërteta që e bëj…
===