Fundja bursa e inceneratorëve të plehrave e ka barazuar çmimin e një ton plehra me atë të një vote: diku tek 50 Eur… 
rrëzoi parimin që vota e lirë përcakton pushtetin publik. Është paraja ajo që e përcakton për fat të keq! Sa më pak… 
sa është çmimi për ton plehra. Kazanët mund të presin plot në mes të vapës në fillim të sezonit turistik. Mandati… 
simptoma të një pushteti të degjeneruar, në kryeministri apo në bashki, që nuk jep llogari tek zgjedhësit por u kër… 
pushteti publik që quhet votë. Shoqëria po emancipohet për lloj-lloj çështjesh e të drejtash, përfshirë edhe tabu.… 
Faji sërish shigjetohet te politika ama ata që shesin votën duke zhbërë votën e atyre që e kanë pa çmim, e mpijnë n… 
Një rrip prone, një derë makine e gërvishtur në parkim mund të kushtojë jetën. Madje tashmë edhe një shezlong mund… 
Por përpara tij, në pellg ngjyrë myshku është kthyer ndërgjegja e atyre që votën e tregtuan me çmimin që i vendosën… 
Kazanë të “mbushur” me vota!Ka dy lloj votash të lira në këtë shtetin tonë: votë e lirë sepse nuk ta prek kush dhe… 
dhe kauzë të drejtë duke bindur shqiptarët. Ai është prova se Parlamenti, ku na mandatoi për t’i përfaqësuar gjysma… 
Parlamenti është shtegu më i vështirë për të ecur për një Opozitë në një regjim që maskohet me votime, sepse asaj i… 
Kam qenë i ndërgjegjshëm kur e shkruaja se është ligji më i ashpër i llojit të vet në Europë, por këtu e çoi vendin… 
trafiqe e krime të tjera dhe ata ende do të ishin në Parlament e bashki. Pa këtë ligj, Rama do vazhdonte të mbronte… 
që nuk do të funksiononte. Ja ku është!Po të mos ishte ky ligj sot, me mekanizmin e tij të pamëshirshëm e të ftoht… 
6 vite më parë kur hartoja ligjin e Dekriminalizimit më duhej të përballesha jo vetëm me socialistët që pengonin ha… 
Arma më e fuqishme e OpozitësLigji i Dekriminalizimit funksionon si sahat! Një tjetër kryebashkiak i dënuar me bur… 
Nën qeverisjen e tij shitblerja e votës, që me ligj quhet korrupsion, për herë të parë u bë problemi më i rëndë dhe… 
miratohej e gjithë reforma.Në tetë vite Edi Rama nuk ka bërë as edhe një fraksion të asaj që ka bërë Sali Berisha.… 
Kryeministri Edi Rama në zgjedhjet e 2021.Sali Berisha është një nga mbështetësit kryesorë në 2015-2016 të reformë… 
ndërkohë ende nuk kishte mbaruar së pushuari nga puna mijëra nëpunës civilë që të punësonte militantlt e saj). Një… 
Berisha e përmbushi.Në vitin 2013 Kryeministri Sali Berisha mundësoi zgjedhje të lira e të ndershme dhe rotacion d… 
Po në vitin 2009 BE pranoi kërkesën e Kryeministrit Berisha për antarësim. BE besoi në reformat dhe luftën kundër k… 
Në vitin 2009 NATO na pranoi si shtet anëtar. Kryeministri Berisha udhëhoqi proçesin e anëtarsimit. Ne nuk kemi ush… 
Në vitin 2006 Kryeministri Berisha bindi të gjitha shtetet e BE-së që të nënshkruajnë Marrëveshjen e Stabilizim Aso… 
U punësuan 10 mijë persona me kontrata të përkohshme, SPAK a...  via 
Besimtarëve myslimanë i uroj nga zemra gëzuar Fiter Bajramin! Paqe e mbarësi sjelltë kjo ditë e shenjtë në zemrat dhe familjet tuaja!
Bylykbashi: Shkeljet e ligjit kanë qenë masive në 9 qarqe, kemi çuar provat në KQZ 
‘A do jetë PD në Parlament’ Bylykbashi: Parlamenti arma më e fortë, por prioriteti ynë është faktimi i shkeljeve… 
Humbëm edhe një njeri të madh!Sot u largua për në amshim kolosi i teatrit të Durrësit, Guljelm Radoja. Një figur… 
Gëzuar Pashkën! Këtë urim nga zemra e kam për të gjithë besimtarët ortodoksë në këtë ditë të Ringjalljes së Krishtit!
për një Shqipëri ndryshe dhe për të rinjtë që tek ne  kërkojnë shpresë.
Duhet të jenë krenarë që arritën të rrisin me 80% Partinë Denokratike. Ky ishte qëllimi juaj dhe i imi si kandidat… 
Për këtë arsye falenderoj nga zemra të gjithë anëtarët e strukturave të Partisë Demokratike dega Durrës dhe forumin… 
Unë besoj se Partia Demokratike është një emër shumë më i madh se kushdo prej nesh. E kemi nder të jemi pjesë kontr… 
Jam i nderuar nga vota juaj!Ju falenderoj që besuat në një politikë të drejtë ku rëndësi ka integriteti dhe jo pa… 
Edhe pse zgjedhja juaj nuk fitoi, sot duhet të ndjeheni krenarë për votën tuaj.Falenderoj nga zemra çdo zgjedhës… 
Faleminderit të gjithë zgjedhësve shqiptarë që me 25 Prill kuptuan drejt se Zgjedhës është më shumë se Votues.Fal… 
Një komb që sot beson!  
Përmes votës ti zgjedh, ti ndëshkon, ti vendos për atë që do, apo për atë që beson se është më i miri. Ndaj shko n… 
Voto sot që zëri yt të ketë vlerë nesêr ! 
Me 25 Prill dil dhe voto për Shqipërinë ku do të jetosh! Voto Partia Demokratike 9 !
Duke vënë në shërbim të çdo qytetari integritetin tim personal dhe profesional, ndjehem më i motivuar se kurrë për… 
Jam i vendosur të vazhdoj betejën time për krijimin e një shteti të drejtë për qytetarët, ku e drejta e garantuar e… 
Në takimet e përditshme gjatë muajve të fundit kam marrë mbështetje dhe inkurajim të vazhdueshëm për betejën drejt… 
Votuesit kanë një zgjedhje të rëndësishme për të bërë ditën e Dielë, atë mes një Shqipërie si pjesë e Bashkimit Eur… 
Ishte një fushatë e jashtëzakonshme. Ishte fushatë që nuk krahasohet për shumë vite. Kemi parë te njerëzit shpresë.… 
Tashmë jemi vetëm një ditë larg nga kthesa e madhe. Epoka e ndryshimit fillon me 25 Prill! … 
Sonte, në Ora News në 19.30 ! 
Programi i Partisë Demokratike ka një plan konkret për zhvillimin dhe rritjen e kategorive të industrisë kreative s… 
Insistimi i shoqerisë civile durrsake dhe mbarëshqiptare për drejtësi ia doli të hedhë poshtë përpjekjen për të mbu… 
Kjo vepër e babëzisë, mediokritetit dhe korrupsionit ngrihet si monument i arrogancës mbi durrsakët, mbi arkeologji… 
Sot Gjykata e Apelit rrëzoi kërkesën e prokurorisë dhe vendimin e gjykatës së shkallës së parë në Durrës për pushim… 
Një lajm shumë i mirë për këdo që do Durresin, trashëgiminë kulturore të Durrësit dhe Shqipërisë. 
Të rinj që zhvillohen me dinjitet !    
Sot dua të marr pak kohë ti përgëzoj për gjithë punën e bërë që kulmoi mbrëmë me mbarëvajtjen e mitingut përmbyllës… 
Liderat i përkasin kohërave dhe popujve. Ju prezantoj me disa nga pjesëtarët e këtij rrugëtimi të bukur dhe intensi… 
Përvoja historike mbarëbotërore dëshmon se të rinjtë janë aktorë të fuqishëm, që sjellin ndryshim dhe përshpejtojnë… 
Takim përmbyllës i fushatës me Zotin Basha! Me 25 Prill Durrësi fiton!Mbështetje historike, uragani blu tashmë i p… 
Ne synojmë që biznesi i Durrësit të mos mbështetet tek betoni dhe korrupsioni, por tek idetë, konkurenca dhe inovac… 
përsëri historia jonë na tregon sesa e vështirë është të jesh vajza, grua, nënë, gjykatëse, prokurore, shkencëtare… 
Shqipëria ka bërë hapa përpara për të mbrojtur dhe garantuar të drejtat e grave dhe vajzave, vendi është ende tepër… 
Pabarazia ndërmjet grave dhe burrave në Shqipëri, mbetet ende një ndër problemet më serioze dhe ndër shkeljet më të… 
Sot në orën 19.00 pranë Torres Veneciane mirëpresim z. Lulzim Basha në një takim përmbyllës të fushatës. Ju ftojmë… 
Vazhdojmë me një javë maratonë takimesh me biznesin që ndonëse kanë kaluar një vit të vështirë pa mbështetjen minim… 
Tekat e pushtetarëve dhe veprimet e kryetares së emëruar të bashkisë nuk ia heqin dot pronarëve të drejtën e pronës… 
kërkon t'u rrëmbejë pronën me justifikimin se kërkon të bëjë një monument për viktimat e tërmetit.Bashkia nuk lejo… 
Banorët e pallatit të shembur në lagjen 6 nga tërmeti i 26 nëntorit 2019 janë një tjetër dëshmi e gjallë e shtetit… 
Sonte në  në Abc News me  
Rama e kupton që po humbet zgjedhjet dhe kjo ftesë e tregon qartë këtë. Njerëzit duan ndryshim, që kupton largimin… 
Suksesi i tyre është i lidhur me këmbënguljen, talentin dhe angazhimin!
Më 25 prill, ndryshimi që do nisë në Durrës duhet të nisë edhe në shëndetësi!
Vetëm mjekët e mbajnë në këmbë shërbimin për qytetarët përballë një shteti që i trajton si shërbyes pa dinjitet, ma… 
Takimet në terren më mbushin me shpresë që me 25 Prill ata do të dalin të votojnë masivisht kundër kësaj qeverisjej… 
Numërimi mbrapsht drejt fundit të kësaj qeverie fillon sot!    
Për një shtet të drejtë voto  zgjidh   
duhet të distancohen nga këto krime. Me 25 Prill 2021 duhet të jetë fillimi i fundit të një padrejtësie që zvarrite… 
Me përfaqësuesit e Shoqatës së të Përndjekurve Politikë Antikomunistë diskutuam pikërisht këto çështje. Krimet dhe… 
Tregon dështim jo vetëm të shtetit për të vënë vend padrejtësinë dhe dinjitetin e shkelur, por tregon edhe dështimi… 
Të diskutosh 30 vite nevojën për rehabilitim të të përndjekurve dhe në plot raste edhe për gjetjen e eshtrave, dëni… 
Shko Voto në 25 Prill !    ëpërndryshim 
me 25 Prill kthejini këto aspirata në realitet. Këto zgjedhje janë një shans për ndryshim dhe për të dhënë një mesa… 
Unë si deputet i Qarkut Durrës jam i vendosur ti mbështes profesionistët e fushave të ndryshme por protagonistët e… 
Në takimin me profesionistët e lirë ekonomistë bashkëbiseduam mbi problematikat dhe zgjidhjet eventuale që ofrohen… 
Dua të shoh një qytet ku njerëzit kanë më shumë mundësi dhe fuqi mbi vendimet e tyre dhe këtë mund ta arrijnë vetëm… 
Vazhdon puna intensive në shtabet elektorale të Partisë Demokratike kur jemi  vetëm një javë larg ditës së zgjedhje… 
Të rinj që zhvillohen me dinjitet !    
madje i kërcënon me vendin e punës kur ata flasin e denoncojnë skandalet dhe PPP korruptive që vetëm të sëmurëve dh… 
Sistemi ynë shëndetësor është shkërmoqur përpara interesave që kapin shtetin dhe babëzisë së një grushti përfituesi… 
Probleme që shpesh kanë emërues të vetëm sjelljen kriminale korruptive të atyre që qeverisin. Nëse ka një sistem… 
Një tjetër takim me profesionistët e Durrësit. Mjekët, ata që janë kthyer në heronjtë e përditshmërisë tonë, me pun… 
Në çdo takim me shtabet elektorale të Partisë Demokratike sjellin me vete mesazhin e banorëve të lagjeve përkatëse… 
Të gjithë bashkë drejt fitores se 25 Prillit!  
Energjia që të rinjtë kanë sjellë në këtë fushatë është shpresë dhe një këmbanë e madhe alarmi për të gjithë. Shoh… 
Asnjë VKM me proçedura burokratike dhe jo praktike nuk do të bëjë punë nëse një ditë do të jetë shumë vonë.Me 25… 
Shtëpia është e dëmtuar nga tërmeti në gradën DS4. E vetme, pa familjarë, ajo nuk ndjek dot proçedurat dhe zvarritj… 
Një tjetër rast i shtetit të padrejtë që rindërtimin nga tërmeti e ka fasadë të falsitetit elektoral. Vetëm pak q… 
Shtabet e Partisë Demokratike janë më të fokusuara se kurrë në fitoren e datës 25 Prill. Takim me shtabin e Lagjes… 
Vazhdon puna e pandërprerë në shtabet e Partisë Demokratike Durrës. Shtabi i Lagjes 6 vijon me shumë përkushtim sen… 
Për një politikë të drejtë voto Partia Demokratike  , zgjidh Oerd Bylykbashi   
Ju uroj të gjithëve ju, në Durrës e mbarë Shqipërinë, një Ramazan të begatë për familjet tuaja. Agjërim të lehtë e të pranuar!
për përballimin me sukses të sfidave që na presin.Rrugëtimi ynë kërkon motivim të lartë, për t’i tejkaluar sfidat… 
Me rastin e fillimit të muajit të Ramazanit, ju përcjell urimet e mia më të sinqerta. Uroj që ky Ramazan të jetë mu… 
Punë intensive me fokus fitoren në datë 25 Prill është motoja e shtabit të Lagjes 7. … 
Prona e shqiptarit duhet të jetë e shenjtë!   ëpërndryshim… 
Takim me banorë të lagjes 10 që akoma nuk janë dëmshpërblyer për dëmet nga tërmeti. … 
Ajo familje ishte pasqyra e shtetit të padrejtë që i shkel me këmbë dhe meqë nuk u merr dot as taksa, as nuk i llog… 
Dyert e sporteleve u mbyllen sa herë shkojnë për të pyetur, askush nuk mban përgjegjësi dhe tanimë të pafuqishëm ja… 
Tavani i shtëpisë kishte rënë, dhe dimrat e 2020 dhe 2021 i kishin kaluar në një kasolle në oborr ku mjerimi ishte… 
Histori mjerimi vetëm 3 minuta larg qendrës së Durrësit.Tërmeti u dëmtoi shtëpinë që edhe para 26 nëntorit 2019 du… 
Takim me qytetarë të Lagjes 6 !   
Unë do të  bëj maksimumin tim si përfaqësues i tyre që çdo ditë t'i kthej dinjitetin dhe pozicionin që ata meritojn… 
Të rinjtë nuk kanë besim në sistemin politik ose janë tepër të zhgënjyer nga politika dhe kështu abstenojnë si një… 
Të rinjtë durrsakë sot janë ndër studentët më të mirë të drejtësisë, teknologjisë së informacionit, menaxhimit. Ata… 
Të rinjtë e Durrësit kanë gjithçka që u duhet për të qenë të suksesshëm kudo në botë. Atyre ua kemi borxh që bazën… 
Ata e kanë gjithçka që na duhet për të transformuar realitetin e vështirë me të cilin përballemi sot. Do të më keni… 
Të rinj energjikë, pozitivë dhe me dëshirën për të kontribuuar në qytetin e tyre. Këta janë liderët e së ardhmes, t… 
 94% e shqiptarëve mbështesin Parkun e Parë Kombëtar Lumor të Egër. Retweet regoni mbështetjen tuaj për Vjosën. …
Takim dhe bisedë organizative me të rinjtë e FRPD për të paraprirë dy javëshin final drejt 25 Prillit. Kam qenë pje… 
Në vitin 2005, durrsakët i treguan pushtetit të korruptuar të Fatos Nanos se ndryshimi vjen nga Durrësi, dhe ndrysh… 
Shume prej problemeve kërkojnë vullnet dhe qasje politike ndryshe. Me 25 prill ndryshimi vjen edhe për zhvillimin urban të Durrësit tonë.
Pasoja është një qytet që vuan nga deformime të rënda në zhvillimin urban që kushtojnë të riparohen.Projekti klien… 
Asfiksimi i autonomisë vendore si pasojë e centralizimit nga Edi Rama edhe në këtë sektor ka sjellë jo vetëm anashk… 
Durrësi është shembull i degradimit të zhvillimit urban si pasojë e keqqeverisjes. Takimi me urbanistë, arkitektë e… 
Biznesi i Durrësit ka potenciale të jashtëzakonshme për të udhëhequr ekonominë e Shqipërisë dhe Kosovës, pasi gjend… 
Durrësi ka nevojë për ndryshim në qeverisje, por Durrësi mund të tregojë se vota e tij e kthen përgjithmonë ekuilib… 
Qyteti i Durrësit, me afërsinë e tij me Italinë i ka të gjitha burimet njerëzore dhe financiare për të bërë kapërci… 
Sot zhvilluam një bashkëbisedim me bizneset e Lagjes 5. Biznesi durrsak duhet të çlirohet nga shteti taksidar.… 
Sot zhvilluam një bashkëbisedim me bizneset e Lagjes 5! Durrësi është porta hyrëse e Shqipërisë dhe motori kryesor… 
Qyteti i Durrësit, me afërsinë e tij me Italinë i ka të gjitha burimet njerëzore dhe financiare për të bërë kapërci… 
17 Ditë na ndajnë nga 25 Prilli dhe shtabi i Partisë Demokratike i qytetit të Durrësit është më i motivuar se kurrë… 
Të edukojmë dhe të rrisim liderat e së nesërmes të gjithë bashkë duke përmirësuar jetën e tyre çdo ditë nga pak!… 
Me 25 prill mos rri po duku! Me votën  tënde ndrysho Shqipërinë!   
Sot në SYRI TV bashkëbiseduam mbi disa nga temat më të rëndësishme të ditëve të fundit. 
Sot takuam bizneset e Lagjes 3 në Durrës dhe u njohëm me problematikat e tyre. Partia Demokratike është zotuar dhe… 
Faleminderit për mbështetjen dhe punën që zhvilloni çdo ditë në terren. Shtabi i Lagjes 5 gati për një javë tjetër… 
Të rinjtë e Durrësit dhe të gjithë Shqipërisë me datë 25 Prill kanë në dorë ti japin vetes dhe atdheut momentumin q… 
Energjia që përcjellin shtabet e Partisë Demokratike më bëjnë të besoj fort që ndryshimi ka ardhur dhe data 25 Pril… 
Lulzim Basha në takimin me përfaqësues të familjeve durrsake me emër, drejtues të shoqatës "Durresi Autokton" nënvi… 
Durrësi është simboli  i jetës dhe qytetërimit urban. Është qyteti ku jetohet në të njejtin vend ku u themelua 2700… 
Për një biznes të zhvilluar dhe të qëndrueshëm që fëmijët tanë mos ta braktisin Durrësin dhe Shqipërinë. Ti tregojm… 
Për një vit të paqtë e prosperitet, të gjithë besimtarëve katolik Gëzuar Pashkën. 
Programi i PD për rivendosje të shtetit të së drejtës dhe rishikim të taksave të padrejta  për kategorinë e avokatë… 
Taksat dhe mungesa e ndihmës në periudhën e vështirë të pandemisë kanë dëmtuar rëndë dinjitetin dhe punën e avokatë… 
Në takimin me përfaqësues të Dhomës së Avokatisë në Durrës diskutuam problemet që hasin avokatët në ushtrimin e pro… 
Për një ekonomi të zhvilluar dhe të qëndrueshme ... voto Partia Demokratike 9!  ës 
Koordinimi i punës me shtabin e zonës së qytetit. Kryetarët e grupseksioneve drejtojnë me intensitet fushatën në te… 
FRPD po kontribuon çdo orë dhe çdo ditë në një përpjekje të palodhur për ta përçuar këtë plan tek rinia durrsake. M… 
Oferta e Partisë Demokratike ka një plan konkret për të rinjtë tanë:Zgjidhja e problemit të punësimit;Rritja e sh… 
Janë marrë masa të paprecedent për të mbrojtur lirinë dhe sekretin e votës.DILNI MASIVISHT TË VOTONI!Pjesëmarrja… 
Heronjtë e 2 Prillit janë monumenti i sakrificës sublime për votën e lirë. 30 vite më pas liria e votës kërcënohet… 
Në takimin me bizneset e lagjes 6 diskutuam problematikat dhe zgjidhjet e nevojshme për jetëgjatësinë dhe qëndrushm… 
 Rama nuk ka frikë për koronavirusin.  Ai ka frikë nga qytetarët shqiptarë që duan ndryshimin pas 8 vitesh dështime të tij.…
Duhet parë nga interesi i zgjedhësve, zgjedhësit që po kërkojnë ndryshimin kërkuan lista të hapura. Ndërkohë që nuk… 
Interesi i zgjedhësve është që të zgjedhin skuadrën më të mirë. Ne ofrojmë një skuadër që së bashku do të sjellë nd… 
Për një ekonomi të zhvilluar dhe të qëndrueshme! Shtet partner me biznesin!   
Për një shtet të drejtë voto  !     
Gjatë takimeve me banorët e  lagjes 10 bashkëbiseduam për problematikat jetike që i shqetësojnë në jetën e përditsh… 
Për një ekonomi të zhvilluar dhe të qëndrueshme!    
Për Një Politike të DrejtëPër Një Shtet të DrejtëPër të Drejtën e PronësPër një Ekonomi të Zhvilluar dhe të Qënd… 
Ecim drejt fitores të padiskutueshme të 25 Prillit. Takim me shtabin ne Lagjen 6. Ju falenderoj për punën e përdits… 
Për një shtet të drejtë   ësifiton 
===