Ankona, kapen 19 tonelata mbetje që po vinin në Shqipëri 
Urdhri i prerë i Erdogan: Turqia në izolim të plotë për 4 ditë! 
Dokumenta fallso për në SHBA, policia ka arrestuar 15 persona. Emrat 
Basha bën lëvizjen surprizë, mbledh në takim të përbashkët ambasadorët dhe aleatët, ç’do ndodhë me protestat? 
Një foto e vetme e Jennifer Lopez i surprizon të gjithë, këngëtarja shfaqet më në formë se kurrë 
Kemal fut Ejlylin në kurth dhe tenton ta përdhunojë, nesër në “Lule të vetmuara” 
Fatos Lubonja: Erion Veliaj të japë dorëheqjen, të japë llogari para prokurorisë 
Reforma zgjedhore, në dyshim 
Pas përfundimit të protestës, flet edhe Basha: Fundi i Edi Ramës është i shpejtë. 
Kush firmosi për shkatërrimin e Teatrit Kombëtar,ja lista e 35 këshilltarëve! 
Vdes në moshën 72-vjeçare, aktori i njohur i ‘Scarface’ 
Turizmi brendeshem në Turqi mund të fillojë në 28 maj 
Rinis jeta në Itali 
Fara droge nga Spanja me postë, arrestohet pritësi në Vlorë. Emri 
Vlerësim për betejën tuaj heroike’/ Mesazhi i Europa Nostra për Aleancën 
Atentat me armë në Mamurras, 2 të plagosur 
Rama: Hiqen tërësisht kufizimet në zonat e gjelbra 
Molotov në hyrje të parlamentit 
Maturantët sot në shkollë/ Rikthehen të përsërisin lëndët para provimeve, por 1500 do ndjekin mësimin online 
Parashikimi i motit/ Java nis mot të nxehtë dhe temperatura të larta 
(FOTO) Doli të mbronte Teatrin, djali i gazetares i përgjakur dhe i ënjtur nga dhuna e policisë 
Basha dhe aleatët nuk pyesin më për Covidin, marrin vendimin final: Ka efekt të menjëhershëm… 
Për 300 mijë lekë jeni shitur, një qen vlen më shumë se ju”, thirrja e artistes bën policët të skuqen 
“Je legen, dorëzo mandatin”, protestuesit zbojnë Kujtim Gjuzin, çfarë thotë deputeti 
Shembja e Teatrit, mjeku Kalo vë pikat mbi ”i”: Pse gjithë kjo urgjencë, a mos e hoqëm nga shpina flamën Covid?! 
Shembja e Teatrit Kombëtar/ Monika Kryemadhi: U bëj thirrje qytetarëve të mos e njohin shtetin e Edi Ramës 
LAJM I FUNDIT/ Dorëzohet në polici Jaeld Çela, ish-shefi i Policisë që ndihmoi “Habilajt” në trafikun e drògës 
“Gynej” feston ditëlindjen, “Songyl” e uron live në Instagram dhe ka një dëshirë 
Kolonjë/ E fundit: Shtron në dru zyrtarët e bashkisë,arrestohet 40 vjeçari. 
U plagos në mal, ndërron jetë në spital i riu 
Vrasja makabër e studentes, dënohen me ‘burg përjetë’ shqiptari dhe greku.  
Nga dasmat, tek transporti publik e pagat e luftës, Rama jep detaje, ka dhe një paralajmërim për shefat e Komisaria… 
“Nuk do ju dalë njeri me hu në dorë t’ju thotë tokë e xanun”/ Rama: Plazhet këtë vit, publike 
Policia Kufitare e Kapshticës kontrolle të shtuara për goditjen e paligjshmërisë dhe mbrojtjen nga krimet mjedisore. 
Artistët padi në Prokurori për teatrin 
Shantazh dhe gjoba biznesmenëve, kush është Erjon Llapushi që OFL i dërgoi formularin 
Covid-19/ U mblodhën tek Teatri Kombëtar, gjobitet për herë të dytë Basha! 
Meta: Në vend që të merremi me menaxhimin e pandemisë, po i vëmë kazmën Teatrit 
OFL në Korçë e Pogradec. 4 të fortët që duhet të deklarojnë pasurinë 
Berati vatër koronavirusi, 5 familjarët e punonjëses së bashkisë pozitiv me COVID-19 
Ekzekutoi vajzën dhe dhëndrin, 55-vjeçari shqiptar shpallet i papergjegjshem. 
Një kafene në Stamboll e ka marrë emrin nga një shkrimtar i famshëm francez 
Budina: Më kanë ardhur kërcënime, zjarri që do ndezin do iu djegë shtëpitë 
Gjendet trupi i pájetë i 42-vjeçarit në Pogradec, dyshimet e para (EMRI) 
Rama i përgjigjet Metës për Teatrin: Nuk ka asnjë shans ta ndalojë ekzekutivin (Flet dhe për procedimin e Bashës) 
Pronari i Seherit dhunon Songylin dhe e mban peng, nesër në “Lule të vetmuara” 
Gjykata e Tiranës jep vendimin për “Zogun e Tiranës” 
Nisi sot kalimi i punëtorëve sezonalë drejt Greqisë 
Arrestohen 12 priftërinj në Malin e Zi/ Organizuan meshën, besimtarët përplasen me policinë 
Korçë/ E fundit: Mbytet një fëmijë në liqenin e parkut japonez. 
Korçë/Flet nēna e 18 vjeçares që u ngacmua nga i ati: Babi i kërkoi të kryenin mardhënie,vajza rregjistroi bisedat. 
SHBA, vdekshmëria nga COVID-19, më e lartë se parashikimi 
Aksident i rëndë në Gramsh/ Humb jetën 32-vjeçari, plagosen 4 të tjerë 
Përdhunimi në Korçë/ 18-vjeçarja regjistroi të atin me telefon (EMRI) 
Danimarka ka hapur gjithçka, por shkalla e të infektuarve është e vogël 
113 vjeçarja shërohet nga koronavirusi 
Reuters jehonë legalizimit të kanábisit: Do hapte vende pune, ç’ka do sillte fitoren e votave në zgjedhjet e ardhsh… 
Aksion i madh në bregdet, árrestohen 7 persona, mes tyre 5 punonjës të IKMT-së 
Rama i përgjigjet Bushatit për oligarkët dhe flet për mundësitë e një koalicioni me LSI 
Stafi i Shtëpisë së Bardhë urdhërohet të vendosë maska 
Përfitojnë mijëra shqiptarë/ Greqia shtyn lejet e qëndrimit për emigrantët, ja kategoritë 
Me një look si për plazh, gazetarja shqiptare raporton para Kryeministrisë 
Çaji i dafinës me kanellë për rënien e shëndetshme nga pesha 
Vala tjetër e shpërthimit/ OBSH flet për mundësinë e rikthimit të infeksioneve, ja tre shtetet që përmend 
Operacion masiv kundër máfias në Itali, vihen në pranga 91 persona 
“Do ndahesha njëmijë herë nga gruaja, vetëm për këtë femër”, Gjuzit i nxjerrin foton, kush është kaçurrelsja që i k… 
Marrëveshja për 15 mijë punëtorë shqiptarë në Greqi/ Bëhen aplikimet e para, kjo është dogana fillestare që do hape… 
Mafiozi shqiptar në serialin britanik, kush është djali i aktorit të njohur shqiptar që po trondit skenat 
Greqi/ Ndërron jetë shqiptari, e gjetën në banesën ku punonte me plagë në kokë dhe gjoks 
Greqi/ Në pranga dy shqiptarë, u kapën me 33 kg marijuanë, pistoletë dhe para 
Greqia merr një vendim të ri për emigrantët në vend 
Ish-ministri socialist: Duhet drejtësi e re me kurajo e forcë përballë arrogancës së pushtetit! 
Emrat/ Arrestohen dy shqiptarë në Itali, kishin heroinë me vlerë 2 milion euro 
Protesta kundër masave kufizuese/ Tensione në Gjermani, Slloveni dhe Australi 
Plazhi këtë verë mund të bëhet me rezervim 
Frutat që ndihmojnë më shumë për të rënë në peshë 
SPAK i drejtoi 5 pyetjet për tenderat, reagon Ministria e Shëndetësisë 
Ne dështuam që t’i mbrojmë të moshuarit tanë”, Suedia “pendohet” për masat kundër pandemisë 
Lajm i hídhur për botën e muzikës! Këngëtari i njohur hùmb betejën me kancerín 
Pas sherrit me familjen vetëdigjet i riu vlonjat, në gjendje kritike për jetën 
Kanabis për arsye mjekësore i konsultuar me ekspertë ndërkombëtarë”, BE distancohet nga deklarata e Ramës: KE dhe U… 
Pogradec: Piktori Tanini transformon ndërtesat e zonës industriale në hyrje të qytetit. 
Prindërit,për ata, fëmijë ne mbetëm! 
Ndërroi jetë dy ditë më parë, banesa e Maks Velos shpallet monument kulture 
Pogradec: 1500 banorët e Blacës,vuajnë për pikën e ujit. 
Paga e dytë e luftës kalon në bankë/ Ibrahimaj: Përfitojnë 64 mijë persona 
Ndalimi i qarkullimit në Bashkimin Europian do të zgjatet 
Ngjarje e rëndë në Berat: Një i mitur masakrohet me thikë nga një 18 vjeçar 
Nga e hëna kufizime vetëm në 6 qytete 
Kërcënohet me jetë drejtori i Aeroportit të Rinasit, Policia në kërkim të personit të maskuar që e qëlloi (FOTO) 
Photohistory “Serenatat e dashurisë në rrugën që qesh e qan” 
SPAK nis hetimet për 10 gjyqtarë të shkarkuar nga vetingu 
Sazan Guri e 6 të tjerë nën hetim/ Meta: Protestat, një e drejtë që duhet respektuar nga autoritetet 
Dy të vdekur nga rrëzimi i avionit ushtarak, jep dorëheqjen ministri kroat 
Koronavirusi ndodhet edhe në spermë, por a transmetohet seksualisht sëmundja? 
Johnson i drejtohet kombit të dielën, masat lehtësuese me pikatore, nuk ka hapje të plotë 
Fëmijët e një diplomati të huaj gjejnë drogë duke luajtur te liqeni 
Shqiptarja dënohet më burgim të përjetshëm, vrau nënën, babain dhe motrën 
Si ndodhi tragjedia në Berat/ Policia: Në fillim ngeci 75-vjeçari 
Bie nga lartësia e pallatit ku punonte, ndërron jetë punëtori i ndërtimit në Tiranë 
Tragjedi në Berat/ 3 familjarë vdesin për një pus 
CoVid-19/ 10 raste të reja, shkon në 842 numri i të prekurve 
Greqi/ Qindra të rinj thyejnë karantinën dhe festojnë me birra, përleshen me policinë 
Zbuloni pse mjalti është antibiotiku më i mirë 
Mbajti dyqanin hapur gjatë karantinës dhe nuk kërkoi falje, burgoset parukierja 
E përsëri them: “Njeriu, ky i panjohur”! 
Lufta e suksesshme me Covid-19, Merkel jep lajmet e mira për qytetarët gjermanë 
Fotot/ Nga tanket në rrugë tek protestat, fotoreporteri grek publikon pamjet e rralla të Shqipërisë 
Kishte gjetur fakte domethënëse për virusin/ Ekzekutohet studiuesi kinez 
Pas rikthimit te Juventusi, mediat në Itali zbulojnë çfarë i ka thënë Ronaldo miqve të tij! 
Koronavirusi në Shqipëri, konfirmohen 12 raste të reja 
Qeshni me lot/ Çmenduritë e njerëzve në kohë karantine 
Unë bëj gazetari,jo argëtim! Gazetarja e BBC,përgjigje për kritikat ndaj veshjes! 
Renato Mekolli zgjedh të largohet përfundimisht nga Shqipëria 
Vjedhja e makinave bëri bashkë vrasësit e viktimat? 
Pogradec: Gjykata ka lënë në burg 19 vjeçarin që kundërshtoi me dhunë policinë,tensione para gjykatës nga familjarë… 
Motosekat dëmtojnë kurorën e gjelbër të Korçës,në Moravë rrafshohet pylli me pisha. 
Rikthehet “Gokhani”, aktorin do ta shohim në një serial të ri në ekranin shqiptar  
Futen edhe 21 emigrantë të tjerë në Kapshticë  
CoVid-19/ Vatër familjare në Kamëz, 3 të prekur  
“Dvorani”, Meta mesazh të koduar në 5 Maj: Është dita për t’u angazhuar që…  
Bie nga lartësia, humb jetën 21 vjeçari në Tiranë  
Në vend të picave kokainë e heroinë!  
Korçë: Zona të gjelbra edhe katër bashki të tjera të juglindjes.  
Meta: Nuk ka marrëveshje me Ramën për Dvoranin, respektoj Kushtetutën  
Raporti sekret/ Zemërimi botëror për koronavirusin, Kina përgatitet edhe për luftë me SHBA-të… 
Rusi/ Hidhet nga dritarja mjeku i tretë ndërsa COVID-19 vazhdon të përhapet  
Laboratori i drogës në Fier i financuar nga Franca, si u ra në gjurmë të rrjetit ndërkombëtar… 
Punëdhënësit nuk kanë aplikuar/ Rama nuk fal: Gjobë për bizneset e mëdha, për çdo punonjës që kanë braktisur… 
Detajet/ Nga sot shtohen “zonat e gjelbërta”, do të lejohet shërbimi taksi për udhëtimet ndërqytetase… 
Ministri italian i Sportit: S’ka stërvitje në grup para datës 18 maj  
Ritadhesimi/ Sistem i ri për izolimin e shqiptarëve që kthehen nga jashtë vendit, ja lehtësirat… 
Konfirmohen 4 raste të reja me koronavirus në Krujë  
Turqia kërkon punëtorë për mbledhjen e çajit/ Paga afërsisht si Gjermania  
===