Më 9 prill 1961 Mbreti Zog ndërroi jetë në moshën 66 vjeçare. Sot, 60 vjet më pas, familja jonë kujton me nderim… 
 I uroj Princeshës së vogël Geraldine, yllit të bukur e më të shndritshëm të kësaj Krishtlindjeje, pasardhëses së re të…
Të dashur miq e dashamirës,Familja jonë ju uron nga zemra Gëzuar Krishtlindjen! Qofshi kurdoherë të bekuar! Wishin… 
Gëzuar 28 Nëntorin! Shqiptarëve në të gjitha trevat i uroj ta festojmë të bashkuar nën valëvitjen kuq e zi ketë dit… 
Për ne ajo është simboli i dashurisë së sinqertë dhe të pakursyer në të mirë dhe në shërbim të të tjerëve. Sot gjys… 
Falë tregimeve të saj për atdheun që e adoptoi, kam mësuar historinë dhe kulturën tonë të vyer! Sot e falenderoj pë… 
Në këtë 105 vjetor të lindjes së “Trëndafilit të Bardhë”, Mbretëreshës Geraldine të Shqiptarëve, kam dëshirë të kuj… 
Kjo sakrificë bëhet në emër të dashurisë dhe vlerësimit për jetën, si dhurata më e çmuar që na është dhënë!
Ju uroj nga zemra Gëzuar festën e Kurban Bajramit! Paçi mbarësi e gjithë të mirat e kësaj bote! Në këto ditë të vës… 
...., Zoti i bekoftë dhe ju pranoftë agjërimin dhe çdo lutje tuajen ! Edhe unë bashkoj lutjet e mia me dashuri pë… 
Gëzuar Fiter Bajramin! Uroj të keni fat, shëndet dhe lumturi për ju dhe familjet tuaja. Ky muaj Ramazani ishtë i pa… 
Unë inkurajoj brezin e ri të interesohet seriozisht për historinë tonë të përbashkët, pasi duke njohur prejardhjen,… 
Me mirënjohje do të doja të Falenderoja Ministrin e Punëve të Jashtme dhe Tregtisë të Hungarisë, z.Péter Szijjártó,… 
Të dashur besimtarë katolikë dhe ungjillorë! Gezuar Pashket!Duke ju uruar gjithë dashurinë dhe lumturinë që mund të… 
Fondacioni "Mbretëresha Geraldinë" në ndihmë të dëmtuarve nga tërmeti  via 
...Kjo është koha për solidaritet, për t’ju ardhur në ndihmë atyre që u prekën nga tërmeti që shkundi vendin tonë!… 
U shprehim ngushëllimet tona më të ndjera familjeve që humbën njerëzit e dashur gjatë kësaj nate tmerri! Mendimet d… 
 I lumtur të kisha në delegacion gjatë vizitës zyrtare në Principatën e Monakos dy personalitete të shquara&amp;shumë të das…
Çifti Mbretëror mori pjesë në “La Nuit des Etoiles” – Nata e Yjeve në Bruksel, Belgjikë, nën patronazhin dhe në pra… 
Të dashur bashkatdhetarë të Kosovës, ju uroj nga zemra Gëzuar Pavarësinë!Në këtë 10 vjetor kemi patur plot sfida,… 
Liria e Kosovës është fituar me shumë sakrifica, me heronj të panumërt, që luftuan për familjet e tyre dhe për Komb… 
Të gjithë Shqiptarët kudo që janë, janë krenarë për Shqiptarët e Kosovës dhe për ate çka ata realizuan.Por sfidat e… 
Urimet e mia më të ngrohta dhe të përzemërta për ju dhe familjet tuaja. Gëzuar Vitin e Ri! Qoftë i mbarë e i begatë… 
===