 Masakra e Srebenicës është një akt genocidal i cili duhet të njihet dhe të dënohet si i tillë nga bota e civilizuar. Sh…
 Në 25 prill shqiptarët do votojnë numrin 9 për ta larguar Ramën dhe ai nuk do jetë kurrë pjesë e qeverisjes sonë. Koha…
 Papërgjegjshmëria e Belinda Ballukut ka degraduar situatën dhe 68 punonjësit e kontrollit ajror po lënë punën, për shkak të…
 Për të sjellë ndryshimin dhe për të përmirësuar jetën e të gjithë shqiptarëve, na duhet të anëtarësohemi në Bashkimin E…
 12 vite më parë e anëtarësuam Shqipërinë në NATO. Me 25 prill votoni Partinë Demokratike, votoni numrin 9 dhe bashkohun…
 Zotohem sot para jush se akti im i parë dhe i fundit si kryeministër do të jetë garantimi i pavarësisë së plotë të drej…
 Sot bashkuam forcat, të sigurt për të sjellë ndryshimin në Shqipëri. Më 25 Prill ne premtojmë se Rama do të ikë dhe ne…
 Me energjinë dhe dëshirën e të rinjve për ndryshimin e madh. Shqipëria fiton me rininë! 
 Ne do të taksojmë importin e produkteve të gatshme dhe do të zerojmë taksat mbi lëndët e para që përdoren në prodhim në…
 Shqiptarët nuk mashtrohen dot më. Më 25 prill Rama humb dhe Shqipëria fiton! ✌️ 
 Edi proparama! Të gjithë e dinë që  me ty Shqipëria ka ngecur në vend. Shqiptarët e dinë shumë mirë që nuk ke bërë asg…
 Ne i qëndrojmë me vendosmëri angazhimit tonë për taksën e sheshtë 9% dhe kontributet shoqërore 18%. Me fuqizimin e bizn…
 Me kë tallet akoma ky? Për 8 vjet Rama i ka shërbyer vetëm vetes, miqve të tij, ortakëve të tij, por jo shqiptarëve. Pë…
 Rama qetësohu. Ky është vetëm fillimi. E dimë se ti nuk je mësuar të përballesh kurrë me angazhime serioze që do të mba…
 Shqipëria ka numrin më të lartë të bizneseve të mbyllura në rajon, numrin më të lartë të qytetarëve që humbën  vendin e…
 Mijëra familje shqiptare po vuajnë nga përmbytjet, ngrica, pandemia dhe kriza ekonomike, ndërsa Tirja i qeverisë e ka m…
Do kandidoj në Elbasan sepse jam larë njëherë në Shkumbin!  
 Edhe sot Rama u përpoq të fajësojë të tjerët për dështimet e tij.Largimi masiv i shqiptarëve është një nga dështimet më…
 Pagat e larta i prodhon rritja ekonomike. Do të punojmë pa u ndalur që ekonomia të rritet dhe rritja të shpërndahet në…
 Nuk mund të ketë mbështetje për rininë, pa një buxhet për të. 10 mijë stazhe me një pagesë 300 mijë lekë në muaj çdo vi…
 Pas 7 vitesh dështime dhe premtime të pambajtura, 7 vite mashtrime, vjedhje dhe dështime, 7 vite dhunë dhe terror ndaj…
 Shumë prej jush jeni të dëshpëruar, mezi prisni ndryshimin. Ndryshimi do të mbajë përsëri firmën dhe vulën e rinisë shq…
 Rinia kuksiane është lënë në baltë prej shtatë vitesh nga Edi Rama. Të rinjtë duhet të jenë shpresa jonë dhe të kenë b…
 Punishtet e qilimave, si kjo e Hate Orës në Kukës, janë në një krizë të rëndë.Shqipëria ka dhënë ndihmën më të vogël f…
 1 vit më parë kur vetëm   sillej si Kryeministri i vendit! 
 Kjo ditë feste i gjen sivjet Shqipërinë dhe shqiptarët përballë sfidës së pandemisë, që u ka marrë jetën shumë prej nes…
 Synimi kryesor i planit tonë ekonomik është rritja e punësimit dhe mirëqenies.Plani ynë ekonomik ka si qëllim ta shndë…
 Rama dje: nuk ka arsye të mbyllim shkollat. Rama sot: mbyllim shkollat. Rama nuk ka asnjë plan! 
 Dje Rama deklaroi se nuk ka asnjë arsye për të mbyllur shkollat sepse "fëmijët nuk të infektojnë me koronavirus". Ndërs…
 Kënaqësi dhe emocion i veçantë, takimi i sotëm me kryetarin e Komunës së Mitrovicës, Agim Bahtiri. Mbështes plotësisht…
 Me keqardhje mësova për ndarjen nga jeta të Bashkim Koplikut, politikanit që dha mbështetjen dhe kontributin e pakursye…
 Pasi denoncimit të fakteve se gënjeu për numrin e viktimave të Covid-19, Ramës ju deshën dy ditë për t'u përgjigjur. Dy…
 Edi Rama po gënjen dhe po fsheh numrin e viktimave të Covid-19 në Shqipëri. Ne kemi detyrën të shpërndajmë të vërtetën…
 Një fitore e madhe sonte për kombëtaren  kundër Bjellorusisë! Shqipëria gjithmonë mund të fitojë, kjo është në d…
 Përfytyroni një qeveri që punon për njerëzit, që jep ndihmë financiare për çdo familje. Një qeveri që ka një plan kundë…
 Me Ramën jemi të fundit në çdo fushë, përfshirë ndihmën direkte për ekonominë. Por jo dhe shumë gjatë! Bashkë do ta shë…
 Jam shumë i vetëdijshëm për vështirësitë e mëdha që kalojnë personat me aftësi të kufizuara.Pandemia i ka dalë jashtë…
 Bashkë do ta mposhtim Ramën, do të shërojmë Shqipërinë, do të ndihmojmë familjet shqiptare dhe ekonominë e do të sjelli…
 Sonte do të rrëzoj të gjitha shpifjet e ulëta të Ramës. Jo për veten time por për Kosovën! Më ndiqni sot live, ora 21:0…
 Rama je një dështim i madh. Sa shqiptarë duhet të vdesin që të ndalësh sulmet politike dhe përpjekjet për të na mbyllur…
 Kjo është përballja dramatike e Muharrem Poleshit me COVID.  Urgjenca nuk i përgjigjet 8 ditë rresht dhe kur i përgjigj…
 Edi Rama leri shpifjet dhe lojërat politike, përgjigju pse nuk e hap Covid 4? Pse të infektuarit dergjen nëpër ambulanc…
 Numri i të infektuarve me covid po thyen rekordet. Me qindra njerëz kanë humbur jetën dhe fatkeqësisht shumë të tjerë j…
 Numri i të sëmurëve nga Covid-19 po rritet përditë, fatalitetet po shtohen dhe kapacitetet shëndetësore po shkojnë drej…
 Rama ka humbur çdo kontroll mbi pandeminë. Kemi testimet më të ulëta në Europë, numrin më të ulët të mjekëve dhe spital…
 Po ndjek me shqetësim të madh lajmet tronditëse nga Turqia. Ngushëllimet e mia më të thella janë për familjet e viktima…
 Rritja e numrit të testimeve, rimbursimi i plotë për mjekimin në shtëpi kundër Covid, bonusi i premtuar dhe angazhimi i…
 Dita e sotshme shënon 75 vjetorin e Organizatës së Kombeve të Bashkuara e cila është organizata më e madhe dhe më e rën…
 Politika e vjetër ka erën e gropës së Hajdin Sejdisë ku nuk vure dorë 11 vjet si kryetar bashkie, ka fytyrën e zërin të…
Ndiqeni sonte ora 20:00 në EuroNews! 
 Pas tërheqjes së Edi Ramës nga padia ndaj BILD, çmimi i Bashkimit Europian për gazetaren Klodiana Lala për investigimin…
 Sot pata kënaqësinë të takohem me ministrin e jashtëm të Greqisë . Gjatë bisedës, nënvizuam domosdoshmërin…
 Lere viktimizimin për të fshehur vjedhjen. Plehrat e tua janë në çdo cep të Shqipërisë dhe 70 mil euro kanë avulluar pa…
 Dhimbjet e shqiptarëve që ke zhytur në skamje e nuk kanë mundësi as për ilaçe, shëndetësia në kolaps, ekonomia në krizë…
 75 milionë euro për mafian e plehrave ka paguar Edi Rama, nga lekët e shqiptarëve.Asnjë kacidhe për 100 mijë të papunë,…
 Kur vjedhja galopante, keqqeverisja, ekonomia dhe shëndetësia janë sot drama e çdo shqiptari,KM fshihet si struci pas n…
 Rriten infeksionet, bien testimet. Ndërkohë që njerëzit kanë nevojë për mbështetje dhe ndihmë, Rama vazhdon me vjedhje…
 Pata kënaqësinë të pres sot  Komisionerin Europian për Zgjerimin . Pasi e falenderova për ndihmën e jash…
 Akti i sotëm antikushtetues shkatërron konsensusin e 5 qershorit dhe godet rëndë integrimin europian të vendit. Rama e…
 Ribashkimi i  30 vjet më parë shënoi nisjen e rënies së mureve në mbarë Europën lindore dhe hodhi themelet e bashkimi…
 Ky që shfaqet në video është një politikan pa ide, pa plan dhe pa vullnet për të ndihmuar realisht biznesin e vogël. Çdo…
Sot në orën 20:45 përballë gazetarëve për planin e rimëkëmbjes!  
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
 Këtë vit, Dita Ndërkombëtare e Trashëgimisë Kulturore e gjen Shqipërinë pa Teatrin Kombëtar, që u shemb nga regjimi si…
 Sado të mundohen vartësit e Ramës në zyrat e propagandës në kryeministri  të prodhojnë video 3D, nuk mund ti mbuloj…
Dhe Edi Rama e ka kuptuar që alternativa e duhur është Lulzim Basha dhe programi që ai ka për Shqipërinë!… 
 7 vjet premtime të pambajtura, dhe përsëri vazhdon të bëjë të tjera. 
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
 Lista 100% të hapura!  
Për çdo të ri që dëgjon këto fjalë e ndjen se në këtë vend ende ka shpresë! ëMëTëMira 
 1/1 Sapo u njohëm me vendimin e gjykatës për ish kreun e bashkisë së Lezhës zotin Fran Frrokaj. Ne jemi të bindur për pu…
Sigurisht që pas shembjes së teatrit fshiheshin interesa të mëdha financiare, fshihen premtimet e Edi Ramës tek oli… 
 .: Gjate 2020 rënia e investimeve është 100 milionë euro. Ekonomia shqiptare buzë greminës së falimentit, ës…
 Çfarë e detyroi Edi Ramën të shkelë edhe premtimin kundër kumarit. Heshtja e tij për të dhënë shpjegime për këtë çështje…
 Personalisht dhe në emër të Partisë Demokratike përshëndes marrëveshjen e arritur mes delegacioneve të Kosovës dhe Serb…
 Raporti i fundit i EuCham që e rendit  ndër tre vendet e fundit në  për të bërë biznes, konfirmon qartë se kjo qeve…
 Rama frymëzoi, promovoi dhe kandidoi për deputetë dhe kryetarë bashkie njerëz të lidhur me krimin. Të përzgjedhurit e tij…
 Po ta përsëris Edi Rama, bëj transparencë e mos u fshih pas gërrvërreve bajate. As servilët e fundit që të kanë mbetur…
 PD, Hasa: AKSHI, 1 miliard lekë për sistemin e monitorimit të inspektorëve tatimorë, sistem që ekziston që prej vitit 2…
 Leri dërdëllitjet prej rrugaçi Edi Rama. Bëj transparencë çfarë po ndodh me negociatat për detin. Historitë me sapun ru…
 Rigënjeshtra nuk e fsheh dot të vërtetën: godinat që duhet të ndërtoheshin janë ende vetëm projekte 3D dhe premtimet nuk…
 Njerëz të braktisur nga një qeveri e dështuar. Turp!                           
 "Thoni: Desh, kërkoi lirinë,Si skifter në fluturim,Provoi prangat, t’errtë qelinë,Për të mjerët, lëshoi kushtrim.Th…
 Koston e konfliktit të krijuar me hedhjen në erë të marrëveshjes së 5 Qershorit dhe 14 Janarit, do ta mbash vetëm ti pe…
 ER i ra maska! Prano hapjen 100 % të listave dhe tërhiq amendamentin e njëanshëm të tmerrit tënd nga koalicioni opozitar…
 10 vjet më parë GJND konfirmoi se shpallja e pavarësisë së Kosovës ishte në përputhje me të drejtën ndërkombëtare. Sot…
 Sa herë hap gojën, Edi Rama gënjen për qëllimin e vërtetë të ndryshimit me urgjencë dhe në mënyrë të njëanshme të Kushte…
 Në emër të Partisë Demokratike dhe në emrin tim personal, uroj 32 deputetët shqiptarë të dalë nga zgjedhjet e mbajtura…
 Ndarja nga jeta e dr. Hysni Shkjaut është një dhimbje e madhe për familjen dhe miqtë e tij dhe një humbje e pazëvëndësu…
 Propaganda vazhdon të çirret por nuk e mbulon dot të vërtetën në sytë e shqiptarëve.Qeveria i manipuloi të dhënat e ndihmav…
 Vendimi i parë i Qeverisë i qeverisë së  dhe  do të jetë heqaja e Taksës së Rrugës së KOMBIT h…
 Sot pata një bisedë telefonike me  Ministrin e Jashtëm të Italisë, Luigi Di Maio. E falenderova për ndihmën e madhe që…
 "Taksimi Rama" zbrazi xhepat e  shqiptarëve, rriti çmimet, uli fuqinë blerëse, falimentoi bizneset dhe solli shkatërrim…
 Çdo vonesë dhe zvarritje në emërimin e gjyqtarëve të GJK vonon daljen nga kriza politike dhe mban mbyllur dyert e BE pë…
 Ushtria Çlirimtare e Kosovës luftoi për liri përballë një agresori që nuk kurseu asgjë, nga genocidi tek sprastrim etni…
 Nëse Rama do të kishte bërë testime si në çdo vend tjetër, ne do ta dinim ku dhe si po përhapet koronavirusi.  E kam ng…
 Babëzia, arroganca dhe shpifja janë trinomi i pandarë i RAMAVIRUSIT që prej 7 vitesh i ka shtyrë shqiptarët drejt shpun…
 E vërteta e vetme e këtij KM dhe bufonëve të tij është plaçkitja e shqiptarëve për interes të banditëve dhe oligarkëve…
 Me Presidentin e Kosovës  biseduam për zhvillimet aktuale &amp; ato të pritshme në Kosovë.Forcimi i shtetit…
 Në ditët më të vështira për shqiptarët, kur xhepat janë të zbrazur dhe varfëria po rritet çdo ditë, Edi Rama përdor dhu…
 Shqipëria e zhytur në borxhe kurse KM mburret se merr borxh të ri!!! Me nivel borxhi 74%, me detyrime të prapambetura 6…
 Sot, në oborrin e familjes Petrela, një nga më të vjetrat në Tiranë, duke biseduar jo vetëm për hallet e tyre sot nga e…
 Një e dielë e veçantë për nënën time dhe një nga ditët më të lumtura për mua, vëllain tim dhe babain tonë, tek i uruam…
 Në emër të Opozitës së Bashkuar ju shpreh falenderimet tona aleatëve dhe partnerëve tanë euro-atlantikë për ndihmën dhe…
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Konsolidimi i shtetit, integrimi euroatlantik, mbrojtja e integritetit dhe sovranitetit të Kosovës, janë sfidat, përbal…
 Ai shfrytëzoi edhe pandeminë për të vjedhur, për të shkaterruar teatrin, për të grabitur pasuritë publike dhe i la njer…
 Rama nuk e sheh më vizën e korrupsionit dhe as vizën e dhunës. Ai është peng i krimit, dhe sillet si kriminel me njerëz…
 Asnjë KM tjetër në botë nuk gënjen si Rama që mos tu japë njerëzve lekët.Asnjë KM në botë nuk ka infektuar 2 bashki sep…
 Për 7 vjet me radhë, RAMAVIRUSI e ka gërryer ekonominë, shëndetësinë dhe mirëqenien e shqiptarëve. CORONAVIRUSI vetëm s…
 Pasi i vjedh përditë dhe i gënjen me premtime boshe, Rama përdor dhunë fashiste kundër qytetarëve edhe sot në …
 Me amb  në : mirënjohje për mbështetjen e çmuar të BE për  kundër  dhe për krizën ekono…
 Ndërkohë që Shqiptarët janë mbyllur në shtëpi dhe nuk lejohen të dalin, punimet për shtesat e kateve tek Sky Tower vazhdojn…
 Mirënjohje për ndihmën e vazhdueshme që vjen nga  dhe solidaritetin në përballjen me . Shqipëria ka shumë ne…
 Mirënjohje  dhe Presidentes  për propozimin e tyre për të ndihmuar shqiptarët dhe gjithë popu…
 Mirënjohje SHBA &amp;  për ndihmën kundër COVID-19.Falë saj, mundësohet rritja e testimeve &amp; aktivizimi i zbul…
 Ky është angazhimi im dhe i opozitës. Gjithë energjitë dhe resurset e qeverisë duhet të shkojnë për të lehtësuar krizën…
 Ky është krim dhe çdo orë që po kalon i vret këta njerëz !
 Falemnderit  &amp; SHBA për ndihmën kundër .  do vazhdojë të insistojë për testim dhe dista…
 Mbyllja e kufirit për dhjetëra shqiptarë në tokën neutrale Shqipëri-Greqi dhe ndalimi i tyre për të hyrë në atdhe e për…
 Teatri ynë Kombëtar është futur nga organizata prestigjioze dhe Instituti i Bankës së Investimeve Europia…
 Për tju ardhur në ndihmë njerëzve, kemi kërkuar që qeveria të subvencionojë qiratë dhe pagesat e qytetarëve dhe biznese…
 Sot përulemi me nderim para kujtimit të Arben Brocit, Nazmi Kryeziut, Besnik Cekës dhe Bujar Bishanakut, 4 të rinjve sh…
 Falenderime  dhe BE për shprehjen e vullnetit pozitiv për çeljen e negociatave pas plotësimit të 15 kushteve.…
 Kam kënaqësinë të uroj përzemërsisht, fqinjin tonë, autoritetet shtetërore, vëllezërit dhe motrat tona dhe të gjithë qy…
 Kreu i ,  i ka bërë thirrje  që të marrë vendim "për të mbyllur fabrikat, fasoneritë…
 Vendet anëtare të BE-së dëshmuan sot se e mbështesin Shqipërinë dhe shqiptarët me shprehjen e vullnetit për të hapur ne…
 Në këto ditë të vështira për Shqipërinë &amp; mbarë botën,nevoja për shpresë është edhe më e madhe. Mirënjohje  pë…
 Duhet vepruar sa më parë.
 PD e konsideron planin e masave social-ekonomike si të domosdoshëm për përballimin e krizës së shkaktuar nga pandemia e kor…
 Sa keq për çdo shqiptar kur kryeministri në vend që të japë MENJËHERË 120 milion eurot e ppp-ve për shëndetin dhe bukën…
 Pas pak nga Selia e PD fakte tronditëse se si vetëm këto 2 javë qeveria ka dhënë 52 milion euro pagesa dhe tendera për…
Të gjithë bashkë si një familje e madhe do t'ja dalim! Gëzuar Ditën e Verës! 
 Përshëndes Bankën e Shqipërisë për vendimin e pezullimit të pagesës së kredive, që është një nga masat e propozuara nga…
 Më në fund e pranoi të vërtetën. Maskat janë të skaduara. Si të tilla ato nuk mund të jenë masë mbrojtëse për personeli…
Kur vendin e drejton një i paaftë, hajdut dhe mashtrues! 
 Sipas  Shqipëria ka rënë poshtë në indeksin politik dhe të drejtave te njeriut. Shqiptarët sot jetojnë në…
 Ndryshimi dhe rotacioni janë të pashmangshëm.Unë jam i përkushtuar që këtë proces ta përfundoj me mjete politike,për hi…
 Sonte në mbrëmje prita për një bashkëbisedim të hapur disa përfaqësues të familjeve pronare të Tiranës.  ka…
 Dhoma Amerikane e Tregtisë ka konstatuar (pa asnjë surprizë) se korrupsioni është problemi kryesor që e lë pas Shqipëri…
 Përshëndes deklaratën e Misionit të KiE që ritheksoi se në 30/06 nuk pati zgjedhje,se pushteti vendor sot nuk është plu…
 Pas 7 vitesh dështim, një gjë është e qartë. Edi Rama dhe qeveria e tij nuk mund të luftojnë krimin dhe korrupsionin se…
 Global Talent Competitiveness Index 2020, është i dhjeti raport që evidenton korrupsionin e qeverisë si problem për sho…
 Edi Rama ka fuqizuar vetëm një biznes në Shqipëri. Biznesin e tij personal me të inkriminuar dhe oligarkë. Çdo biznes t…
 Me hidhërim mësova se sot në Boston u nda nga jeta patrioti zemërbardhë Van Christo, personalitet i diasporës në SHBA &amp;…
 Indeksi i Demokracisë i  e klasifikon Shqipërinë  regjim hibrid një hap larg autoritarizmit, për shkak të munges…
===