 Edi Paloka hap punimet e Kuvendit të PD, të thirrur nga  Njoftohen revolta popullore deri në shkarkimin e …
 Lajm i fundit: Gazmend Bardhi njofton përjashtimin e Berishës dhe Bashës nga PD. Nga sot drejtimin e partisë pritet ta marr…
Shumë shpejt do jap giveaway nji Kryetar
Filluan duke ardhur firmat nga delegatët. Po të vjen dita Edvin, do shkosh nga ke ardh, por prit se kam pak punë… 
Ta kam que përgjigjen me Uotsapp, se nuk kam koh për telefon:"Yxhym, e mos u nal" 
Ju kërkoj ndjesë që kam mbështet Lulin.Dhe i baj thirrje Lulit t'kërkoj ndjesë qy ka mbyshtet veten.
 Nuk bëhet kështu.Erdhën, morën emërimet dhe ikën.Vajtën dëm gjithë ato trileçe që kisha porositur.ësi …
 Baca Sali që i bën opozitë opozitës është i njejti emocion sikur Brazili fiton kupën e botës.
Basha i ka ditët e numërueme.Pas tij, edhe Rama i ka ditët e numërueme.   
Nuk ke parë gjë akoma 
Nga nji anë Edvini kërkon bashkpunim me Lulin, nga ana tjetër n’qeveri nuk kishte asnji demokrat.ën 
Mark Marku ka dhanë dorheçjen nga mandati i deputetit, refuzon t’rrijë në nji parlament me Edvinin. Lufta jonë do… 
Respekt për ushtarët dhe për sakrificën e tyre të madhe në Afganistan  
Kujtim nga dita lexhendare kur shkova n’Kabul dhe ja bëra afganëve rrup sup. Nëse e kërkon atdhehu, shkoj prap. N… 
 Ta marrë vesh Doktor  se edhe në artin e zhytjes me not, jam i padiskutueshëm. 
 Tatuazhi me imazhin e kryeministrit Rama, në fakt është barcode për procesin e fiskalizimit 
 Të shpartallojmë grupimin armik Shehaj-Harxhi-Kadilli dhe të forcojmë unitetin dhe pastaj ti japim dërmën mafies Rama-Dosh…
Princi Harri dhe Meghan u banë me goc dhe un nuk u shkoj dot për qokë. Ja qfarë na bani ai mistreci amerikan, na tu… 
Qfarë bohet kshtu?!Masakrojn nji alamet femne për vidjo n’TikTok dhe lejn pa dënue nji Edvin që vjedh zxhedhjet tak-fak. 
Shpreh keqardhjen time private dhe personale mbi masakren zgjedhore në votimin e Kangës Maxhike. Turp ti vijë Ardit… 
 Basha: Numëruesit e PS vizatojnë mbi fletën e votimit një organ gjenital, por ja cila është fleta origjinale 
  Qesh mirë ay që qesh n’Paris
 Për një gjë siguroj demokratët: Rama mund të vjedhë zgjedhjet e përgjithshme, zgjedhjet lokale por kurrë nuk mund të vjedh…
Nuk frigohet nga delja apo nga DASHi ay qy ka qenë Bariu i kopesë për 30 vjet. - thenje latine 
 Parathënia e librit “Dinjiteti im” është shkruar nga kolegu i Berishës, shkrimtari Lulzim Basha i cili pak javë më parë…
 Në këtë ditë feste të lëmë sfurqet dhe të rrëmbejmë pirunjtë. -ësidheDashuri  
 Gjendet një celular pranë një lokali te Fresku. Policia lexon mesazhet për të identifikuar të zotin. 
Kam gjet provën që vurteton se se janë vjedh vota. Kjo vajz bukuroshe kandidate për deputete mori veq 4 vota.  Si k… 
 Kreu i opozitës merr në patronazh një familje dhe e shpëton nga katastrofa 
Knon poplli për Babën e Kombit dhe qdo tingull i asaj qiftelije do jetë kanga e qyqes për Edvin Ramën. Ju premtoj s… 
Jemi të destinuar për të fituar që nga antikiteti.  
U hidhnova pa masë për vdekjen e Princit Felipe. Ishte njeri 99-nç. E gjithë Mbretnija e Bashkueme asht n’zi. I për… 
 Monika Kryemadhi reagon për videon: “Duhet të më kuptoni se në atë kohë unë isha pak e , dhe ato fjalë që i tha…
 Deri tani ka patur shfaqje interesi nga disa kandidatë opozitarë të cilët kanë dëgjuar se radio ka fuqi rrezatuese për t…
Me librin e citateve të Bashës në duar nuk ka Kurban që na ndal drejt fitorjes së madhe.  … 
Baçkim Fino ka qenë nji personalitet i veqantë. Ja nji vidjo ku i kemi shpehur njani-tjatrit simpatitë tona të kthj… 
 Urime ! Të pres në Tiranë për ☕️ në dt.26 Prill. Më bëj një zile kur të jesh tek poshtë zyrës time tek …
Presidentët dhe Kryeministrat nga bota po bajn vaksinën e Kovidit llajv në tv. Ndaj për t’inkurajue popllin shqipta… 
 Ra kjo Koronë dhe u pamë 
 I bëj thirrje Llukashenkos të mos pranojë oferta apo pakte nga Rama. Ai e ka me të futur e nuk e merr vesh se nga të vjen.…
Mu ka bo verem kjo kërpudhë. Sa t'bohet Luli Kryeministër, do ta zhgul e do shes për Spak, m'falni deshta me thanë… 
Zbulim: Një qendër sekrete në Divjakë po trajnon mushkonja që shndërrojnë demokratin e prekur në socialist të thekur 
Dy të zeza në një ditë për njerëzimin: Mjeshtri Ennio Morrikone iku nga kjo botë, ndërsa Prof.Dr. Gjelal Mziu iku n… 
Koha kur deputetët i kishim edhe kongtarë.  
 Hapet i pari fast food i trevave mishngrënëse shqiptare që do të gatuajnë cdo gjë pa mish derri e viçi por vetëm me mish…
Policija e Edvinit sot provokoi randë opozitën duke xhobitë makinën e një qytetari të thjesht. I baj thirrje qeveri… 
As krimi nuk ka respekt për kët qeveri t'korruptueme. 
Un nuk dal për pazar dhe pik. 
  Mendoje një herë të kthehesh në pavjon o doktor, vishe bluzën e bardhë dhe ky do ishte revolucion
 10 Këshillat më të mira për të mos u mbrojtur nga Koronavirus 
Në respekt të situatës shandetsore, rrximin e sheverisë Rama po e shtyjm për ma vonë. E kuptoj që poplli nuk duron… 
 Nuk do lejoj askënd të bëjë Coup M’etat ësi 
 Abonenti i kërkuar ka dorëzuar kallzimin në prokurori. Ju lutem telefononi më vonë.
 Neser do lë vilën lart në kodër e do zbres poshtë tek qytetarët e thjeshtë. Më ka marrë malli për një copë bukë misri dhe…
Jam i xhallë e jam në jetëJam me pushime në Kretë 
Un jam si Tuitter, gjithmone ne gjendje pune edhe kur Rama dhe e gjith bota asht daun. 
===