 Takim me struktura të grupseksionit 3, të degës 11, në  Institut. Të fortë, të bashkuar e të vendosur për rrëzimin e k…
 Fushata e PD një fushatë model.Çdo derë u hap për ndryshimin, por vullneti i tyre nuk u përkthye në votë.Krimet elekto…
 Me njerëz të tillë në Shqipëri ka ende shpresë.
  Shikojeni këtë video të dashur qytetarë! Kaq vleni ju për Edi Ramën Erion Veliajn dhe Ogerta Manastirliun! Vleni sa nj…
 Prandaj ju motra e vëllezër që po kaloni vështirësi shëndetësore, nëna dhe baballarë që sot jeni në pamundësi ekonomike…
 Nga zemra ju uroj Gëzuar Pashkët të gjithë besimtarëve katolikë.Kremtimi i Pashkëve shënon triumfin mbi të keqen dhe f…
 Takime me banorë dhe biznese të njësisë 9, në rrugën “Siri Kodra”.“Çdo derë ku trokitëm, u hap në mbështetje të altern…
 Me banorë të njësisë 9, në rrugën “Dine Hoxha”.E nderuar nga mikpritja e tyre, dhe besimi që kanë në programin e Parti…
 Duke prezantuar programin e Partisë Demokratike tek banorët dhe bizneset e njësisë 9, në rrugën “Skender Kosturi”.Mbës…
 Takimet vazhdojnë në rrugët  “Lunxhëri” dhe “Genc Ndreu” në njësinë 11.Shpalosja e programit të Partisë Demokratike pr…
  ë do votojnë për ndryshimin. ë do të votojnë për një tjetër model Kryeministri e tjetër model qeveris…
 Takim me gratë dhe vajzat, mbi dhunimin e të drejtave te tyre në 8 vitet e qeverisjes së Ramës.Gruaja është viktima më…
 Takimet vazhdojnë në njësinë 11, në rrugët “Azem Galica” dhe “Marubi”.Banorë të braktisur dhe të zhgënjyer nga kjo qeve…
 Kjo është listë ndryshimi, listë fitoreje, listë për normalitetin, listë për t’i dhënë fund ngecjes 8 vjeçare të Shqipë…
 Tobias Rüttershof: Aktorët politikë duhet të sigurojnë që kushtet për konkurrencë të pastër midis kandidatëve të plotës…
 Takim me banorë të njësisë 11, në Institut.Problemet janë të shumta, e shtohen cdo ditë prej braktisjes nga ana e Edi R…
 Forcimi i shtetit të së drejtës dhe lufta kundër korrupsionit janë thelbësore për mbështetjen tonë për vende si Shqipër…
 Takim me banorë të njësisë  9, në rrugën “Siri Kodra”.Banorët të braktisur në 8 vite nga nga kjo qeverisje. Lagjet e vj…
 Takim me mësues të njesisë 11, në zonën e Laprakës. Ju uroj gëzuar 7 marsin të gjithë mësuesve, që janë fisnikët e shoq…
 Shqipëria mund të ndryshojë.Shqipëria ka nevojë për ndryshim.Ne do ta sjellim ndryshimin! 
 Sot bashkuam forcat, të sigurt për të sjellë ndryshimin në Shqipëri. Më 25 Prill ne premtojmë se Rama do të ikë dhe ne…
 Me planin që shpalosëm në shtator, çdo biznes i vogël merrte një çek 1 mijë euro. Pushteti i mbledh taksat dhe ua jep n…
 Shqipëria meriton më mirë. 
 Takim me biznese në rrugën Fortuzi të njesisë 9.“Gjatë qeverisjes së PD arrinim ti conim 5 lekë në shtëpi, ndersa tani…
 Takim fantastik me banorë të bregut të lumit të njesisë 11, të cilët përqafuan bindshëm programin e Partisë Demokratike.…
 70 vjetori i ngjarjes makabre ku 22 intelektual u ekzekutuan pa gjyq nga komunistët.I kujtojmë për ti nderuar!I kujtojmë p…
 Ne do të taksojmë importin e produkteve të gatshme dhe do të zerojmë taksat mbi lëndët e para që përdoren në prodhim në…
 Vasil Gjika: Unë do të kërkoja nga ju mbrojtje për investimet. Duam barazi në trajtim, duam barazi në garë, duam shanse…
 Faleminderit për mbështetjen tuaj të pakursyer! ✌ 
 Kënaqësi të takoja e të bisedoja me zonjat e mira e fisnike te Bregu i Lumit, Njësia Administrative 11 Tiranë. Jam e si…
 Ne do të abrogojmë ligjin aktual të pronave dhe të gjitha aktet nënligjore në fuqi që janë të pandershme dhe do të ndër…
 Rama i ka braktisur banorët e Tiranës!Mjerimi është ulur këmbëkryq.Pa ndihmë ekonomike, pensione të ulëta, pa punë e a…
 Në njësinë administrative nr 9, atje ku banorët ndjehen të braktisur nga Qeveria, të tradhëtuar nga Rama.Por në 25 Pril…
 Pronarët do të shkarkohen nga kostot administrative si dhe tarifat dhe taksat gjyqësore në proceset administrative dhe…
 Jo, nuk do të harrojmë! ëriaFiton 
 Një ndjesë pronarëve, në emër të Partisë Demokratike për vonesat, problemet me të cilat jeni hasur në rrugën tuaj në ka…
===