Rritet treguesi i besimit në shërbime dhe tregti/Konsumatorët optimistë dhe gati për të shpenzuar  via 
Reagon ISHP: Nuk ka raste me variantin Delta në Shqipëri  via 
Varianti Delta: Greqia urdhëron vaksinimin e detyrueshëm për mjekët dhe mësuesit  via 
Një komando ekzekuton në shtëpi presidentin e Haitit, plagoset edhe Zonja e Parë  via 
Një mësim për botën e kriptomonedhave nga kriza piramidale shqiptare  via 
Priten arrestime të tjera zyrtarësh të lartë, Arben Kraja: Zhvillimet e dy ditëve të fundit, vetëm fillimi… 
Kadilli: Sa kohë “njëshi” dominon i patrazuar, shanset për demokraci në parti janë të pakta  via 
Luis Enrike: Italia mezi priti penalltitë, Spanja mund të luante dhe gjysmë ore  via 
Vrasje dhe grup kriminal, SPAK dërgon për gjykim bandën e Talo Çelës  via 
BE: Kryetari i AMA-s të zgjidhet nga Kuvendi i ri!  via 
Foto/ Spektakël në shkallët e “Wembley”-it, batuta dhe thumba me banderola  via 
Ç’duhet të dimë për variantin “Delta Plus” që po step botën  via 
Kadilli propozon ndryshime në statut: Kryetari të largohet ose të zgjidhet kryeministër  via 
Vakanca në Gjykatën Kushtetuese, emrat e 9 kandidatëve që konkurrojnë  via 
Greqia shtyn pas 10 korrikut hyrjen e pasagjerëve në Shqipëri përmes portit të Korfuzit  via 
Kim pas aksionit të SPAK në Lushnje: Mendoje, a ja vlen të shkosh në burg  via 
Covid-i fshin nga kalendari garat në Australi të Formula 1 dhe MotoGP  via 
Akuzat e SPAK; shpërdorim detyre për Tushen, korrupsion e falsifikim për të tjerët  via 
Basha: Arrestimi i Tushes, fillim i mbarë. Drejtësia të hetojë lidhjet me “Hakmarrjen për Drejtësi”  via 
Barcelona duhet të reduktojë pagat, PSG dhe Siti sërish në sulm për Mesin  via 
Studimet e fundit: sa është vërtet i mbrojtur kush ka bërë vaksinën anti-Covid  via 
Kapelo ka për të gjithë: Spanja të vë në gjumë, Franca ekip mendjemadh  via 
Më shumë se në çdo vend të rajonit, bizneset shqiptare i marrin të ardhurat nga tenderat publikë  via 
Gjykata Kushtetuese rrëzon nenin për përgjimin nga policia pa lejen e prokurorisë  via 
Rama distancon PS nga Tusha: Të përgjigjet vetë para drejtësisë, me gojën e tij!  via 
Kupa e Amerikës/ Paketa shemb edhe murin e Perusë, Brazili në finale (Video)  via 
SPAK, operacion anti-korrupsion në Lushnjë. Mes të arrestuarve edhe kryebashkiaku Fatos Tushe  via 
“Plaku dhe deti”, romani kryevepër i Hemingway  via 
I shpërthen goma e kamionit, humb jetën punonjësi i gomisterisë  via 
5 librat më të bukur që mund të lexoni për jetën e Princeshë Dianës  via 
Majemi, hidhet në erë me eksploziv pjesa e mbetur e ndërtesës që u shemb (Video)  via 
Spanja, thirrje publike tifozëve të saj anglezë: Kemi nevojë për ju!  via 
Anija që bllokoi Kanalin e Suezit do të paguajë 550 mln $ dëmshpërblim  via 
Një shëtitje në Toskana, Itali  via 
Kosova kontrollon kushtet shëndetësore në zonat turistike në Shqipëri: Të ruajmë pushuesit  via 
Senatorja Ernst paralajmëron për rritjen e ndikimit rus në Ballkan  via 
Alarm nga varianti Delta, Greqia në prag të valës së katërt  via 
Vendosi bllokadë në Bruksel, por Bullgaria kërkon ndarjen e Shqipërisë nga Maqedonia e Veriut për negociatat… 
Nusreti kërkoi nuse në Shqipëri, por miqtë dhe “gruaja” e zhvatën dhe i mbyllën telefonat  via 
Reforma “e thellë” e Policisë; drejtorët ikin…bëhen drejtorë  via 
Lidhje që përfundojnë në përndjekje; Burra që nuk pranojnë ndarjen, gra që duan të përfitojnë  via 
500 mijë pensione të pa tërhequra gjatë pandemisë. KLSH: Mungesë e digjitalizimit dhe burokraci në ISSH… 
Dështoi në Europian, e ardhmja e Deshamp te Franca vendoset këtë javë  via 
Deri ku të çon bixhozi? Burra që humbasin paratë, por kallëzojnë në polici për vjedhje  via 
Shpërthimi në Europian, Juventusi bën gati 40 milionë euro për Lokatelin  via 
Të rinjtë. të shqetësuar për të gjetur punë si pasojë e pandemisë  via 
Simfonia e 5-të e Maks Vershtapen në Austri, Hemilton e mbyll i katërti  via 
Ngjarjet kriminale, lëvizje dhe ndryshime në kupolën drejtuese të Policisë së Shtetit  via 
Afganistani, talebanët dhe gratë, ajo që ka mbetur nga liria pas 20 vjetësh  via 
Për një vit rriten çmimet e produkteve bujqësore. Rritje ka edhe qumështi  via 
Zbulohet në stomakun e lopës mikrobi që mund të shkatërrojë mbetjet plastike  via 
Brukseli e Prishtina, dy “shënjestrat” e Edi Ramës në fjalimin e Prespës  via 
Të rrethuar nga varianti indian i covidit. Pse nuk ka hyrë ende në Shqipëri?!  via 
Beteja tjetër, Kushtetuesja shqyrton ligjin “përgjues” të Policisë së Shtetit  via 
SHBA e ka marrë vendimin përpara Kushtetueses: Ilir Meta është thjesht një President ceremonial!  via 
Kryeministri i Ukrainës në “sulm”, me 7-ën e Shevçenkos në mbledhje qeverie  via 
A do t’i rikthehemi maskave përsëri? Ekspertët janë të ndarë  via 
PD: Qeveria shpërblen me tendera trafikantët që blenë votat më 25 prill  via 
Katër “të penduarit” që zbuluan organizatën e trafikut të drogës. Roli i tyre dhe goditja e grupit  via 
Aleanca për Teatrin dorëzon kërkesën për përjashtimin e Vitore Tushës  via 
Shaqiri paralajmëron Spanjën: Dimë si t’u shënojmë skuadrave të mëdha  via 
Investigimi/ Skandal me perimet në tregje: Me pesticide mbi normat, të ndaluara në BE, por edhe me shumë lloje ngar… 
Mega-operacion anti-drogë italo shqiptar, arrestohet prokurori i Vlorës dhe zyrtarë të policisë  via 
Si të mashtrojnë në internet për të të vjedhur paratë  via 
Arrestohet femra shqiptare që arriti të vjedhë 100 mijë euro përmes internetit. Në kërkim tre të huaj  via 
UEFA nuk lëshon pe për “Wembley”-n, Berlini e akuzon për papërgjeshmëri  via 
Një ditë pas vizitës së Reeker, Kim “troket” te zyrat e SPAK  via 
Shtyrja e negociatave të Shqipërisë, SHBA e zhgënjyer me Bashkimin Europian  via 
“Turizmi i kuq”, të huajt vizitojnë Kinën për njëqindvjetorin e Partisë  via 
Para kujt raportuan ERE dhe ERU në Kuvend dhe deputetët që nuk e dinë pse janë aty  via 
Shkarkohet kreu i Sigurisë Publike në Policinë e Shtetit  via 
Me Belgjikën gjykon slloveni i arrestuar në 2020-ën, në Itali ngrenë dyshime  via 
I veshur si Mao dhe një orë fjalim, Xi paralajmëron botën: Kina nuk trembet!  via 
Gjermania në proces, Lëv merr të gjitha përgjegjësitë dhe bekon Flik  via 
Ndryshon ora policore, rihapen teatrot dhe kinematë. Masat e reja që hyjnë në fuqi  via 
Mesazhi “i fshehtë” i vizitës së Reeker në Tiranë  via 
Ligji funksionon part-time dhe aq sa gjatësia e hijes së një çadre plazhi  via 
Varianti Delta/ UEFA mban finalen në Londër, anglezët s’shkojnë dot në Romë  via 
Çështja e detit Shqipëri-Greqi/Dendias: Vendimi për të shkuar në Hagë është kapitull i ri  via 
Dyshime për spiunazh rus gjatë stërvitjes së NATO-s në Shqipëri  via 
Foto-Video/ Nis aksioni në bregdet kundër zaptimit të plazheve, sekuestrohen çadra e shezllonë  via 
Itali-Belgjikë e vetmja sfidë e vërtetë, autostradë për Anglinë drejt finales  via 
Video/ Anglia feston me Sterling dhe Kejn, tjetër dështim për Gjermaninë  via 
Rama kundër Ndreut: Asnjë tolerim për fyerjen ndaj policëve. Ka bërë shumë gabim  via 
Serbia demonstron forcën ushtarake me stërvitje gjigande nga ajri e toka. A mund të jetë një paralajmërim për fqinj… 
Na kërcënon varianti Delta për masa shtrënguese në vjeshtë?  via 
Pas të dehurve, të droguarit në timon nuk pyesin për arrestimet  via 
Kriptovalutat – Si po i shfryn ligji aksionet e bujshme të policisë  via 
Negociatat-Shqipëra shpreson edhe tek  Sllovenia. Ç’duhet të presim 6 muajt e ardhshëm të presidencës europiane… 
Rama, Vuçiç dhe Zaev shtyjnë përpara idenë e Mini-Shengenit  via 
Pjerin Ndreu paditet nga policët: Na pengoi të mbyllnim një lokal pas orës 23  via 
Seanca në Gjykatën e Apelit ndaj ish-kryeprokurorit Llalla, në 12 korrik  via 
Kredia e re për ekonominë në rritje gjatë majit, arriti vlerën e 15.5 mld lekëve  via 
Raporti i OKB: Shqipëria e para në Europë për hashashin, kontrollon nga prodhimi te shitja  via 
BE paralajmëron për përhapjen e variantit Delta  via 
Sot sfida Angli-Gjermani, një tjetër big duhet të largohet nga gara  via 
Me shpejtësi vrastare, radari kap “pilotin” e rrugës me 196 km/h në Tiranë (Foto-Video)  via 
Basha heq dyshimet: Në shtator vijojmë betejën në Parlament! Kemi mbështetjen e BE  via 
Video/ Zvicra bën goditjen e madhe, kampionët e botës ndëshkohen nga Mbape  via 
Shiriti ylber, Nojer: Kundër racizmit dhe dhunës, jemi shembull për të rinjtë  via 
Covid, Izraeli u kërkon të rinjve që të vaksinohen për të shmangur kufizimet  via 
Vaksina ka, por pak kush do të vaksinohet  via 
Qasja me “dy fytyra”. Tani BE kërkon të mos pranohen të vaksinuarit me Sputnik dhe Sinovac  via 
Masakra në Velipojë, dëshmia e një prej të plagosurve: Shkuam për të folur, por situata u acarua  via 
Dhoma Amerikane jep 40 sugjerime për përmirësimin e klimës së biznesit  via 
Sot në fushë Spanja dhe Franca, Deshamp pret golat e Kilian Mbape  via 
Aplikimet për vend pune në shtet në 2020-n arritën nivelin më të lartë që nga viti 2001  via 
8 viktima në dy ditë, Çuçi “zhvishet” nga përgjegjësia: Faji i gjyqtarëve dhe prokurorëve  via 
Video/ Tjetër sherr për shezlonët; në Drimadhes i djegin gjatë natës  via 
A mjafton një dozë vaksinë tek ata që kanë kaluar më parë Covid-19?  via 
“Arnautoviç, të fala mamit” Ia bëri vetes, tani sulmuesi ka punë me shqiptarët  via 
Tjetër sherr për shezlonët; në Drimadhes i djegin gjatë natës  via 
Bota e egër në fotografi  via 
SHBA në pritje të publikimit të raportit për UFO-t  via 
Italia qëndron në këmbë, “Jo” uljes në gjunjë para ndeshjes me Austrinë  via 
Ndahen çmimet e letërsisë për të rinj, shpallen 3 fitues  via 
Fuqia e buzëqeshjes së një të huaji  via 
Rama “i dyzuar” për Berishën “non grata”: Me BE-në jemi mësuar që të mos mbajë premtimet  via 
Shkaktoi aksidentin ku humbën jetën 4 anëtarë të një familjeje, prangoset 22-vjeçari Igli Medani  via 
Shqipëria e ekstremeve: Në Tiranë jetohet si në Pragë. Veriu, më i varfëri dhe me papunësi rekord  via 
Kim rikthehet te SPAK, takon kreun e Sektorit për Krimin e Organizuar: Do të kemi edhe më shumë rezultate, askush s… 
Testohen në Itali 54 lojtarë, trajnerët kuqezi në kërkim të talenteve  via 
Zaev: Bisedimet për BE nuk duhet të shndërrohen në bisedime me Bullgarinë  via 
Aksidenti, Policia e Shtetit: Rast tragjik që do të hetohet. Shpejtësia vret!  via 
Greqia në alarm: Varianti indian do të dominojë deri në fund të gushtit  via 
Shqiptarët po vdesin rrugëve dy herë më shumë se mesatarja e BE  via 
===