Njihuni me Axhendën e Tirana "Tirana SME Week 2018: Transformimi i Ekonomisë tonë "e cila do të zhvillohet më 15 N… 
SME Albania pako ushqimore falas për 250 familje në Tepelenë (FOTO) 
Nean Muçaj: Ndërkombëtarizimi, suksesi i ekonomisë shqiptare - Gazeta Shqiptare Online 
Në Akademinë Verore për SME-të 2018 përfaqësuesja e Enterprise Europe Network për Shqipërinë, Znj. Migena Muslli pr… 
Ceremonia e ndarjes së certifikatave të pjesëmarrjes dhe çmimeve fituese të Akademisë Verore për SME-të 2018.
Në Akademinë Verore për SME-të, leksioni me temë "Hyrje në strategjinë dhe planifikimin e eksportit" lektori Z. Ale… 
Tema: Mjetet e komunikimit: Media Sociale si një mënyrë për të promovuar biznesinLektor: Z. Flogert Muca – Ekspert i Medias dhe PR
Dita e dytë e Akademisë Verore për SME-të, vijoi ndër të tjera me trajnimin me temë "Roli dhe Funksionet e Organiza… 
Lektore: Znj. Anxhela Bushati – Përgjegjëse e Sektorit të Menaxhimit të Programeve të Zhvillimit Ekonomik, Ministr… 
Në Akademinë Verore për SME-të, leksioni me temë "Bashkëpunimi tregtar Shqipëri - Kinë", prezantuar nga lektori Z.… 
Në Akademinë Verore për SME-të, gjatë trajnimeve me temë:1. Ndërkombëtarizimi i SME-ve  nëpërmjet pjesëmarrjes në… 
Gjatë intervistës së Z.Kenneth OE Sundin në SCAN TV. Akademia Verore për SME-të 2018 dhe përfshirja e SME Albania n… 
Nga Pekini për të përshëndetur Akademinë Verore për SME-të, Jona Shaba, studente e Akademisë së Biznesit në Kinë, f… 
Në Akademinë Verore për SME-të, temat “Guerrila Marketing” për biznesin e vogël dhe “Networking” si një strategji m… 
Në Akademinë Verore për SME-të, tema "Programet Interreg IPA 2014 - 2020", trajtuar nga lektori Z. Gentian Xhaxhiu… 
Në Akademinë Verore për SME-të, tema "Cilësia dhe standardet" trajtuar nga lektorja Znj. Edona Bilali – Konsulente biznesi dhe sipërmarrëse
Startoi sot Akademia Verore për SME-të e cila do të vijojë aktivitetin e saj të trajnimit "Menaxhim të eksportit" n… 
‘Akademia Verore për SME-të’, mbërrin në Shqipëri një nga ekspertët më të mirë ndërkombëtar  
Akademia Verore për SME-të 2018, akademia e sipërmarrësve eksportues! 
Ju mirëpresim në Akademia Verore për SME-të 2018!Afati i fundit për regjistrim: 20 Qershor. 
Artur Hadroj, fitues i Akademisë Verore për SME-të 2017, ndan eksperiencën e pjesëmarrjes në akademi në emisionin "… 
Ju prezantojmë me lektorin, Z. Gentian Xhaxhiu, Përgjegjës i Sektorit të Programeve të Bashkëpunimit Territorial pr… 
Prezantimi i Akademisë Verore për SME-të në emisionin Mirëmëngjes Shqipëri në TVSH.Daniel Guce - Koordinator i Pr… 
Një tjetër lektor i Akademisë Verore për SME-të 2018 është Z. Alessandro Silvestri, Konsulent pranë IB Solutions UK… 
Një intervistë me lektoren Znj. Ingrid Konomi mbi Akademië Verore për SME-të. 
Akademia Verore për SME-të: “Trajnim për menaxhimin e eksportit” 
Vasil Kolezi është një ekspert i menaxhimit të marketingut, i tregtisë ndërkombëtare dhe i pasionuar ndaj marketing… 
Ju prezantojmë me partnerin dhe një nga lektorët e Akademisë Verore për SME-të, Z.Kenneth OE Sundin, themelues i SM… 
Akademia Verore e SME-ve, model suksesi trajnimesh për SME-të në Shqipëri. SME Albania merr pjesë në vlerësimin e p… 
Ndërmarrjet e vogla dhe të mesme, trajnim për menaxhimin e eksporteve - ATSH - 
Zbuloni mundësitë më të mira të bizneseve të vogla për vitin 2018 
Gëzuar Festat nga Fjorza Mullaji, sipërmarrëse në Pazari i Ri, Tiranë! .fjo.accessories... 
Gëzuar Festat nga Ana Maria, sipërmarrëse në Zvicër.    ... 
Gëzuar festat e fundvitit nga Daniela Toro, studente në Angli.     ... 
Shqipëria është e njohur për një traditë tepër të pasur të artizanatit me vlera të çmuara, të krijuar prej... 
Shoqëria Giostre e administruar nga Blerta Lefteri me seli në Durrës është themeluar në fund të vitit 2013 me... 
Shumëkush i ka parë por shumë pak e dinë… Objekte dekorues në pazarin e Ri të Tiranës dhe objekte të tjera të... 
Natyra dhe arti sot janë bërë NJË, ky është light motivi i  Krisiko Art, sipërmarrjes së dekorit dhe eventeve që... 
Gëzuar Festat nga , sipërmarrëse shqiptare!    ... 
Ngri një sipërmarrje që të fal emocione positive ” ky  eshte motivi i Hënës , vajzës 26 vjeçare nga qyteti i... 
Kop Frut është kompania e parë dhe e vetme në Shqipëri që prodhon lëng molle 100% natyral nga mollet e Dibrës,... 
Bashkimi i Dhomave të Tregtisë dhe Industrisë së Shqipërisë, në bashkëpunim me Ambasadën e… 
Bashkimi i Dhomave të Tregtisë dhe Industrisë së Shqipërisë, në bashkëpunim me Ambasadën e Republikës Popullore të.… 
SME Albania në SCAN TV 
Ora News - "Java e SME-ve", kërkohet më shumë mbështetje ndaj këtyre ndërmarrjeve 
SME Albania prezanton në SCAN TV aktivitetin Tirana SME Week 2017: Speed up to Europe i cili do të organizohet në... 
SME Albania mori pjesë në edicionin e 22-të të eventit mujor të organizuar nga BLG në Ballkan, në kuadër të... 
Bëhuni pjesë e Institutit Shqiptar për SME-të! Dërgoni CV tuaj në info.al Ju mirëpresim! 
Gjatë pjesëmarrjes së SME Albania në B2B organizuar nga BLG Group. Një mundësi partneriteti midis sipërmarrjeve... 
Gjatë pjesëmarrjes së SME Albania në B2B organizuar nga BLG Group. Një mundësi partneriteti midis sipërmarrjeve... 
Në Gusht 2017 eksportet e mallrave arritën vlerën 18 mld lekë, duke u rritur me 12,0 %, në krahasim me të njëjtën... 
 59% e të rinjve shqiptarë janë të prirur drejt sipërmarrjes- SME projekt për mbështetjen e tyre 
Bashkëpunimi i SME Albania dhe BLG për inicimin e një projekti të projektuar për të mbështetur të rinjtë që duan... 
Banka e Shqipërisë dhe BERZH mbajtën një seminar për faktoringun në Tiranë këtë javë. Diskutimet u përqëndruan... 
SME Albania pati sot kenaqësinë e vizitës miqësore të Z. Corrado Bambini, Drejtor Ekzekutiv i BLG Group për... 
Në Korrik 2017 eksportet e mallrave arritën vlerën 25 mld lekë, duke u rritur me 9,7 %, në krahasim me të njëjtën... 
Shfletoni newsletter e parë të SME Albania. 
820 milion euro për bizneset SME. Mbështetje e dyfishtë e Fondit Europian për Investime dhe ProCredit Bank për... 
Instituti Shqiptar i SME-ve, SME Albania zhvilloi sot Ceremoninë përmbyllëse të edicionit të parë të Akademisë... 
Roli i Medias Sociale në mbështetje të sipërmarrjesLektor: Valbona Mezini
SASME në ditën e gjashtë.Tema: Inovacioni dhe Teknologjia e Informacionit në mjedisin organizativPhD (c). Erjon Curraj
SASME në ditën e pestë.Tema: MarketinguDr. Ingrid Konomi
SASME në ditën 4.Tema:  Shitja dhe komunikimi efektivLektor Dorina Laçi.
Vijojnë prezantimet e lektorëve në ditën e tretë të Summer Academy of SME. 
Gjatë workshop të zhvilluar nga Lektori,  Gregor Jänin me temë: Shëndeti dhe Siguria. (SASME) 
Për tu ardhur në ndihmë SME-ve, gjatë muajit korrik do të ngrihet për herë të parë “Akademia Verore e SME-ve”.
Sondazh për biznesin mbi të drejtat e konsumatorit
===