Një herë, vetëm një herë në jetë e kam takuar. Në njërën nga rrugët e Tiranës, u ndeshëm përballë njëri tjetrit ras… 
Dy vjet pa praninë tënde fizike Andrea! Por ka gjëra që vdekja nuk i prek. Sepse ata që i duam nuk na lënë kurrë!… 
Nga ceremonia e ndarjes së çmimeve ''Karriera'' organizuar nga  nga Unioni i Gazetarëve Shqiptarë
 Shihe, retweet dhe komento nëse të pëlqejne klasat dhe pianot e reja te Liceu. Vendi ecën përpara vetëm me punë :) 
 Dr.Ilia Sefo, kryebashkiaku i ri i Kolonjës, mjeku që do të kurojë plagët e vendlindjes në rrugën e nisur të Rilindjes Urban…
Sapo pashë videon mbi pjesëmarrjen e Sali Berishës në “Power Kids” një rubrikë televizive ku disa fëmijë i... 
Kuuvendi votoi me konsensus aktet nënligjore të dekriminalizimit. Votimi mori 114 vota pro, asnjë kundër dhe... 
Sali Berisha paska deklaruar se po konsideron mundësinë e dorëzimit të mandatit të deputetit nga që Parlamenti... 
Vërehet një prirje e ethshme donkishoteske, jo vetëm brenda vendit, për ta risjellë në axhendën e politikës... 
Protesta e sotme tregoi edhe më qartë dallimin mes qeverisë së djeshme te 21 janarit që vrau protestuesit dhe... 
SHËNIM: Si tradhtojnë ndërkombëtarët | GAZETA DITA 
ORGJI ME LIRINE E FJALES?!Pas një debati që kam patur në “Opinion”, fanatikë berishiste dhe ca media online... 
ORGJI ME LIRINE E FJALES?!Pas një debati që kam patur në “Opinion”, fanatikë berishiste dhe ca media online... 
HILETE E DRITAN HILESDritani sapo me ka share në facebook. Do më kish pëlqyer të më kish kritikuar dhe jo... 
AKREPI BERISHIZMIT DHE DEMOKRACIAI përballur me një disfatë të thellë të PD dhe aleatëve të saj Sali Berisha i... 
SHËNIM: Pse PD nuk do njohë zgjedhjet! | GAZETA DITA 
SHËNIM: Gabimi i Blushit, partia mbi të gjitha! | GAZETA DITA 
Hipokrizia e dekriminalizimit: A mund të “legalizohen” Gërdeci dhe 21 Janari?! | GAZETA DITA 
Një reagim shumë qesharak i qeverisë së Maqedonisë ndaj deklaratës së Edi Ramës se pa zbatmini e Marrëveshjes së... 
O MAQEDONI O LUFTE?Kanceri i Maqedonisë është urrejtja mes etnive, dhe në radhë të parë mes atyre dy kryesoreve,... 
O MAQEDONI O LUFTE?Kanceri i Maqedonisë është urrejtja mes etnive, dhe në radhë të parë mes atyre dy kryesoreve,... 
POPULIZMI ANTISHTET I BASHESDëgjoj Lulzim Bashën që i premton qytetarëve se nëse PD rikthehet në pushtet, do... 
MORALI URDHERON QE NISHANI TE LARGOHET!Nuk mund të jetë President një person që gënjen. Dhe një krahasim i... 
===