23 Shkurt 1923, Shqipëria dha me konçesion tek të huajt për 25 vjet, çifligjet nga Shkumbini deri në Vlorë… 
23 Shkurt 1843, referat i prof. Franc Bopi në Akademinë e Shkencave të Berlinit; shqipja është një gjuhë indoevropi… 
22 Shkurt 1942, grevë antifashiste e nxënësve të Institutit Femëror në Tiranë  via 
22 Shkurt 1926, u ngrit kryekonsullata Shqiptare  e nderit në Janinë të Greqisë  via 
22 Shkurt 1822, u dërgua në Stamboll koka e Ali Pashë Tepelenës  via 
21 Shkurt 1915, gazeta “Dielli” shkruan për konçensionet e Shqipërisë  via 
21 Shkurt 1924, greva të mëdha të mësuesve në gjithë Shqipërinë  via 
21 Shkurt 1272, mbreti Karli I Anzhuin shpalli Mbretërinë  e Arbrit dhe vetë u shpall mbret i saj  via 
20 Shkurt 1897, u mblodh në Kalabri Kongresi i II për gjuhën shqipe  via 
20 Shkurt 1913, lindi Dr. Jani Gërmenji, ndër të parët dentistë në vend  via 
20 Shkurt 1991, u rrëzua në Tiranë busti i Enver Hoxhës  via 
20 Shkurt 1622, shënohet sot përvjetori i vdekjes së Pjetër Budit  via 
19 Shkurt 1936, demostratë e zejtarëve në Korçë kundër prodhimit industrial të këpucëve dhe opingave  via 
19 Shkurt 1919, letër proteste e Bajram Currit për Klemansonë  via 
19 Shkurt 1272, përfundoi kisha e Rubikut, faltorja më e lashtë kristjane në Shqipëri  via 
   miraton ligjin për  .    … 
  Jani Dode u zgjodh  i  të  "Aleksandër Xhuvani".  … 
  u lind në    Ibrahim Kadriu.   … 
  u lind në   Fatos Cekodhima.   … 
  në   i shtrin pretendimet deri në  të Zi.  … 
  plani i   Uillson shpëton ërinë .  … 
  kur ët luftonin për të çliruar  .   … 
  , në  "Dodona" të ës u dha shfaqja për fëmijë "Goni trazavaci" .  … 
  , "Halili dhe Hajria" krijoi bazat e traditës  në  .  … 
  lindi  dhe   .   … 
  , u hap në   #"Esperia" .   … 
  , ushtritë -hungareze depërtojnë deri në  .   … 
  ,  nxorri në  në moshën 55 vjeç 168 ës.   … 
  ,  mbërrin në   .   … 
  , u luajt në   pjesa  .   … 
6   , një shoqëri që perzgjidhte  për fëmijë.   … 
6 janar 1843, lindi në   ;  dhe  .   @ Shkodër, Albania 
6 janar 1882, u lind Fan Noli.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
5 janar 1924, del gazeta "Dajti" .  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
5 janar 1880, luftë e madhe e vullnetarëve shqiptare në mbrojtje të Plavës dhe Gucise. # albania1880 @ Plava 
4 janar 1975, Shqipëria aderoi në Konventën Doganore të Transportit TIR.  @ Qendra Mbarëkombëtare e Kol… 
4 janar 1924, lindi Kadri Roshi.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
3 janar 1946, ndihmat e "Vatrës" për Shqipërinë; mbi 800 tonë ilaçe, pajisje Bujqesore e ushqime.  @ Qe… 
3 janar 1957, u dekorua Ansambli i Ushtrisë.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
3 janar 1924, grevë e arsimtarëve shqiptare.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
3 janar 1809, luhet në Dardhe pjesa teatrore "Lufta e Trojës".  @ Dardhë, Korçë, Albania 
Janar 1621, Relacion i Pjeter Budit: Shqiptarët janë të vendosur të vazhdojnë luftën.  @ Rome, Italy 
2 janar 1942, Shqipëria nënshkruan paktin kundër Fuqive të Boshtit.  @ Qendra Mbarëkombëtare e Koleksio… 
2 janar 1942, Shqipëria nënshkruan paktin kundër fuqive të boshtit.  @ Qendra Mbarëkombëtare e Koleksio… 
31 dhjetor 1919, raporti i Gjeneralit Francez De Furtu: trazirat në Shqipëri i nxisin fqinjët.  @ Qendr… 
31 dhjetor 1901, ndahet nga jeta Zef Serembe, një nga Liriket e Letërsisë Arbëreshe.  @ Qendra Mbarëkom… 
31 dhjetor 1454, përballë ekspeditës kundër shqiptarëve, Venediku mban anën e turqve.  @ Venice, Italy 
30 dhjetor 1940, vdiq në Shkodër At Gjergj Fishta.  @ Shkodër, Albania 
30 dhjetor 1985, u shua Theofan Papa, studiues i shquar i kulturës sonë mesjetare.  @ Qendra Mbarëkombë… 
29 dhjetor 1996, rivarrimi i eshtrave të At Gjergj Fishtës.   @ Qendra Mbarëkombëtare e Koleksionistëve… 
29 dhjetor 1968, përkujtohet mjeku i shquar Janko Theodhosi.  @ Qendra Mbarëkombëtare e Koleksionistëve… 
29 dhjetor 1944, shënohet ringritja e ATSH-se.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
29 dhjetor 1924, plagët e betejës shuan Elez isufin.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqipta… 
29 dhjetor 1919, mërgimtarët notë protestë Parlamentit Italian.  @ Parlamento Italiano 
28 dhjetor 1914, Franca dhe Rusia protestojnë pranë Italisë, trupat e së cilës kishin pushtuar Vlorën. … 
28 dhjetor 1977, Premierë e filmit "Tomka dhe shokët e tij" .  @ Qendra Mbarëkombëtare e Koleksionistëv… 
28 dhjetor 1927, lindi piktori Fatmir Haxhiu.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
28 dhjetor 1925, hyri në fuqi "Marrëveshja Tregtare Provizore" Shqipëri-Amerike.  @ Qendra Mbarëkombëta… 
28 dhjetor 1976, u miratua Kushtetuta e re, "Shqipëria është diktature e proletariatit" .  @ Qendra Mba… 
27 dhjetor 1945, u themeluan Banka Botërore dhe Fondi Monetar Ndërkombëtar. @ World Bank 
27 dhjetor 1937, u krijua Shoqëria kooperativiste "Qumështi".  @ Qendra Mbarëkombëtare e Koleksionistëv… 
27 dhjetor 1932, hyri ne fuqi Konventa e Bashkimit Ndërkombëtar të Ndihmave.  @ Qendra Mbarëkombëtare e… 
27 dhjetor 1923, përfunduan zgjedhjet për Asamblenë Kushtetuese.  @ Qendra Mbarëkombëtare e Koleksionis… 
27 dhjetor 2006, u shua kompozitorja Dhora Leka.  @ Qendra Mbarëkombëtare e Koleksionistëve Shqiptarë 
27 dhjetor 1876, kryengritje e veriut për një principate shqiptare autonome.  @ Qendra Mbarëkombëtare e… 
26 dhjetor 1984, u miratua Kodi i Parë Rrugor i Shqipërisë.  @ Qendra Mbarëkombëtare e Koleksionistëve… 
26 dhjetor 1919, notë diplomatike për kryeministrin francez Klemanso.  @ Paris, France 
26 dhjetor 1917, lindi në Shkodër kompozitori Prenk Jakova.  @ Shkodër, Albania 
25 dhjetor 1927, Kinema Majestik e Korçës me e mira në Ballkan.    @ Korçë, Albania 
25 dhjetor 1914, pas incidentit të sajuar Italia zbarkon në Vlorë.  @ Vlorë, Albania 
Leu në Shkodër, në gjirin e një familjeje të thjeshtë, i ati Llazari ishte furrtar. Ndoqi mësimet fillore në shkoll… 
Rexheb Beqiri i njohur më shumë me emrin fetar Baba Rexhepi  ka qenë një dervish i tarikatit bektashi dhe themelues… 
===