 Çdo përpjekje ligjore, reformë në polici e drejtësi, për një rend publik të qetë, është për t'u mbështetur. Të gjitha këto…
 Kush është i riu/ e reja?  
 Shkurajimi i të rinjve dhe dëshira e tyre për t'u larguar nga Shqipëria për studime apo për punë mbetet ende shenja më e qa…
 Vrasjet kriminale të ndodhura kaq shpesh kohët e fundit tregojnë shëndetin e shoqërisë tonë, përballë të cilit nuk mund të…
 Kush e shet votën me para, ka shitur dinjitetin e vet dhe atë të familjes, si dhe nuk ka më zë për të kërkuar llogari. P…
 Krahas varfërisë dhe ikjes së shqiptarëve, si pasojë e perceptimit të mosjetueshmërisë së vendit, një tjetër sfidë e madhe…
 Uroj Presidenten Osmani për zgjedhjen. I dëshiroj shëndet dhe pres të ushtrojë rolin e saj kushtetues në drejtimin e at…
 Në Shqipëri jetojnë rreth 682 persona me sindromën Down e sot është më e nevojshme se kurrë të punohet për të përmbushur…
 Në këtë 7 mars, kujtoj një nga figurat vigane të kulturës kombëtare shqiptare,  françeskanin, atdhetarin e mësuesin erud…
 Si sot, më 4 mars 1946, për Fé e Atdhe u pushkatuan në Shkodër atë Gjovanni Fausti e atë Daniel Dajani, bashkë me semina…
 Më 20 shkurt 1946, u pushkatua At’ Anton Harapi, bashkë me anëtarët e tjerë të Regjencës, Lef Nosin dhe Maliq bej Bushat…
 Urime përvjetori i 13-të i Pavarësisë së Kosovës Sa herë që e kemi këtë festë, mendja më rri te  &amp; lufta e përdi…
 Ushtro të drejtën tënde të votës, rinovo dokumentin tënd të identifikimit! Falë votës, shtetasit shqiptarë do të zgjedhi…
 Nëse je një anëtar i Diasporës Shqiptare me aftësi profesionale të larta dhe do të doje të ndihmoje Shqipërinë me procesin…
 Prof. Ernest Koliqi, klasiku i fundit i brezit letrar të viteve '30, mbylli sytë përgjithmonë, si sot, më 15 janar 1975.…
 Një lutje për zonat e përmbytura! Zoti i ndihmoftë të përballojnë situatën me sa më pak dëme për njerëzit, bagëtitë dhe ara…
 Ceremonia mortore e At  në dhjetor 1940, e ndjekur nga  ëMarubi, që nga prehja në shtrojen e dekës, tek…
 Përkujtojmë sot në 80 vjetorin e vdekjes, figurën më të madhe të letërsisë shqiptare të gjysmës së parë të shekullit të…
 Nëse do të mund të përmblidheshin në një foto degradimi i shëndetësisë falas dhe propagandës  
 Në vigjilje të Krishtlindjes po ndajmë me ju disa foto-histori realizuar nga Michel Setboun.Stefan Duka, ndër nismëtarët…
Në Rumani, Ministri i Brendshëm dha dorëheqjen pasi policia e shtetit nuk kishte arritur t’i përgjigjej thirrjeve t… 
8 Dhjetori duhet të jetë datë reflektimi. 30 vjet më pas, shqiptarët jo vetëm që nuk e bënë Shqipërinë si Evropa, p… 
 Nga kujtimet e Át Konrrad Gjolaj për datën 29 nandor 1944...“E premtja e zezë e Shqipnisë, që filloi me 29 Nandor 1944…
Me këtë foto të shqiponjave që fluturojnë mbi Kullën e Jasharëve, gëzuar! Ditë krenarie e shprese se kohë më të mir… 
 PPP për sterilizimin e instrumenteve kirurgjikale është në vitin e pestë të operimit, por ka shënuar rritje të kostove t…
 Në “Shtëpinë e Abatit” pozojnë anëtarët e shoqërisë “Bashkimi” e themeluar në vitin 1899 nga Imzot çi me personal…
 Situatë absurde! Marrëzitë për ca vota quhet politikë! Në Hagë drejtuesit e UÇK, Kosova akuzon Serbinë, Tirana akuzon opozi…
===