 (3/3)Vlerësimi i listës së kandidatëveLista e Partisë Socialiste për Tiranën, të cilën kryesocialisti Rama ia ka faturuar…
 (2/3)Projeksioni për Tiranën: PS merr 48%, PD dhe LSI merrin 50%, Thurja 0.5% e partitë e tjera 1.5% …
 Kush fiton në 25 prill? Me 23 shkurt, Rtv Ora dhe Antonio Noto sjellin sondazhin e dytë kombëtar dhe projeksionet për Shkod…
 Kapen rreth 300 mijë euro në Durrës, u futën nga Italia 
 Delfini dhuron spektakël në Vlorë, e filmoi një peshkatar 
 “Ky është fashizëm” Zemërata e Gent Zenelajt: Mallkimi do bjerë mbi politikanët!Shikoni per me shume  
Bushati dhe Kotzias takohen në Bruksel 
Ora News – Tragjedia, nëna mbylli trinjakët për të marrë vajzat nga shkolla  via 
 Votova në 4 qendra votimi dhe nuk vura re asnjë parregullsi!
Live: Lulzim Basha sot në "Arena" në Ora News  via 
Live - Kryeministri dhe Kryetari i PS, Edi Rama në Tonight Ilva Tare në ...  via 
Live në Ora News: Çfarë do të ndodhë me PD? Sali Berisha në “Tonight Ilv...  via 
Moikom Zeqo jep alarmin për Gjirokastrën. JO ndërtimit të By Pass 
Miliarderi s’ do tia lërë fëmijëve pasurinë 140 milionë dollarëshe 
Atentat në Tiranë, ekzekutohet me armë zjarri ish-drejtori i policisë Vlorë 
Xhafaj, Xhaçka, Manastirliu dhe Shalsi ministrat e rinj të qeverisë 
“Politikanë e prokurorë të korruptuar do përpiqen të vjedhin zgjedhjet” 
Jep dorëheqjen Mirela Fana, kryetare e Këshillit të Emerimeve në Drejtesi 
Krisja e koalicionit me LSI, të mërkurën Edi Rama në Tonight Ilva Tare 
Ambasada amerikane revokon vizat për disa gjyqtarë dhe prokurorë 
Letra e mësueses për prindërit : Rreth atij fëmije (që ngacmon, godet  fëmijën tuaj) 
Hajdaraj kishte marrë tre apartamente me qera për t’i shpëtuar policisë 
Presidenti i ri amerikan dhe pritshmëria shqiptare 
Mandatet e tre zyrtarëve, Blushi: KQZ, Gjykata e Krimeve të Luksit! 
 - Prishtina alarmon BE për rrezikun nga shtrirja e ndikimit rus në Kosovë – Ora News 
 - Donald Lu: Mos arrestimi i Balilit dështim i policisë dhe drejtësisë – Ora News 
 - Meta: Vendet e punës nuk hapen me kanabis. Duhet pakt pozitë-opozitë – Ora News 
 - Në Dubai treni më i shpejtë se një avion – Ora News 
Rusisë i intereson që në pushet në Shqipëri të vijnë forca proruse, por edhe të nënshtruara  via 
 - Kundërevolucioni i heshtur rus në Ballkan – Ora News  via 
Gruaja që lufton me kancerin merr propozim për martesë live në tv – Ora News  via 
Kjo eshte amerika :) Obama pret në Shtëpinë e Bardhë 6-vjeçarin shqiptar – Ora News  via 
 - Obama pret në Shtëpinë e Bardhë 6-vjeçarin shqiptar – Ora News  via 
 - Ja dhe superhëna, foto të mrekullueshme nga e gjithë bota – Ora News  via 
 - Bilbili ndërron jetë, por zërin e ka të përjetshëm!  via 
 - Mesazhi prekës i mërgimtarit për bashkëqytetarin e tij në Kosovë  via 
 - Si të shkruajmë pa gabime?!  via 
Ben Blushi: Dielli i Evropës do të na ngrohë ngadalë, por ne gjithmone do ta shohim.  via 
 ZOTAT U NGJITËN NË QIELL                                      Zotat u ngjitën në qiell dhe s’dinë më të... 
 “KAMBANA QË BIE PËR TË GJITHË”, të Enjten në “Të Paekspozuarit”, ora 20:45 në ekranin e Ora News. 
Njësi antikorrupsion për të arrestuar Al Capone-t shqiptarë. SHBA do ta mbështesë me miliona Dollarë  via 
 - Përjetimi: Në tren me djem që shkojnë në… ‘Asnjë-vend’  via 
 - Dy gra filmojnë jetën e frikshme nën sundimin e ISIS  via 
 Flamuri i Kosovës në një filxhan kafeje   
  – Vendimi , Mbi 1100 vende të lira pune në administratë publike 
 Qeveria ngre një tjetër qendër statistikash, përveç INSTAT 
 Armando Prenga: Edhe pse plotësisht i bindur në pafajësinë time dëshiroj të mbetem larg jetës parlamentare përsa... 
Veliaj, pemët e Parkut dhe premtimi për referendum  via 
Platforma e Blushit: Do kthej PS majtas. Deputetët po grabisin për shkak të statusit që i dha Rama  via 
Daut Gumeni: Ceni ynë, paaftësia kombëtare. Busti për të përndjekurit  “një grusht zorrësh pa kokë” 
 Nga Ilir Babaramo/ A duhet të ishte i pari Spiro Ksera?  
Lu: Publikoni deklaratat e pasurive të kandidatëve.Largoni politikanët kriminelë e të korruptuar  via 
  Pacientët në pritje, Onkologjiku pa kimioterapi, mungojnë 4 medikamentet bazë 
 KE për ekonominë shqiptare: Shqetësim mbledhja e të ardhurave dhe borxhi...  via 
 Ambasadorja hollandeze: Këtu sheh më shumë makina luksoze se në Hollandë   
  - Xhekpoti amerikan arrin në 900 milionë dollarë 
 - Justina Aliaj:  Stefan Çapaliku më detyroi të aktroja në 2 metër skenë  via 
 - Kjo mrekulli nënujore ndodhet në Gjirokastër  via 
 Fatos Lubonja shkruan: Mirë ne që nuk kemi kujtesë institucionale sepse sa vjen njëri në pushtet i nxjerr të... 
 Kosovë, Asociacioni i komunave serbe, Kushtetuesja: Jo në përputhje me kushtetutën 
 Zbardhen të vërtetat e hidhura të arkës së shtetit. Qeveria nuk di as sa borxh ka marrë në dy vjet." Insight"... 
 - Sulmohet me gurë Ambasada shqiptare, Bushati kërkon garanci për stafin  via 
 MPJ  &amp; Zv.ministrja  në ministerialin e BE-së mbi krizën e refugjatëve  
Historia e Ndre Legisit ne “Arratisje nga liria”, të enjten në 20:45 ne  “Të Paekspozuarit”  via 
“Arratisje nga liria”, të enjten në “Të Paekspozuarit”, ora 20:45- Ora News  via 
 - Shumë konsensus dhe pak shpresë për dekriminalizimin  via 
Rama: Mos shkrepni armën e nacionalizmit merrni kuponin. Shkollë nate për Tatimorët  via 
 Fatos Lubonja: A mund ta mbysin dy të mëdhenjtë LSI-në? | Lapsi.al  
 - Do të jesh një shkrimtare? J.K. Rowling ka disa këshilla për ty  via 
 - 10 gabimet më qesharake që s’duhet ti bëni në CV  via 
Braçe: Përgjegjësi penale për 156 mijë pasaportat e pavlefshme. Ministër ishte Basha  via 
  - Media gjermane: Thaçi mund të përballet me gjykimin për krime lufte 
  - Guxholli: Qeveria po godet të varfërin, s’mund tia faturojë Greqisë dështimin 
  – VIDEO / Ftesa për të vizituar Vermoshin, magjinë e Alpeve 
 - Taksa të lodhshme  via 
 VIDEO / Azilanti kthehet dy herë nga Gjermania: Do iki sërish, këtu s’ka asgjë 
 Kyeministri i Malit te Zi Gjukanoviç u heq një javë pushime Ministrave: Kemi detyra të rëndësishme per te... 
 Perëndimi i diellit në Ksamil pa fotoshop   
Kthehen 70 azilkërkues nga gjermania, shumica të rinj. Rrëfejnë aventurën  via 
 Kukësi kthehet blu, Shehu per Ora News pas fitores : Mundëm një të keqe të madhe... 
Arrestohet Vladimir Gjuta, i dyshuari kryesor për shpërthimin në farmacinë e Tahirit  via 
 VIDEO/ Raporti i Bankës së Shqipërisë: 210 milion euro më shumë borxh 
Gara për Tiranën, Propozimi i Ramës: Erioni kryetar bashkie, Kosova drej...  via 
Rama: S’do lejojmë të ndodhë në Vjosë ajo që ka ndodhur me lumenjtë e tjerë  via 
Autostrada Nish- Durrës i siguron Serbisë daljen në det nga Shqipëria. Projekti 1 miliard euro  via 
Kryeministri kosovar dhe serb shtrëngojnë duart në Tiranë- Ora News- Laj...  via 
 Vuçiç: Droni u organizua politikisht. Rama: Shqipëria e madhe s’është projeki ynë 
 Video/ Pakti detar , Rama: S’negociojmë interesin kombëtar. E paimagjinueshme ndërhyrja e Athinës për Idrizin 
Blushi:Turqisë i kërkohet të ngrihet Parlamenti. Me Athinën nxitohet. S’funksionon “vetoja” me Shkupin  via 
“Rrugicat që kërkojnë perëndimin”, të enjten në “Të Paekspozuarit”, ora 20:45  via 
“I’m alive” Elhaida Dani çon Shqipërinë në natën finale të Festivalit Europian  via 
Pse Gruevski ka vendosur të vrasë?  via 
Çfarë fshihet pas zhurmës së videos në Shkodër?  via 
DioGuardi në Uashington: Ndarja e shqiptarëve, gabimi më i madh pas Luftës I Botërore  via 
===