 Shqiptarët e dinë që Rama në qeveri është më i dëmshëm se “Ramët” e emëruar prej tij në bashkitë e vendit. Dy gjëra jan…
 1/2 Arrestimi i Fatos Tushës pas denoncimeve shumëvjeçare nga PD të bashkëpunimit të tij korruptiv me krimin e organizu…
 Trushpëlarë, apologjistë me apo pa qira: boll akuzuat njerëzit për të keqen që ka plasur kudo! Është vetëm pasojë e mod…
Është edhe kjo AMERIKA 
 Sot vij para jush për të shpallur një tjetër synim, një detyrë, një mision që i përgjigjet dëshirës së çdo shqiptari: k…
 Ndryshimi për sa i përket pandemisë do të vijë në 3 rrafshe kryesore. E para, shteti do të marrë rolin që i takon. E dy…
 Është koha për ndryshim. Është koha për të larguar Edi Ramën. 
 Më 25 prill do të konfirmojmë se Shqipëria do të jetë demokraci, jo diktaturë. Fytyrat, sytë, shpirti dhe mendja juaj d…
 Domosdoshmëri unifikimi i qëndrimit mes Tiranës dhe Prishtinës në arenën ndërkombëtare për çdo çështje që lidhet me Kos…
 Gërrvërret prej palaçoje nuk e mbulojnë dot dështimin tënd dhe krizën ku i ke zhytur njerëzit. Pas çdo gërrvërri ti fsh…
 Sikur të ishin bërë realitet ato që thotë ky, Shqipëria nuk do të ishte në këtë gjendje sot. Por pas 7 vitesh premtimes…
 Përse shqiptarët humbasin vende të punës dhe Shqipëria nuk ka Investime Huaja sipas ?! Përgjigja është në grafikun…
 Çfarë e detyroi Edi Ramën të shkelë edhe premtimin kundër kumarit. Heshtja e tij për të dhënë shpjegime për këtë çështje…
Përpara 600 vjetësh kemi qenë shumë më përpara se sot 
Kënaqsi të (ri)dëgjosh Dr.Berisha dhe...100% dakord me tëëPD ëimirëishqiptarëve ëshkuar
Fitoret kanë përmasa të ndryshme por, edhe fitoret e vogla prapë duhen gëzuar 
 Sot kemi hedhur një hap përpara, për të mundësuar më shumë garanci për zgjedhje të lira dhe të ndershme në Shqipëri. …
 Shqiptarët meritojnë të dëgjohen me vëmendje. Me Entonin dhe familjen e tij të re në Tiranë, duke folur për problemet e për…
 .: Landfilli i Republikës së Shqipërisë,po finalizon grabitjen më të madhe në histori, koncesionin e rrugës…
 Askush dhe asgjë nuk e përdhos dot luftën çlirimtare të Kosovës dhe sakrificën sublime të familjes Haradinaj në altarin…
 Dorëheqja e kryeministrit Ramush Haradinaj është akti i një njeriu që ve Atdheun mbi gjithçka. Ramushi i ka shërbyer gj…
 Nesër me  në orën 20:00, bashkohemi të gjithë në Tiranë si njerëz të lirë me dinjitet,prindër, motra,vëllezër, të g…
 Të hënën  në ora 20:00, bashkohemi të gjithë në Tiranë kundër diktaturës së krimit, bashkohemi në mbrojtje të liris…
 Sot, është dita e Flamurit në Shtetet e Bashkuara. 242 vjet më parë, më 14 qershor 1777, Kongresi miratoi flamurin kom…
 . :Shqiptarët &amp; mbarë Europa është tronditur nga përgjimet e publikuara nga BILD.Gjykimi është i pashmangsh…
 . : Sot më shumë se kurrë, vendi ka nevojë për zgjidhje politike, e cila kalon përmes largimit të kryeminist…
 Të gjithë të bashkuar do ta ndryshojmë fatin e vendit tonë! Nuk do ta lëmë Shqipërinë në duart e një bande që ka marrë peng…
 Në Asamblenë Politike të Partisë Popullore Europiane në Bruksel pata nderin të takohem me Znj. Annegret Kramp-Karrenbau…
 Paskuqan  : Shqipëria nuk është një vend i varfër, por është një vend i vjedhur.Në  bashkohemi për t…
  :Ora e Shqipërisë europiane po troket,ora për të cilën shqiptarët kanë ëndërruar.Ora e bekuar e shpre…
 Kryetari  : Opozita e Bashkuar u prezantuar eurodeputetëve gjendjen kritike të demokracisë shqiptare, ku bas…
 3/  : Edi Rama ka premtuar stabilitet &amp; në emër të stabilitetit, ka shkatërruar demokracinë &amp; shtetin e të d…
 .: Beteja që kemi nisur për një Shqipëri si gjithë Europa është pa kthim! Kjo betejë përfundon me shporrjen…
 Konference per mediat  : 16 Shkurti ishte referendumi i shqiptarëve! Unë e mora mesazhin tuaj. Me anë të kës…
 Alternativa jonë për zhvillimin ekonomik të vendit e cila do të sjellë punësim dhe mirëqenie për qytetarët shqiptarë për të…
 Rama dhe Veliaj firmosën për të zhvendosur shtratin e Lanës dhe për të prishur shtëpitë e mbi 200 familjeve! Këtë e bën…
Tabaku: Ende nuk ka një ditë kujtesë për viktimat e komunizmit, edhe PD fajtore
Shpërthejnë skemat e mashtrimit në Shqipëri 
Ata që i bënë gjyqin e kafeve, i kërkojnë Rudinës, gjyqin e komunizmit 
Kur bijtë e vrasësve dhe vrasësit flasin për drejtësinë! 
“Rama rrahu në zyrë Niko Peleshin pak ditë më parë”  via 
 "Fatkeqësisht, fotot e diktatorit Enver Hoxha e njollosën ceremoninë e sotme në varrezat e dëshmorëve."
Këngëtari amerikan i kushton këngë futbollistëve të Shqipërisë 
Atë që s’bëri politika, në Bruksel e bëri gazetarja |  
 Kur dhe perse nje kryetar (apo nje kandidat per kryetar) eshte I lumtur per garen e ndershme?
===