"Çfarëdo që të bëhesh, së pari bëhu një njeri i mirë." — Abraham Lincoln 
Kush tha se të jesh i/e bukur do të thotë të kesh portret të bukur ? Ndonjëherë të jesh i/e bukur do të thotë të k… 
Gruaja ëndërron bashkëshort të përkryer, burri ëndërron bashkëshorte të përkryer, por të dy harrojnë se Zoti i ka k… 
SPAK nis punën/ Sekuestrohen hotele dhe automjete, ja grupi kriminal nën gjykim 
New York Times: Shqipja, ndër tri gjuhët më të vjetra në botë 
Askush nuk të hyp dot në kurriz, nëse ti nuk përkulesh!| Martin Luter King | 
Per te qare dhe per te qeshur ... 
Vuçiç e Zaev në Tiranë, priten nga kryeministri Edi Rama 
Çfarë është dhe çfarë nuk është liria?! - Shekulli 
“ Mashkulli nuk duhet të jetë Bletë që të Shkoj në çdo Lule,,,por gjithashtu dhe Femra nuk duhet t'jetë Lule që të… 
EMOCIONUESE/ Vajza me sindromën Down punësohet si stomatologe dhe dhuron rrogën e saj për të prekurit e tërmetit në… 
Gabimi i një doktori varroset në tokë. Gabimi i një arkitekti bie në tokë, kurse gabimi i një mësuesi ecën nëpër to… 
Rusia po rrit shpejtësinë e ndërhyrjes në Ballkan 
Dikush e pyeti njeriun më të pasur në botë, Bill Gates: “A ka njeri më të pasur se ju në botë?"Bill Gates u për… 
Anketa e madhe: Çka mendojnë shqiptarët në Kosovë e Shqipëri për njëri-tjetrin? Sa e përkrahin bashkimin kombëtar? 
Zbulime nga Vatikani, 5 shekuj është shkruar shqip 
Historania denoncon rolin negativ të Rusisë: Fajtore për TRAGJEDINË e ndarjes së shqiptarëve në 5 territore 
Shumica e atyre që na urrejnë, e bëjnë këtë jo sepse ju kemi dhënë shkas apo ju kemi bërë keq; na urrejnë shpesh e… 
Pasojat politike – Lëvizjet e para që po e trondisin Ballkanin e Shqipërinë 
“Kontrollojnë secilin prej nesh. Dirigjojnë historinë, tërheqin fijet, na i bëjnë trutë dhallë, na urdhërojnë të sh… 
Serbëve iu çjerrim maskën – Patrikana e Pejes është shqiptare 
"Njerëzit e një kombi janë solidarë. E mira dhe lumturia jote, janë dhe të miat. Fatkeqësia jote është dhe për mu… 
Njeriu i mirë është i gëzuar kur bën të tjerët të gëzuar.I ligu kur i bën ata të vuajnë!Ilir Kadia 
“Mos pandehni se me trimëri mund të bëjmë ndonjë punë të madhe. Trimëria e shqiptarëve nuk e shpëtoi dot as Nishin,… 
Burrat e fortë - ata burra që mund të bëhen model për të tjerët - nuk kanë nevojë të poshtërojnë gratë për t'u ndje… 
"Ju keni vjedhur fëmijërinë time", fjalimi DRITHËRUES i adoleshentes suedeze, si i 'GOZHDOI' liderët botërorë në OKB 
Tërmetet/ Apeli i Emergjencave Civile: Mos qëndroni në shtëpi sonte 
5-vjetori i vizitës së Papa Françeskut, Kisha Katolike thirrje për dialog politik: Shumë “shqiponja” e kanë lënë fo… 
Nëse vërtet në këtë Shqipërinë tonë te dashur kur e ngre zërin tënd dhe do drejtësi, mos shiko fjalët e pushtetarëv… 
Mirësjellja është një lloj elegance. Më e mira që unë njoh, e megjithatë ka njerëz që e ngatërrojnë me dobësinë. 
Shumica e njerëzve nuk të dëgjojnë për të të kuptuar, po dëgjojnë që të të kthejnë përgjigje.| Stephen R. Stephen… 
"Jepu gjithmonë njerëzve mundësinë, që të ta ndjejnë mungesën tuaj ..."| Liam Gallagher | 
Është paradoksale kur mendon që kemi të paktën nga një jurist për cdo shtepi, e megjithatë mbetemi vendi i padrejtë… 
Ka vetëm 8 klasë shkollë, kush është ministrja që ka trazuar Italinë 
Pas Alba Kokalarit, një tjetër shqiptare merr post të rëndësishën në Suedi, zgjidhet kryetare e komunës së dytë më… 
Vuçiç: Idetë e mia dështuan, nuk ka ndryshim kufijsh 
Dalin SMS-të e vajzës së vrarë nga babai: Mami më quan k*rvë… 
Rusia zyrtarisht ka pranuar kushtin ndërkombëtar që Kosova nuk do të bashkohet me Serbinë - firstchoienews 
Video DRAMATIKE/ Nëna qan e vajton për të bijën 25-vjeçare, iu mbyt në Holtë (KUJDES, përmbajtje sensitive) 
Wesley Clark: Baza e Rusisë në Nish mund të destabilizojë Ballkanin 
Studim/ Njerëzit më inteligjentë kanë lindur në shtator 
TGCOM: Shqipëria me plazhet si në Karaibe, perla e Mesdheut 
Divjakë, aty ku shalqini shartohet me kungull për t’u pjekur më shpejt 
===