 Koha të ndërtojmë ura për njerëzit, jo të bllokojmë rrugë. nisën sot punën për rikonstruksionin e urës së Bu…
 Rrugëtimi i Laboratorit të Inovacionit 2.0 bën ndalesën e fundit në . Gati per projektet fituese! 
 Gratë kërkojnë ndarje të drejtë të punës!   
 Thirrje Publike!Apliko si anëtar i rivlerësimit kalimtar të gjyqtarëve &amp; prokurorëve⌛Deadline 9 Shkurt  2017 …
 ë sendërtojmë socialdemokracinë për Shqipërinë e Gjeneratës tjetër Ëndrra e majtë vazhdon...  
 Në studion e "7pa5" në vigjiljen e ditëlindjes së  për të folur mbi ristrukturimin e forumit dhe Programin e Rinis…
 A ka më bukur kur të vijnë 300 Babagjyshë për vizitë?  Lali Eri 
 Back to university Në Shkodër për të diskutuar me studentet për Laboratorin e Inovacionit 2.0    ✒ h…
 LIVE në Ora News tek "Tonight Ilva Tare" për 'dhuratën' e Krishtlindjeve që do na sjellë Kushtetuesja, Vetting-un!  ht…
 Në “betejën” e ideve arma e vetme që pranohet është argumenti i arsyetuar dhe faktuar mirë.   …
 Luftoj për drejtësi,mundësi të barabarta &amp;  të drejtat e njeriut!***Laboratori Inovacionit 2.0 
 Nëse harxhon kohë duke  njerëzit, sdo kesh më kohë ti duash ato!   
 Gëzuar ditën e pavarësisë, çlirimit &amp; nëntorin e 4! Nëntor 2016 nisi rrugën pa kthim, realizimi i ëndrrës europiane të sh…
 Këto numra duhet të ishin të gabuara, por nuk janë!  ërndaje  "Unë zgjedh të jetoj pa dhunë"  …
 Strategjia Kombëtare për Barazi Gjinore '16-'20. “Unë zgjedh të jetoj pa dhunë”, apel kombëtar kundër dhunës ndaj gruas…
 Kolonja zgjodhi masivisht Dr. Ilia Stefo që të jetë në shërbim të njerëzve.  garanci për  e Kolon…
 Nëntori i katërt i Shqiptarëve :)Komisioni EU: REKOMANDIM POZITIV PER HAPJEN E NEGOCIATAVE✔ Shqipëria është e përgatit…
 Sot, ora 9-Vizion +  nga  diskutojmë zgjedhjet në USA, mundësitë e Ballkanit, raportet politike  …
 Nëse dhuron gjak je një  për dikë, diku që merr dhuraten e jetës!      h…
 I ftuar në Asamblenë e PS, nuk mund të mos e filloja fushatën duke lobuar për politikat rinore, sfidat e të rinjve... htt…
 Sot, shenjtërimi i Nënë Terezës. Në Vatikan, asgjë nuk është rastësi! 
 Çelet në Jalë Akademia Politike Verore me 500 të rinjtë e FRESSH | Gazeta Dita 
 Urime dhe gëzuar! Budapest,  28 anëtare të  për anëtarësimin e Kosovës! Një ditë historike për futbollin! 
 Në 23 ditë, 2600 aplikime nga Vermoshi në Konispol. Rinia per Shqipërinë Europiane .al  …
 Blushi në Asambenë e PS – Fjalimi i plotë  ( Lexo lajmin   )
 BE Në Kosovë drejt liberalizimit të vizave 
 Suksese vajzave të kombëtares shqiptare në 26 Janar kundër Greqisë. Jemi me ju :-)    
 Sot,në përvjetorin e vdekjes,e nderojmë me përulje.Lavdi Heroit Kombëtar,Gjergj Kastrioti Skënderbeu.  
 Sot pashë nga afër zonat më të prekura nga përmbytjet, si dhe bisedova me banorët.  janë në terren! 
 Na ishte njëherë lumi i Lanës ;) 
 Pune e paqme në Katund të Ri ku janë evakuuar 185 banorë. Vijon evakuimi, shpërndarja e ushqimeve dhe veshmbathje. 
 Këngë krishtlindjesh, verë të ngrohtë dhe shumë shumë argëtim. Dil nga shtëpia e bashkohu me festën.  
Nëse të mbajnë nga rroga 9,5% për sig shoq&amp; kjo nuk derdhet për hesap të sig shoq, po të vjedhin  
 Gëzuar 17 Nëntorin!  përkujton 71 vjetorin e çlirimit të Tiranës! 
Gëzuar Bajramin miq! Paqe dhe begati në familjet tuaja!
 E kënaqur nga takimi me atasheun ushtarak kanadez kolonel ,në kuadër forcimit të b/punimit me NATO 
 TESTI I DROGES…Sot lexova në gazetën “RD” të partisë më të madhe të opozitës se “dekriminalizimi” do të ketë... 
Koha që të rinjtë shpenzojnë në net është rritur, megjithëse 15% ende nuk kanë akses. Studimit Rinia Shqiptare 2014 
Besoj në zhvillimin progesiv &amp; evolutiv të çdo qënie njërëzore nën parimin e lirisë barazisë &amp; solidaritetit  
 Parku i lojrave, Panairi i Produkteve vendase, ekspozitë fotografie dhe vizita në muzeun e Pezës!  14-15-16 
Dream Team ;)Çadra e FRESSH është  
Në Këshillin e ri Bashkiak të Tiranës janë mbi 50% nëna dhe vajza :)    
 Përse është e rëndësishme që të rinjtë të votojnë. 
 Dream Team ;-) “: Sfida për Tiranën filloi...Skuadra UNI FRESSH është gati  :) 
Në Shqipërinë solidare, hija e lëkurës nuk është pengesë për sukses   
Dita e Ndërgjegjësimit për Autizmin është më shumë se krijimi i mirëkuptimit; është thirrje për veprim  
 Qeveria miraton Ligjin e Ri për Arsimin e Lartë! Koha e universiteteve që bëjnë sikur japin mësim ka marrë fund.
"Një Tokë, Një Popull, Një Ëndërr" mbledhja e përbashkët e Qeverisë së Shqipërisë dhe asaj të Kosovës.   
Dëgjesa publike mbi reformën e Arsimit të Lartë me   ës_tjetër 
Gëzuar ditën e verës ;)  
Together for equality!  Bashkë për barazi!   
"Arsimi është arma më e fuqishme për të ndryshuar botën" Nelson Mandela  
 SHËNIM: Shqiptarët janë popull i mirë  via 
Gëzuar pavarësinë e 7-të, Kosovë!  
 Mjaft më, i menaxhojmë vetë “punët” tona! 
===