 (1/2) "Nëse jeni të përfshirë në korrupsion - pavarësisht sa të fuqishëm mendoni se jeni - tani është koha për të pesh…
 Sot, ne festojmë ditëlindjen e 245-të të Shteteve të Bashkuara, ditë e cila përkujton miratimin e Deklaratës së Pavarë…
  Yuri Kim: "Në përputhje me rolin e tyre kushtetues në procesin e vetingut, vëzhguesit ndërkombëtarë dje…
 Të gjithë duhet të ndjekim nga afër se çfarë do ndodhë më pas. Përgjigjja do të jetë shfaqje guximi &amp; integriteti në d…
 A do t'i shërbejnë mediat publikut dhe do ta raportojnë këtë çështje me integritet, apo do të marrin telefonata dhe do…
 “Historia u shkruajt: urime  për zgjedhjen për herë të parë në histori në Këshillin e Sigurisë së OKB.  mirëpresin…
 "Ne mbështesim hapjen e negociatave të pranimit në BE për Maqedoninë e Veriut &amp; Shqipërinë pa vonesë. Ne jemi të angaz…
 Ejani në Ditën e Hapur në Tiranë nesër. Aktiviteti është i hapur për publikun &amp; do të përfshjë ushtarë &amp; të cilët…
Gëzuar Pashkën Ortodokse nga të gjithë ne në Ambasadën e SHBA në Tiranë! Ju urojmë shpresë në këto ditë të bukura p… 
 Cënimi i votës së çdo kandidati do të ketë si pasojë sanksion penal deri në 7 vite burgim, për këdo nga numëruesit apo kom…
 2/2 Nuk ka asnjë justifikim ndërprerja e procesit për shkak të mungesës së numëruesve. Numëruesit dhe/ose komisionerët e lo…
 1/3 Ju bën thirrje subjekteve zgjedhore, që procesin në vijim ta përcjellin me qetësi pasi askush nuk e di se kush i ka fit…
 (2/2) ...Kandidatët &amp; udhëheqësit gjithashtu, kanë detyrën e tyre: të mos supozojnë rezultatet por të pranojnë vullnet…
 "Votuesit në  morën pjesë në numër të lartë për të shprehur vullnetin e tyre. Autoritetet zgjedhore &amp; ligjzbatuese k…
 (2/2) ...Mesazhi i SHBA: Ata që shkelin ligjin dhe pengojnë të drejtën e qytetarëve për të votuar lirisht dhe në paqe…
 "Lajm i mirë: Pres me kënaqësi për t'i uruar mirëseardhjen disa gjeneralëve nëjavën e parë të Majit si pjesë e …
 (2/2) "Institucionet e reja gjyqësore si Këshilli i Lartë i Prokurorisë - ku  &amp; të tjerë kanë investuar shumë - duhe…
 "Ky është një moment i rëndësishëm për Reformën në Drejtësi - e cila ka përparuar mjaftueshëm për të trembur kundërsht…
Nga Qëndrimi i Komunitetit Mysliman: “Ju kujtojmë gjithë qytetarëve  se, shitja apo blerja e votës, veç të tjerav… 
 (3/3) ...Kjo është ajo për të cilën kemi interes". Lexoni tekstin e plotë të intervistës së Ambasadores së SHBA Yuri K…
 (2/3) ...rëndësinë kritike që ka që të sigurohemi që rregullat dhe proceset janë të ndershme, janë transparente, që fu…
 (1/3) "A kemi një kandidat të preferuar? Jo, nuk kemi. Nuk është ky pozicioni i Shteteve të Bashkuara. Ajo për të cilë…
 Dje, një grup shqiptarësh nisën të hedhin hapat e tyre të fundit drejt shndërrimit në hetues të Byrosë Kombëtare të He…
 "Krenare që mirëprita ushtarët  në ndërsa përgatitemi për stërvitjen më të madhe ushtarake shumëpalëshe të udhëheq…
 Ambasada e Shteteve të Bashkuara të Amerikës dëshiron t’i përçojë ngushëllimet e sinqerta familjes, miqve dhe kolegëve…
 ësit të përfshihen aktivisht në raportimin dhe denoncimin e rasteve korruptive të shitblerjes së votës dhe financimi…
  janë për qytetarët, ndaj promovoni dhe debatoni çështje politike pa përdorur gjuhë të ashpër, gjuhë diskriminues…
===