  A mund të publikohet marrëveshja e plotë? Në formën e një dokumenti zyrtar.
 Shqiponja e flamurit tonë nuk është ashtu.
  Italia humbi një ikonë të botës së spektaklit. E saja merita sepse diti të gdhendë historinë e televizionit italian. Pus…
Ehh "Në Mundsh..."Interpretim i jashtëzakonshëm i të madhit Reshat Arbana. (Vetëm disa pjesë nga interpretimi i t… 
 Nëse kjo do të ishte e vërtetë vetëm një axhendë e zgjeruar kuturore dhe nxitëse për tolerancën fetare… 
 Rezultatet e votimit në Asamblenë e Përgjithshme treguan se Shqipëria gëzon një reputacion pozitiv dhe konsiderohet nga…
 Dridhen malet jo nuk tunden kullatNë log të burrnisë po maten burratPo i këndon Drini kangtë e vetaKanë lind shqipet nëpë…
Kanë qenë të cilësisë së lartë dhe shumë të bukura. Dhe Gjoni nëse do të prezantonte Shqipërinë s'do të ishte kaq f… 
Kjo është e keqja e vendit tonë, shumë të mirë s'do të gjejnë dot rrugën në këtë "çorbën" që është gatuar ndër vite… 
Kolona muzikore e filmit shqiptar "Në çdo stinë" një nga më të bukurat❤One of the best albanian music movie!
 Nga Qëndrimi i Komunitetit Mysliman: “Ju kujtojmë gjithë qytetarëve  se, shitja apo blerja e votës, veç të tjerave, ësh…
"Modestia nuk do të thotë që je budalla, por ajo është një virtyt që  budallenjë nuk e kuptojnë!"Shumë e ndiej këtë shprehjen.
Gëzuar Bajramin! Urojmë të marrim dhe reflektojmë mirësi!
Nuk e di kush ka vrarë më shumë persona, Covid-19 apo njeriu njeriun gjatë kësaj periudhe në Shqipëri.Është e frik… 
"Klientët ta shohin përballë njëri tjetrin nga një distancë prej të paktën 2 metra"   2 zgjidhje ka: a)tavolinat m… 
Mendoj se ia vlen të ngrihesh çdo ditë herët, për të shijuar këtë pamje dhe të presësh lindjen e diellit 
 Te gjitha Dhe atë biskremin që na e blinin sa herë sëmureshim, atëhere dmth kur nuk doje të haje asgjë
 “Nuk kam nevojë që të jem komuniste për ta dashur vendin tim! Unë e dua vendin tim edhe pse nuk jam komuniste. Unë e dua…
Sa mendje fëmije pz. I duket sikur po bën kryeveprën e shek.21 dhe po e filmon që ta marri vesh dhe bota.Edhe kjo… 
Fëmijëria është periudha më e bukur dhe më delikate e jetës së njeriut! Është momenti ku gëzojmë, mësojmë, por dhe… 
Koha është me të vërtetë e vyer! 
Epo të gjithë duhet ta respektojmë njëri-tjetrin pavarësisht nëse e kemi apo jo një besim. Nëse përkrahim një grup… 
 "Tek prisnim të piqeshin kushtet, na u kalbën dëshirat" – Faik Konica
 A ka Kuvendi ende burra e gra me shtyllë kurrizore etike? Këtë po pres të mesoj sot.
 Lavdi Deshmoreve te AtdheutGëzuar 29 Nëntorin, Ditën e Çlirimit të Shqipërisë. Nderim e përulje për të gjithë ata djem…
 17 nentor 1944Sa herë ka rënë aq herë është ngritur ky qytet 
 "Besa Besë" në Plzen. Qyteti çek po frymon shqip para ndeshjes Republika e Çekisë - Kosova  …
===