 Jeni zemërmirë ju Gëbels!
 Bravo more lider global, pos si nuk gjete kohë të reagosh për deklaratat e miqve të ty serbë të Ballkani… 
 Hahahah përpiqu bashkë me Fugën më mirë për t'ju hedhur hi syve shqiptarëve. Duket se të bezdisin protes… 
 Nuk të ecën kjo retorikë e pështirë. Në shesh dalim për arsye jetike, nuk na plas për nongratat e tu. Po… 
 Fakti që Serbia nuk ka vënë sanksione ndaj Rusisë tregon shumë dhe tregu shqiptar është i hapur ndaj saj… 
 Më pëlqen që në fillim nxjerr media që ke në vartësinë e Fugës me lajmin, pastaj del vetë. Sigurisht nuk… 
Çfarë do bëjë Carlo i shkretë pas 25 prillit. 
   më pëlqen pena juaj.
 Po pra, në një qytet pa ujë të pijshëm dhe me beton.
 Nuk ka shembull më të mirë arrogance dhe deliri personal nga ty se sa kjo gjobë që u është vënë shqiptar… 
Bravo  me  që një pordhë tymuese bën dhe Carlo Bollino e Mero Baze e shpërndajnë d… 
Sot  bëri një pordhë, 15 medie në vend e raportuan me pathos dhe rigorozitet këtë ngjarje!
  Po nuk bën vetëm Fuga montazhe, se siç duket s'të pëlqen aspak kur sheh harbutërinë tënde!
Në këtë fushatë i vetmi që do i mbajë premtimet do të jetë krimi.
  Po pse nuk e ke zbatuar para 3 vitësh këtë gjë?! Apo të duhet tani për projektin Fusha sh.p.k?
Ore të vijnë të gjitha vanksinat me mpiksje gjaku, me efekte anësore të rënda, qoftë edhe me vdekje, vetëm ajo me çip mos të vijë!
Bashkë me këmbimin e monedhave të huaja në lek, duhet futur edhe këmbimi i analistëve, për të parë si ngrihet apo u… 
 E gjitha falë Rlindjes!
 Më je përgjigjur si Veliaj, jo se çuditem. Unë nuk përdor njeri se kam qenë në sheh si qytetar i ndërgj… 
 Nësë të vjen policia pa shkresë ligjore, quhet shkelje e ligjit. Edhe nëse nuk ka kontratë, pse nuk u b… 
 Më pëlqen kjo ndjeshmëria juaj për këtë dhunë, por nuk ju pash të bënit të njëjtën gjë kur ndodhi shemb… 
 Respekte edhe ju për mbiemrin, por e keni parë që policia ka ardhur me një shkresë pa vulë dhe firmë? A… 
 Pse nuk fton Veliajn në studio sikurse e ke zakon, që të flasë për këtë dhunë kaq të madhe ndaj policis… 
Kam përshtyjen se Mero Baze dhe Carlo Bollino e duan Ramën e Veliajn më se gratë e këtyre të fundit!
 Mero shqetësohet për policin si i rrahur vetë besoj, jo si parimor i madh!
Mund të qahemi për shumëçka, por vetëm për mungesë spektakli grotesk politik jo!
 As Unë nuk jam kaq gënjeshtar i mirë mor bir!
 Jeni në një version trial.
 Ose do zbrisni në Ferr.
 Do t'ua tregoj unë juve të dy po hë, vazhdoni cic-micet! Do t'ju tredh.
===