 dmth bashk me ty
 Ani un maj shpresa mi taku my tw friends a hala qeto t kumanoves qe I kam njoftu ktu si kam taku
 si esht te kesh vlla/moter me te vogel ?
 A o najkush qe tdon pa interes bre?
 Mercedesi nuk ndrrohet me asni kerr tjeter .
 E ti kur je keq , thirrem fol me mu
 Me kon qe ka rendsi pamja e jashtme, Allahu na kish marrr trupin jo shpirtin!!! ‍♂️
 Ore do me bej ndonjeri share ktu mua te m rriten cik fllw po ju desh qefi🥺
 kur te thote mami nuk do dalesh nderkohe qe ti u ke thene te gjitheve se do vish🥴
 Hin njeri ne twitter, sdin ka me ja majt prej kllosharve.
 Kur te plq aq shume nje pale atlete dhe do ti blesh po nuk ka nr tend..:(
 Me pas ni shok/shoqe si veten &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;
 Un skam moter edhe qdo dit ka me qit qaj , a ato qe kan motra bile e kan ni dit njana ni dit njana.
 Me pas vllavin ma tmadh e me tnal per qdo sen , shum keq o
 N’GRUPE NUK QOHET SNAPN’GRUPE NUK QOHET SNAPN’GRUPE NUK QOHET SNAPN’GRUPE NUK QOHET SNAPN’GRUPE NUK QOHET SNAP
 Dikush dje,dikush sot,dikush neser qeshtu krejt kadal kadal po u largojshin.
Kur genjen, vetes sa i beson?
Mbylli syt, veten nga brenda shihe!Hiq dore nga cmendurit qe ben bota! Njihe shpirtin tend!Behu vetja! Vec ashtu s'do te lendohesh!
 Hahahahahaahahahah urime edhe ty
 Na lodhen kto mysafirt, hajr paq edhe ty per hajr
 Mos na kall kshtu be sa i pa shpirt
 Hahhahaahhaaahaha omg edhe ajo zemraaaa aa ufff
   ti vje bashk me mu aty mrena
   Mo se na tuti HAHAHAHAHAHAHHAHAA
 kjo tbon tkeq ty
 tkujtova qe je njeri mir beee nanennn
 gezoheem nese je ndryshe
 ti duhet me dit mamir
 paska edhe ksi djem a
   Ta kallxoj qytekin un
   Ajde apom del HAHAHAHAHAHAHAHAA
  ki pun me ta ki edhe me mu.
  cfar problemi ki ME twinin tem
 hahahahahahaahahaha loveee u tooooo 
 po dokesh nejse hiq mos ta nin se arta krejtve deshirat jav plotson hahahahahahaahahahahahahahahaha
 prej xhelozis me pa ku o me kan o cka ban hahahahahahahahahahaha
 si njeri HAHAHAHAHAHAHAHAA (MENEMADH JE TEPER)
 menyra se si flet
 ju vet e tregoni ate pa deshmi 
 shum falemindderit kjo shkon te shoku im me imgusht sepse ai tha se ska kshtu xheloze si un TNJEJTA JENA
 isha tu menu per qet sen se dej tash sdul naj njo qe osht shum xhelozeee
 dmth paska edhe si un haahahahahahah
 sbesoj qe egziston njeri ma xheloze se un 
 teper valla pe sho shum blok tpaskan bo
 HAHAHAHAHAHAHHAHAA ti qfar je?
 Syt naj KNAQ veq kjo maca 
===