 Welcome to NBA Lane.  
 man it's been a tiring day edhe deshta me ju thone "Naten e Mire". shpresoj me ju pelqy &lt;3
  kjo qe kapet per der nese shkon ma shpejt se 30kmh
  ooooo o o oo ooooo oooooo
 e paske msu 1 fjal a
 2 E "zemra zez"
 urime locko edhe plot tjera &lt;3
  omg, she do be kryppin
 fuck no sen ska ndodh?
 un nuk jam, ama muj me tndihmu me anglishten
 2 bir, e ki qef violinen
 ma mir se t'shkojsh ta vizatojsh 1 smile nleter 
shum e du ket njeri 
  mir be bir leji tknaqen pak tbojn qef
 NO SHIT SHERLOCK TAG IT
  sleni 2 min njerin me lujt
 biro shum amater je
    na falni per vonesen sot, na dul shum pune me nana e u dasht dej n21:00 me zgjat
 mentori po thot da vinki?
  jo be se ka 1 i pi
  ey, pse ty tvlen ajo sdomethon qe edhe te tjert o njejt stfu
 HAHAHAHA, bro noizy as nmuhabet su kon fuck outta here
  kesh tu ta bo 1 dishwasher me calendar tu e mark po im done
 ti definitivisht ki probleme me tag
 e kaluara mbetet ne te kaluaren
  au cfar paragjykime bon 🧼🧼
  mu sma rraskan phe
  kjo edhe ylli... mos vet
  menzi ka prit :p
 do rikthehet se shpejti
   qeky bumi nfund pom lun krejt
   epo shti duhesh tkesish kujdes se ka dikush pernime e rezervon... jo qe rezervova un po vec po tham apodi
   qysh e thojka menxi paska prit
   got it vec nji cingrr edhe u nisem
  kjo eshte fake news
   sdi dikush tha take me there parzit 🧐
 e harrove 1 presje nfund...
   jo be pare jo ama kam qef vleres tja plotsoj deshiren
   ajde prej meje ket her 
 shuj mes vet edhe ka pe mendoj ska cokollada tpersonalizume me ftyr temen kurkun 🧐
  qy omg un as su livdova as sen tqita, shti e fshi
 shka ka ajo cokollad nta naj dhom tallanit a 
 jepja blertes tma bjere pls
 skena nevoj per rekllama tajfon nimdhecit faleminers
  urgjentisht me qit vleren nsiti se ka hy nkriz shum fell
 mos mshordho moter me ket bajram i ki bo nja 4000 euro qu blema 1 kerr
 sje mir ti pasha Zotin HAHAHAHAHAHAHAHA
    aahahahhahhahahahahahah naten e keni prej meje ❤️❤️❤️❤️
  bruh kam do raste me ti kallxu kur vje dita
    kam fol un me cukerbergin mos e keni gajle
===