 pasna harru mem fal
 po per fat te keq
Anglia pos range rover-it sen t'leshit te hajrit ska
 kjo so gjo, paramendo irani naj ka morr ciftelin edhe serbia lahuten edhe i kan fute si instrumente te… 
 A nuk osht kalaja e Rozafes qikjo histori?
Messi ka fitu kup, fllad po sdi çka kerkoni ju ma shum nga jeta🤣
Un me futbollin dhe fushat e blerta pershendetem prej sonte
 i bike qe e ki morr vendimin ma te mire ne jet
  hahahahahahahahahahahahaha diqaaa ja çiva ropt
  mu ni makiato tvogel pa shkum.
  Hahahahahaha mire se vjen, ça je per me pi?
 Urime Arbnora shum suksese ne te ardhmen, dhashte Zoti te punsohesh sa ma shpejt
 Oktapodi me tentakulat e tij
Po bohen propozimet e marteses naper matura si kurxha hiq, a une qeto vjet i bona hala tdu si thash kerkujt.
Paskan nise me ardh shqipet ne fole
 e killet qysh mi hjek se buken e kam hjek🤣🤣🤣🤣🤣🤣🤣
Ni za nga Medvegja po më thrret o vlla,oborret e t'parve na ka marr malli me i pa,mali edhe fusha paskan mbet te… 
Çdo perpjetze e ka nga ni te naltze
 6rdit - Naten Vone ( vissvissy)  via 
Nga e hena fillojm prej zyres shyqyr Zotit.
Ju lutem mbani gjakrat te ftohur
 More kish ndej ton naten ne klim u cu ne mengjes shok edhe kish ra e kish thy shpatllen edhe kllavikulen
 Bojani kolega ne majsh mend qeshtu e kish hanger kepen
 U bej apel moshave te shtyera te mos dalin jashte ne keto temperatura, ndaqit me shtye edhe pak….
 hahahahahah sqyra fitim prurese
Fotot ma tmira i kam bo nqet pasqyr 
Une, dunda, prazi, pucki, saçi edhe rrusta veq thuje diten caktoje daten 
O Ramiz ndali maqinat se po kendojme
 6rdit - Jeta  via 
 6rdit - Prom  via 
Na plasi karikusi me ket mot londinez
Cfar nxeti tropikal, mos ju paca borxh
 6rdit - Naten Vone ( vissvissy)  via  1K❤❤❤❤❤❤
Masi pi nij kongt e Shyhretes ne oborr mund ta shpallim sezonin e darsmave te hapur
 telexi o prej shkupi, bohemet, foleja,yjet jane prej kumanove..
 Nuk ka lidhje ku o fundi, mjafton sa jem mir mu kon 
Per nje çast me ndali zemra ishe ti 
Kur ti qeroje kivit garant ja bon:mfal zemer se jam tu i depilu ca kivi 
 paska gufu tezja si mi pas qit kfasac
 6rdit - Naten Vone ( vissvissy)  via 
Un po nenshkruj me  
 sidomos per tre shifroret
btw edhe un jam Geg :p
Kafja e mengjesit sot me Arditin
Rash me motin tropikal u cova me motin londinez, sidoqofte shkojm me kafen e mengjesit
hahahhahah moti skam ni ksi kryevepre
 kardiologu ma i mire ne maqedoni, a blero ne bote
Blero &gt; Zan Mitrev 
 Zgjidhje kreative o mbret
hahahahahahaha nale doren o Ramiz se ja u morre buken Stupcave 
Njerzt sinqerisht sjan normal 
 Ka allti te posacme per me shpu hunden qe dallon me at qe e shpon veshin, nqfs e bon me at qe e shpon veshin dhemb shum.
 - shitja e drogave te lira
Terr para syve Kaltrina Selimi
Sa i lumtur jam qe kapitullimi i Serbise u nenshkrua ne qytetin tim ne Kumanove, urime Kosove datat e çlirimit.
 provoje me 1000 den
 bone public le ta shofin tjert ket kryeveper
A paska godit Dada Elvan pak mdoket
 luje nbastore italija me fitu besoj ma kfote tmire
Sa mu bo qefi qe hupi Turkia
Sa e kam nem Shkelzen Gashin qudi qe o xhall 
 Ska kombtare pa kumanovar
Cysh kesh Trakla melaqet pi shpije ti perze
Pa e pas diten mshtellim sum doket interesant
Jakup Ferri mor ku je.. 
Shum kalori kam djeg, e meriton robi tash me flirtu me frigoriferin
Ja paska nxhit Glaukit smujen e vet Basha
 po na pushtojka moti londinez
 shum durt e ronda ju
kam ardh me gjet fiatin e jetes jo fiat panda hahahahahhahahahahahahahhahahahaha
 te portokallia ka qen ni pjese e humorit, edhe patna kesh edhe patna kajt..
6rdit - Ndjenja  via 
 po hajde bre hajde
 na ka mbet do bakllav
 Krejt kajmak koka, ani qysh shkon me cigare kjo
 Nese sosht kuki i saj sdu kuki hiq
Edhe doza e dyt sot, perhajr na koft ky muhabet 
Zoni ma i omel i veriut
 po ama buzt e mia sjan per aq ni vere te shtrenjt
Vena sa ma e vjeter ma e mire 
 o valla edhe uj me pi po trashna hahaha, btw tboft mire
 mo bre se sa ushtrova...
Ferizaji mir koka sonte
 hahahahahhha e qe jeni pi nkry krejt
Ishalla i bje kanceri nqafen e mitres
 E kam emrin me te bukur ne bote Alban
hahahahahahaha mem fal ariana grande po shum kam kesh 
 I nderum shume mire e paske shtjellu, fatkeqsisht kshtu osht
 besoj qe je e shkupit edhe e din kishen qe osht ne shesh, askush prej shokve perveq meje spike te uj te ceshmja e kishes hahahahah
Dita kunder duhanit shenohet me pirjen e duhanit hahahhahahahahahhaha
Pe shof qe dita mbrapsht hala kafen e mengjesit se kam pi
kumedit sa keq me kan kur ta ngoj ket kong bohna mire
Zoja Pali - Moj Shqipni te qofsha fale  via 
 bash qetu dashta me dal
 arsyja pse po shkrihet greenland
 po presim masdite me ndrru
 po njeri mdulen llafet e tua
 po njeri mdulen llafet e tua
Rrespekte per lagjen gavran ne Gjilan, boco ma mire se ne debar maalo nejat po u bojshin
Mbram paska pas shfaqje ne teater te Kumanoves se paskam dit ama sot koka repriza, keshtu qe krejt me ardh mi pa ak… 
hahahahahahahahhahahahahaha ja qr e boni simit pogaç 
Pse kush o ka maron burek ndite sodit oj zane e skandinavise? 
A thu a bijm ndashni me personin apo me kohen e mire qe kalojm me at person?! 
Shum kreativ po jam ama spo ma kutpojn humorin
cdo fjale e tij osht ni yll ne galaktike
Ku je oj e premte e te hanksha
Hajde me flet krejt se kem mu cu heret neser me pi duhan
  se paskam ngu nojher ama edhe ky koka verzion i mire
 Veq kujtoje qe je tu jetu ne maqedoni edhe ste merr xhumi pa problem, po tfoli pi pervojes.
at least pi terim teshat me ni dill 
Hahahaahahahahahahahahah o allah falmi gjynahet se shum kam kesh 
Ja paska shti flaken Albina Kelmendi sonte, o Zot çfar zoni i knoft zemra.
Me dal me kall ni duhan se mu ka nxe shum procesori
 e di tkutpoj plotesisht, ndjehesh si goku super sajan
 Mandej ski nevoj mu lodh per vota me bo fushate, veq i blen vezhgust edhe e shef veten keshilltar🤣
 kur je e uritur sje vetvetja
 un kisha thon ep nihere
Neser koka fest dmth neser osht ma e dill se e dillja
Situata gjendje e jazhtzakonshme 
 pom qudit ket llaf si me pas thon un🤣
Nga moti londinez shum shpejt ne motin tropikal
Le ta dine shteti ku po jetojm se mesnesh paq ska ma
Vllaznit tone po punojn ne Malte, bravo trima ju lumshin komt
Po shifet nstory qe krejt pasni dal
Mir fillova po keq mbarova
Per ne pune jo ama per ne fakulltet po 
Sonte kafja e mengjesit me dy trima qe kan ardh prej dojshlandi
  mirri edhe 5 malboro
 ooo hajde e dhezim ka njo mas xhumos
Na myti ki moti londinez
Mirmengjesi shpirta te kompleksum
 mfal amo kjo lutja duhet mu kan pergjithmon, amin.
 as kafen sum pate lan me pi direkt me shku me lujt hahahahahahahh
Ikni se jam tu e mush
 Sa mire, se sen ska bo ne maqedoni. Gjithmone ka qene pro pozites bile u quditsha pse nuk pe shtin ne list per deputet.
Jo tarzani po jarani
  ktu kur jam kan i ri ne split njeri hahahahha
 ariani so nfoto po o nzemrat tona
Kete foto ma çun para do ditve, i lusim te gjithe te pranishmit nqfs kan foto ktyne dy djemve me naj çu 
Per shkaqe te migrimit shocnise teme ne dojshland kafja mengjesit pihet nshpi
Kismet mos po dalim me pi kafen e mengjesit
 Boll inati pom vjen me ta bo llajk po cashtu o
 ani barem vlejm dicka, kam mundsi me shit krahin per heker te manta
Sot Kumanova asni rast pozitiv, nisjani more konges " shkojshin e thojshin kumanova sban"
Ngacmime seksuale apo perdhunime per fat te keq ka me pas gjithmon, por mendoj denimi me vdekje i zgjidh kto pun pe… 
Kush o vlla n`ket vakt qe thirr ntelefon?!
 ktheheshin te lumtura ne shtepi sa her qe ktheheshin nga mali 
 Kallzom naj shpi apo banese qe shitet ngat ty, e pim kafen e mengjesit bashk
Struga me liqen, universitet, klub ne gara kombtare boll arsye me jetu ne struge
Mos jetoni per story se marut
Rrespekte Anila qe keni dal bravo, veq se kisha pas deshire me bo protesta edhe padrejtesite qe na bohen neve ne ke… 
Si te xhyshja per dark te bajramit 
 O shoc kadal ti me kto fjale se kjo osht bashkqytetarja jeme
 Gjith me masa mbrojtes e maska 
   ska foto qe e pershkrun ma mire hahahahahahah
Sonte derbi man.utd - liverpool qe nenkupton ndeshje e fort, ndeshje e fort dmth golla fort apo thene ndryshe gg1.
Ndrroni fotot e profilit a qitni poste t'ju baj llajk se e kam lshu doren sot
Mos um lutni me hanger se sum vjen marre po sjam ka muj
Shero nuk nuk po muj mo, a e kallim ka ni cigare?
Urime festa e Fiter Bajramit p.s dita me e bukur ne bote Alban 
Ta dini per neser, mos thoni se ditem 
Un e bitisa bakllaven do hanez e qitkan nstory
 Momentalisht 3 raste me palm angels n'Prive
Çka osht more ky mot londinez qe na ka kaplu
 ne vetull ose ?
 jo bre se krejt jemi ama qaty jane kane krejt nder pluma sen sthojn
Fillimin pe kom tmir a perfundimin katastrof
Un neser tu e qit frigoriferin ntavoline 
Kqyre çfar logjike ki oj amebe ni qelizore. Ta baj ni paralele maqedonia osht e mire e sipas teje veq pse ja u ka q… 
 na perveq se juve sen tjeter sjem ka lypim
edhe sun flej pi nervozes
 Ca me bo tregu osht kaq te na
1 ore e cova posht edhe smunjta me ndreq ta marr sakicen ta baj copa
Tu e kqyr dua te te bej te lumtur 
 kam postu njeri po as komentojke kush as sen
 per kategorin e kurrizorve po foli un hahahahahah
 Urime e paske hjek gajlen
Emrin tond ja u kam msue zogjve, te gjith zogjt emrin ta din 
 Faleminderit shum per kto info
 comi linkat ose emrat sit dush
sa e di ska crosffit ne Kumanove?
Po u qelkan gym-at ama sjam tu shku, ama me u bo me u qel naj crossfit i pari jam aty.
Shume situaten gjendje e pasna ama vazhdojm skem ca me bo
Shum horny koka twitteri sonte
Edhe me knu ajo kongen urlla urlla 
A ra qajo raket mo, se jam ka du me flejt sen po pris..
Maqedonia koka ne kufi te zones kritike me ra raketa kineze, kshtu qe pa panik njerz
Sot moti koka e disponimi me honger ni iftar ne Gjilan
Shume dite dinamike koka sot
 Cka me fol bre mo, vendime tpunes sun po jap kshtu qe fjala spo ka vler.
Ktu ste lajn as me vdek e leje mo me flet
 Fatkeqsisht kemi mbet si e dita e merkure, as andej as ketej.
 cfar gabimi paskam bo, faleminderit
 un besoj nfund te mujit qelen prap
 jo bre pse demotivon veten kshtu
Sonte paskemi dal krejt me kry te drejten kushtetuese mu infektu
Mi djeg do kalori per mi morr do kalori
Ketu tek ne gjithcka osht "javna tajna"
Per qeto dite kem liftu o spec 
Çfare dite e mire me ik prej Maqedonise
Ne vend qe te bie nga pesha rash nga shkallet
Koka tu mbizotru ni nxeht tropikal, sinoptikanet po apelojne qe njerzt me numer treshiftor tkilleve mos me livrit deri ora 8
 e kish harru dikush plloçen lshut n'tresh
  ma shpejt sa su bo gjendje e jashtzakonshme
 kismet po presim lajm nga 
 nuk je e vetmja
  hajde ishalla king tshofim me naj klub tfort sa ma shpejt
 un sonte pak ndrrim, speca me xhiz hahahahahahahahahahahahahahhahahahahahhahahahahahah
 po sidoqoft na Kumanova gjithmone pe psojm
===