VALLË, A U SHKRUMBUA EDHE NJERZILLËKU?! 
Bashkim Aliu Tema: Si te perkujdesemi ndaj pleqve- 1 tetori dita e pleqve  via 
''Pas mengjesit ne Koha" - Bashkim Aliu  via 
emisioni Pas mengjesit ne Tv Koha-Tetove
Persiatje rreth kuptimit te drejte te jetes profetike  via  Press
Vazhdojne punimet e asamblese se pergjithshme te Unionit Boteror te Dijetareve Muslimane, asambleja u organizua nen… 
Qendrimi islam ndaj punes se femijeve  
Opinion: Kurorat e qendisura me gjuhen e urrejtjed
Ligjerate:Si te jemi pas Ramazani
libri im me i ri "Momente dhe qendrime" 
parada e turpit.....po ne Kosove nuk diskriminohet komuniteti LGTB, por diskriminohen femrat qe kerkojne shkollim m… 
Per hajer festa e Fitrit, e lus Allahun te na pranon adhurimet, te na jep te mira ne te dy boterat. lutem per velle… 
nata e kadrit-nata e dijes dhe drites
tv koha, botimi i librit mesazhe haxhi 
u botua libri im me i ri "Mesazhe Haxhi"Nje falenderim i vecante per donatoret e librit. 
pamje nga falja e namazit te Fiter Bajramit nga xhemati i Xhamise se Wetzikonit 
Pas mengjesit ne Koha - BASHKIM ALIU - Teolog
ne studion e televizionit koha-Tetove, duke u pergatitur per emisionin "Pas mengjesit" 
Vizite e Feti MehdiutSot patem nderin qe ta kemi per vizite ne Xhamine e Wetzikonit profesorin Feti Mehdiun. 
Me rastin e 8 vjetorit te pavaresise se Kosoves, Xhamia e Wetzikonit organizon mbremje islame me 13 Shkurt, 
Libri im me i ri, i botuar ne muajin ShkurtRoli i xhamise ne mbrojtjen e identitetit fetar dhe kombetar ne perendim 
Mbreme ne xhamine e Regensdorfit(zh) pas tribunes me vellezerit ligjerues nga Maqedonia 
Pas darkes se perbashket ne Xhamine e Wetzikonit me rastin e festes se 28 Nentorit 
Sot mbajtem tribune ne Xhamine e Wetzikonit ku ligjeroi hoxha i nderuar nga Shkodra Bashkim Bajraktari. 
Sot mbajtem tribune ne Xhamine e Wetzikonit ku ligjeroi hoxha i nderuar nga Shkodra Bashkim Bajraktari. 
Lapsat dhe letrat ne nje klub shqiptaresh ne Zvicer. A e dini per cka? Jo per shkence, por per te luaj Gure 
Shperndarja e kurbanave nga Xhamia e Wetzikonit per banoret e demtuar nga vershimet ne Shipkovice 
Tv Koha-Tetove e mbuloi aksionin e shperndarjes se kurbanave nga Xhamia e Wetzikonit per Shipkovicen 
Shperndarja e kurbanave nga Xhamia e Wetzikonit per banoret e demtuar nga vershimet ne Shipkovice 
Shperndarja e mishit te kurbanave nga xhamia e Wetzikonit per te demtuarit nga vershimet ne Shipkovice-Tetove 
Para selise se posahapur te OH Kalliri i Miresise bashke me kryetarin e Kallirit Rufat Sherifi 
Pamje nga punimet e konferences per komunikimin dhe thirrjen islame ne Europe e cila mbahet ne Paris 
Ligjerate:Llogarite veten para se te llogaritesh
vlera e agjerimit te dites se Arifes
Ne xhamine e wetzikonit para namazit te xhumase 
Jemi mesuar cdo here ti akuzojme tjeret se ata jane fajtore. Tash shqiptaret e kane rastin te zgjedhin deputet te diaspores. Te shohim?!
Ligjerate: Besimi i shpreses
===