 Lufta e 3 botrore kto me QA mirren Kime 🤦🤦🤦
 Csgo ska qe na shkon edge hajde boll flejtet
 Shyqyr sjam i kosoves
 A do ndihm krejt ti baj
 Ca esht ai sen?🤣
 Jabe asi anglish a spo Di qysh mi than hec e deshifro qka kam shkrujt kadal se  shkenctart kan zbulu se m… 
Mendon negativ, edhe ni here mendon negativ IYKWIM 
 Spaska nevoj me ngu lajme 🤣🤣
 Paramendo me kan real ,aman krejt mendojn se esht per Halloween🤯🤣🤣
 Ka najkush mas ti 
 A egziston grupi Hala? 
  Kalxo be ma fort ne e kishmi Bo
 Kesh n shkoll hyna n wc edhe i lajta durt hyna ne klas ju thash:Ku osht peshkiri  ?!
 Edhe kur e lexova e feela dyqysh hahahahahahah
 Bash  koha ftoht edhe me shi
 Pa marr parasysh kush t’lendon, pa marr parasysh kush largohet prej teje, pa marr parasysh kush t’bon keq, kujto dhe me…
Kurr hyn n banjo e harron me marr peshkirin 
Qe ku tregon se skam shoqni edhe instagrami e din ... Alone  level 9999  
 Nje bised e zakonshme me crushin+ cka bon ? ( 12:45 ) - qe po ri ti ? ( 20 : 45 ) + nqofse nuk je e lir folmi masanej (…
 Mac esht kjoo po hahahahaah
Korrik hajde ma shpejt edhe thuji qetij qershorit mos t kan mo!
Mos u mundo me ngrit veten tu e ul dikan, deshtimin mat madh n jet e ban...
 Edhe twitteri nuk esht instagram 
 Vjen shum shpejt hahahahahaah
 Vallah na t Shkupit qe jem vendas s kemi dit shum per Vushtrin tash fal atyve edhe na jemi njoftu m… 
 Hahahahaha Secili fis e ka nga nji pis ... Ra qajo qajtorja ju boni horr...
Kot e ki mo qe po aktron. Sjam pjes i publikut.
E jemja esht me bo mir, e jotja mem urrejt ti mu. Sdi cka ska t qart ktu.
Hedhja tipike e fajit -Nuk e kam qe najsen per mu, po per ty ma shum-
 Tash mduhet me gjet diken me fol deri n syfyr.
 Hala t thojm bile 
 Qudirat e Shkupit ti kallxu 
Mu çorapt m kallxojn se qysh ka me u vesh dit per dit çfar ngjyre i kom qashtu edhe veshna. Hahahahahahah 
+Kur e ki ditlindjen?-me 1 Prill+Mami jot edhe Babi jot dmth t paskan bo tu bo hajgare e tu kallxu rena a!
 Pse e permene be pernime u prish koha 
 Aa ani ani shujtaa
 Hajt se i kallxoj mamit tash 
Pe du nji femer si qekjo 70 her e rrzoj dej sa ta kry missionin edhe apet vjen mas ulet ...eh qekjo esht dashuri e… 
 Nuk osht more marre me e dite gjuhen e armikut
 Ishalla edhe n ahiret ju bojn Nji pytje t thjesht edhe ulu n vend. Profesora!
Qe dy her po munona mi shkrujt crushit,po apet po i fshi.
 Awaw Faleminderit banju selam t shpijes hahahaahhah ❤️❤️❤️
 Diqka qe ai na tha sot e qe m’boni pershtypje: Kur nuk dini, duhet me pyt dhe me kerku ndihme, kur dini, duhet me pas guxim!
 I vetmi qe e sakrifikon jeten veq mem ba mu tlumtur o buka.
 Mubo me i than naj femres mke perngja me najkon tvran tmasakron tvjerr nkanop
 Shkolla ku mesova 9 vjet hahahahaahah
Mu wifi ja shpis spom lidhet e le mo naj femer
Nese ndjehesh keq parameno turqisht vjehrrit i thojn "peder"
 Sa m thae qetash meniher me nxjer n tweet selake 
 Edhe un flamurin e kam majt veq 
 Çorapet e addidasit 10€ . Me i pas  une kurr s'kisha vesh patika , kisha hec qashtu me i pa krejt.
 Po be e pash edhe une spo dorzohet njeri bash me rreh po du hahahahahahaha
 Ma tha: Çka bon nkohen e lir  ?Thash: Ha buk.Apet ma bon: E cka bon kur sje tu hanger buk?? thash:Lypi me hanger buk.
 Fundi e zbukuron vepren.
 +Urime ditlindjen cdo t mir n jet.-Faleminderit, gjithashtu.(M shtin n dyshime mos e kam edhe un ditlindjen)
 E kam trunin e musht me shum informacione te panevojshme.
 Kur djemt bojn t'dashur thojn kom bo femen , pse qikat nuk thojn kom bo mashkull?
 Se prej Shkupi vijna
 Aaaaaa ka tu kujtu moj hahahahahahahahaha poooo 
 Une si kuptoj fjalt anglisht kur ti shkruni tamon , e le lo mo kur ti shkruni me shkurtesa
 Ose ban RT ma shum veq
 jo spo respektohen qikat , qe kqyrne qito. 
 O spo du as unaze e as dhurata t tjera mjafton be mem dasht edhe mos mem rrejt o tiii
 Per kto loqkat e reja qe rrijn tu na kesh , e sdin qa o twitteri  
 Ti sa dush bleju shqiptarve kasaforta per pare apet ata ta mushin me sene per musafir 
 A e keni vrejt qe kur osht nana e smut doket sikur krejt shpis i ka ra gripi
 - Nuk ke bo sen per mu!+ Boll qe e kom hup kohen tu fol me ty deri n'mengjes.
  ta kishe dit kupttimin e fjales zot se kishe bo hic ket pytje. Fjala Zot dmth :" Pa fillim dhe pa mbarim" ,…
 Skish sen ma t'ron se me tu idhnu njeri,pa i bon sen!
 Zemer a mos jena tu lujt Jadec se nonstop n mene pom rrin...
Najher qaq shpejt pi lexoj tweetat sa qe 2s sa e ka postu un like e boj...
 Ani be ani qe t pruna mos kallxo n twitter ti krejt cka bojm te shpijaa hahahahahahahhaha
Nese delja skish pas kom ish kon re
 Krejt  e kan ka nji shok/shoqe..A un kam shum, po veq me njnonin foli...
Sje i ksaj bote nese shishen e ketchup-it kur tu ka sos se ke pre n gjys e me marr qato e ka met edhe pak.
Sje i ksaj bote nese shishen e ketchup-it kur tu ka sos se ke pre n gjys e me marr qato e ka met edhe pak.
Per nje s qe ti se ve fjala ska bahet ka.
 e hypmi nker,edhe blejna me honger najsen e tani shkojm n'Vodno, pi nalt e kshyri dashnijen tem,SHKUP
 U ktheva nshpi pram kan 3 ishin kan krejt tu flejt, si ta kom shlu fshisen e strujes e tja kom nxer ment-karma is a bi…
 Nata kur u be bashkimi kombetar  
 Nese nuk ke turp atehere bej cfare te duash.| Muhammedi a.s |
 Me sene qe jan per me na ardh marre, njerzt po krenohen.
 un ty tdu si shok 
 Mos i hup ata njerz qe t'degjojn edhe atehere kur ti se thu asnji fjal . ‍♂️
 T’qifsha gjeneratenSjom shqiptar un po KosovarJe kosovar se ke lind 2005 e sdi kurgjo hiq per historiPerqata bon krahasim…
 Mos kshyrni filma kur ju ze gjumi se ju flehet...
 + I thash ni shokit tem bane ket Channel subscribe nëse Don..Ai mtha... -A ka ktu lektyra a!?!
 +O bab qeky shoki jem ka marr 5-Po mir e ti ?+Vallai une per pak sun e mora.
 E vertet hahaha ❤️
 Flokt a heken , a prehen , a qethen....!?
  Po sosht twitteri per cifte hiq se e pam n insta cka bojn 
 +Mos i prej thojjt naten!-Pseeee?+Se qashtuuu....
===