Ne tash e mijera vjet me pare e dime jo vetem si ti lajme duart por edhe si te pim uje, si te ushqehemi, si te hyme… 
 Kjo eshte tmerr, nuk ma kap truri, ata qe skane tha nuk shkojne te ai, ua car tmerri. Ska mbet njeri pa… 
Eshte mjeku me i mire tha, une gjith' ata qe i njoh i coj te ai, vec ata qe skane pare nuk shkojne, se do nje te "q… 
Nuk ma kishte marre mendja qe do pi kafe ne te zeze :)) e piva dhe e shijova si kurre me pare, ashtu ne kembe nen f… 
Virusi i hyri edhe princ Çarlsit, familja mbreterore ne izolim, ky virus paska qene tip fare, spyeska as per princa e as per te pastrehe.
Djali im sot ndihet i vecante, kjo bore ka rene vetem per te :)) i lumtur pa fund, e priste me kaq shprese gjithe k… 
Shtepite plot e rruget bosh... bukur ë?!
Djali im kur behet xheloz per ca gjera qe motra vete i ben ose i ka ja merr kenges; kjo ka koronavirus, koronaaaviruus :)))
Tani, shohin ke te largojne prej pune, sa? Qindra, mijera?! Po po mijera do ikin prej pune dhe qindra te tjere nuk… 
 Hahahhaha Maki, ja pse une nuk i hy asaj valleje 
Keto dite kam pasur shume nevoje te blej lule, lule me gjitha ngjyrat.
Ne Gostivar rasti i pare eshte prej Zvicre, ne Oher rasti i pare eshte prej Italie, ajo femija 4 vjec prej Anglie q… 
Ne MK na erdhi virusi vetem nga egoizmi dhe pandershmeria e atyre qe "u kthyen ne shtepi" pasi u shpall pandemi. Na… 
Pasi te kaloj ky virus, nje gje eshte e sigurt perendimoret do ndrrojne stil jetese, do prodhojne dhe perdorin tualet me taret.
"Nuk mund te jesh i shendetshem ne nje ekosistem te semure" 
 Hahahahhah fiks keshtu eshte, menjerehere ne te 6- shten nisemi, skemi durim fare :)))
E kemi te njejten lufte me pjesen perendimore por nuk e perjetojme njesoj, ata ziren neper markete per letra nevojt… 
Ky virus dhe izolimi prej tij me detyrim ka prekur jashtezakonisht shume familjet e varfera! E ata nuk ankohen se s… 
 Une do thoja; hajgare me krip dhe hajgare pa krip, njera haet, e tjetra ta shpif :)))
Mendoj qe njerzimi kishte nevoje per dite te tilla, edhe pse me panike e me frike, pas cdo lufte vjen paqja, pas ke… 
Feja jone, besimi jone eshte melem per plage, ne jemi te pergatitur dhe te njohtuar per cdo krize. E dime si duhet… 
E mira e ketij izolimi; po i ham vaktet bashke, tamam si familje, te gjithe ne nje sofer, mengjes , dreke, darke. F… 
Lajmet e Maqedonise i shoh te mediat e Shqiperise. Tonet jane te zene me seriale turke.
Amerika masat ushtarake i ka marre njesoj si ne luften e dyte boterore. Trampi sot anuloj te gjitha fluturimet nga… 
 E vertete e dhimbshme!
Punetoret e dyqaneve punojne pa masa mbrojtese, doreza dhe maska. Njerezit poashtu pa ato shetisin, prekin, peshtyn… 
Frika dhe panika jane dy gjera ndryshe.Frike po, panike jo!Por te ne nuk shoh as frike. Neglizhenca ta han koken d… 
Enver Hoxha kur e shpalli shtetin ateist e beri vetem e vetem se nuk donte ti tregonte botes nje Shqiperi me 70 % m… 
Kur e pyeten Arber Ademin se cfare do te behet me librat shkollore, viti po mbaron e libra ska, ai tha: nuk pergjig… 
E them pa pike dyshimi; sot, lufta me e madhe e prinderit eshte ti mbaj femijet larg telefonave. Dhe diskutimi me i… 
 Kemi shpresa te brezi i ri. InshaAllah nuk marrin shembullin e profesoreve.
Por ne vend te kesaj, ai zgjodhi rrugen me te shkurter, me te lehte per mendesine e tij. Ti kundervihesh nje fenome… 
Ne vend qe ta sillte si shembull perrallen me sorren dhe priftin, mund ta kishte sjell si shembull Profetin a.s me… 
 Shqiptaret e mbajne flamurin ndersa maqedonasit i kane ne krah, ketu te ne jane njesoj dy palet.
Pika e 21, flet per lirine e vertete dhe ate fallco, mbi trajtimin e njerezve si  nje mjet per te arritur qellimin… 
 Nuk jam shpreh mire, lufta per shkarkimin. Edhe une sbesoj te shkarkohet. Por pse duan ta heqin, kjo eshte pyetja :))
 Jo frike se kemi fare. Por si iliro pellazg qe jemi armikut nuk duhet tja shtrojme tapetin e kuq.
Shengeni i Ballkanit nuk eshte asgje me shume vec perfitim i Serbise dhe mundesimi i daljes se saj ne det. Shqiperi… 
 Çrendesi ka emri qe i veme, rendesi ka llumi ne te cilin zhytemi cdo dite. Emrat kane per qellim qe ve… 
Besoj se prinderimi merr formen e duhur kur femija kalon nga periudha "femije" ne adoleshent. Eshte beteje e dyfish… 
Fatkeqesia me e madhe e Shqiperise nuk eshte termeti por varferia e thelle ne te cilen e kane futur!
  nuk do doje ta dije cka kam afer une dhe cka qelloi te faqja 56 :)
 Nuk e di kush ka thene keshtu por edhe une kendej ashtu thash edhe mendova; elhamdulilah qe me kaq, i pa… 
Nje femije i trembur pertej ekranit, dhe nje femije brenda ne ekran qe vertete e ka perjetuar shkaterrimin e strofk… 
 Ama cka lidhje Kosova me paaftesine e tij? Tema ishte Kosova, tani na doli deshtimi.... po pra, jane t… 
 Atyre portaleve qe japin lajme te rrejshme as kercenim e paralajmerim, duhet direkt te mbyllen. Cka ka… 
 Me mace e me mi i jane falenderues Kosoves. Kjo eshte e verteta! Pa te nuk do ja dilnin, ashtu si pa T… 
  Me kete video e bere per vete Makronin, prite tash thirrjen direkt per ne Eu
 Ne per sonte e kemi lene :))) do e nisim ka ora 11 dhe do e bitisim aha ....duhet shume matematike  e kemi prit si syte filmin 
Po qarkullojne lajme se kane filluar te vjedhin ushqime, tesha me etikete e gjesende tjera. Lus Zotin mos jete e ve… 
 Pse ti nuk ke qeshur fare keto dite?!
Qindra goma dhe mijera plastika ne detin e Sarandes, pyetem se ckerkojne gomat e makinave e kamionave ne det, si sh… 
Kur e gjej veten te trazuar, shqetesuar dhe aspak te lumtur, pa asnje arsye rrethanore, me kujtohet qe kam harruar… 
 Ce nje ore jam tu qesh, Salen e kemi poliglot hahaahhahaha
Nese e ke veshtire te thuash "me vjen keq" atehere mos fol fare, vec e prish dhe tjetrit ja luan trurin akoma me shume!
Pse nuk ha ta ti nene?  
 Ne qe nuk e dim arabishten e kemi shume problem kete pjese, sepse sado qe te konctentrohesh mendja ik, dhe… 
Mik eshte ai qe ta uron diten e xhuma dhe te thot; dergo sa me shume salavate! Perkujtimi mes shokesh eshte dhurata… 
  Mire e ke ti, por kta jane si rrodhe qe te ngjiten pas teshave, nuk i shkep dot :))
Me erdhen ne shtepi deshmitaret e jehovait, filluan me te vetat, a nuk e shihni qe jam muslimane?! u thash. Dhe ke… 
Ne festen e mbremshme te Albin Kurtit nuk kishte asnje flamur te Kosoves, ata festuan kuq e zi, kjo tregon per nje… 
 As me Samsung nuk bohesh rehat, une  e kam mendjen te note 10 plus  hahahahahah
Te vin mysafir, ta pin kafen e ujin, flet per ty sesi jeton, te len ca therrime thashethemesh mbrapa dhe ik. Dhe ti… 
 ndersa ne i themi "lule xheneti" ne mengjes dhe mbremje leshon arome te kendshme sa ti shpon hundet, ne… 
 shume e cuditshme,sdi per ke dhe kujt i ankohen,te semurve te tjere?! Te ankohesh per rrjetin social ne… 
 Ta dine ata termin e openmindet, nuk i ishin referu vetes te tille, shkurt; vec budalla  eshte open mindet...
 Fidan, une i kam bo :)) dhe i ruaj per tim bir kur te rritet. Kjo poezi ka shume force, e dua shume
E fuqishme eshte poezia! 
Perpara jan lavderu vjerrat se nuset e tyre jane ngritur ne saba per te lare oborrin, ska qene teme namazi por obor… 
  Maki, a se pyet veten po kjo Besa cdo ketu?! Une nuk guxoj ta pyes  jam bere stuck ne Shkup
 Edhe une te njejten e kam bere njehere e nje kohe :)) pra e di si eshte 
Kto analistat e pd, kto i moret, ato i moret, te gjitha i moret, tani do marrin edhe presidencen thot tipi. Po norm… 
 Po bre e pash, oj none oj none... mjer ju kush ju ka rene per hise
I fitoi 60 bashki Rama :)) pd le te shoh filxhanin e Mones per mbas kater vjeteve, po te jene gjalle deri atehere.… 
 Zgjedhjet u mbajten, sot jane numerimet. Gjithcka shkoj uje :))
 Po kta duan ta ndjekin ate, demek te bejne ironi e shakara si Edi, oj none oj none, ai eshte Edi, vec… 
  Meqe ra llafi, per bukuri shkojne zgjedhjet sot :)) presidentit nuk i doli falli  Mona… 
Del presidenti i Shqiptarise me rroba banje ne pishinen e villes se tij mijera hektaresh karshi popullit te vet me… 
 Ama Edi Rama eshte king 
 Demokratet ne krye me at plakushin kurre skane qene me Kosoven as edhe ne.  Por edhe sot. kta jane kun… 
 Edi Rama eshte king :) eshte i vecante
 Nuk eshte idea te notat, por ajo qe ti do nxesh dhe do behesh. I admiroj ata prinder, duhet shume guxim d… 
 Keto familje zakonisht kane shume femije, jane minimalista, jetojne neper ferma dhe bejne jete modeste, n… 
  Fidan, jo vec per sistemin te ne, te ne as nuk vin ne shprehje. Ne Amerike dhe Australi ka sh… 
Nuk i besoj sistemit te shkolles. Me mire do preferoja vet shkollim per femijet, sesa nje planprogram per 500 +nxen… 
 Pse a nuk ham a? E kemi ngrene qe cke me te.
Po te mos ishte ndihma e Zotit une vetes time per asnje moment s'ja kisha besu asnje ceshtje...
 Cka ka punuar e ka fituar, ne kete bote ishte poet i mire, boten tjeter ja lem Zotit. Kjo poezi me pelqeu,… 
 E di, ndersa ktu te ne vec te tjerash behet fjale edhe per njerez te pafajshem qe i kane futur burgjeve...
 Nuk eskalon situata jo, jane frikerat qe i perhap opozita. Bash tani kur jane negociatat ju kujtua ket… 
Intervista me e mire e dhene ndonjehere tek shqiptaret 
Si nuk arrita asnjehere ta kuptoj dhe pranoj bajram party- n..., nuk i shkon bre as per emri, "bajram party" qyqjaaa...
Atij qe duam kurre nuk i themi lamtumire, shpresojme ta shohim e ta prekim e ta ndjejme serish, e njejta eshte edhe… 
 Jo nuk te zihet :))
 Une e mora te Libraria NuN
E kam liber te ri, per cdo liber te ri gezohem si femije :)) 
 Veres edhe ma shume, se jep freski :))
 Ai qe na mesoi se Allahu e do faljen, na mesoi edhe "...falni qe t'ju fal Allahu"!
  Njesoj qenka, plus edhe parketi njesoj :)))
  Njesoj qenka, plus edhe parketi njesoj :)))
Zoti te takon me njerez te rinj qe me vone do te behen te dashurit e tu! Ndersa ato qe ke pasur nje jete te tere po… 
Dhe kur e mendon thu ti se nuk e ke perjetuar kurre kete ndjesi, ishte para nje viti, eshte edhe sot, por cdo vit q… 
 Une skam fb. Ua bllokojne tjereve...
Fb ta bllokojne feministet, kjo ideologji po te ishte rehat me veten nuk do bllokonin profile, po te ishin rehat me… 
Nder tjerash i lutem Zotit tim per nje vdekje te bukur, Ne nje vend te bukur dhe te ma falin xhenazen njerez te devotshem.
Ai burre qe rri turi varur perballe femijeve qe ja zene rrugen duke luajtur, nuk eshte burre, por nje deshtak i neveritshem!
 Ooo mire se na ardhke ;) 
Duke thene; u shpraz vendi, do ikin te gjithe, harrojne qe fusin deshperim pa vetedije te ata qe jane ketu. Ose ose… 
Aq shume i gezohet dites im bir, saqe cdo gjysem ore me pyet; mami sa eshte ora, (se ka idene e ores) por ka sensin… 
Nuk ka gje me te bukur kur;  InshaAllah behet Elhamdulilah
Rrjetet sociale vec ua nxorren brinjat njerezve..., te pakten nuk e dinim qe ka aq budalla. Edhe kesaj specie ju dh… 
 Yep :)) shpresoj tek gjeneratat e reja, ne do bejme ndryshimin te femijet tone. Me patjeter!
 E kisha fjalen qe ne si shoqeri i druhemi te vertetes, per shkak se gjithcka marrim personale dhe me e… 
 Adaptohet. Qofte ne kushte klimatike, qofe ne kushte te ndyshme shoqerore, fizike, edhe me dhimbjen adaptoh… 
Reagimi i senatorit te Australise ndaj djalit qe i hodhi veze ishte skandaloze. Jane hedhur shume veze e doamte, po… 
  S'kane kohe ata, jane te zene duke ngrene njeri-tjetrin
Mos mendojne ata se na kane perulur ose nençmuar, kjo ska per te ndodhur kurren e kurres. Krenaria e te qenit musli… 
  Tani isha duke lexu lajme nga cnn pash nje arme te tille qe dukej e njejta. Sidoqofte e dime qe… 
  Kaq shpejt doli fotoja e armes a, a eshte burim i vertet apo lajm kshu nga portalet tona?
 Behet fjale per sulmin e sotshem apo ndonje ne te kaluaren?
 Flejne gjume. Ata zgjohen vetem kur agresori eshte musliman e viktima krishter. Ata i kemi shmekit e shoqerise....
 Aktori hyn ne rol tamam se, po nuk e beri nuk eshte aktor, ai misherohet me rolin, behen njesh. Ata qe s'mu… 
 :)) nuk me dukesh i ndikuar, por kujdes ama 
  Drenusha, edhe une i bashkangjitem listes tende "smuj me paramenu" pervec pikes se pare :) a… 
Rrjetet sociale i kane bere njerezit qe ata te flasin si personazh publik jo si individ.
 Une ti jap edhe 5 min plus ;)
 Duke mos lejuar te shkelin terenin tend :))
  omg paskan mbri ekstremin ma shume se kaq sbesoj se mund te shkojne, ska  o me lot...
Evropa ka çmim, ja u be edhe ligji kunder diskriminimit te lgbti. Pse vec me nje te nderruar emer te hym ne Evrope… 
 Te jesh krenar per ate cka je. Sic jane shtetet europiane perfshire edhe Serbine.
 Status me te fort nuk kam lexuar. Kjo ja ve piken  e madhe te shoqeruar me nje te qeshur me lot :)))
 O Zot :(( sun e paramendoj. Me duket e shemtuar.
 Shume skene e shemtuar, prinderve te atij romit ju ngeli buzeqeshja e ngrire.
 Tjeter racizem kane ata... mos harro qe kane qene skllever vetem shkaku ngjyres.
Nje femije rom hante çipsa, i afrohet nje femije i bardhe shqiptar me i vogel ne moshe dhe lakmoj, romi ja zgjati n… 
 Edhe Migjenit ja kishin bllokuar, per nja status te 2016 :))) Lgbt po forcohet shume por ama ne e dime shu… 
"Hate speech" nuk vlen vetem per islamin, muslimanet. Pra, per ne mund te flasin cka te duan. Per gjithcka tjeter… 
 O kta e kane problemin me veten dhe mes veti por e kamuflojne me meshkujt.
 A nuk e more mesazhin a 
 Jo hiq s'eshte i koduar, ma drejtperdrejt s'ka ku shkon :))
Ata qe mi kane marre librat e s'mi kane kthyer, ta dine qe do me japin llogari ne boten tjeter. Te vetmin gjest qe… 
Njerezit ndryshojne, kujtimet mbesin te pandryshueshme.
 Une e kam bere krejt fb hide... dhe jam super ;) sme mungon asgje, biles me jane shtuar te mirat.
 Muslimanet jane koshient qe xheneti; parajsa eshte te kembet e nenes; edhe se femra u krijua nga brinja e burrit per t…
 Me bere te qesh. Zoti te rujt e te begatofte me nje nuse te hajrit.
 Gjeje nje nuse qe e do librin. Se me prit prej shkollave tona ju merr lumi 
 Ma thuaj, prej ku vjen dashuria per lexim? Jam dakord qe dashuria e pare vjen prej familjes... po me p… 
 si ka mundesi qe shumica e popullit tone ketu ka probleme gjuhesore?! Gjeneralizim nuk bej, por ama ke… 
Nuk ma nxe as goja e as lapsi te shkruaj lavde te rrejshme per msuesine tone ketu ne Mk... Jemi per te qare me gra… 
Kur femija doktorit, ministrit, drejtorit, punetorit te krahut, jetimi, etj etj te trajtohen njesoj perballe librit… 
 Thu ti qe mesuesit tane jane perfekt me gjuhen. prandaj dhe nxenesit i kemi ne kete nivel te gjuhes, n… 
 Dhe me shet moral e gjoja flet ne emer te popullit
 Mjer ti, cte te them... pale po kur tha LSI nuk ka vjedh vota, omg 🤢
Une kur e shoh Monika Kryemadhin ne televizor 
Do foto skane nevoje per komentim. Ata ulerasin. 
Nje thenie qe e lexova ne nje web faqe per terapiste:Kur nje burre te thote qe je i shemtuar eshte i keq. Kur nje… 
 Dhe tjetra, kta te pd luftojne qe te mos hyne ne negociata, e as te behet reforma ne drejtesi... si e kane hallin kshu?!
 Sjam dakord :))) e treta eshte Mona 
 Pd kurre ska fitu zgjedhje, pervec nje here kur Ps u nda dhe u formua LSI... vetem atehere. Perndryshe… 
Mallkimi i pare i shqiptareve ishte Enver Hoxha, i dyti pas tij Sali Berisha.
Protestuesit e Sales, te Lulit dhe Mones, shajne ne moter, grua e nene me mikrofon.... me fjalet me banale dhe me t… 
 Shpresoj te mos i shohin interesat vetjake por ata kombetare. Le ti lene inatet dhe te luajne me zgjua… 
 Shpresonim te ishin vec thashetheme, do gjera nuk pranohen edhe nese jane te verteta. Fatin e njejte si te Bosnjes :(((
 E kan bo aminin a?!
 Hahahahahahaha tani me musteqet a?!
 Lum Kosova e shqiptaria per kta mendje ndritura, jane per cdo gje 
 Po pra. Ketu ka faj shteti. Dhe duhet njehere mallit vendor ti jep perparsi, pastaj te kaloj nga Kina apo kudi une....
 Ka ka gjera te mira, perndryshe nuk do kishin pushtu boten me tregti, por tek ne vin llomet.
 Une e kam shume brenge. Por ngelet vec brenge se skemi cka bejme... jo. Zoti na ruajtte!
 Hahahahhahaha te ishin prodhim i mire ok, ama kta i kane prodhuar si per Ballkan ma, cka mbetet nga mbetjet :)))
 Po mishin e harruam o Maki, ate te Brazilit, pulat sa nje xhel deti, mishi i bardhe sa nje kofsh vici...… 
 Une kocanski marr, jam mesuar me ate. Dje u gezova qe gjeta hudhra vendi, te vogla te lezetshme. Shitesi… 
Nuk e kuptoj cfare zori kemi qe edhe kokrrat e hudhrave i marrim prej Kine. Per gjera tjera jam dakord, per ata qe… 
 Rama e ka gjet llafin "kazan" mediatik. Sa i perket kohes se kesaj fotoje, padyshim qe ajo gjenerate ka… 
 Kan lexu lajme tamam kta, kane marre info te mirefillta, jo si ne sot lloj lloj portali qe ndjekin shtat… 
 Une i shaj, pikerisht per kete gje 
 Paska kris dicka he :))
 Prandaj po i djegin mandatet :))
Me shume njerez kishte Edi Rama ne Vlore sesa Lul Basha ne Tirane.
Ne protesta kane mbledhur vec meshkuj te dhunshem, nuk eshte zeri i popullit ky... por deshira e njerezve  te desht… 
Ajo shtremsha kur e beri ate postimin ne fb, garant nuk e ka ditur qe ka edhe udhetar maqedon, i eshte gezuar vetem… 
 Te besoj. Ky vend ka njerez te mire, biles shume njerez te mire. Zoti i shperblefte. Sa pash ne video… 
Sa keq kur nje tragjedi perdoret per te shfaqur urrejtjen, politiken apo perfitime te ndryshme...
 Zoti te shperblefte ty!
 Sa keq me vjen!
 Zoti i meshirofte. U tronditem krejt.. skam fjale, Zoti ua lehetesofte dhimbjen te gjitheve.
 Po po u korigjove :) 
 Vetem fjalen tarikat e mora vesh, gje tjeter skuptova nga kjo video :)))
Ky eshte shembulli me i mire qe kam marre ndonjehere. 
Thone qe cifutet jane race e zgjuar ata udheheqin boten.Pse zgjuarsi na qenka te ngritesh ne kurriz te te tjerve?!T… 
 Shkolla duhej ne vend ta kishte paraqitur rastin te merrej shkolla me ndeshkimim. Por ja qe te ne mbro… 
 Qeni ste kafshon tre here, por njeriu po, ky lloj njeriu eshte me i keq se qeni!
Po lexoja rastin e Drenasit. E tmerrshme, mbi te gjitha deklarata e nenes; "rastin me mesuesin e dinim, por me poli… 
  mami shkon te doktori. Nderkohe qe shkon diku tjeter :))) ja nje e panevojsh… 
 Ka, ka edhe genjeshtra pa nevoje, te pakten njehere ne dite te gjithe biem tek ai test.
Genjeshtra pa nevoje ma heq trurin fare.
Iritohem shume kur shoh genjeshtra e mashtrime prej te medhai te nje femije i vogel. Zot, sa te paditur qe jemi ne… 
 Nuk dyshoj qe po, njerez te tille ka plot, ata jane si yje nate, si drite hene, nuk duken shume por b… 
 Kjo tregon se druhen nga e verteta te cilen me cdokusht nuk duan ta pranojne dhe keshtu nis lufta per… 
 Eshte tmerr. Dhe kur e mendon, eshte prinderi qe ua cel, tmerri fillon ketu dhe ska fund pastaj.
 Kush te ka nervozu Suno?!
 Te ne nuk ka gazetar njehere, s'ka.
 Sa shume kam qeshur, ama hadithin e ditka. E venka ne perdorim tamam :))) O Zot, na ruaj mendtë!
Ndonjehere njeriu nuk flet ashtu si mendon, por ama, fjala qe thuhet degjohet, mendimi jo. Sa shume kujdes duhet te… 
Tani do hym me pasaport ne Greqi , cfare gezimi :))
Bie bore, sa bukur qe bie... Mendimi?! Eshte i pafund, fillon me bujarine e Zotit!
  kam pershtypjen qe te gjitha rrjetet humben kuptimin pse u hapen.insta u hap vec per foto.T… 
O laps i mprehte, kur dielli pas reve te jete fshehur, vizatoje ate, shkruaj per te, e nese do shi pas nje dite zja… 
 Kjo foto akoma me e bukur :)) 
Morem nga ky qytet aq shume bukuri sa tani jemi gati te jetojme kudo qofte me shume dashuri!  ❤ 
 Yeap. Sot u merzita shume, se krejt ma kthyn ankthin qe na dhane para dy viteve. Dhe kush e beri?! Ja kta qe festojne badnika
Sot eshte nje feste ortodokse. Ne çerdhen e Struges kane zene brum per buke,i kane mbledh femijet edhe ata musliman… 
 Liria e shprehjes?!! Sa shume abuzohet me kete fjali! Dhe... nuk vlen per te gjithe e sidomos kur ceno… 
Jam bije, jam grua, jam moter, jam nene. Cdo dite mbledh copat e thyera per te ndertuar nje mur mbrojtes, ndonjeher… 
Kur e shikon qe miqte te kujtojne ne momente lumturie dhe jo vetem kaq, por ne nje lumturi ndryshe qe ta sjell ai v… 
===