 Bro shkupi o qyteti ma fallc neurope
 Moralistat: Mos imitoni, kthehuni kah vetja, kthehuni te rrënjët, jo halloweenrave.Rrënjët: 
Si te jem i lumtur sa ilazi dhe anifeja gugëll sërç 
 xhi bojni be ju andi ka gestivari?!
 E ka per interes te vetin per zgjdhjet presidenciale 2020. Se ai mburet per stabilizim dhe ndryshim te po… 
Ec more bon bajram me dajen se ska kuptim 
Xhi o be puna bankave ntetov?
 a je bre normal
Jom tu kalu ka s*rbia e ja kom kthy shpinen xhamit se sdu ta shoh ket vend tkalbt
 koleg mos kshu se ka edhe prej atine qe pernime klikojne
 A pi ndrrojm gajlet bre o naimch3
 Uranik, pajtohemi me Mergimin mirepo je super kreativ se si e ke spjegu storien, keshtu qe nese kjo tweet i merr 1k retwe…
   Ballkani osht rasti ma konkret sa cka mujn me bo ndarjet nacionale e sidomos… 
 Aha hahahahha un as skm aplikau ataj
 a edhe ty stpranojke sistemi?
Ami ho se ska virus 
 jo veq deshta me tpyt a je qu?
  Eh sa kacija jan hanger per ni cop udhe....
  btw kto dy katunde kan fërrka historike hahahahahahahahaha
  Si ta kesh xhet pa gugëll maps un ti jap
Kur shoh snapa njerzit npushime mu hala afati provimeve sm ka fillu eej so e drejt valla
Guess kush ia ka kcaj sKllOpKen asaj pjese 
Ka ni qender ntrau e mban balancin nderrmjet dites en nates
Nuk osht problemi te miskoja ama pritoj tkruhem un mrapa
Arsyeja pse mjeket e perdredhin shkrimin osht se va perdredh anatomia nervat gjate studimit.
Every albanian kid kur nuk va blish at lojen xhi sa e kan pa per udhe be like 
nauk se jom fetar ose dnisend ama perher boj bismilah para se me najs dni pun
 Butrint weakness: nese njeri prej tdyve osht i keq edhe aj tjetri bohet i keq ata gjith dyt keq mesin
Duhet ta tregoje patjetr?-nje bylizik
 O ndrrojani emnin Covid-it n'Promaja, e sheh a del naj shiptar masnej
  Nesin e kina kreative
 Marrin guximin en i thujn vetit artista...
 Ani kur qohen gjeneratat e vjetra mr thon qe perpara mjekesia u kon ma fshtir. QEKY E KA KRY, CHANGE MY MIND!!!
Ka do tipa njerzish xhi per moto jete e kan "fake it until you make it".hajt xhi de presish pi atine?
Pe pres me thir sabahi qe me flejt deri mas dreke. 
 Po raj be nshpaj shajf deni film mo u bon filmash
===