Kaja na ka tshkojsh mhb lufte
 Ja jo smar msysh
 Kuq edhe zi malboro
 Mere edh ms mthuj dreq 
 Diten qe te pashhh me nje mijj plagg ne zemerrrr
Kushhh te ndau prejj mejee
Sa e fort kjo dhimbje
Sot shum koha mir e feelsha nraj
 Pse a ka me ardh naj update qashtu a 🥳🥳
E kam ni shok qe un e thras bari
Kush ma mson turqen shperblehet me shum diqka
 Qele njo edhe ndjeke crushin per me shum te dhena hahahaa
  Ncnc marre Curly pele qysh thot chat e bonen ma thinen
  A qysh mqet nrren
  Edhe ti qishtu je de u qoshe bilum prej n4
 Vdekja i jep kuptim jetes, nese skish pas vdekje jeta skish pas kuptim.
Ma bojke a po doon patika llakoostt
Bojlerat naksion jan kon sonte
Pse ki diell spo lind meeee pse ky zoggg skendooonnn 
Bigkomerci lajti lesh lajten leshe edhe paret mia
 Hahahaha ndrro pak ndrro
 Plus duhet me prit dej sa t thire merdhif
 Pritoj me shku me mar porosin vet
 Shnosh me kan veq
 Ja qesi i pin un
Ahhahahahah o diqa be 
Ksi ftofti as veres su kan
Nfillma tshtijke albumi lyricalit edhe kreshes
 Ma then nshkoll me shku
 Sje per strug ti dikun ndubai ngat misave
 I paske ga krejt dites
Follow eren se ju merr fryma 
S’po du toxic shitBitch hiqmu qafe
 Paj ska lidhje nashta gru o
Qaj vit i njejt qa kari
Jom qu pesh jom tu e thy korin
Po kaja nanen njeri pse bohet budall tu kqyr tiktok veq un
Shti me ket bor sdurohen snapat
 Hahahhaa badihava qe majn sen behen si ne
Pak von po ska lidhje
 me tu ftoh krejt jeta
hahahahhah diqa me kingin, nga vllezrity e motratt e KING’itt 
 Profili shum i mir tani per tani
 Njeri i ka fajet jo jeta
 Qa ke mo zemra qa tka faj jieta
A keni probleme me instagram?
Naj serial tmir ju lutem!
O ropt u bo ora 2 apet
 103miljon euro i bjen qe osht dicka
Kangen e noizyt edhe mozzikit jena te prit njejt si vitin e ri me familje bashk
 Parameno sa t’lumtur ishin kon njerzt tishin kon bashk me qata qe i dojn
Ja munu me t hy nzemer po ma qiti error
 oha cfar shiu po bjen
 shpesh here i kom marr mallkimet ma tkqija prej njerzve qe deshira jem u kon me jau plotsu tyne deshirat
Era saj, e qesi ere kur sen gjaj, qata maicen kur se laj
Qikjo nat koka per me vujt edhe shi
 Qeshtu te ne osht pa test pa vakcin smunesh hahah
Nlodnder po mshkohet kaja na
Qitu nmahall tem era hajvar po vjen
Kam menu qe qik e mir o
Tu jetu me andrra edhe po besoni a
Po menon qe je kjut ik mer qije nonen
Qa kari n6 duht mu qu qija jeten e nans
E pidhit i ka ra vlera
 Nuk pat si ti ne bot e ndrrova boten per ty
Sa e bukur ish me vello
 Pi kallka djemt ki far pederi
 Veq syt shum tbukura
Qysh mi than tdu pa e vrejt ajo qe un i kam than
As hana spo ban drit mo
Merzija pom han mrena kur po di qe sje e jemja
Bjere jointin nket ftoht ta then
 ja ka nis edhe gjumi me mu largu prej jete si njerzt.
Qdo njeri ka defekte
Jeta per ju ish kan
Dej kur me tprit mo
Kur isha ma i vogel e vetsha femnen tem sa fmi kem mi bo djal a qik e don hahahahahahhahahhahha
Me ty kom desht mu deh
Spo muj me u rahatu me foto tprofilit
 U knaqa me tni shokit
 Gjumi paj aj pak qishtu
 Opa mos se sban
Mka ra virusi skoka sen
 Muj me u ngatru
Xhuma te pranuar inshalla
 Bjemi qato 500 den
 Asnjo so tu pru kurgjo konkret,Mu ka bo krejt rrafsh si me shtru parket.
 pasha zotin haram osht mu sill mir me do njerzzz.
  So sen so sen preke hunen
  Po po e mire i kallxova
Nejse sju han kari klm ntm
Emrin shkeliqm amo spo shkelqen 
 Sedi fshatare skam lindur akoma po ti‍♂️
Ishim femij te lindur ne nje stine
 Au shumm teper ani kur folke me rion
E kom exin nsnap ropt ja qifsha haahha mu keshet me to
 Ok skopsko za nas
 Ka shum pijana aty rrunu
Amo nime u ka ba ftoht nata qa karin o vlla me duks me hec po ta then
 Netflix je tu e kshyr a
 A e kan nxjer nfilma24
 Mka ndodh amo skom kajt HAHAHAHHA
A o ndjene e mire
Flej mer ti qifsha ropt
Shoqni te gjith e keni dit sa shum e deshta
Qifsha racen m vllai ik
===