A di mu nal ti naj her ... 
 "Mka bo bllok naper krejt rrjetet sociale , nashta po ka qef me i shku nshpi" HAHAHAHHAHAHAHAHA
 Paske ik per lesh trashki 
Kojshia i mir osht per dit vshtira  
Mer frym loqko se po pelset 
 fuck nudes send me memes!
Qaty ku dalin kepurdhat 
 Ni mashkull pa pare e don veq nana e vet
 Ma e mir ishe live se sa nfoto 
 Parameno sa selak/selakic duhesh me kon me i qit mesazhet qe t’shkrujn
 Nuk ka nevoj per fjal. 
 E qysh tash nese aj ta bon ti pe mer qe tu ul n’dy guj me unaz n’dor a qaa kari
 Shoki qe o shok t thirr me fal Xhuman sot!
 Cka osht fore me u anku Jeta Xharra ne KQZ ne emen te Haki Abazit 🤣
 shumica shqiptarkave ntiktok jan llom+lloç
Tu ritet botha edhe ni kfadrat inshallah ❤ 
Qite bothen ma shum nfoto 100% Efektiv 
Aj djali nuk tdon ty kshtu  
 Zot ruj djemt prej kurvave bazike
 Ndryshimi ne Kosove ndodhi.Tani rradhen e kane Shqiptaret e Maqedonise
 Ma perkedheles dyqysh po rok llaminati 
Si llaminat po doket ?! 
Kush e ka bothen mat mire ? 
Kush e ka bothen mat mire ? 
 Ma ntdjatht ma ntdjatht doren 
 “ ᴊᴇ ᴛᴜ ᴜ ᴅɪsᴛᴀɴᴄᴜ, sᴇ ᴛᴋᴀɴ ʟᴇɴᴅᴜ. Jᴇ ᴛᴜ ᴜ ᴅɪsᴛᴀɴᴄᴜ, sᴇ ᴛᴋᴀɴ ʟᴀʀɢᴜ “ 
 Femnat jon si disa fmi qe ti bojn 500 pytje mrena 10 minutave
Kokshe bash per te perputhen 
 Qitni krejt ka 10€ edhe lyne klasen!
 Ne fund te dites, syte e tu kane me dashte me i pa vec pamjet qe ta mbajne ngrohte shpirtin.
 HAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAH qija jeten pejont tjeter nivel 
Kjo dhem ma shum se kur e rok gishtin e vogel dikun 
 “Se po t’ja qi futbollin e nanes, s’ka buk pi asaj pune” 
 Mo ksi tfita o king se fmia qifti yt menojn se nime osht marre me dal me tshpis
 Para 15 vitesh e perqafova per her tfundit babain para se me shku npun edhe su kthy mo.Me mungon qdo dit. Nuk e din se qk…
Met drejt e ki, veq live spi shofmi tnjetat  
Kokan tut pelsit sis 
Qika a e zgjedhni ni djal per ftyr a per pare !? 
E pse dreqi osht flejt tash ? 
 Pot mytshe met dashni ti 
Qka o kjo dashni me inat kshtu oj boter 
Moti osht kjo pun 
 LOOOOOOOOOL kids k!ll me  
 pse spi man striksatqfar snapa me t qu o vlla tu qit qaj a
 Dhe ju mthoni qe 2021 do jet ndryshe? 
 Un du me mdasht per qato qe jam jo per ato qe ki qef ti une me kan ;)
Tdek nana per Bajram 
 Flej se shi bjen
 E kam njerin un
Bandash guma ooo shofer  
 Nashta s’po dihet per kon po folet... 
 Mos haro ftesen per dasem botra jem
 Aha ti don qysh e kam un ! E kom dit qe tkam fanse amo jo dej qetu mu bo si un 
 Ni arsye ma shum me dyshu ne nje lidhje 
  Hapa per lukth po lyp
 nobody:kiflet kur i shtishum nqant: 
 Hahaha e shajshet je per Zotin, amo edhe dohesh mu kritiku pak per mu bo ma e Shajshta n'tw .
Alis e shajshet ije 
 Nuk o ma privat story nese ta shohin 60 veta
 Veti patikat dej nsa kg mujn me bajt, tani kqyri fajet apet ☻
 Filani po thot skam djal per ti
 Ska si Shkupi 🤩❤️ 
 Dhe mos u be mbrojtes i tradhetareve! {Nisa 105}
 Thojn kush rrin von, jon t’dashurum.Kto jon rrena qysh thot Kresha
 Jo ti boll srioze me foto tua ... "✌"
 Send me dm this fillm se spo di qka me kqyr
 Edhe ftyren pak nxjere 🤓
 Shume keq osht me tu ftof dikush, stkryn pune as zjarmi
===