Pse shqiptari kur don me ta kallxu naj ngjarje ja nis munohet me bo sa ma shum me fantaziat e veta me mashum ngjarj… 
Paramenoni mem dasht mu najkush khuu
Me jetu esht gjëja ma e rall nbot. Shumica e njerzve veq egzistojn, kjo esht e gjitha.
 Skan krejt kerrat senzor
Pse shqiptari kur duhet me shti kerrin nparking ja nal zonin muzikes?
O nuk tshkruj e para me dit se toka me qiell bohen bashk
Sot spasna nerva me kerkon me fol
 HAHAH masi nuk te plasi trapi mos komento i dashur
 masi spot han ski nevoj me komentu e ska nevoj met thirr
 e qka nese e ka pas per mu?
  ta ha zemren e bardh🤍🥺
   Nooo me ket mood xhannDuje veten edhe nese kerkush nuk tdon. Kerkush nuk tvyn sot.
 t'hanen e kom vendos me qel deri t premten
 kurqysh hiq leje krejt se kërrsh u bo puna
 ke bo pytje pa pergjigje
 jo thash shyqyr qe stkom
 shyqyr qe stkom ty 
 oh faleminderit qe pom kupton
 me kap nji hore krejt bashk e me kcy
 qka nhamam po komenton masi spot han? 
 bravo apedon nji apllaus
 Me Rrendsi me Tdasht Zotti
Kerkush spom don :(
Vleren sma ke dit e tash zemren e ki me plag!
 shuj ti mos kesh 
Dashuria e zbukuron sicilin shpirt veq temin e ka kalb
Sedi do njerz ku e morin vetbesimin mu feju qaq shpejt
mos u nij i huj me mu
 Gjonat e thjeshta jan tbukra
i kajke shpirti po botes ja mshefke lotet..
T'miren kur te hup qat her e vlerson
Kom pa e kom pa amo me ta gjujt edhe t familjes skom pa🤯
Mos e lejo kerkon me ti ngjyros ditet e jetes tonde, se shum prej tyre nuk kan laps tjeter pos atij te zi
Sdi pse najher tmenoj?!
Edhe kosi osht i zant amo luga i hyn
qe qetu tu u perla me sicilin njeri ma thej valla
E kalumja osht si username i snapit, kurr nuk mundesh me ndrru
 hej mos hani shum per bajram se thot ramazani qe menxi spaskan prit
Ndit sodit sa ki pare qaq ki vler
Seni i par qe i kallxoj dikujt osht qe nuk du mem rrejt, senin e par qe e bojn ato mrrejn, kshtu qe ajt shkoni nlesh njo ka njo
 vjen ni moment ku sen stbon pershtypje mo
Vnoja zemres naj filter tsnapit nashta tzbukurohet
Msoju me jau dit senev vleren para se mi hup e mi ra pishmon
Ai e din shum mir smunet mem zavendsu
 haahahhahah edhe un podu me ditt vallah
Dima vleren o budall se qishtu veq mashum je tum hup
A ka naj arkitekt qitu?Le tma bon nji plan per jete se hupa krejt
Krejt gabojna amo ti e tepron
     ani apet skana keq
 sthash qe edu 🤝
Pse met dasht kur nuk em don hajt pse
bashk me ty se koke unt 
 qeshtu pra mamir hahahahahhaha
 gjymsat i paguj un e gjymsat ti hahahaha
 dashta me thon qu hajde shkojm hahahahha
podu me pas dikon qe mthot hajde shkojm hajm buk sa tmujm e jo ato qe e bohen kishe spo hajm sen🥱
 e kom kuptu moti un e dashur
 let knaqen se qat e presin djemt
 mos e lexo, mos komento edhe nuk nervozohesh
 joo skaa asnjo tybe
Pytja e dites:A ka djem qe "nuk" tradhtojn?
 ma e mir se ti jo🤝🥲
 eh po pra ajsel🤝
njerzt qe sjon per veti smunden mu kon kurr per ty
Per momentin nitali sosht ka jetohet 
Ku jeni more o njerz
 A ju shkrun najkush najher juve veq me ju vet qysh je?
nqofse dikush pret nji sms prej meje 100 her ndit i kisha shkrujt
 Veq n'menen teme po t'rrihet a?
Krejt e gjeten at personin me kon me fol dei nsyfyr perveq meje :(
Thojn shiu tbon romantik, mu zakonisht em bon qull
Disa njerz jan si lakra sa jau hek livoren ju del nje tjeter ftyr
Dashni osht kur un sjom e ti prap mdon
 - Po du me shku n‘kosov - Sigurt e ki gjet naj kon qe po lyp me shkuSHQIPTART
  2 ekipa se 1 pak esht 
 15 vjet fmi po bojn e lej mo mu feju
 qe merre mo se qe 10 je tu i pij e nuk tqes mo  
Sado mundesi tu japesh njerzve, sado shum her ti falesh, sado her te mbyllesh njerin sy per hire te rendesis qe kan… 
Mos ma uroni mu se so festa jeme kjo
Na qe jena single a me flejt tash?
qysh t'zhgenjejn njerzt qe ju beson mas shumti🤷‍♀️
 E pranoj qe t'du shum,S’um vje marre
 meno para se me fol
Nuk esht marre mu kallxu se je musliman o popull🤦‍♀️
Thirrum kur je keq veq mos harro mem kujtu edhe kur je mir
Lulet jan vyshk se pa uj i le
Najher duhet edhe met dasht e jo veq me dasht
 kerkush sum don mu :(
A thu a mke dasht najher?
Fotografia e personit t'dashtun mahet nkulet me kujtu qe so jeta krejt te paret.
se po pres ty me qel, qe me ardh me t'mar erë
Ku do qe ke prek shej ma ke lon
A din sa shpesh m'doket qe pom fol n'vesh
Mi ringjalle krejt ndjenjat kur ma bone je e jemja
Qele telefonin t'kom qu zemra
veq per ty po ma nin
Berllogin qe pe qes une pe mer tjeter kush
A jeni bre normal ejjj
Ska nevoj hiq me kqyr lajme per termet qe bohet tu kon qe mi kqyr snapat qe ti qojn mamir se n'lajme
TRADHTIA SO GABIM e perserisTRADHTIA NUK O GABIM
T'lumtur ninstagram n'realitet a thu a jon?
A ban me fol, a ban me fol?
Te un deren qel e ki nese ni dit don mu kthy, se e kom qel personalisht n'ftyr me t'pshty
Do njerzve edhe realiteti ju bohet anderr, e mu kurr andrrat realitet
Zemer ti i ki syt e tradhtarit
 Nese folim per qytet t'bukur❤️ 
Shyqyr shti mjegell si shof tullusumat
Dita e 11 sot qe jom tu i kshyr krejt snapat (storyt) edhe e kom vrejt qe dy femna e keni te njejtin frajer
Mos e prit met dasht dikush qe se don as veten
Kam fal njerz qe sum kam kerku falje
Ala maj shpresa nty 🤦‍♀️
Shqiptart definitivisht nuk din me komuniku/debatu. Nese dikush nuk pajtohet me mendimet e tua sdomethon qe meniher… 
Mkan dek ndjenjat qaq shum sa qe edhe pika dobt mo sum dhem
Qysh me ta fal zemren un kur ti ke nevoj per tru
Du me dit kur i mshel syt a menon per mu, a menon per tjetren?
 From "shyqyr qe t gjeta " to " Apom fshin apot fshij?" real quick
Pse ta kom kthy follow-in sdomethon qe m'intereson o njeri
Vlera jote nuk varet nga mendimet e tjerve.
 nashta msohesh pa to, amo kurr nuk e harron qato qe e ke dasht
E kom zemren e madhe i zen edhe hejterat
Pe du dikon qe veq mu em don
Deri sot kisha qel oqean sa kom qit lot
Me mu se dashte jeten ti
Ka me ardh koha ke mem lyp ti mu po KURR sun ke mem kthy
Nji njeri nese mdel prej qefit 1 her, te un ska kthim mo..
Qysh kan thon: 'Uki kimen e ndrron por zanatin se harron'
Per me i pelqy nji djalit bonu vetvetja qajo qe je e jo me u bo kurv.
A ka njeri qe ska foto t'syve t'vet ntelefon?
Edhe tradhtin ta kom fal, qka po don ma shum prej meje???????
 Pse duhesh mu vesh si bitch me i pelqy atij?
 Mu kan thy mkan met mshel krejt sun pi qeli kurqysh
 e nese del burr 
 veq sit dush mu martu ntzez ta gjej najnjo
 sa t'dush bonu e mir me njerzt, ata apet e bojn t'veten e ta thejn zemren najher
A ka njeri qe t'don qashtu qysh je a ska?
Po dallohesh qe spe bon prej zemre je shum i rond me i pelqy ni femre..
Mos i hap dritaret e zemres pa e pa motin.
A keni edhe ju dikon qe e urreni shumm hiq pa e njoft ?
Qysh keni qef me pas emrin?
 Djemt per me meritu dashni duhen mu kon burr e jo mu bo kurvara e mandej me lyp dashni🤷‍♀️
 Nuk e meritoni ju djemt
Nashta jom idiote, po sjom un femna jote..
 kom shum sene mi thon po kur po du mi thon me fjal tutna sjon tu mdal boll
 qa po komenton pra?
 po qe de pse edhe tani thojn sdojm fm kurv po ti qasi i ke qef
  sdi un hala skom pa
Jom lodh me dashni fake
Un prinderit e mi si luti per kurgjo e pot luti ti a? HAHAHA
Un jom qajo qe jom e jo qysh don ti me kon
Sa keq kur dy persona duhen amo smujten me kon bashk🤷‍♀️
Mos i besoni kerkujt
Po qfar njerz tflliqt ishi kon be  phu
Te gjith genjejne...Dhe un bej sikur i besoj derisa lodhen, pastaj u ofroj nje karrige qe te ulen e te thone te verteten.
Un edhe armiku im kemi shum te perbashketa... ndoshta nuk ngjajme por te dy merremi me punet e mia!
Jeto per qefin tend dhe jo per ti bere pershtypje botes. Sido qe te sillesh, cfaredo qe te besh bota njesoj do te te gjykoj.
Dashni osht kur une s'jom e ti prap m'don!
Pse po merzitesh qe ki jet t'keqe? Ki ni familje qe t'don edhe osht afer teje prej momentit kur ke ardh n'ket jet.… 
Ta boj jeten sikur nprralla po spo du met bo pallavra
Dit ma t'keqe se sot kurr skom pa
===