 Hajt se ki edhe prej atyre qka ta reklamon hixhabin e nikabin npublik.
Sahabet i braktisnin punet e dunjase per te kryer namazin , ndersa ne i braktisim namazet per te kryer pune te dunjase...
 Ama me mbulu trupin edhe me reklamu n'rrjete sociale nuk ban
 Ket qe po thu qs dijetaret nuk guxojn me than.Kjo dmth se kot edhe qe falemi nese bejm gjunahe apo diqka?
 Kurani esht ibadet ku Allahu e shperblen robin e Tij.
  Po pik spari haram esht me ja kthy mesazhin,
 , prit ti prit 
 Ktive pa mbulesa pale sa ju bahet qefi, meniher me at fjalen: "Ma mir nuk mlona sesa me pantolla" 
 Qe ta paska kallxu ni vlla.
 A nuk esht turp ni fm me mbules me than qesi fjal?
 Kan ndryshu njerzit, se koha esht ajo koh qe o kan edhe n'kohen e Pejgamberit alejhi selam.
 Po nese jep shenj  per me nguc?
N'bio e ka No Dm, ka ana tjeter llafe muhabet.Kuptohet që smundesh me u ba melaqe, t'paktën shejtan mos u ban!E huazuar
Pse spo falesh?Tha skam abdesPo edhe une nuk kam pas po morra.Askush ska lind me abdes.Hoxhë Sadullah Bajrami
Nese dikush e kritikon mjekrren tuaj ose hixhabin, mbani mend se ju jeni ketu per te kenaqur Allahun jo njerezit.Dr. Bilal Phillips
 Hec voto ata te cilet i kane largu motrat nga shkolla per shkak mbuleses.
 Me ni qosh n'Mekkah
 Ka meritu dikan ma te mire se ti padyshim!
Ku ke pa ti me vëndu shami edhe me hyp n'ker t'huj?Hoxhë Dhulkarrnejn Ramadani
 Nese sfal namaz e nuk lexon Kuran pse jo 
  Per fat te keq, sot nuk ta kthen askush.
   Nuk vlejn kto per injorantat, ntm.
  Se nese se ke namazin tjerat kot qe i ke.E kur e ke namazin dhe ato te tjerat, atehere te gjitha i ke
  Thash se ki vet, pfff
 Pse nanen larg e ki a?
 Ska Twitter nana jeme !
 Djem ka ama qika jo 
 Edhe kur ki mu feju ki me kallxu se tkan dhan a 
Rrena e djemve:Nuk t'lo asniher !Rrena e femrave:Skam pas kurrë t'dashur !E huazuar
Disa jan ba gra veqse !  
 Ani se me mshel prap del dita mos ki gajle ti 
 Abdurrahman Mossad tknaq krejt.
 Falja e namazit, leximi i Kur'anit!
 Na e korriten shamijen e hajt, te mjeret na.
  A spo dini me kuptu a qka, hoxha e ka per qellim per ato qe thojne se smuj me u mbulu se duhet me punu.
 Nashta e kan pa se dikujt ja ke dhan mundsin 
 Femres me shami si ka hije asnje send nese e njollos shamin.
 Ku esht ky vend?
  Popo,masi ki komentu edhe ti 
 Nuk eshte e hijshem me pas shume follow dhe me ba dawet me djem.
 Sa ja dhash kafen, flm 
 Epo nese ban fraer qashtu tgjan
 Qesi shembulli je per ato pa mbules a?
 Me do postime po
 Nese do me pa budall hyn qitu ntwitter krejt i shef
 Djemt: Nuk tla asniherQikat: Skam pas fraer asniher
===