Ju grat e martaume mo postoni foto me bikini se gerdi kini lon.Nuk vu ngjan
Sedi pse en bitmojin snap kurv e bon ?
ju xhi hini live nuk ndezni mo.
 e gjeget per pussy
ju femnat xhi kini shom lesh ka komet mo veshni pantulle tshkoçta ose tshkurta se ukubet a.
 ta dell mje bo me kt snapin
ju xhi thujni sma ka kthaj msg lirisht hupni
kur ti frojni buzet 5ml foto xhi i kini pas ma para fshojni se gërdi
Mos dilni mo kengtar tri se na kini gerdit zdim ku ti chojm en ckto xhi jon
cat Encen e kisha mel para iftari.
i ka mar paret ene cac gode o tdale para popullit tthote po une i mora ,ne shiptarët nuk e dina xhi osht ti bojsh m… 
Catinve njerzive xhi vu a mtek sot Allahi ,valla mdhajmen.
per ju femnat kur skini g tboni 
ah rinia xhi u bo, u dhi ntoo
a ma kan gerdit vec mu sot cket filterin GOOD DAY 28.04.2019
pi do caullve nzort ie ta kesh qif en dni kengtar se bardh ta bojn
sall rina me taynen tperlahen skaa ce shtaj en shyretja me motrat mustafa tbojn pak fam
e diell be mos i ipni vitit siklet me pantullet e ngushta en vothet kolar, veshni trenerka oj bija
Femnat te ne.Snapi skallxon gjali majr o 
cello mos u prekni a, amn en me shamoj en shminkat 1 kill valla hich nuk shkon a.
en budall en  ataj mbas emrit nuk shkon hich
cato femnat xhi bojn video tu kendau far besim nviti kajn ?
ato me samsunga renaveca tmdhi a
sen e kuptova sot per callen gjini ke 8 marsi
buri madh shkrun Hmmm...
Hala nuk tdu cac shom sa xhi passat ti vi me emrin tond lockoo
mi shofish sajt e kuch en mendojsh se kom kajt per taj ?nauk lochk mos e rri vitin traull jom
mi kallxomi chato emrat e crushave teko se mshkon shkusllajki
kit ato xhi u hupen prom ka nja 2-3 sahat edini rendin ku kan festau
A ka mbet be no dnjo pa me e var shenjen e policis te bafchirja nrab ?
 Ca kari jom te knu vlla “po mvyn ni femen e thjesht asi pa make-up”
sen i paramendoj kto 8-3 xhi bohen si gra tvogla
ju xhi na kini follow ninsta ene sbojni llajka diktoni kit se per haxhuzellajk rajni ataj
sem dilet be nise me raben e kerkuj nfoto kur edi se so e jemja
Xhi kerkojni pi chati gjalit xhi ska mbet femen pa e bo follow en pa me ja lip
 a ngjojsh?thajrem ma von teta jap hunden se te une e kishe harrau
gruja madhe i fall in love in kokaina
shiqir xhi u bo S4MM i famshem en krenar ina en kit shoket i çiti pi krize
Perzotin shom selake dukeni ju femnat me at gurin ndhom.
a de bini nmend ju gjemt xhi vizatoheni ka floket a nauk
ju gjemt mos postoni foto kot se caucat nuk va bojn replay
va ka chi npick S4MM
du ta kem ni burr per tbo foto theshme
kurniher sva kom kuptau qellim chative xhi dalin nfoto ene e ven doren te ftajra per "burrat" foli
Un si coj foto kur du ta hipi scoren 
shom kosovaret kan najs follow nise, jon aktovizau! A thujni o pun letrash kjo 
chach baksuz xhi ina ene per letra sdna mare kerkush
ku jon ato ngordhshat xhi kur skishin fraer thujshin mu sn em ndalen krekund
ckjo pick motre ishalla sem del mo 
ckto memet me sinanin ma kan gerdit instn
 qfar dite e karit
 a flish ? po jom tu flet
njerzit me ni taur muti nkraje ku e kan vendin e vechant ?
nike en adidasi duhet tvu paguje dns ktive xhi vu bojn foto sall pumave
+a me pupG d rajsh a me mu -normal se me pupG be lock se taj nshpaj d rajsh buk d bojsh
u mbajta tu mendau se jom tu jetau ndubaj 
hej be do lipin me va vra traunin
kur dush ta nemish dikand thuj u bofsh kaps
dhe vajn aj momenti kur tpordhish o ma e rrendsishme se do njerez njet
i ka promash veshet 
nauk tha un sfrajgem pi kerkuj, a llafet ndm kit unsent i bon
mirmnegjes kit ju xhi si cauca shom gjem tmajr ini.
kur ngrajhen çato do sorte folin per kultur edukat kuedi xhi, mvajn tva çaj krajen me cigëll tkuçe xhi kina lujt çizga
kush ka thon se maca sbe nshpajn? 
si lam rahat kto tlgbts ta vrasen bithen
i kom qif chato njerzit xhi skan kok vneri
jamkammejrshaumpërdhunim trauni.jom, kom, majr, shom❤️
a zdrau pi toçaki 
kur i shof do njerez e mar munoj vitin
kitve ative xhi vu gjeg posti fajten shajn 
gjemve me blluz pembe si vu thujni ju ?
aktoret ma tmajra caucat e shpajes
Rina ja ha peten Cradi B tha Ferro
ma bojn ku e ki ex-in, vu thom qe e kom dhii n'too
cauca "ku po kalon ti per mu o e kalume" a harroj se ja chiti kit tzezat vitit
ishalla ju chiftet e ardhshme nuk d cilni mo profila Mr.Mrs
anuloje at bitch. Zdish pi ka tja najsish
gjali sa viti ja bo a del nfoto e thajme bithet ti duken
hajt xhoma ni njeri xhi sosht per tja chi familen
burra tmdhi gra tmdhoja vujn per snapstreaksa
nuk edi ju aman un per viti sjom hich e knachet me ket punen e Evropes, se kit tetova sall ka 1 muj de kesen struj mujn e 2 dva presin
llafi ma i perdoret nvorim "raj mom cho tcheshi shtaj"
hajvari u sos se specat ka 5milard u bon, najsim me turshajat me lakna
dhee praaa te dashur miqq, shkllup me axhen neser nFax.
kuedi be shtaj, kan qif ti postojn 5 foto per 1 dit
gjali Tunes kur da kerkoje nonen e vet ngoogle de dale me 10 bura, paramendonja ju nonen tuj cashtu xhi i kishi bo 
kit kini pas qif ti thujni motres/vllajt taj tkan marr pi ndom
kur thin viti nqiff 
 e virgjer tha lindish nuk bohesh, aman nket vaket en u bohshe
kurr mos vu beso ative xhi tthujn prajt dt thajri ma von
neser mo dilni hich tvotojni, se neve kshau si sorte xhi ina sna pranojn as me at emrin nEvrop
buta kit o tu mendau se killshot 2 de jese per at e rrin vitin
si tvu kallxoj ktive femnave tona se  barki perjasht buzet e kuche en highlighti nuk veshet en nuk vihen npajk tdrekes.
Mo kishin kon statusat nwhatsap sn da kishi mar vesht ku ka shku misafir nona
pse rrojn be kto njerez njet kurxho sjon a per ditlindje jom queen/kings sen i mar vesht
kota 3 lloje njerzive : picka familepicka avradipicka motre
ktau te ne nTetov nzort ie en me tw tmiresh se drit ta bojn ho bee mos u dhaj se nuk ie taj dni njer i famshem a dn… 
kjo dunjoja shom e shajshet kisht kon si me e li me marmallad , tha njoni xhi kisht shom pare
nDonsk si me kon pa pare sollariumi katron ausllanderkat e donskes rajn
buri madh e ka mbush profilin kit zemra
sedi S4MM ku e pa dashurin nket vaket
do njerez per ti kuptau jom ma trond se tegat tfitnes
 Un veq po du me dek n'gjum i qet pa gajle
Kit i kuptoj aman ckto profilat me dimija xhi bojn pyetje ataj nstory ininsta sen i mar vesht asniher
pytja ma e lodhshme nbot : a e ke ndrau orarin ?
Mkujtohet aj vakti nshkoll kur 1dit mshkonte ta mbushi ni flet me 1Sha
Jeta ska kuptim pa KURVA, tha njona xhi e kisht ndajt burrin pi grues
Gzuar per kit gjemt xhi jon BITHAG
ni prshendetje shom e madhe per kit ato gjemt xhi i hekin vetllat, bravo si femna dukni❤️
 haj huppp shtaj taj mke hi nkar skom ardh un te postet toja
 a pse ie fake mendojsh se mund tlujsh karet me kit njerzit ?
 mo e kom shkruj per taj tt duket me lidhje ?
Ma para nuk kan ndajt gjat nWC se skan pas telefona, po skan ndajt se vu ka ngroj bitha pi tftoftit
femnat xhi napushiten jon jet,QR
kishi kon nzort per cat filterin me pirs te hunda, pr kit ato xhi e kan film tven pirs nhund aman si lon tshpajes.
Çonja traunin pak nfitnes se me traupin gerdi kini bo
Cauca madhe shocet e asaj nona jan bo ajo bon kiki challenge
xhumi naten sem xen kur mteken cato gjemt me pantullet e ngushta en tshkurta njer nkoc.
do jan bo ma bajat se xhiza pa krajp
eheee rajni shtaj se va cheli en ni pun instagrami
sedi pse i cellojni profilet e huja ju xhi skini xhi tboni, pse bojni mjerrimm
gjali kit se e ka xhet ni femen ajo i thot sn dalim meniher se ala nuk tnjof, a nuk edi se at se lon tshpajes tdale se vong o
boni be njerez, pse vu vajn inati per njerzit ton kur mrojn dns
shiqir xhi u ftof havaja se njerzit val
ta kishin cellau vitin kto njerzit ton sa i cellojn qeret de ishin bo dni xho sendi ,haj mrsh
shtaj ma shom hin ta shofin profilin tem se postin e casaj gllupes xhi miret me postet e moja, tung
en nvor a legalizau tw a ? 
 oni pshauru gjithditen taj naten sdet bohet
 nuk o e zdraume posht kjo thjesht o mendim njeri tshprehet i lir kryesorja duhet trajtesh pak per tp… 
 a do tta jap profilin tma menaxhojsh tm vesh foto ?
 taj xhi tha qushki far foto ve une oj pussyy
 taj pussy tka mbet haj mo u dhi
sen e kom mar vesht kurniher cket kur ma thujshin mo luj me zarm se de pshauresh naten
ojj Rinaa en golic dil nspot si tdush kot  zoni jot se kallen asnjo.
 po majr mi taj pick famile a do ta bojm dit zie neser per ato xhi sen lujn futball agje nsiri , njerzi… 
kosovaret legjend kallxohen nkit onet a prap sen dalen pa viza kerkund
ka mbet vec en nuçja jem pa me e cit xhaken saunde
Se shipee bohni vetem nraste qishit
 ni kaluse boll e kom
oj dollmo shko mi ha speca mo shajt mend
Tfolim en tngjohna, gjemt nshumicen e rasteve lirojn udh ma shom se femnat.
e ka ngjau cauca nja 2-3 her ja ka bo qifin en i duket viti BURR, kadale be babat ton ka 50 vjet kan bo ala svu duket viti burr
cac haxhuze xhi o, tha en kur fli un sajt i mba cel mom hike dns pa me e pa
ta bojm ni protest ti ndalim cato xhi postojn ka 1000 foto nstatus nwhatsapp
çiravec lindish nuk bohesh, a gllupe bohesh kur tdush.
 pse mi se do gjalin oojjj taaj
Non mi je bo, nuk mund ta mar vesht pse duhet tthehesh si zhab neper foto
oj gjeksho mo u dixh mi mo se boll ashtau ashtau skie kok trauni
A mund ti pajtni nonat si i kan pas gallapet kur kan kon tvogla ?Se un e pajta mu sm kallxon.
au ej sen kishi prajt tpajni piva, gjekshi
neser nsaba sen ngrajhesh ose nuk flish hich ene menxaj se presish tsosen tollovajat ene ka 1 sahati tja fajtish xhumit.
oj strashillo boll mi mo 1 kill shminka ke vu, da cojsh ninfektivna at fraerin
ojj puloo a pse rajsh ntw ka najs tt duket viti cfaggii ?
 pse mi taj a agregat de marish agje me viti a akumullatorr , hej bee ckshau o kur skie lidhje me feen.
nise se kom kuptau asniher, pse vec ktau te ne vu intereson ku shkojn kojshit ?
au be kur i shof cekshau sall thenje posto nstori posto ninsta po hik mi mo tkishe dit cac shom autore de ishe bo, mo grdit dunjon
 taj a desht nesr tvajsh ntetov per iftar mo d xhojshe dnjo
pse be se lat ta bojn chat inftarin de shajfshim en shom veta xhi se kina dit se jon gjem tmajr 
 kurxho skishin kon bjondinat ngat cati Bekimit LGBT-s
 Urime Nata e Kadrit , lutuni tu mos chit foto nstory 
en mo i grah kit saunde se gerdi ke bo mo mendo se kit saunde dti fale Zoti
nuk njefim ne lutje Zoti njefen , kshau xhi pa stori ju lutem
  kur smarish vesht se bojsh like komentin
 po e kom shkruj sen e kuptoj ,mund tma kallxoni
mngjan pak cataj si ato t2 shkurtit nparad 
najsni ta duni vitin si FERRO zbesoj se de zhgenjeheni
Çekshau mgjajn cato ka 12 vjet kur vu hin viti nqif 
Çekshau mgjajn cato ka 12 vjet kur vu hin viti nqif 
smund ti kuptoj kurniher cato njerzit xhi kur smbajn ramazon kan qif tfoliren ce demek une smbaj.
kshau si cauc shom gjal majr kit mjeker mashallah
taj i thujsh PESHKI ajo kit qif mendon se traupin si peshk e ka, a se mer vesht se PESHKIT traunin ja prmendish
boll vet stres provimi en kto neper insta neper snapa neper tw provim provim kendi hish ta harojsh kendi sal kur e… 
 sendet xhi i kom ma munoj;1-tradhtin2-mos respektin3-gjemt me vetllat e marrta
shatkoo ber nmend so e napushitmja per taj oj deve
 Njo pi sendeve ma tveshtajra oshte txhish ausllander xhi ska proteza
    po normal se de kthehm naher tt shof taj LOP tta chi familen tta fajti krajen nbar
    taj kt per traunin perdore, se ajo per dhomet nuk mduhet kari jot intelektu… 
 mut punt.mut njerzit.mut jeta.
    ju picka motre skini trau per tfol si ne per at hani mut
e virgjer tha lindish nuk bohesh, aman nket vaket en u bohshe
   hoo fajtuu se ke mbet cataj pa hi
    msohu mi shqip tfolish ta chifsha ftajren e gjeget hakatish tfugesh nbith m… 
   ju kosovaret ju picka motre nuk kini fee e para her se en motrat tuja nbith i chini
    au be taj pick famile taj twitteri report duhet tt boje
 -çfar cigare pajsh ?+n'varet sa pare kom.
hupni vdisni kit ju xhi se duni, nfakt zduhet ta duni mjafton supporti .zhduknja inatin krenohuni se kina mroj dik… 
aho far sorte ina njerzit ton nuk i duna, me kon dni kengtar pi kosove kit share dja bojshi muziken
oni kit majr smbajsh ramazon per viti aman pse duhet tpostojsh dns tu honger
 ka pare ka fam kit i ka, vetem ment i mungojkan
kit llafet anglisht mer be shkruj shqip cataj si inson mo mu bon shajton
xhi folish mi bi 
normal se i bon kech se sall mut han
 taj mduket i hash koret pa prtajp dta zon frajhem su ndale mo tu honger, ta qift nauk po ta çift Universiteti ho motren kaps u bofsh
mplasi lukthi nise per kto xhojat xhi sn i kapin njerzit me tparen po tpajtin ka 10 her si ?
 Do njerez jon si lepinjet , vec nramazon dalin 
 jom bo nifar harofshi kec ene un, shom njerz i kisha harru.
sot tha o dita e njerzive pa trau boni tagg mora ti boj tagg sdisha kan para
sall ntajm rajn, en gjithditen fle
 nuk i han po i fshojn per 1 vjet sduhet ti presn deri nxhims i hann
 nauk se i frajgem po kom respekt perchat.-Frajgaveci
 -ooo sa heret u kone ngrojt, kur ke ra t’flish?+kush t’tha se kom ra t’fli???
 o baba kur pshtojsh e chesish shkelbazen mundish vech ta gerditish femnen , nauk ta zosh.
kur zdush ti shofesh do njerez bash cater tshkoj dell tbohen
far mileti kech, su mbushem me mend
halis mvajn tvajlli kur i shof npajk tdites barkin perjasht en me shtiklla, a sen e dalloni xhi duhet tveshni naten en xhi diten.
 personalitetin e shumices njerzive e xhish n'diqon t'99denar.
rralloe pak ,grdi ke lon tu i bo follow kit femnat e mundshme ninsta
un spaj tha drog, aman tajmin du ta ha.
kit qif cauca i bon nja 10 foto theshme en i duket viti artiste, kadale mi shatko se ala nuj rajsh ske najs tflarojsh.
nuk shaj tha une se ramazon o ,a kendi u dhaj tu rri kjo so gjunah a ?
cauca kit qif kallxom se napushitet 20000 her ndit a kendi frajget se hala ka mbet pa martau🤔
===