 E paske baben e mencur :)
  Paska me te thirre ne darke se e ke meritue
   Da taka e. Se slozuvam. Malku e podobro nego sto bese, no loso e voglavnom. Ama… 
 Saher qellon naj budall qe e don me zor. A pe sheh se so ka don me dal ne video
E ky a mundet tan jeten me qene drejtor i shoqates?   … 
 I ki nja 2-3 milion edhe ti
 On si misli na fb e da go falat. Ova i da go pravis ne smees da se falis. Osven ako ti fali nesto... mislam na mozok nesto
 ..pune te shtepis edhe burrat kan.Babi im perpos punes qe e bon edhe ne shtepi mjaft i angazhume asht. Na femrat duhet me…
 Ia kan ndal ceshmen nuk i rrjedh uji tani behet dai
 Si me majt sopate ndore
 Njani 100% qenka i joti, per tjetrin nuk muj me fol
 Thonjte paske harru mi ndreq
Ja nin  i shkoi jeta lagt... me i pas une 2000€ nmuj nuk isha ndal duke vrapu
 ky shoqi jot e shkelka
 Te bukur si Jusufi a.s. a
 Sherbimet e twitterit meqe aq shpejte e zbuluat se jam me Besen
 Si e zbuluat kaq shpejte se jam i Beses? A mos bashkepunoni me sherbimet?
 2 faqe? Mos e kopjoni
 Ku e keni? Publikojeni
 E evladi jot kur pastrohet?
 A do behesh minister?
 Kush po ti perkthen statuset
 Si napravi i svoj sajt. Ligavi mu se na zaev. Sto e sledno?
 Mire o me shit syza
Ku je o , ku i ke ministrat 
 Ha ha. Me vjedh shtetin nuk zhbehet po vec me zhbe kshtu ne menyre klasike
 Qysh po mireni vesh, anglisht?
 A spot na albanski, imate?
 A esht me mir me i tregu se ke bo lutje apo mos me i tregu?
Ja sa e do populli  
Nese analizojme me thelle dalin se pikerisht te emertuarit e Alternatives jane turpi i tyre, ndersa ata fisniket nu… 
Po skeni nevoje ti punsoni, boll qirajen e baneses ne Durrs mjafton! 
Muslimant e sinqerte, ma mire per veti, se sa per ngjeti...   Hoxhe… 
 pret klime me te mire politike per tia nderruar emrat shkollave. Zonja Arifi, cfare nenkuptoni me klime me te mire?
Meqe sben dicka interesante te pakten ti perkulet Goces :) 
 nuk e di sa jeni te vetedijshem per kete cirkuz, kuader i juaji, por se shpejti do i dale emri ne gaze… 
Meshkujve me kalimin e kohes, iu bijne floket, pos , thuhet se i dalin. Nje paraqitje kronologjike e flok… 
 perkunder faktit se fakultetin e ka marre apo blere pas kohe, mire u gjind me . E keqja e… 
===