 Typing....                  Per kon ke votu 
 Du n'krah me t'pas qdo ver, se veq ti per mu ki vler
 Allahu e meshirofte, qofte i xhenetit🤲
 Na gjeni tek sheshi Aty do te jemi deri ne ora 16:00 
 Lumturia nuk lidhet me pamjen e jashtme, ndjenjat perbrenda teje do ta caktojne ate.
 Pash hatrin e Zotit, a njeriut, lexojeni. E nisa diten duke e lexu nje tregim te tille, sa dhimbje kane nanat e Kosoves, per…
 Neve si familje t deshmorve gjith na ka dhimt shpirti edhe nfestat mat t mdhaja nuk i kena festu me gzim po me lot, po un si…
 Sot jemi me maska, por asnjehere skemi qene me te zhveshur ne personalitet.- 
 Ylli ka nevoje per ndihmen tone! 
 Sot e morra penzionin, e i qita 30 Euro per Shqiperi. Nuk i harroj, 3 muaj kom nejt ne Korce gjate luftes...e perfundoi ne…
 Senet ma t’kqija qe mkan ndodh n’jetë i kom kalu krejt vet, e mos prit qe ke me mu dasht per support najher
 Fatkeqesisht, te na ala pa e dit cka osht jeta shkojne martohen, do me qef e do se prinderit e saj i thon "qika jem shoqe…
dashni perdit si me pas ditlindjen...
 Ne pergjithesi palohemi perballe njerezve qe flasin gjuhe tjeter, ose jane te "huaj". Mendojme qe dijne me shume, jane eks…
 Shpi' quhet ku t'flen zemra e jo trupi.
 Urimeee, festofsh edhe shume vite tjera❤️
 Seni ma palidhje qe mun prindi me ba o mja permen fmis vet edhe buken qe ja jep.
 a jom e vetmja qe i shof storyt ne insta a me mend jam tjeter kund
 Kur e paguj semestrin heh 
 Fort pritoj me hi ne Youtube , se kur te hi sdi me dal  Feel me?
 Definitivisht dasmat gjo e kot jon
 Perse i jepni kaq shume rendesi, pamjes trupore? Une nuk kam degjuar asnjehere, se dy persona, kan vendosur te jene qi…
 Kur do kuptosh vlerat dhe rendesine tende, disa nga njerzeve perreth teje do u zbehet rendesia...
 "Nese bukuria jote , eshte ajo qe prezantohesh me te, ti je femra me e varfer ne bote"
 Nese dikush ti tregon lotet, dije qe qajo osht dashni e sinqert, se ti po e sheh anen e qatij personi qe kurr kerkush se…
 Haahahhaha qesi baksuzi jam edhe un sidomos kur bohet fjal diçka per nkuzhin
 Only Mickojat m'shohin si t'gjalle 
 Nena asht e vetmja krijes qe i “demton” eshtrat e saja per tet lindur ty edhe vjen puna me i bertit a jo vlla/motra jem
 + Miredita per ku?- Gilan.+ Student?- Jo mac, qe 1.50 euro.+ Urdhno bileten, faleminderit. ❤️ 
 Sot per iftar u desht vet me honger buk pa pranin e prindve per arsye se ata ken npun , edhe pernime smu honke as buka.Po n…
 N'telefon ma shum kom foto tjerve se t'mijat.
 Kaniher ki qef veq vet me nejt mos me pas kontakt me kerkon.
 Menxi po pres per netet e Ramazanit, e me e qetsu shpirtin
 I shof disa me kusherit e vet jan shum t’afert bile edhe shok tngusht jan, a kusherit e mi mvetin mu si e ki emrin
 Sdi pse nuk pom rriten flokt
 Qysh ja kisha fut skip qesaj dite
 Jeta o shum e shkurt per me majt diet
 Kur dikush ska kapacitet met kuptu, i dokesh menemadh/e..
 Kisha vdek anderr t'shpreses
 Pse un jam ajo viktima nshpi teme qe kush do kafe nana jem mkqyr meniher mu
 Motrat e mia be like, kur ato jon nervoz une sguxoj as me ju fol se qarten e une kur jom nervoz dojn me em myt tum nguc
 Kom menu qe di,dei sa jom taku me njerz qe me dijen e tyne mkan bo mu ni aq i varfun sa edhe kom kajt,e qajo mka shty me u k…
===