 Ose shembull me i shkrujt e mos me ta kthy ka 1-2 jav se u kan i/e zant hahah
 Mi dhon zor shum, zbon. Ec mere vaksinen ose qysh thot i preferuari yte ZZ: Vaksajnssss
  Bile jena tu i shit do, sen pi majm shum te rona jan bo.
 Blej PITBULL coin i ka 9 zero, thank me later. :D
 Po na pi dojm paret :P
Tu hi me shpi n  
 A e pa sa fort i reniti hehe
 e ki fjalen per: ose per: 
 Shkurt, dej te vjen vakcina imun krejt shteti 
Veq  tjep "hype" e ta bon lojen e  me komentim me tu kshyr, se per tjert n'minuten e 3 ja futi gjum.
 U kon "qyteti i solidaritetit", "sinonimi i jetes se nates", "qyteti me nji retrofuturistic architectu… 
 Te siguroj qe Kamnik ka ma shume "&gt;&gt;&gt;&gt;" 
 Osht ne Shkup sendi njejt btw
Invazion ne Kosove kete jave.
E nisim te dielen me kshtu sen. 
 Domethon mu si shtetas i ish FYROM-it apo tash i RNMK ky nuk mundet mem kuptu a qysh pi bjen ?
+ Hera e fundit pot kallxoj, nuk jon filma vizatimor, jon filma te animum!- Aha dmth vetllat e animume i ki?
  Aha, edhe per mu pra njo 
  Ku me gjete at kohe per PS i nderuar?
 Albin Kurti e ben zbulimin e madh: Nen liqenin e Ujmanit ka toke. Wait? What? Ai dallon nga liqeni i Shkodres. Pse cka ka nen…
 Kundershtaret e marreveshjes ne Washington e kane vec nje deshire: Mos me na njofte Izraeli. Plus i thoni vetit qe e doni Ko…
 A e ndrron Seroven?
 Qashtu osht be Beni, kallxoju!
   Mdoket spo mundet me kap ritem sdi cka osht tu fejllirat njeri. Tu pas… 
    Po, definitivisht njo prej kualifikimeve ma interesant kete vit.
 Kur po thote Trumpi shumice myslimane po idhnohni, a kur po lypni me e ndertu xhamine ne qender te Prishtines po thoni jemi sh…
 Mos mthuj qe e njek F1...
Oficialisht  i ka statusat ma hilarious qe dikush i shkrun ne FB. Postoi statusat e FB ne TL ktu te pa… 
  HA HA HA, hahahahahhahhahahhaha oh kuku, ne borxhe mdoket i mlum jom per ket sen
  qaty de...te vogla...te rakise..kikirika, fara urdhnoni hahah
 Hahahahaha, a te kujtohet nifar bisede rreth ksaj teme ne nji prej kafeve te vogla (spom kujtohet emri)… 
 Vetevendosja po dojka me e çele nje TV te veten. Paramendojeni kur te fillojne lajmet. Mirembrama, po i japim lajmet. Sot gjat…
===