Naten e mir krejtve faleminderit per krejt pytjet ✋ -  
kujt i doket dosadno gajret se bohet mir ^_^ - Po po ntm 
Lea ose Nita? - Ti e din mos tperzina se spo kthen po idhnoesh masaj leje ..? 
Qato qi lishojn bajata pafshin krima nander - Hahahah 
Ramazan se kesh tu ti qu do selame rafall kshtu po mos ma flliq gojen  - Hahahahah 
Naj kang tmir  - Shkoqijunbithbir jajahahahhaha 
Ajde kan e ka zan gjumi ne ta qoje doren✋ - Hahah jooo 
Ntm kiwista❤e gjum te ombel nashta se kom tep... - To njeri je 1 aaa hahha cao kalo bukur me gju... 
kon e kishi thir ndarsem me knu - Ty biroo knon mir timpis hahaha 
A mendoni se u ka ba bajat kiwwii ? - Joooooooo 
aaa qe kena me mledh pare per bajram puffff - Mos meno bile je ba magar hahaha 
Kush o qut hale hahah -  
naj pytje helbet ? - Kur ki mu martu pershembull hahahahhahaha  
Sa vakt t'duhet per me njoft bash dikon ? ❤️ - Aah as vet se di as et se di jahahah 
Prinderve kurre mos ja ktheni fjalen, lejani seen  -  
Ajt tasho kush ska ra..... -  
Ai momenti kur e di melodin e ni muzike e stkujtohet emri !! a thu ka me ardh k... - Oooo hahahah 
naj muzik tmir :P - Qy fale sabahin leje muzikenn 
Qish kesh tu nejt weq kur a nal rryma e ja nisen me kajt fmija......shuni shuni se erd... - Hahahha 
Allahi kabull namazin ❤️ - Edhe ty inshallah 
kon e kishi rre stupcc - Ti hahahahhahaha  
Paramendo ty qish paramendon tu paramendu mujtesh... - Mos parameno hiq shka ka mu bo bojet hahhaha 
A i kini ble teshat per bajram bee heheheheh - Hahahahah heret hahah 
03; 03 un perweti e kam prit drejt po kallxoj  -  e dii 
I pres pytjet 03:03 - Jajjaha 
Kiwera ju du mas shumti Besoj se sjom bo do... -  flej bre lej pasj familen se gjumin ... 
Pritni statusat 03; 03 mrrinen edhe pak ape pritni ju...un... - Hahaha 03:03 qee hahha  
Aju kam mungu...a hiq... - Sdi ndoshta 
A menoni se shqiptart dojn mu bo ma shkije se shkit. Mshkrujn anonim Kosovo is Serbija... - Hahahah 
Qysh mkishi thir shkurt? - Sanii 
ju boft Mir syfyri ☺ Agjerim Te leht  - Edhe ty amin 
O hiq smkujtohet mdoket me adres qe e kom pas po as asej pasin sja di sjom hi qe 5... - Ooo hahahah 
Kryva pun me ni add tjeter po mujsha me kthy mbas 24 orve  - Off 
Po edhe mu pom del emaili po se mbaj nmend  - Hahah 
Ka ju kom hahahah veq hyna meju pa a jeni knej ✌️✌ - Op op 
Adin kush me kthy snapin ja kom haru passin  - Sdii 
Spaska sen ika ✌️ - Hin ninsta she najse hajde hahah 
ahahhahaha o milet sekam dtl be  - Ani dee kur ta kish qather po tabutpjm pi sonte 
A menoni se reperat shqiptar nuk perparojn tu i qit dissa njani tjetrit  - Hahhaha 
O kiwista qyshh e keni qejfin? - Nice 
Falma nje Jet jetoj me A e ngoni sinan vllasaliunn  Vvlla ee kam  - Hahaha hahhaa 
A e nguut brehh Manjakin tem  ❤❤❤❤ Mozzik ft Kida - Premtimet luw luw...  Dashnin e ... - Ahaha 
A mund  te egzistoj nje lidhje miqesie. pas nje lidhje Dashurie?? Sipas jush ?? - Pooo 
O kojshi akinii Wifi ?? -  
Aa do shkonii npushimm ?? KU kismet  ? - Po jahajhaha nbora bora jjahhaha 
A jeni flejt :) - Joooo 
A po ju rrihet :) - Opp 
A e pinii ?(un jo )  - Oppo 
Njeri gjall gabon.....kerkush sosht perfekt -  
Ajenii single a txan : jaa u lodhaa moo e fundit pyetje koft  -  
Edheee najsen me kallxu -  
Qka po thuni per foton e profilit?  -  
Kto t'tetoves jon hupp kejt... -  
Ka jeni be? - Qe be  
A qeeli be ki trendafil te shkolla mo a naukk..... - Jahahahah 
Mtha a vuni per dashni?? Ahahhahahahaha qe hala tu kesh jomm : -  
Sa foto i kenii Ntelefon ?? -  
Hajde e bojna sikur ndarsem nkiwi   -  
Aamos u bana pak bajat ?? (Drejt  - Jo vallah  
Sa vjet i keni ?(16✌) - 18 
Brune apo zeshkane ?? -  
A i hani petat ? - Po a po na ban 
Aae pelqeni emrin tuaj ?? (✌pakk) - 29.10 
pytja qe kurr skini mujt me parashtru? - Aa mos na ngushtoi 
A ka najkush ma shum se un bateri? (2%) - Op 28 
Aaa shani ??  - Jooooo 
Pse bree spoo shkruni e spo vetni naysen  - Sdim senn 
Qkaa poo banii bee aa jenii gjall tashh   - Po poo 
3persona shka i dalloni nkiwi  - Leje pash familenn spo dallohenn 
Juu past boo mir ifatri  - Flmm edhe ty 
Shihem edhe heren tjeter.....se dola un - Okeyy 
Per qikat- Kush osht kingi juve?Per djemt- Kush osht queena juv? - Aa mos vet 
a jeni kty :) - Ppp 
O njerz dul bajgi bur qAj Anonimi u Prezantu   Resekte  HAHAHAHAH  - Hahahahaha 
Kush osht ka e per iftarin (un po) :) - Poo 
Edhe 20 minutaaaa jo ma shummm - Hajajaja 
O loqka mos keqkuptoni meniher - Joo joo 
a munesh me shtrengu doren fort me ba boks sa tqohesh pi gjumit :v - Jooo 
ju baft mir e zoti kabull - Amin edhe ty 
A jeni kty ahhaha - Po hahahaho 
Kush po vjen me pi qaj hahah - Unne sdi ndoshta 
A i keni mor notat? Un nese i marr  - Sedii kurr 
hajt bone naj pytje mmore hahah  - Mos mos um ngushtoo 
Qeky Anonimi qe po ma lyp Instagramin kush o se djeg mka met em dit  (pls pa rre... - Hajahaha sdii 
Kush po me qaros me ni caj  - Hajde te aktiva hahah 
A i lajtet ent qika  Mu po mi lan shoqja makina veq po duhet me ja qu krejt po ... -  
Hej tung e ju baft mir iftari :) - Amin edhe flmm shumm 
800 followers rrespekt per krejt, ama jo per ata qe lshojn bajate  - Hahahha jr njêshii 
Naj muzik qe ta rrit adrenalinen? - Hahah 
Naj film kshtu nemoguce  - Hahhahaha  
Hej , sa followersa ki , bojm kshu ti thuju shokve tuj ktu n'kiwi tma bojn follow mu e... - Po anii 
Gjall najkush helbet? - Pa rjepp veq hahaha 
Parfumi qee ka eren mat mir sipas jush :p - Chanell 
Qa spo bani more pytje a jeni flejt a qa :) - Joo 
Follow ;  ❤️ - Oooo hAh 
E ndryshova emrin n'Instagram ; .abd  -  
Na qikaat ma shum vujm per me qit qaj se sa per dashni.  apo be qika?  - Haha 
JJu qe me keni kerku fb qe emri ne facebook L... - Unn jom ama qe poo bomi fit fit Erdem zuberi ... 
Kur tvin ausllendarat Pytje e njejt -  a ma mir ktu a atje . Edhe rrena e nje... - Hahaha rencatr 
A po ju hajn mizat breh?? :P - Opp 
A osht naj kush ktu bree - Joo 
A mer veresi nshitore??  (Un po bile me fletore) ❤ - Aaa sjemi tveresiss 
A ju ka ndodh najher diqka qe sju ka ndodh kurr? - Jo 
A e kishe lendu personin e zemren ?! ☺ - Jo 
A ju ka lshu buka? Mu po teper  - Joo 
Pershkrujemni me 3 emoj  - Aa mos e tepro qe me njo boll 
E nova djalin nprofil  A i paska ga mamit vet be  - Ahahha shumm 
Qka thuni a ta noj djalin tem Diarin nprofil a jo?  - Hahaha 
Sa % bateri kini? (Un 6%) - 99 
Are kiweraa ntm, juu du shummm nysa(veq ata qe nuk lshojn bajate, ata qe lshojn bajate ... -  
Arsyeja pse sju zen gjumi bash sot.... -  
Ma dosadno se kur qohet vllavi n'saba nuk paska - Hahha 
Qka po boni nkto momente - Po nisem per npun 
Pse sboni pytje? A doni mem qu me mshel kiwin a ?, - Jooooo ntm see gjumi po thir 
04:04 ajeni qut kiwista - Po ama bay bay 
Ejj......mos bini se heret osht - Bay bay 
Allahu kabull namazin ❤️ - Amin 
insta ??? - Qiuu ahhaha a kana keq hahha 
A kajni kur ngojni kejnga vajtuese - Ncukkk  
Samiikingg njeri qa ju shkon nerva, veq hyni nprof tyna edhe kqyrne sa budall o  -  
Nese i mbyllni syt  _______ ka gjasa te mos shihni asgje  - Hahah djegen dritat 
Kon se kam insta ? - Un tkam ti mu nuk edi 
Shpresa ka humbur, klithma per ndihme nuk ndihet , kurse nata esh... - E bir e ainshtajn je hahahah 
Ju boft mir syfyri agjerim tlet - Amin edhe ty 
I dho krejt qa kamm ........ se du met passs  - Oooooo 
oo me cmendi 2tonii Hala pa dal me ty ja nisa met dasht  - Hahhah 
A ju dokna menemadhe ? - Hiqq 
Ai momenti kur je mysafir edhe naj fmi ta hi shuplak syt gaca ti qet edhe ski shka i... - Hahahahha 
A u lodht bre - Hajde te sera tkallxoj ma shpejt 
Nirvana a Metallica ? - Sdi qysh thujsh ti  
Aj momenti kur je nbazent edhe ja nis muzika qe ti e pelqen :P ^_... - Hahahah tu kcy ner uj hahaha 
Qfar ngjyre i kini syt (un te kaft) - Gjelbert - kaff 
Kon kishi pat qef me pas afer &lt;3 - Sdiii e di e dii hahah 
22:22 a jeni bre te vrejt mas iftarit sa shpejt po shkon koha heheheehh :W :D  - Shumm 
Tu menu qysh me ja vjedh shminkat mamit. - Hahahah 
2TON - Ani nasht ❤️ .. kujt i ka pelqy ?   P's ; mu teperrr - Sdi valla 
Naten e mir te gjithve :) - Ntm 
Naper filma kur hin Prinderit te oda e caullve i bin deres.... aa Baba en Nena jeme ku... - Hahahah 
A ngoni muzika serbisht ?? - Poo 
Joo be spe shaj kerkonn pyetje kee veqq nashtaa sju vrajta nzemer : - Ncukkk 
1 koment per foton.nprofil? - Nice 
Pse  spo boni more pytje :) - Sdii ndoshta ma von haha 
Cilinn sport edoni ma shumm ?  - Basketr 
Ti sja thu asaj/atij gabimet qe i bon veq per mos me ofendu ai/ajo menojn qe osht perfec... - Ehemm 
Akeni udhetuar najher me aeroplan ?? (Unbpo) - Joooo hahha ren hah 
Qetoo qe po bajnn bajate  A thu cka e menojn veten  - Sdi menemdhajj hahah 
A ka naj nja qut more :) - Poooo 
Per shqiptart caucat kurr sen kien shok... - Hahahahah 
Jjaa sonte kiwistaa paskan coff ste kokan as per pyetje ?Po ku jene more??  - Qe bee ti ku je 
Qka po bani per momentin  ?? - Sen tu kshyr folm 
Cilen muzike jeni te ngu per momentin ??  - Muzik romantike hahaha 
Naj film tmir ? - Sdi per filmaa 
A jeni flejt :) - Joo 
Aa m'folni mem pa nayher ? - Pooo 
Frika juaj mee madhe ?? - Me ra pi magarii 
Boni be pytje mos i runi per turshi  - Po de qe 
Cilen ngjyr e pelqeni ?(un t'kuqe)  - Gjelbert qel 
Qka ju ka mshel goja sonte diqka :) - Sdi sen 
Dola e bona ni krug ken tum grabit shiptarhan... - Hahahha a ta bajshin ooo sa e mir ooo hahahah... 
ini mir ini ? - Mir tii 
sa vjet kishi pas qef mi pas nese kishi pas shanc me vendos - 7 
o a jeni gjall - Jo kem dekk 
o a jeni gjall - Jo kem dekk 
A menoni se jeni provokus? - Ncukk 
Cili nr jeni nditar ? - 7 jom kon 
Pantolle apo trenerka  ( un nshpi trenerka nshkoll pantolle)  - Nisojjj si ti 
veq kur e menon me kan milioner osht qef ..... e leje mo me kan pernime  - Hahahha ski faj 
Sa me qef pi lexoj do pergjigje bash po mknaqin a d... - Hahahhahaha knaquu me tmirt tii bukuroshee 
Keni kafshe shtepiake?Cfar kafshe?Edit: - Skomm  
A pritoni nayher me shkrujtt (une perveti po )  - Joo 
Me pas emrin Ndricim edhe asnjeher mos me ndricuee - Hahahah 
shka kishe pas qef me ba per momentin  - Me pi kafe bashk 
A kisha mujt me ba ni foto me tu :W - Pooo 
A jeni flejt :) - Joo 
A jeni flejt hale :) - Joo 
Kiwersaaa Arbesa po shkon me flejt moG'n❤️❤️❤️❤️ - Gn 
A me zhilet a me veet - Hahaha zhilet 
islamin loqk e kam  - Edhe unee 
Qka po kallxoni naj sen ?? O kiswista - Senn  
Kiwi shum pak klienta paska be ku jan tjert? -  
A jeni ksajde :) - Opp 
Kush ju ka than dreq per her tfundit  - Unee hahaha 
Qka poo banii oo kiwistaa ?❤ - Sen tu nejt 
Me mungon prania jote./// Blero  - Haha 
Ju past mo mir iftari e inshAllah Zoti Kabul  - ❤️ edhe ty flm 
Nese mkishit pa Live a mkishit fol? -  
A i keni shti najher gishtat ne shtiker te rrymes per me pa boten 3d, 100% funksionon p... - Hahaha 
A nervozoni leht ??  - Jo 
Emrin qysh e ki a me jep ti mu numrin ❓ - Opp ahha 
Hellouu kiwistaa  - Helloo 
G.M loqkitaa :)  - Gm 
Hey , Hy pak n'profilin tem ktu n'kiwi e mi bo Like Post-et se si kam aty pergjigjet , je... - ❤️ 
Qfar ngjyre i keni syt❤ - Gjlebertkaf tperzimw jajah valla 
Qfar ngjyre i keni syt❤ - Oo mo u muta tu ju kallxu gjelbert kaff 
Po ju ban tfala kejtve Kroacia  - knaquuu ti atjee 
Qysh u qut sod a pat naj ander heheh -  
Hala pa dal me ty , ja nisa met dasht ! :P :P :P &lt;3 (HAJGARE SE Spot Njoh hiq ) :P  -  
A osht e vertet se na shqiptart ju bojm njerzve follow per follow back  -  
A keni menu najher qe dikush o tu tdasht met myt?Un po edhe at qe 2her -  
I dul lezeti edhe kiwit e hajt - Jo be 
U myten tum vet dishka nlidhje me martes...a ka najsen qe sdi un -  
Najkush per futboll  (shum sportiste po kallxohna )  -  
Emri ma palidhje qa e keni ngu n jeten tuj ??   - Xhemshir 
Nese ishi kan Qen kan kishi pas qef me kaqq  - Qenushenn 
ka kishi pas qef me shku me pushu nja 10dit :P - Shumm 
A jeni gjall :) - Op 
Cfar ngjyre i keni syt?? - Gjelbert -kafe 
A pritoni najher me shkrujt? - Jo 
Ku per pushime ?  - Bora boraa (nshpi) 
Boni pytje masi te koki gjall hahahh - Hahaha 
Kush munet shpejt me than"e shes thesin se shes thesin"? - Leje kejt see po jaaa ... 
A juv ka ardh naj ausllander? - Jo 
jemi  duke planifikuar nje darke(iftar) te bukur por mund te ftoni ve... - Hahah mos u harxhoni moo 
Un- Mam qe ne autobus jom.Mami- a u lshove pi shkolle a?Un- jo e kam mor autobus... - Hahahahahha 
Kush po don share profilin, ama share back  - Sdiii qysh dushh 
Jom ka e msheli kiwin  - Moss o bir mos gabo se tvras 
Shum sick app palidhje o bo 3 dit ke ntrendt u dhi tani  - Hahaaha 
Folni naj sen more  - Fol tii de  
kot a patjeter duhet me bo diqka si te falenderoj a kot jerm  - Sdii 
Follow , follow dostinn Enis667 shum djal i mir osht lum shpija qe e ka valla . ... - Domaqinn koka 
Qka thuni mu qel ni faqe per shoutout nkiwi  - Ooooo 
Ku keni lindur?? - Nshkupp nfakt nspitall 
Lajmi i fundit : ! Hera e pare qe nuk ka Lajm te fundit ! :)  - Hahahah 
Shum Lindin meshkuj po pak vdesin BURRA !! :v A je dakort me mue bre ? ?! :P  - Poooo 
A ju ka marr malli per najkon?I miss my grandma - Sdii sen 
Respect per ata qe i bojn shoutout vetit  - Hahaha 
Qka jeni tu bo per momentin? - Tu nejt 
Mirmengjesii ✌ - Gjesi 
Dikush mka mallku shum keq....saher adapterat e telit mprishen -  
Ej kiwistta si ju komm ??  -  
A besoni n'dashuri nshikim tpar?Un po -  
Qone ka ni foto mat miren e la nprofil dej neser qesi kohe. (masikr... - Leje be shnosh qeter her 
Kush osht ka e kqyr feriden  - Jooo 
Fmit e sodit shum tpshurrt jan apo? - Po 
A frigni prej qenit .. un jo ama kur e shoh mvje ni qef me garen  - Haha 
Dej parzit sum ka bo kiwiii - Puna madhe  
En vend ka en tu qeras  - Ku osht ajo hahahah 
Po du me adoptu ni fmi shka po thoni ju? - Hahahh 
Shkupjant a Prishtinalit a Tiransat (facera)✌️✌ - Shkupjant be fsr pytje 
Ku jeni ju si te dilshit sonte me mo su shoff  - Hahah 
Ne liburn jem ajdeni krejttt ahhahahahahahah - Kuu osht ajoo 
Xhinset a pot vin ty tamam ? - Shkaa o aj sen 
Mafli qe spo jav kthej skam koh mjafton meju pyt sorry ✌️ - Aaaa skaa ashtu 
Pershkrum me nje emoji - Ska per ty emoji 
Qysh po kaloni  kako e ide haha  - Pa aj taka ide nekako dobro ee mir mir 
A ju ka ndodh tu shku per nbazent edhe me ja nis shiii?? - Po 
A keni mem kqyr me 27 shtaor a jo  - Sdi sen 
A ka naj sen a jo ?✌️✌ - U prish 
Ku ju kom o rrusha  - Qe vala  
A miskoja ka a mu mduket.... - Sdi e kshyrmi nsaba a jena aj a jo 
Pytje ?? - Skaa moo  
Kur ndrroher ora Krejt njerzt veti. sa na bjen me punu 1 or ma ... - Po pooo naa mo shqiptar hesapi 
Edina rexhepi flmmm shum per foton qe ma mundsovee teper flokk tmira  - Leshh nejse futja naten  
Pale si i ecin centat ($) ati si e ka krijo kiwin  - Jahahahha 
Flokt kaqurelee leee ka ju komm bre naj foto ... - Nuk kaa perinati pse sma shkrujte emnin lesh ... 
Ruju djal mos pi uj pi qeshmes tshtetit tdhamin brit bubrekt kur stvin nveti  - Bomba 
Fal dashni gjen dashni jep tradhti gjan tradhti - Hahahha 
Si mendoni te boet mejr fusioni a jo  - Sdi ti si thuu 
Qysh e titullpjn videon njerzit tjer ( My the best video ).     Shqiptart ( xhevdeti... - Hahahahah 
pak si teper u bo a ?  - Poo po ajde tatmii 
Te vin dite te zeza en per ju te kiwit hahaha - Hahahha 
Kallzone dallimin mes katunarve edhe sheherli... - Kurgji be leje se fillma jan atoo pse jena sh... 
Pun e madhe qe sum don ti kryesorja mickojat ... - Haahahha sdi sen veqq kur pomm puthin piset h... 
Kta qi  po bohen dordhant i bjen si kur mu kan gjakovar e dordhant  - Hahahahaha 
1⃣-7⃣k flm per pytjet qe i boni ❤️❤️ - Aa e teprove 
Ikëm mu fal , 5min iq mashum .Ikni edhe juu  -  
A ju rrajhet.... - Hiq po pi zorit 
nese do me dit kush jom vetem me kon ri  - Me islamin mo qija nan un autobs skisha prit me to ... 
Nese ishit kon kryeminister ca kishit bo - I kisha zhduk shqiptart se spo kthjn followa jan ba... 
Shkup mos me na njoft si n'Jamaica mos me pi barin  - Hahaha 
a qoni jerem bee hahahahhahahah?? - Hahah kesh tu dal npazar nje natt 
Ni person qe smundesh pa ta hiq  - Aaaa mos u prekk 
Qka menoni kan du me shpall mat respectushmen knej pari gjinin femrore 1 m... - Erdemm bosii ahhaha 
met zan gjumi tu hec edhe naj banderit me kam  - Hahahah 
folin per alltia a nxhep mbajn chokollada  - Hahah bllok 
me ni park ishte perdhunu ni plak nesrit parki ishte m... - See doj plakat me hanger ncncn edhe tii 
Pse hallkit gjith po mrrin ma shumm  - Se je a tfort bashk me ji shok qe ka mri 1,600 
A mamir jasht a mrenaaa - Jasht po mrena ma mir be prap 
Mos e deletni (fshini) kiwin se po knaqem muh... - Kusmet neser 2:00 delete kiwin se spo durohen... 
Jeta osht e ketill si ne kupatill bone rshite... - Ruju mos tbje sapuni nburg bir se po ta qajshinn 
1Koment per foton e Profilit - Je najssss bre ska fjal 
Laja kamt e pija ujij  - Hahahhahaha  
O flm per mirpritjen kamejav shkruj emrat krejtve mat veqant qe ju kom... - Mu tparinn se tmys haha 
Qysh um kishi pershkru me 3 fjal t shkurta  - Sdi valla sen hahahahah 
Andra juaj qe e endroni shpesh  - Sdi senn per endraa 
H ose hahahha - Ahaha 
ju pas bo mir sifyri &lt;3 - Flm edhe ty 
Do njerzve sju vyn hic brezovica kan rrshit motiii  - Haha 
a ta ndrooj foton e profilit - Profili jot  osht qat dush bon 
Ka kon gjit ka.kon .....vazhdojnja - Nime ni than 
Qfar sy kini qef mi pas fmn / fr juv  - Gjelbert 
Syn a syn syn ?  - Fjolla morina hahah 
Bashkjetesa a martes ✔️ - Bashkjetes hahah 
Tomin a xherinI - Xheriii maj lovee bahah 
Najj poezii helbet ?? - Sdiii smirna me to 
A ma mir shok/shoqe a fr/fm per juve  - Shok shiqe ma shum muhabet 
Erdha nysaa qysh kalut ❤️ - Najs 
Vazhdimi.. ; Ti me je si peshku nujj un per tajj paj cigare me strujj per syfir det boj ... - Hahah 
BardhEzi a ZiEbardh? - Bez 
Qaq ke per sonte ajt ntm kyss e keni❤️❤️❤️ - Kis kiss naten e bukur 
Oj taj cauc , taj cauc e majr kush ta fali tajj at ftajrr oj e shajshet simpatike je g... - Hahahah 
Dola pak jasht mos fleni kthena kiss - Hahaha 
A a B - Sdi A ja ma shum terheqsee 
Qka menoni para se me ra n gjumm  - ❤️ personin 
okaxha a okala? - Sdi qysh thujsh 
dicka ju nal punaa kiwitt  - Hahah 
Flm krejtve erdha plasa e hajt se smu hanger shum iftari e syfyri pak shumm e... - Cigarjaa naksion 
Ju boft mir syfyri - Flmm shum edhe ty 
Me mshel kiwiin ,se kallabllak u boo , po vlojn bajaqoort - Rrij be pash mu 
Qka ju pelqen te une ( Pa ofendime ✌) - Senn hahah ka 10 met kallxu valla u lodha 
Ika me mush rezervarin qyss nihemi pas pakë kiss  - Hahah 
Ulqini vendi ne te cilin muti noton  - Pooo 
1⃣-6⃣k danke shumm - Per ty i bojm 2 k bir pa gajle 
Ajde syfyri erdh ju boft mir kthena :p - Gjitha.... Edhe tyy 
A sufata a hapa  - Sdi senn loqko  
A keni naj shok qe tpergjigjet veq me PO-JO . do kan nis veq k... - Hahahha po aa ahahahah  
Snapin e keni prevarit keq e kini qit n'klluq  - Haha 
A keni kerku bostan hiq  - Kom gjbi sot niftar 
Pse pula kur pin uj e qon kryt tenalt   - Gjeli e pate fjalen kshyr a ka vakt me ta bo at punn... 
Kiwi a kiwii - Sdi qyh thujsh 
a ma mir dashnii a shoqni - Dashnii 
A rreni shpesh ?  - Shumm hahah 
a pot rrihet - Sdi  
Ej a ju kan marr edhe juve gishtat ndezje breu  - Joo se i komm ushtruu hahahahah 
A kena me shku nxhami be ? - Sdi senn mashum jo 
Vllazni e Motra pernime jem tu knaq as nkoh t... - Hahahahahha live ska qekaq e nannenn " thann ... 
===