 nuk e ki femren e bukur veq pse krejt kthehen me kqyr, femren e bukur e ki kur ti nuk kthehesh me i kqyr tjerat
 “Po t’lutna ma mire t’bjen me shku sa nuk o vone,Ma mire njeki andrrat tua, lej kujtimet mu harrom,Harroje krejt dashnine…
 Spo ti kthen ala a
 Bruhhh emrin emira ma ke lannnn
 1 rt, edhe i shkruj simpatis.
Ti je pjes e imja, e un e jotja
  Khuuuu qe pom nervozon, a vec bojndinaaaaaT jan tbukra o hamam?
 Ti kqyri yjet ! Nuk ka me tu rrit buxheti, as skan mu nal luftat, as ska me ta rregullu lidhjen! Ama osht e randsishme m…
Ti doren ma ke kap..
 Damn it o burim a cekac e kerkume kana xhemilja jeme a
 Ndroja emrin xhemiles se u tranuu
regulli nr1: Jep cac sa tjapin!
 lajtem lesh n'moshen ma tmajr
E kur je vetem ke me lyp po ske me gjet as veten
shqip: sheqerpare anglisht: SUGARMONEY 
 mashum ksi se asi?
"Krejt po folin rrotlla, musht me rrotlla bota"
 Ermira nese e lexon ket; tlutem mos e len profesoreshen tm shenoje.
Femra ka nevoj per attention o hamam
Krejt cka dojm duhet mi bo, e mos mi lan pik nzemer
Nisi at'her kur un mendova se mbaroj gjithcka
Imazhin tend e kam tfiksume nkry
Endrrat ma tmira fshihen me premtime
 momentet e para kur mri nshpi; 
 oj shipni kthehu en niher ermofsh prf.kimete.
Po du me ik diku larg qytetit me dhez cigare edhe me fol deep conversation .
 Po e pelqej shume zanin e hapav t'mi kur po largona prej senev qe nuk em meritojn
 çkan kta njerez shikojn n'qiell.
 Fakt : T'shtuneve edhe t'dieleve nuk ka shansa teorike me msu.
 o crush, saher ti thush atij  "BURI IM" ki me permend emrin tem. kuptoje vet tash.
Edhe koha ka nis mu bo dyftyrsh.. her vrant her me djell
Se une jam pi najn
 .           /     \          /         \          /        \      /            \       /                \  / diku lar…
 Vec 1screenshot sa per tash se tan diten 70 
 aj qe thot un sjom ashtu, bash çashtu osht. ligj.
-a un tkom bo ty a ti mu ?
 Reagimi jem kur ja dham dhuraten profesoreshes e pastaj ajo tha hapni librat nfaqe... 
 M'fal mos je shkrimtar, se veq me fjal i ki kejt veprat, kurxho tjeter.
"Sa ma shum me faca t'reja t'njoftoheshQaq ma shum gaca tjera shplohen"
 Boren se hek shteti prej ruge, do ta hekin ato frajerat qe femnes ja kan hek krejt djemt e klases edhe shoket prej instagrami…
O pasha jeten pitet i du ma shum se veten
Sot je veç ni anderr qe ma prish gjumin
 kur ije tu bo snap, en t'leviz filteri: 
"Qysh mundesh me ndi diqka tvertet, prej ni njeri fake?"
 si besoj vetes si u besova un juve  mor vëlla.
 Nalet rryma kur vjen thom 'flm o ti qe e krijove rrymen'Vjen rryma e kapi telefonin 'flm o ti qe e krijove telefonin'E…
ndoshta ti je andrra dikujt
 Kur pleqt ka 60-70 vjet i shoh qe kur kallxojn dicka prej kohes tkalume ja nisin me kajt e kuptoj qe koha nuk sheron plag
Kur tshpis tbertasin pa asni arsye 
 +--+(RUJE cat person qe mund tkomunikojsh live me kto ftyra)
 Une veq uj me pi ja nisi menoj ne cilin muj jom 
Un jom njo prej atyve qe mytna tu hang e prap s'trashem
 un jom si streaki, 2dit tm losh mbas dore, mke hup.
Kupto qe jo gjithkush o i/e mir si ti
Justin Bieber- Kush te ndau prej meje 
Nota e testit t matematikes 
Femra o si sapuni, nese sdi me majt mir ndor t'hik
Bocoo mos prit met besu ty kur si besoj as vetit
Njerzt jan tu ma tesh
Amo amo yjet nalt..
Shum kisha dasht mi turn off menimet nkry
 friksohem ta shoh n'sy se do e kuptoj qe e ndjej.
 problemi esht se ne kemi njerez ne mendje por jo midis krahve.
po du me ik diku ku as emrin nuk ma dijn
 Bash kur qohna mu bo gati per shkoll gjith i menoj tjert qe knaqen tuj flejtttt
Dikush o njejt si cigarja, digjet per dikon e nfund prap shkelet.
jeta o shum e shkurt mu mar me MIZIVIRA
 TU MENDU QYSH MI HEK DO MENDIME PI MENDES.
 Si je?-si alarma, me ra KEQ, mes ra KEQ.
 S’po kom nerva me debatu per gjithqka, kshtu qe t’boft mir block’i
Tan jeta mshkoj tu than: e shkrume paska kan
pse playlisti jem o i musht me kangat e aida docit sdo me than se vuj per dashni🤦‍♀️
Ësht si drog qe t'ec nvena..
Ma shum po ma ngroh shpirtin supa se sa dashnija jote.
n'MOOD per kurgjo hiqqq.
Jam tu planifiku me ta nxjer ni bilet per n'rs
===