 nese nuk osht per tcesh sagllom per tqajt osht
 pse si thave kom shaum pare per at e blita
Dicka qe nuk blehet me para, blehet me shum para
Kena pasuni, po sjena jahudi                     Kena demokraci po fjalen nuk e kena liri
Secili ne cdo kohe mund te filloj nje te ardhme te re
 Ni mashkull pa pare e don veq nana e vet
Derri do plumbin, nuk zihet me duar
 Aj eshte biznismen jo politikan, kan dallim shume te madh ndermjet njerit dhe tjetrit!
 ndoshta kjo eshte nje shenje cka duhet prap me ardh kodren e diellit
 ose ndodh i ke lishu dritat e gjata po i pengon  per at ti lishon
 Urimi Vjetin e ri 
 shiqir g ka pun cigaret vajn e shkojn, puna si tshkoje svajn
Gruja e smunt ene Burri pa pare, nuk duhen.
 te thajka sedi a mungon a jo
 G luhen do llafe 
 Jo pajka si shkak kur mthajre ntel gjat kohes provimit
 Mer pak uj pi Strug
 u bo 4 dit, bajgi
 ja ke qi ropt me ket foton
 dajxhen e ka tfort
 Kafe ka cel po duhet ta kerkojsh se jon mcefet pak 
 ndoshta te paj me taj se me mu kur ka dal perher ka pajk pi provimi
 yll gabohesh me 4 bohet tap aq e ka kapacitetin
Fjala ma e perdoret 2020 nTetov, na shkoj dimri pa vdor
o ndroje muziken se mu zu frajma 
 sagllom jon bo per rahmet i kan sos 
Politikanet ma gjat e mbajn shuren se sa fjalen
 hahahaha kjo hala ma rond ta shetajtin evropen 
Ni napolitank kisht mrojt pi Tetov deri Gostivar te e cu grat misafir
Ushtrime per oren praktike, e falemenderoj prof. Ilir Memedi pa ndihmen e te cilit nuk do mundeshim te arijme keto… 
 pse 1 nauk po kerkojsh dy
 koha ndikon, nje koh vetem per gjum eshte
 sje e vetme cka po del gjumi heret ne dit pushimi 
Rendesia e njeriut nuk matet kur ai ze vendin ,por nga boshllek qe le kur ai iken
mosmirnjohja nuk njeh kufi por disa njerzeve edhe shpirtin tua japesh pak doju duket
Nuk ka rendesi ajo qe thua, por ajo qe ndjen kur je duke e jetuar
Fundi eshte I duhuri per dike qe ska iden fillimit
Dhe kur mendon se gjithcka ka mbaruar, nis nje gje e re
Fjalet e teperta te lodhin me shume se punet e renda
Me shum se sa dje e me pak se sa neser
Ish kan niher ni rren ish nis me lyp t'verten Qysh pe lyp t'verteten kur rren e ki veten
Fat ne fatkeqsi dmth kur gruja te thot e kije ma tmadh nmuhall
 Neser e dini ju ✌️ 
 Un tu u mundau ti ndali problemet 
Dimri, stina ku del ne pah puna "Konkrete" e shtetit tone.
Shum nxeht ka kojshit ton po ka ju ? 
 amin ene taj ni bur tmajr 
 hahaha u sos puna ateher se shpejti dot jap pergjigjen per cfar reklame me pjesen tjeter taj miresh 
 duhet ta najsim sa ma shpejt mos na kape 2020 pa reklam ene neve ama sdim cfar mos kie deni ide taj?
 ma kan lodh shpajrtin mo sem hiet fb ene insta shkak i cektive shtahi pres ka viberi kur do cesin 
Premtimet e kesaj jete jane si lulet ne shkretetire!
 Paske probleme tmdhaja taj be shoc biri vitit mbas
Njerzit e kataundit toon, e kan' ni zakon, veç caucat e majra i marren, ka jon e ka s'jon
Qendroj si kapiten n’mes t’detit kur fjala e sinqert po nihet
 jaa nuk osht e vertet, ni shoki jem denar xhep ska ama goja si ndalet vetem folen
 taj xhi i thave
Sa ka shtete Amerika çaç dët kisha lut, Sall mos merr ka e prapashpresat mos m'i kput
Ja cka mor Barca sot  
 Un paj cigare tejdukshme 
 Hin njoni restorant ene e pajten kamarierin a mbajni voe,kamarieri i thot po mbajm ene ulet tavolin thot bema ni sharska,…
 Roma, zemra e Evropës.
 talibane, beduina arabe, per tra nsaj e shan heroin kombetar edin se reagoin shiptaret kur osht pikpyetje skenderbeu
Ne emer te Atit, i biri i rifatit ja rrasen Realit me guxh t'Karamuratit. hahahahahahah ina bo turpi botës  
 ambulanca do vaje tt mare 
Ne shiptaret ma shaum kujdesna per veturat se sa per shendetin, vetures servisin cdo vjet ja bon a analizat e traupit ce 10 vjet si ka bo
Ne shiptaret ma shaum kujdesna per veturat se sa per shendetin, vetures servisin cdo vjet ja bon a analizat e traupit ce 10 vjet si ka bo
 Dikur twitteri ishte vete jeta kalonim shumicen e kohes ketu duke ikur nga prb e jetes mirepo tani eshte mbushur me femij…
 Islamin askush nuk don me rrëzu, por ekstremistat e islamit duhet me i shfaros cka dalin hajn palidh… 
Nese sdo egzistonte dimri, nuk do ja dishna vleren veres
 mendoje te ardhmen ndoshta dot hipe disponimi i msimit
Emrin e FB-se Toto Rino e ka vu a nuk la ders te Elvis Nacit ene ilahie te Adem Ramadanit pa mos shperndajt
Ktau Maqedoni nuk ka kushte as per tra vdor
 Shaum tralla jon ato femra xhi nuk frigen 
Ma para femrat u frajgshin mos va zon nshpaj cigaret, shtahi frajgen mos va zon kokainen
 ofofo kush po fol 
 ce cataj, taj ?
Saunde vetem Vodka g mund tt nxefe, ene mrenda nshporet me hi kot osht
 Per nProvim nuk vlen koleg 
Njeri kapet per fe se nuk din histori
Nkrejt boten pasaniket miren me politik fukarat punojn kurse te ne fukarat me politik pasaniket me biznise
Emrin Ali a shkurt e thajrin Alush vetem te shiptaret ndodhen kjo
Do femra aq folirante xhi jon ene hunda me i pajk nuk thken ta mare
Sedi xhi kie, kush tka thon se e majr ie hec mi cauc shko lihu me parfem Arabie
 Rastesia eshte mbret i botes
 Içerde nder serialat ma tmir e ki edhe youtube me perkthim shqip
Dikush ka perjetau shaum sende, e dikush hala ënderon
Sedi pse kur shkojn femnat ndet i cesin komet nfoto
 eh kur e shkrujn ashtau duhet ti marish krejt caullet dalish ene ka kojshit 
Mthajren ndarsem, e kishin shkrujt ftes ini t’thajret krejt shpija 
Do e kan vu ftajren nHIPOTEKE, ai xhi hupen bohet PAFTAJR, ai xhi fiton DYFTYRESH..
DASHURIA, deniher shkruhet ene me 4 shkronja.. PARE
Kot se kie BMW 50,000 € kur e cesish krajen nxhom ti nguxish femnat
  paska dal pi kontrolle admini
Mtha njoni abe kit do shkojm nvor ni dit ho kie ho skie, i thash do na cojn qeret se vet nuk shkojm
 So marre me vjedh,marre osht me tregu qe e ngon Feron
 Eminemi Shqiptar me plot kuptim tfjales Lyrical Son
Permomentin Maqedoni ma shaum prespektiv kan ato g e marin zanatin e frizerit se sa ato g sosin fakulltetin
A osht bostani i majr i thash prajt ta fajtim rengen ene dot kallxoj
Nese fjalet jane me pak te rendesishme se heshtja - mos fol !
Krejt mileti po merret me 'ceshtje madhore',prandej na mbeten edhe 'punet e vogla' pa i krye .
Bota ju takon atyre qe zgjohen heret
Kto kosovaret shaum tzoti per krejt xhojat ama prap prejt Kosove sen dalin pa viza (tha njoni)
 haha mendja e ative ashtu mendon
ka qif tdale te tetovarss per at e bon krejt  
 as min nuk shkoj i honger krejt cekto xhojat
Cac folirante xhi osht taj ja urojsh bajramin ajo ta con ni ? ncnc deri ket hall kina ra
O shofer jepi gaz se Adelina tvjen permas
 sjom mangup amo kit m frajgen-tha ni dentist
 as vet sedish se xhi dujsh te thujsh me ket tweet
 per saunde hic mo fol tweet i vitit osht ki
 Aj:Hmm, sa buzët e shajshta tzdrajtkan pi llabellës...Ajo: burek hongrra 🤔
 Shqiptari ene hoxhen e bon pop
 ho majr ho kec prap lesh te cesin
Pajdh none osh aj xhi :i Krun hundet e nuk e shef kush,ene i ngjet frajk e frajk per dekun!
 Kofshendosh ene taj ma gzofsh bajramin
Ni dit fakulltet ish ni femen para muu ama traupin shaum tfort e kish ene i thash ni shokit aww chkjoo si me pajk p… 
 mtrashet mtrashet ene at bumehet 
Tshkoj jeta t’repovat a nfund prap bardaka lajsh
Ska lidhje sa e heshme ije.Me rendsi osh se e betchme ije.
 kur mos e hup endren, veq vazhdo kie prirje per minister
ee hallkit muharnajcat ti ngren
Kur komentojsh me dekan, ene aj i fshon komentet, jesin vec tajat . Taj duhet tet bohet qifi se e ki lan pa zgjidhj… 
 qetsohu gjalo g kone kall pajk sabahit
 as qe diskutohet, te meson gabimet e se kaluares mos me i perserit t’ardhmen
Kam njohur e takuar shume njerez,emrat mund t'ua kem harruar apo edhe te mos ua kem mesuar asnjehere,por kurr nuk i… 
Mtha njona hala i ri ije shko luj me maca naper obor I thash,nuk ka nevoj tshkoj tluj me maca nobor tet pas taj Macc ktau Twitter
Ma para ishe e trash si thes, ama shtahi ka najs fitnes
E ofendova ni cauc ne Instagram!Mtha: mos se det fshaj ..-i thash: ta kishna dijt se ije pastruese xhi fshon, nuk det folsha hic.
 pak si shpesh kom najs
Angli : Only for Boys!Shqiperi : Qenka per cunat!n'Tetov: Mos i fajt bithët ku maten k*rat! 
Femrat shkojn dhe vijn, po Paret vech shkojn mduket.
 duhet deniher tja cim
Zemer po ti them kejt nga e para, hicma cat fustanin me lara xhi mje shkalavajt naper Restourant ARRA, dilem ctau p… 
Njoni mpajti kush osh njeri ma i mencet nbot thash se dii? Mtha aj xhii e ka prodhauu sholen?Thash psee, mtha kerku… 
Zemer !Kur jam pran teje, behem si shqipe dhe fluturoj, sepse eren e gojes tende sen e duroj.
n Ramazan te tallavajtet gjumi kejt!-Ndre Mjeda!
 - du nause t heshme en tnalt+ e heshme oni po e nalt xhi tduhet a da chojsh prdit perde tvare
 tjesh twitterash nuk don t'thot t'jesh komedian✋
 ka plot interesohu ma shaum 
Tetova ka 1 emer, qe thirret krenari Tetova ka 1 smundje, qe se sheron njeri Tetova ka BALLISTET, armaten kuq e z… 
Mtha lock mujn e mjaltit du ta shof krejt boten, i thash ok lock a ta prajshi taj ce shtahi shajfe pi krevet 
1 e ka maturen a kan shku ta shofin baba nona halla tezja dajxhat kojshit si me e martau jo si me e pas maturen
 hahaah sfoli kec asniher un nejse ene ju femrat nuk ini lule per tu mar erë
 hahahah mbajsi idhnohena e mer vesht
Ne gjemt e kina se sa najsim tshkrujm me ni femen drejt thujm e zuna, a hala se kina pa live
 Mos luj me zemren e femnes se ka vec 1 , po luj me cajcat se i ka 2 - Mentor Kurtishi
Nauses i dhomen bubreket, ka mos i dhomen secilen verë naper motora ka rajt
Bruda ke sajll rond me ket tweet  
 as un asniher skom per ti kuptau 
 ose disa gjem me kmajsha as kto sen i kuptoj
 hahahhah po kismet duhet me mar masa ene ni spallno tamom bohet
 i mbet hatri shaum
M’tha te shkoj jeta tu hedh Tweeta ne Twitter, i thash te shkoj jeta tu lexu tweet e mia
Kishin dal protesta mbaj 1000 veta shkak i papunsis, rastesisht kaloni ni biznismen ene e thajren njonin i thot a d… 
  hahaha flm  gjthsh ene taj
 tetovaret lene xhi i kuptojm en dim ti folim kit dialektet shqipe, po rrjedhshem folim maqedonisht, anglisht, nshkoll i mso…
Taj mi cauc vetem kosoves nuk paske kapercaje kufij gjuna me shku ka Shqipria Jugore me siguri do mendojsh se folin… 
Armiku i fort osht aj qe ta din piken e dobt, a piken e dobt ta din shokt dhe ropt
xhoja ma e kece n’jet xhi mund tet ndodhe ta zosh nonen te cellau porno kjo sfalet
Un jom si ato lulet ndarsem sa ndahen femnat pi mu drejt fejohen
Hapni sajt mos dilni me ishfraerat 
===