ka me ble ni qen ka mja lan emrin Europ edhe kur tm vesin dikush ku je ka mju than qe tu e shetit Europen
e kam vjedh qet tweet
nxhami nsafin e par edhe nprovim nbanken e fundit ma sevap osht
 hahahahahaha ama nime jam merzit
 momenti ma emocionues si tifoz i Realit qdoher qe mdel kjo foto mkujtohet 2014 kur u dridhsha qe ke… 
Kur punon me nder , flej  me dritare qel.
Shkruj nkohen kur ka futboll nese ta kthen dije qe u kry pjesa e par 
 Barcelonen qe ka hup prej Liverpoolit 4-0 hahahahaha
 ju kapot sigurt me spanjen
edhe 30 followersa i baj 2000 rtw per 2000
 hahahahhahah ka efekt edhe me tamël ta kesh parasysh
 ke nform shakaje se nuk kam lexu per vakcinat shum po per kto qorapat me uthull sigurt e di qe prodhim i joni osht
Kshyr tan ato provime a un vendosa nty me ra.
Mirmengjesi popull i cili vazhdimisht bie ne dashuri e assesi ne mend.
 parameno qet tweet te ta futti me postu
Mos u merzit nese nuk tflehet neser nsaba 100% ka me tu flejt.
 hahahaha osht film e sot u ka kry mas 4 sezoneve fantastike
Qka supozohet na me bo thanave masi u kry Çukuri &lt;•••&gt;
 neve t'cukurit sot mos na folni tok ina
Sikinti yoksa Sikinti var demektir     &lt;•••&gt;
 sa shum ka me na mungu shpresojm me ja nis naj film tjeter ngjashem se ma tmir ska me pas
 neve sna vyn mo me fitu sna vje interesant mo jemi stermbushur me trofe tash pushojm pak nja 10 vjet
 hahahahahahha dost qe don me tu fry syni me Liga tkampionve dil ka na i kem 13
 qe Zaevi ish kan Nturki te Erdogani ja kish dhan ni Usb me filma rri rahat
 hahahaha met shti qekjo video me kap librin tash me msu per provim kurr sm ka shku menja
havaja per te mulliri
 krkush ska jo veq ti
 kismet mas nja 10 ditve shoq se osht afati qershorit
 me gjith kisha ardh ama kismet naj dit qetr
 a ka bujrum o dost
Lidhjet nuk ju funksionojn se e keni anashkalu at pjesen me shoqni.
Përpara pleqt ju lishin fmijve toka,pasuri tash veq borxh
Edhe para se me u dashuru ka Terms and Conditions ama ju ja futni Accept pa i lexu.
 qellimi i ktij tweeti ke per kto ofertat kohve tfundit 4 dit nbus e njo nhotel edhe ja bajn mos e humbni ket ofert
Ofert marramendese PARIS Me autobus 5 dit 79 euroDita e 1-Dita e 2-Dita e 3-Paris Dita e 4-Dita e 5-
 e shum sene tjera 
Na jena ni popull i rall nbot qe hajm SHPAGETA...-me buk.!
 kush e kapi mir kush se kapi shnosh
Urime 1 qershori,dita e fansave tBarcelonës(kapove)
dy arsye pse nuk ju besoj njerzve-nuk i njoh-i njoh
  ahhahahahaha ka me qu nhuazim se ma konte kta
 oo harrova qe enishte e kena at
 hahahahahahaha ma shum un kryj pun vlla se konte
 po nxhami edhe e kam mlu me kamen tjeter mos diktohet ama prap u doke
A je budall a ke studiu per ket deg ?
Spo kam koh me i mendu gabimet e vjetra pom presin trejat
Qka del mas shiut?-Ni selak me kerr qe tlag tbon qull.
Sot osht ditlindja jeme.Sot i mbusha plot 20 vjet.Per fat tkeq nuk kam asnje arsye tvetme per tfestuar.Gjithqka qe… 
 kush lufton ooooo ne ato male 
  ooo vellaqko urime pas 7 viteve plot pritje ju presim se na bashk me juve jena baballar tkti ko… 
Deshire jeme ma e madhe osht nana jeme tjet e buzqeshur tan jeten.
 Shumica sdin mi ra pianos
 tvyn veq me kalu provimin edhe nrast se neser ligjeron matematik
 Hahahahaha jo be dost . Po na shqiptart edhe kur skena hargjojm.
  Kto gjithqka munen me kan ama meshkuj jo
 smunesh me imagjinu e jo mo me dit
 andrrat jan paralajmerim i diqkaje
Shum anderr tmir kam pa
Paramenoje ta lexojsh ni liber me krejt rrenat qe jau ke than njerzve
Ah djal ti kisha pas vjet e tua!Ah gjysh ta kisha pas penzijen tane.
 kur tshofsh edhe sezonin e 5 tash
 Shpresojm ni tardhme sa ma tmir ama shum zor
A be te na qaq qe osht i ndam populli saqe nese dikush lun tenis me murin gjysa prej tyre kishin bo tifo per murin.
 Fajen i kan pikerisht prinderit qe nuk jan ngjendje me eduku ni femij qysh duhet ,Baba as qe ulet me bise… 
 Fakt: Dikush ka foton tane  n'gallery ama ti nuk e din.
Lukthi jem nuk osht ndijeni se qka ka mi ndodh sot.
Mos e uroni Bajramin n00:00 se nuk osht viti ri.
 knej ka Shkupi dominon Domestosi e ka Kosova sdi
 hahahaha 8 me 2 na nau blejm domestosat skena pun tjeter
Qikes mir sot duhet me i ardh era domestos.
 amos e ki ndermen edhe tejten me agjeru
  Shpresa vdes e fundit
  hhahhahhah ene nja 10 vjet me kto jena ne
 hahahahahaha shum moti e kem bo plan ama spo bohet kismet
 a je per ni loj shah
 Qaty osht krejt puna.Kan harru se lutja osht lidhja jote me Zotin e jo me njerzit.
Lutu nnamaz e jo nrrejte sociale.
ah ta kishe pas trunin sikur apetitin
Shoqnia osht si stilografat .Shum ki a pak prej tyre shkrujn!
Shoqnia osht si stilografat .Shum ki a pak prej tyre shkrujn!
Sdi pse i urreni dembelat kur ato sbajn kurgjo.
 kjo metet veq tweet,ta dim ku jem
 hahahahaha sa mir pe dini
Gruaja e ka vendin nkuzhin.Tu pi kafe e tu e kshyr burrin qysh pja lan ent mas iftari.
A po ma jep numrin e telit oj ti qik?-Pse a po don mem thir per syfyr a.
Vllau vogel qe menxi e kena qu per syfyr tu na kshyr qysh po bojm hajgare me ta. 
 a tbohet kabull se
Ma shum e kam pa Ramosin nkamer se Salahin nfush Vamos mi Madrid
Nkohen teme friends with benefits ishin ato shok qe ti bonin detyrat e shtepis.
Problemi si problem ka me u zgjidh dyqysh.E jotja osht se a do ta zgjedhesh me nervoz apo me buzqeshje.
 Qfar gabime kam bo sot qe mos ti perseriti neser !
Mfalni qe u vonova ama sdeshta me ardh.
 ni presje pasna harru me vnu hhhahahaahah
Mos u merzit nese nuk tflehet neser nsaba 100% ka me tu flejt.
Nese ti nuk i beson vetes pse po pret te tjeret met besu ty!
Sje i dopt nese ki ndjenja per dikan,tdopt tregohen ata qe tu e dit se ti i don sinqerisht largohen.
 Qe...kto aktivistet per te drejta te barabarta. 
 Shkupi n'Ramazan n'kohen e iftarit ❤❤gazibaba ✌❤ 
 E pash ni ander qysh n2022 na kish sulmu ni virus i barkit, rrishmi kejt me pampersa edhe thojshmi sa mir kem me maska
 e ke harru lojen shah un e ti
 havaja kana per te mulliri
kam nis me msu arabisht
 mu mpelqen cicerima e zogjve nlindje tdiellit se ndina krenare me veten qe stuhia e nates kalume s'arriti mem lendu aq…
Kur jeni kan tvegjel a e keni puth 3 her buken para se me gjujt?
Pom thojn tshpis i ke kalu kejt kufit a un hala skam pasaport.
Gjithcka osht merzishtshem nket shtet,perveq rrogave ato jan qesharake.
  hahahahahahhah tanananana istebiste mdfk
Pom dilet npark me dikan me hanger fara e me kesh me za tnalt derisa tqel sabahi.
 jo qe ma ka djeg shpirtin ama teper knon mir kto sodit me ta grdit kejt
 mdoket si te kogustaki mucize pasken desht me ja bo rolin yamacit
 Ka njerez qe nuk e kane studiu ekonomine, ama e dine shume mire qe nje euro hallall ka vlere me shume se 1000 euro hara…
sdi a jam te kshyr Cukurin a Sefka Tepen
Doktor ky i vogli po qohet n2 tnates edhe spo flen mo qka mi bo ?Qeljani ni furr !
O Allah qdo te uritur ushqejeqdo te zhveshur visheqdo njerin pa streh strehojeqdo te semure sheroje qdo te vdek… 
Qohu Adem..ta shofsh per kan ke luftu!
Perpara kur kojshit na sjellshin diqka,pjata sguxonte me u kthy shprazt.
Sa gjera kam bere per njerez te gabuar, kush e di sa jam i afte te bej per njerzit e duhur.
 veq un e di qka kam hek hahaha
2 provime per 1 dit me sukses.
 bitha atij mekes me shku na jo
 Jom e shokume spo di cka me thon, vec mu thy zemra per kete zonje! 
 mnervozun se sna kan thir ndarsem
 ahhahhah edhe un e trashi
 un po shpresoj te ky opsioni i dyt neser
nuk pom zen gjumi se mu kujtu qysh jam kan i vesht per semi matur
Me i msu nkoh tgjitha msimet edhe me msu ni nat para provimit a arrihen te njejtat rezultate?
Prej qorapave mundemi me msu se edhe nese pershtati me njani tjetrin nuk domethan se do jeni bashk.
E diel,dita kur veq semaforat edhe shqiptart punojn.
 CUKURIN ku e lae
Atje lart osht ni njer i cili mka dasht shum.Mungon teper.
 amin inshaAllah vlla ❤️
 amin inshaAllah vlla ❤️
 amin inshaAllah motr ❤️
 Allahu ju takoft nXhenet inshaAllah ❤️
Para 15 vitesh e perqafova per her tfundit babain para se me shku npun edhe su kthy mo.Me mungon qdo dit. Nuk e di… 
Dita e mir shihet ne mengjes ama ti sit qohesh 12 normal qe sn e sheh.
Zemren e ni qikes tduhen ni milion fjal me fitu a tmjaftojn veq dy fjal me humb.
Kan e kishi prit edhe nese qdoher ish vonu?
I du ato lloj njerz qe i folin dy gjuh: drejt edhe nftyr.
E shikoj ni fotografi para 10 vitesh tgjith tlumtur e tbuzqeshur.Sot njoni me tjetrin sfolin,a gjysa prej tyre kan harru qka osht buzqeshja.
Pse nuk flen? -aj tlutem mos mvet ksi pytje tkomplikume.
Nëse don me ndryshu veten shko spari her nbibliotek e jo nfitnes
Kohve tfundit jam tu flejt shum pak.Mdoket qe osht tum hup edhe talenti i vetem qe e kisha.
ti e din qe veq per ty me rreh zemra
 kismet ti sosim qeto provime edhe lujm
 sban me livdu vetveten amo ta qaj
Juve qe ju ngroh dashuria ka sa paguni rrym.
ta prishin disponimin edhe masanej tvesin qka ki
 dej tash 4 fletore mkan shku tu i ushtru qeto detyra ama prap sishte diqka e komplikume me koh e msojs… 
 saher qeket formul e kam ngatrru edhe nfund rezultati mdilke ndryshe hahahahah
Prej ku blehet forca per me kalu diten?
===