kush osht per nji msg tbukur 
mos bon shum mir se nuk tu kthejke n'at menyr 
 mas qafe e kan rrok 
 valla mu pi qetash ja ka nis najher po m dhem,po ku mos me dhimt fshi n shpi fshi n pun puno n shpi p… 
 kur t plaken ju dhem boshti kurizorr .....
 kjo kryet e ka vec me hargju shampon e jo qe najsen ma shum .
 qata edhe un zaif jom ra dicka (t'perkrah)
 O Berat a ta dha a sta dha? 
 e kuptove thelbin e asaj qe deshta me thon 
Per deri sa ke zemer te perbuzesh nje te varfer.Mund te kesh dhe me shum zemer ti ndihmosh atij.
Jo se vertet gjdo njeri qe e shoh e i buzeqesh kam dicka me te,por me mir te buzeqesh se sa te pergojoj,imitoj,perq… 
Mos u deshpro nga paragjykimet,inspirohu nga vetvetja.
JO-JO,nuk shkon me zorr.
 9shi per cvetan zlm ekonomi 
 pi n 7 dej n 12 kom flejt 
Edhe detajet ma t vogla qe ike n at surat t shishem ti du ☺️
a sha po thue be
Pse nuk vetdihsonu !
Nuk esht mirsi nese i bon dikujt dicka per me ta kthy .
dikush dicka per mu menim 
story-t e shoqes teme kur del n shesh : 
 SHIT ANI E KE GJET NJERIN HAHAHAHAHAHHAHAHA
 pse cka pat qe bash kjo,ajo nuk osht e vertet ?
Nese serioz tradhtia mod koka bo,un jom jasht mode.
 qut qut jom baraz me kohn jom po njerzit kan ndryshu 
 opss kshyrii lottt qysh po m shkojn seriozisht mke prek me at fjal,KAP VLLA MYTU SA S'TKA MYT NAJKUSH.
 HAHAHHAHA A TA VRAS EX-IN TOND 
 a t veti personalisht ty dikush !
Tradhtia koka bo mod,pi kur kshtu !
Nuk preferoj genjeshtrat kur realiteti flet vet 
Jom ma e lumtur prej se t'largova ty !
 shum rrespekt per ty qeliza pozitive 
 daj daj ti koke ma i kompletumi ktu 
 qe daj daj a e kshyr shpk nazin !
  shitt mu ka dhimt si mu pas kon crushi jem 
 ndoshta,ka hala femra t moralshme e meshkuj t moralshem qe po t man kjo tok .
Ma shum po ka trimnesha se trima 
 makeup-i profesional n surat t tyne,pantollat e ngushta depilimi i ftyres e vetullav t'tyne etj.
 Qashtu diqka pja pshtellim kryt ksaj pune
Erdh ajo koha ku dhe vellezerit ndermes vete nuk shihen 
 Duksa ka edhe per femra po makeup-i so bre per djem 🤦‍♀️
 Make up ma shum se femrat,pantollat ma t ngushta se femrat,mardhanje me gjinin e vet ma shum se femrat ed… 
S'po dallohen do djemt prej vajzave 
Pasurija nuk blen shendet !
 zot furnizo se ti je i madh,amin 🤲
 ja mu sma kish bo sipas deshire vec ma kish bo sje evladi jem mo jo jo
Secili osht i bukur n'at natyren e vet 🥰
Pak para diltindjes duhna mu idhnu me do shoqe qe kan foto t kqija t mijat 
T'kisha dasht po me qato gjeste nck serce moja  
sje te dit sa pe ul veten posht me qato gjeste,ncnc 
 HHAHAHAHHA ishte vec kot ky tw
"m'shkelsh n'kom se n'nafak sun un shkel" thenje e cila perloti boten.
  shihhh spo kallxon 🤣
 HAHHAHAHAHAHAHHAHA JAMM DEK TU KESH KUR I KOM PA
 t'kuptoj se ke leht as ti,popo rrran osht
  abe begaj tamo,mos i ras hunt ku seki venin 
 Ti e ki knaq krejt 🤦‍♀️
 jojo t hanen ma mir ma komike bohet pjeket e keshmja ✌
 Ky demek mdon mu a knej fol me shoqen teme i thot ndreqma tatinen knej asaj i ka lyp mu bo bashk me to.Hec e mere vesh
 Nuk jon menemdhaja thjesht sja jepin mundsin gjithkujt me fol me to.
  Kur ka gjujt rrufeja e ka rok kto n kry,qato sja zo per t madhe.Anashkaloje si mikrobb.
 Po edhe,qka i rrase hunt edhe ktu ?
 Dashurohna ku duhet jo te gjithkush,se ka at mundsi gjethkush.
 ban moj kur ta kena prish qefin ty 
 zoti i ka 99 emra 
 Hahhahah dihet edhe krejt neve
 ani qysh tkom thu ti un n lidhje serioze me kto pi se jom lind  
 ani qysh tkom KUKU NANA JEME 🤮
 me vet vullnet e ka kcy edhe tuj kcy n rs i thash me shku 
 ban beje aj mka rit,mka yshy me canbebe HAHAHHAHAHAHHAHAHHAHA N ZOOO
 ani qysh tkom biri babes thu ti jena rit me nji shtrat 
S'podu me m ardh n'men me pa qat imazh,bardh e zi po e dhoh cdo mesazh.
E une vdekjen e pash n sy t'tu edhe e pranova 
Kom me t'mungu hala ma shum se ce t mungova dje.
Kohve t'fundit shum i ke ra pishmon.
A mora o saher ti me honger mut a ?
t'kom dasht aq shum sace dola pi vetes 
 Shtet i sigurt, qe ska pas luft, termete, apo dicka te rrezikshem per popullin edhe prap e kan detyrune cdo objekt me pas b…
Koha e bon t veten.
 the shen ja kom bo zii n tona ant
  aa at ekam ngat zemre 
 S'ke per ty. Qaj person ka bo dicka t'pa riparueshme.
e zgata kryjen edhe ktu ✌ 
Je mdoket njeri vetem qe mvjen me vjell pi tye.
besom se t'urrej mashum se gjithcka 
T'kisha dasht amo ti si ke flokt si  Can Yaman 
M'vjen keq mi pranu thikat qe mi gjun njeri ma i afert,amo e kom lyp se i besova.
Dija vleren vetes sa su ka bo vonn.
A ka dikush me nota neser ?
 Un ikom tdyjat respektivisht edhe zemren me pozitivitet.✌
Duje trurin e nji femres jo trupin.
Ngjyrr e zez n shpirt t'bardh.
Qka ke hup haroje,qka ke ndor shtrengoje.
  Hhahahah mos po do naj qaj t nxet 
  najsen me shtu ?
 lumja ti un qe 2 dit pa gjum 
 e ti njeri shendosh qka ban nkto or t vona 
 Kam nevoj me dal me dikan edhe me bo muhabet shummm really home sucks
 dej sa kam goj, fjal, ndjenja edhe sy..               osht gjyna prej Zotit mos me fol mir per ty 
 AHH BASHH SOD E KI GJET ME BO HJG ME MU 
 un jam shtri midis koridori,nji vibrim ma i vogli jam vesh hazer vec per dere n sokak 
  Po mir qe na e kuptojm, po ka asi njerz qe nuk i bojn hesap si krijes t zotit ato 
 a bashhh soddd e gjete meeee uu zaebatttt aaaa 
 Ooooo shujjjjjj se tutnaa
 Ka hala njerz t mir 
 n ato momente jom kon tu i qu t shpis pi xhumi edhe tu i mar fmit pi naltit 
 po vec mu bo appet ????
 Ooo jam tu dek 
 vec un 1 ton ekom pi
  n tiran 2 termete njoni 6.3 tjt 6.1
 thonjt ju pahan bo zi mrena 🤮 
 Kto kengtart aedi qysh po mdoken kohve t fundit.Si aj serilai "Më Fal",ky ja mer atij aj ja mer ktij,n fund kerkujt kurxho.
Ku ke ma heret o vlla.T'lumet na qe kena hala ksi djem,kallxojuv shokve t'tu se ato jan qeliza negative.Ka hala n… 
As sigurim per wc s't kisha bo,qaq njeri kastravec qe je 
Ti je melaqe,e dim krejt.Amo melaqe mullini je.Ta mer menja qfar melaqe je mo ...
Shum i lodht n truu jeee breeee,phaaa
 kshyr qysh e ka zgat kryjen  
E ki nji vler n zemer teme,mbi nivel 
 EduSeduPunPerMuA ki najsen mashum,flmklmntm
Ndoshta sod osht dita,ora,minuti funit qe je tu fol me nji person,shfrytzoje rastin thuja fjalt ma t mira.Nuk t'ki… 
 s'ke per ty o nys,
Najher t'du vec pse m nervozon 
 Shuj se sjam n mood per hajgare
 Qite pasqyren para pshtyje veten,para se me pshty dikon tjeter.
A po bahesh a po t baj ?
 Qysh tdush kuptoje,secili e ka at pikpamjen e vet.
 majlind a je ti qaj
 Qeliza pozitive - n'ket rast me qelizen pozitive emertojm njerzit pozitiv qe s'bojn bajata.Mbi t'g… 
 a je per flak a jo
 Ka po t'ralla jan ato raste ku gjinija mashkullore ka qeliza pozitive n'dashuri.Shumicen e rastev… 
 vallen e rugoves ndryshe e thirin flak t snapit,
Kusho per flaka n snap ?
 edhe un perfshihna aty 
A e di qysh mdokesh?Si asi njeri i tjera hershit.
 Mirr a keqq po menon ?
       Midisit t shkupit.A po do me ta qit… 
T'kisha dasht po sje i rangut tem,je i perjashtum nga ky mjedis twitteror (mos e merni ngat zemres)
       A!Sha po thue be se spo tkpt 
 do e rokim do e shkundim farrree 
 E qet jam vec se disponimin ekom mbi nivel 
 Ska lidhja na ktu per hajgare jena,kur tdush 
Ti je i nemt edhe pi bukes qe e han,krijes e çuditshme  
 Mu m the a vec e shkruve 🤷‍♀️
t kisha pershklly n surat me marker t zii,ojj qeliz e eger 
Paske probleme serioze psiqike *
Sdi pse je qaq bajat njerii,a e din ti per veti ?
Teper je i rokt n tru,ki problem me arcin.
T kisha sill si spinerr n gisht,ojj krijess e cmendur 
 forrt e kena qpu 
 prraqk ?? cka i bje
Pse pe ngushtoni veten me mikro organizma?
 A!Per cka e pate
 A! Sha po thue be 
 sum vyn hiq aj mikrob,ma infekton zemren 
 Qe mun mir qoje qashtu qe smun pusho pak...Nejse apet ti din ma mir. 
 shpk nazi ta ndreq javen ejj
 sjelljen,dhomt,buzt,edhe i gat mu kon 
ti je parazit dhe njekohsisht tullusumi jem 
   S'KOM,SE KERKUSH SUM DO EDHE M SHKOJN N NERVA KREJT DJEMT
   JO,amo m plq kur ja bon DAJ DAJ 
   ja spi di,amo ma ndreqin moodin 
   ani,ti mun as shpk nazin mos me kshyr as ... qysh ti e kupton ajo osht krejt YOUR PROBLEM 
 qifti ktij e meriton mikrob me e thir bash si mikrobakterie osht t infekton t smun 
 VETEM MAS ERES T BECUTANIT KALLNA,JO MAS PJESVE QE LYHEN ME BEKUTAN ✋
Shum shpirrtin e bukur eki,a po ma fal ?
Nji femer kshyre gjoje t bukur n karakter,sjellje,moral se bukurija e jashtme osht vec qaq sa e ka fal zoti.
Ti edhe me yll n ball mu kon,nese cdo njeeit ja ban bajat,kot e ki edhe yllit n ball i bjen vlera
Kur ke mujt ti pa mu,kom me mujt une pa ty.Kur ke mujt ti me shku une muj mos me tu kthy.
 se pate at mundsi me hy,je shum larg flm klm ntm
 pi sod e tutje je i perjashtum pi jetes teme,ben pjes te tullusumat e mij 
 Bonu si aj i nderumi tani fol per too.Nejse 
     Allahu e ka kriju krejt t boten amo nuk tka thon allah… 
 neser ka t shkoj n shkoll ti bi 
 oo un ti bi vec bonu mir 
 S'kom besu kur n'ski xhona.Pi fmi qeto men 
 Ha fara t zeza pi te semkara,edhe kikirika t nxet pi n jajpash.Jo me e haru po e zhdukkk 
     ti edhe berllogun e farav t'ma kerkosh per besss t zotit n… 
     oky zmr kur ta kom prish qefin ty 
      anshkaloje si kur e sheh naj mac t coft per u… 
  edhe per juve njerzive t mir qe hala sjeni i fketu pi flliqsinav 
  t lutna mos ja vazhdo anashkaloje si insekticid 
  nese ti nuk ban gabime tjt nuk ban tkt nuk ban secili e rujm veten besimoni qe bota ka me mar shije tjeter 
  ZOTI I UDHZOFT KUSH KA DEVIJU JU LUTNA BONI AMIN
     DEKJEEE ,zoti e udhzoftttt 
  JU DU SHUMMM BESONIJ 
  ska lidhje e kuptojm edhe na kto edhe ky neve apo zemer ? 
     JE I PERJASHTUM PI JETES TEME PI SOD E TUTJE EDHE RI BON PJES TE TULLUSUMAT E MIJ 
  Thjesht leji anash krejt senet qe tbojn mu ndi keq,dil ec n natyr vet shoqrohu shum me njerz edh… 
  JOO per pozitivitet ktu jam  
===