Dashnija veq te paret, bot e hileqarit
Un e kom gjet ama ajo ala sum ka gjet
Kaniher jom mir kaniher jom keq
 meda ja paska nis hiphop a
 Qaq mo bir u tepru duhet me na liru veqse
 Ne cdo aspekt Kaimucki me stafin me te mire :p
 po qihen menihere, spo presin deri martohen
Shkoni be qinu me kto challenge
 mka bo budall karantina ja kom nis me ngu kit qiftin 🤦‍♂️ 
 Babo qetsohu boksin nshesh se kan hek hala
 qe tash del naj myshteri i dit e natit, thot bojkotone ket semundje homofobe
 me ni fjale me fol vetmeveti
 a dojshit me dek more kullera qka u bo tash
 "a po bohesh idi idi idiotja jemee" 
 kjo para se me dal me ty, ta lyp ni ese  "dita e pare e vjeshtes", qija ropt kerkah sjeni
 Mduhet me hek pidhin prej menjes urgjent
 a mos je e interesume me ta zbardh pak ;)
 Po foli true story qaty tmajt te 
Livdom goj se tqava
Parasysh sjam tu mar, mas syve po ja qi robt
Po le be mos ja qi nanen
 a ha ha type beat 
 - Smundesh tdalish me ket miniq nqytet.- Ama babiiiiiii- Tduken bolet Hasan!
 Kena lujt  me ta
Ti havera qet per mu haveri beret qet
Pernime dhimta o shum e madhe
Paret i du se i kan ftyrat e njejta
Shtrij kamt sa e ki jorganin
Per Messin ska fjal, i papershkrushem.
Ik se tqiva robt
Un jom lind mu kan problem eyo eyoooo
I ri po dhimtat e midisit si mi pas 80 vjet
Ajde perhajr dollaret jon n’ajr
 Kjo i bje ta kish nler nautomatik 
Duhet me lshu n’ler
 Jam lut per ket me lan po smu pranu lutja
Ca me bo pertej lekures sun dalim
Qaq ke e mir sa ton diten se kom harru
Ku humbem ne te dy
 Ski per kan ban ski nevoj per kerkan me bo veq e kshyr laliga Reallin me trenerin e ri Zizou :p
Paj shka me than be qija nan
Si andrat e mia si gollat e Peles
E njeki suksesin si bmw-ja benzin
Jom n’at trajten mes humanit edhe kafshes, si biri i mufases
 Kena me ndreq ket rap game kena me bo nuse.
 Po ama tash ska nevoj per kurgjo mo
Estrad mos nxjerni muzika mo se tash kena shka me ngu :)
TV ryqki Tom &amp; Jerry
bitchi mshet men edhe hiq so ka nalet
Fillmi fundit = Masterpiece
chillin me veti si mu kan gjith e dille
  Mdoket pi apelit e banen leak :p
Boj apel me bo leak najkush albumin USA :)
 Ja mo e kan dhi
 sduna me paramenu :p
Na ka met veq prej larg me u pershendet
Krejt keshin kur te prekin cashin
 Grevista, pse s'keni dal n'proteste?
 DUHESH ME MSU, JO ME ABUZU. 
Oj nause a majsh piqke a
Vallverde ta ha grujen
===