 I lendojme njerzt qe na dojn e i dojm njerzt qe na lendojn
 Me t'pa ty t'lumtur osht krejt qka du
 thojshe qe s'do me m'hup po as se more mundimin me m'rujt
 Nuk po du me t'mungu veq kur t'jesh vet, po kur i ki kejtat edhe apet e nin se jom ka t'mungoj
 Kto rrug' nuk zbukurohen pa na pa dore per dore neve
 pyti yjet, ato t'tregojn se sa m'ka marr malli per ty
 A t'kom thon najhere qe t'kom zgjedh pa u menu dy her?
 Krejt bota me t'lon ty vet, une kurr nuk ta kthej ty shpinen
 Jepni dashni personave qe i keni afer se kur si keni n'jeten tane mo, e kot osht qdo sen qka ndjeni per to
 Gjeje dikon qe ka mu kon aty per ty n'2 t'nates kur ti s'je mire po edhe n'2 t'dites kur ti je n’momentet e tua ma t'mira
 Kur nji person t'don dallohet n'sy
 Kur dikush largohet prej jetes tane, osht se dikush tjeter osht gati per me ardh te ti
 S'munet me t'mungu dikush qe se ki pas kurr
 Duhet mu kon t'kujdesshem kur e dashurojm ni zemer t'thyme, se me copat e saj t'mprehta mundesh me preh edhe  veten
 A ma kishe kap ti doren nese jom shtrit per tok?
 T'besoj vlen ma shum se t'du, se mundesh me dasht dikan e mos me i besu, e po i besove dikujt atehere e don pernime
 Paramendoje qfar humbje o me lendu njerin qe Zoti ta ka qu me t'sheru ty
 Ahah krejt jon tu e prit haah Vera oshte ilaq per covid-19
 Sonte po m'mungon vetja ma shum se ti
 Kurr mos e lejoni gjarprin e njejte me t'kafshu dy here
 Hajde dalim hecim n'2 t'nates e i tregojm njani tjetrit se qysh po na shkon jeta
 Ti lexoj syt s'ka nevoj me t'pyt
 Spo muj me ardh n'veti, a t'vi te ti?
 E kur t'shohin që je n'qosh munohen me t'shty
 Asnji plag n'zemer se kom prej armikve, krejt i kom prej njerzve qa m'kan than t'du
 Nese rrin si un qysh rri me ty asnjoni skena me u vra
 Nji dit ka me ardh dikush e ka me t'perqafu qaq fort sa qe kejt pjest e thyme tuat kan me tu ngjit
 Plagt ma n'fund shërohen kejt qa mesin jon veç shenja
 A ka strehe ma t'sigurt se kraht e nanes?
 Ski me mujt me m'harru edhe nese don
 Kishe me koh zbutna po akullin hala e kom n'mes, se prej frikes hala e kom zemren e mshelt
 Kurr mos e lendo dikon qe t'don, se nuk hakmerret, po largohet pergjithmone
 Hehe ndoshta ne gjum 
 e tash qe s'jena tu fol a po t'kesh zemra?
===