Qe e hup ni njeri t'mir se mendove
A ja vlen per ni fjal t'vogel me u perlajt beee
Sot 1 vjet ekom njoftu ni njeri shpirt zi e pa ndjenja
Pse sma ban add oj pisee
E verteta dhem po ski qysh me nal
Jom bo shum njeri ftoht
Syt zdu me ti pa moo
Kom vendos me dasht veten boll mo ty
I kom 1000 arsy mos me fol un me ty
zemer i knaqem kejt hasmit,ata per neve po flasin
Ajde i qajm hallet bashk 
Kur u bone ty mem sha
Ti kisha uru kejt t'mirat, po ti mat miren e hupe
Fajin sta lo ty fajin ja lo vetes.
 Edhe pse sot s'jena bashk s'domethon qe un nuk t'du, po prap jon do arsyje qe dyve na bon mu idhnu
Ajde ma rikthe buzqeshjen 
Mos em qo fllw me ig fake se nuk ta pranoj okeee
 Ajde se melinda te dema ka ardh
A t'mungoj kur vjen nata
Mos dilni prej shpije se shum nxeht vallah 🥵
 So kurxho ni dasem per ty 
Senet e mira vin gjith me vones.
Tdu gjdo dit jo vetem per 8 mars NËN
 edhe skena me e kuptu kurrr 
 Urime zmr edhe plot tjera t'lumtra 🥰❤❤
 Nese don me t’dasht, sillu keq me to✍️
 Aj se e banem chat ktu 
 A menove naj deshir
 Qe shkon thir oke mos harro ❤
 Ahhahahahhahah ta prajsh diten
 Tash pernime e kuptova se njerzt veq kur kan nevoj per ti t shkrujn:/!
 Kejt shteti na ka inat be 
Kqyrin me t'prek, tani kur ti preksh ... preken !!!!!
 Mir ti po un qe skom tik tok 
 Skem qka bojm po presum 
 Po presum me u ba mir
 Pode menimi jem o
E ombel si  ta du  e zi. 
Smujta pa me e qit edhe ktu 
Lej ato filma t'k***t o bro se ike bo do vjet.
Qysh me i than be se lujta kejt. 
 Shkoni n’lesh n’mnyre kolektive
 Edhe mu njona o tum luuu 
 Hiq mos ta nin 
 Vallah zdi qysh jam tu nejt nkom 
Ekom tepru me bakllav vallah 🤢
Mdoket jom i vetmi qe skom qit foto per bajram ?
  Qysh t'thujsh ty qashtu o
Njerzit e lendum gjithmon kan dashni t’sinqert.
 Zdi qysh ta paskam ba like o shtremsh
 Auu si mu kon pi Tetove ❤
 Pajjj pele qfar qellimi kan be ahhahahaha
Sjon sen ato kisha hala asi qe e qesin nstory 05:05 gn 
  Phaaaa menxi e gjeta njo qe ekem njejt dtl 
Çdo dit e rre e ka ni mundsi shtes.
 Ehh mirr qe paska naj njo qut
 Ani mos em thuj tana mflehet 
Ajde rrim deri n'drek tu fol be ❤
 Un as emrin zdu me ja ni e le mo me lujt
 ka spi rass hund mos ja qn edhe ty
 Kom harru qe shoqe ka ,
Mke met veq kujtim, si ma i miri gabim.
 Skem qka me bo, aj se kalon edhe kjo
  Veq sa ti kry do pun edhe shkoj 
 Ti prish kejt planet 
Hiq se du kohen me shi.
 Ec me nonen qite qet foto n'status
Ma ka nal frymen ni qik n'qendër sot kur mka kesh 
 Qet jom po ka po hi barca real mdel para 
 Edii po qa me bo 
Ty boll fake je plus edhe me fake acc mshkrun.
 Edhe mu mkishin knaq po ska 
Mu hiq sum haa me ma lon seen. 
Ty je p!dh boy e qashtu i ki edhe shokt.
 Edhe un ktu jom amo tjert kerka sjon. 
 Po de qata desha me thon 
  Qka o puna bre 
Mke dal prej zemre njejt si Facebooki.
 Hahahaha po qka me bo duhet naj her ❤❤
 Po more se kejta bohen.
 Opo opp qa me boo
Kur e shohim se ska sen prej teje.  
  Bohet mir o lul.
 Bohet mir edhe per na.
Hiq nuk kshyri kujt ja boj like
 E ty qfar prb ki ?
 Me kohen jan mas hala
 Spo shoh tjer be
A kejt flejni aaaa ?
3 dit u kon n'Gjermani tash veq Loredanen e ngon.
N'6 duhet me u qu breeee kejt ja qifsha ati qe eka bo shkollen.
Veqq shkrujmm bee zduu maa shumm.
 Jo be se smujta
Smujta pa me e qit edhe ktu. 
 Sjom i asaj dore un 
Shkojni be nkaret kejt ejjjj
 HAHAHAHA jo be edi 
 Thash se mu je tu ma ba HAHAHAHAHAH❤
  Ajo as nuk e din qka osht twitteri zdi qysh eka qel HAHAHAHH
  E rre osht be ka gabu 
  Ahhahahahha njejt edhe mu si me msu n'mjeksi
 A kokan Adidas bee
 Kshyr qka shkrun te maica e Getinjos.
 Njonen ma jep mu 
 Mo se tash vi ta mar 
Kur e pi cigaren msheft knaqesh vallah.
 Skem tjeter qka me bo
 Bohet mir mos ta nin
 ejj um erdh edhe ni shoq n'Twitter.
Me harxhu koh me naj kon që sja vlen. 
 Jo be mos ta nin tye ❤
 Ani more se nuk thash naj sen tkeq 
 Ajj se bohet mir 
 Jaa ski qka bon 
 Ajde ajde deren qel e kie
 Jo be nashta e ka rrok promaja 
 Hahahahahahahahah po de ka edhe asi qa ti shtin ethet
 Po duhet najher o shokuuu
 Ajt more se bahet mir 
 Ani veq tklx un 
 Aj e vezhdojm nChat se teper u bo ktau 
 Aha po majr majr
 T'shpajs si i kie majr
Qe qetu tu pi kaffe me Bakin ☕ 
 Amo denher duhen ene ato hahahah
 Mfalni ka e njifni ilirin ju 
 Ka dek njo tu i therr zemra 
 E pse nuk klx ma heret ty
E pash qe eka qit Mozziki kongen edhe hina nSnap me e ngu, do nStory do snapa edhe e ngova.
 A tdhem naj qka oj qik
 Ej aedi qka ik qine nonen edhe ty edhe shoqet e tua
 Po ti eki qit ma heret amo un prej teje nuk e kam marr
 Ta kisha marr prej teje veq rt ta kisha ba
 Qka osht more kjo pun kshu
Bash hiq skom ndjenja 
 Kan dek mangupat ska moo.
Hala ma keq e kom Zemrën. 
Truni edhe zemra jem kurr smujn me e gjet ni pik t'perbashkt.
 Ahhahaha aj se bahet mir
E kam pas zemrën e mir per njerz t'gabum.
 Heren qeter shkojns be 
 Ma mir e paske ty 
 Hahahaha qa me bo se 
Edhe ndjenjat ma t'forta lodhen kur injorohen.
 Shnosh qa me boo 
- Perjetova tradhti ku tnjejten koh ju dhash dashni.
- Njeri menqum ma shum me mend se me sy sheh.
- Ni dit sillesh mir, tjetren dit bohesh kishe sum njef.
 Popo e kom vendoa hiq mos shkoj bile 
===