 Sonte kumanovart po ja shtin flaken Struges  
Duhet me bo emoji ose reaction, shume kishte kry pune 
 Kalle bre, pe bojm kockert!
  Deshmoje me PCR test qe ki shije!
 Faleminderit per respektin, Bimi ☝️
  Mdoket e ka n'vend t'keç, tjeter trajtim o tu lyp :p
 Tu ja uru Urimit kangen tonde ❤
 A po vjen me marr dresin a ta gjuj?
 Lugen e makijatos veç shtoje 
 Neser lujm futboll, deshtak.
 Jo thUn pU Vi Pu kaM mE MtHu
"Çom kur t'fitoje Shqipnija"
Vout gajzz voutttt zirotu!
 O tkena thirr po su çove 🤣
 Kush e ngon Shpat Deden ...
 Dikush mujtet edhe me ardh me mbrojt sonte ... 
    ma kaaa jep njjoooo ka ana djatht taniii ma ka jeppp eedhhee njooo nbark
 Njejt man. Ren ishte.
 Steki i ftoft ...
 MA I ZOTI ahahhah
 Qushtu te dua 🤗 ahahahhaa
 Thpo di thka je tu thon ...
 Made in China. Shkon ju del e martë. :/
Nji makijato pa "plumb" shef! 
Na erdh dita edhe neve...  
 Perdor presje dikund kuz se mbete pa fryme  hahahaha
 O ma mire se na e dijne po e kane taktike parandalimi ... ;)
   Ma bet jemi kon ahahahaha
 Jericho e disa tjere lypin mu kon 18+. Ne neurone, jo ne vjet.
 Ngushllime man, shfryju hjeke tkeqen. Te jetoni ju te tjeret e ta kujtoni per tmirat qe i ka pas.
+Ku shkoj bre çajo torte qe ke ntavoline?!- Fpe di vava
  Hahahahahah mish po shkojshin aty... :p
  Mos hyni se krejt kshtu ishin!!!! 
 Bash kesh tu prit ku ki me dal ... hop mdole kojshi :p
 "Shuj bre ti veç buken shka e harxhon"
Une kishe po ja lidh nalt e s'po keshet me fore t'mija, ma vone dul qe gjysma e dhomve i mungojke.
 Me pas ardh mi dhon zor qaty me tndihmu ka shpija per 2 dite e kishit kry punen.
  BUXHET PACOLLI - ma emer i sakte se sa emri i tij origjinal
 BUXHET PACOLLI - ma emer i sakte se sa emri i tij origjinal
Deri te patarina e kumanoves 3 her e mys. Hahahaha
Nese ti nuk i shkrun, as ajo nuk t'shkrun , atehere ndoshta...nuk e keni pas t'shkrume.
 A je tu ordh me pi kafeee mo
 Foto ta shoh tblej
U dasht me lon ky showbizin qaty ka 2007ta edhe mu mbajt mend si legjende... :/ 
 Valla tkampojne para shpije, veq caktoje daten :p
 Nklip thirri krejt shoqnine e tw. Bone special. 🤘
A veq une e kom verejt kete te HIB petrol ne Kosove?! 
 Himni i Kosoves* me tekst. 
 Lej kto, ngritu mbi kete mentalitet edhe mrrije potencialin tand man. 🤘
 *shkon i bon 99% tseneve tjera qe jane haram amo tattoo jo
Kur najkush tan kohen poston sene depresive edhe dyqysh tdhimet amo edhe ja ka nise me ta tesh ... 
Zakonisht, njerezit pijne ilaqe shkaku i do tjereve qe duhet me i pi, po nuk i pijne.
 Faleminderit oooj lumturija familjes ❤
 Faleminderit shume uooouj çikadajes ❤
 Bff me gra t'trasha
"Nkthiz nkthizz" - Kosovari me barkun e forte njeherit edhe rezistent ndaj hithave
Edhe ky Janari t'shkoje kshtu edhe prej ne Shkurt kismet po e fillojme 2018ten...
Mire jom , mire jom. *dies 
 Gajret kuzan, krejt kena me shku atje. Mos i mendo ashtu senet. Sa jemi ktu t'jetojme.
*shower thought*-Njerzt ma te kualifikum me tdhon ideja per emra te femijve jane polict qe punojne n'kufi.
Njerzt qe thojne muzike e jo kangë lypin bejzboll n'pankreas.
Krejt e kemi ka nji shok qe ka zgjidhje per cdo problem qe ja kallxon ama krejt i kushtojn ka 100€ e perpjet...
Gjdo? Gjdo?!?! Ne reklame ne RTK - gjdo?!  Spe di a analfabeta jeni a po mundonu me kriju identitet. Edhe spe di cila ma e keqe.
Merrni krejt mandarinat, veq gështenjat mos mi prekni!
 "Litin nuk ua solla une ...ate e gjeta ne mesin tuaj" - Filonidi
Shume instagram kur po ju shoh tu bo lame humor n'komente t'femrave me dekollteja.
Shume do emra te mire mi kane gerrdit do njerez t'keqij.
"Edhe qeky Zahiri kurxhohiq..." - gjyshja  per Zaevin
 Amo Zaevi ... amo Zaevi na do be neve ej ... qysh tash ...
Na ndodhi edhe kjoOoOoOoO... 
 Krejt poenta twitterit in one tweet.
 Kush pi shti gollat be abi?!  Hahahaha
Jetoj ktu edhepse edhe ajri nuk preferohet per konsum njerzor. Definoma.
 Urime whitetrash mamma, ktu se nfb po mdoket si para kamerave me ta uru.
A bohet kto t'Reallit me harru me lujt futboll...
  Vec ata qe skan qafe votojne nah ketu.
 Tnaftes 2 here e paskan rrit a?! Dola nplin fuck it.
Shqiptari n'mjek:- E fotografova kryjen, mthan kurxho ski! Amo hala po mdhemb.
 Bjeri bre pak ka Kina ...A jeni kon nKine...? Mhm mhm jo dmth...epo...
 Spo kallxon qe ke ra ndiler tmire kuzan...
E tash veq ta sjelli kete omletin ka ana tjeter ...aaa fuck ... prap veze tperzime sot.
 Skonka ide e keqe me bo nji tips group ktu ntw me ja pa hajrin
 6 kifle me djath i hongra, hala jom tu e lyp djathin...
E kisha bo nji reklame per duksa: "Duksat - kur do me nxon simpatine ama ski pare per kerr tfort."
  O tu e lyp valla...
Gabimet ne jete:5% - kiksa tnatyres tndryshme95% - mka lshu buka kom fol palidhje
Shpejt fshini statuset per zonjen Kryetare te komunes - MELIKIJEN !!!
Ski najsen perveq dekolltese n'meny a? Naj fije karakter najsen shoqeruese? Jo a? Dobt dobt...
 Krejt kancer o kjo...
"Era ftoht o tu ardh" - vec shqipja e din cfar ere i vjen ftohtit...
Tekstin himni i Azerbejxhanit mdoket qe e paska Azerbejxhaaan Azerbejxhaaaan Azerbejxhaaaaan Azzzzzeeeerbejjjjxhhhhaannnnn!
Koha me shi si ne Angli u bo, tash mos po i bojme edhe tjerat sene...
  Bonja nji telefon bicepsit tvjene ...
  Ylli , ky twiterash i sjellshem.
Boll more u ankut. Sdi kush po ju shti me zor me shku n'shkolle, me msu, mu zgju heret, me fol me shoçni e familjarë. Çka nuk don mos e bon.
 Veq ato rë rë-jat pak mpengojne ama prap hallalli e mund haramin te ajo 
 Shtoja nji doze Frederik Ndoci edhe sprinkle it me pak Inva Mula, shume rahat bohesh.
 Gjej nji paciente shnoshne njoni tjetrin ahahah
 Jo jo sje i hjekt kshtu. Veq nji krize e vogel o kjo. Shiu fajet.
  Cka o forja me gjuhen letrare? Asamble najsen?
Moti ska postu bash u patna bo merak per kto xhinka... 
Nji shok e thirrke kamarierin "fifty" , "ej fifty nji makiato". Ai mendojke qe doket si 50 Cent a najsen. Ky e kishte qe demek gjysnjeri je.
 Sti merr Zoti krejta jo...jep najsen. 
 Ta jep TMobile edhe 1 shanse...
 Kto kusheri te atyne, pasardhes hahaha
Hajt kjo. Po kur pe boj mend qe komplet nji familje jane kshtu ... 
 Man, provo hjeke/shtine nrryme.
Tu e çu nji foto... SHOÇAJEMIRSHAJETUBO!!! 
 How do i like this 99times? Se i ri jom ntw.
Psh kur ka supe me kokrra mishi a po nuk je weird nese i le nfund kokrrat e mishit me tshiju ma shume? A po be? A po?...A POO???
 E be no kjo fjala "me tgiligic"...
   Qysh munesh me ja bo unfollow nji threadi ktu ntwitter? Per nji shok po pys. 
Po m'dokesh si dikush qe nuk u konsultu me mjekun apo farmacistin...
Ka njerez artificial qe aq shume shtiren si tsjellshem sa besoj qe edhe deren e frigoriferit kur e hapin, nuk e hapin pa trokitur!
 Hajde dalim naj dit rrespektojm femra
Kur e ki femer amo ajo se din. 
"Syzat a laminat a bash parket i ki?" - Eroni 
 Su kon qaq po kohve tfundit u piçkav.
Telepati me nji mace. 
Kur nji femer tndryshoje stil tflokve nmenyre drastike papritun, kap çite n'kafe njoftoje prap se nuk o njeri njejte ma!
Kshyr futboll me shkupjan.+"Shumë bezopasno t'postavitëm kto igraçt e Juventusit"- Bjerma smetkën be se heca...
  Pak si me rezerva e kish lujt qeto ...
  E dobt ama ki potencial. Besojme ne ty.
 Kshyr ky fmija hiq sbojka panikë. Garant so i atyhit, ka ardh mysafir te dajt. Ose i ka ra topi.
Dyqysh boll poshtrim per shqiponjen qe strip club. Ama ky 2shi demeke se po be e kom edhe nji si ti njejt, kurxho s… 
Goals: Mu bo Kryegjysh Boteror. Respekt per Bektashinjte. Veq mu kesh me titullin. Ma gjysh demeke mo ska. Ky kryja. 
 Qito e zune ishalla stka djeg naj 1+ pjesen e pare ... ahhaah
 Mu bo "shibe" njeri ...
===