 Qe ku e kan muhabetin kta .. mas 1jave hyp numri e na akuzojn per bajramin qe na lejun me fal 
 Sosht qudi munet mu kon edhe ky .. veq mu mashum po ma mer menja messi osht
 Urime edhe shum suksese nJet 
 NATEN E MIRE INTERI, NATEN E MIRE, ÇDO T'MIRE
Urime Festa e Fiter Bajramit
 Shuj se shkum po mdoket
 Ku po gjen espresso tmir nXhon kenedi
 u nisem me shoke per Prishtine, ku e kemi turneun me Rossonera. Un per veti s'luj per shkak t'kames, po iu uroj shokve…
 HALLALL PER KET GJEST ❤️ 
 i kish pas than gjyshi, ster gyshit: "O bab, a ka me u bo mire najher n'ket vend?" Ky ia kish pas kthy: -"Hajt djali je…
 A thu a ka mu bo najher mire ne kete vend? 
 - Bro, a dalum?+ Smuj bro se skom pare - Kom un edhe per ty bro. 
 Jo mu m'kane tradhtu dy persona qe si kom ngjoft kurre me njoni-tjetrin OOOO ALLAH OOOO QU MER PI GJUMIT 
 Mos harro mi harru, ata qe t’kan harru.
 A jom i vetmi qe jom knaq tu i kqyr qita ktynehere 
 po normal, pse me dale kur kjo proteste nuk osht per lgbt edhe nuk ka dale adelina ismajli me i perkrah 🤔🤔🤔🤔 
 Urime pritsh edhe shum tjera tlumtura 🤑
 te OnRecords-at  ki Mami ,Baba ,Arush qka tlypsh-Mos te harrojm se kemi edhe te pirë hahaahaha
 Ju pengon kur shkruhet per fe n’twitter e 24h shkrujn per crush’at qe as nuk i njohin🤦‍♀️
Kan mu knaq dostat nshkoll tMesme tu ja nguc nanen kti fmis qe e lindi 13 vjeqarja
Kryesorja shnosh mu kan
 ekom dit ket sen veq kom prit dikush mi vnu vul
 mashum mpelqejka me than kursim i rrymes masi spasna zgjidhje tjeter 
'' Jam nje zonje 42 vjeq kam 2 femij me ka vdekur burri tani jam nLidhje me nje djal 28 vjeq , njerzit flasin pas s… 
ku ka ma funny se me jau ngu do probleme ktyve tShqipris 
kisha harru me vnu pram telin nrrym :/ 
qysh kan than pleqt kush e kesh e vesh
 Kur thu “haa” prej gojes del ajr i nxeht, kur thu “hoo” del ajr i ftoht. 
me pas dit elita5 sa e urrej un shiun garant e kish fshi muziken pin youtube
un kom faj qe rri nfb jo ju qe postoni sene palidhje
 Muj me jetu edhe pse mka blloku katunarsi 
plot me dit tlodhshme o kon qky muj
 Kur mthot dikush : Ha ma ka dal se po plas. 
 Faleminderit. Forca edhe juve! 
 Sosen ❤️ Urime edhe ty e kejtve
Istina je sve ... Gjesi miq
hahahahaha hala sdojn me pranu realitetin qe sosht mo Maqedoni
Lojat palidhje tBotrorit kokan mledh sot
Urime Fiter Bajramin ❤️
 po du me pa ni qesi rasti live 
 po du me pa ni qesi rasti live 
 Kur nuk e plotsojn safin ne xhami... 
Muni me ma bo perhajr ❤️
zot runa prej tkqiav edhe pi kurvave
o ka pe shoh tu fol qet qik per moral du mu smu kejt
jet o jet , sjom tu pa n2 metra qr
Gsw - Bos kisha dasht me kshyr finalen
 Shume palidhje qajo forja per Salahin edhe taravit 
nKet loj kish kry pun Salah edhe De Gea nGoll
 Amin vlla kejtve inshaAllah jau pranon .. gjithashtu ❤️
Besoj se atmosfer ma tmir ska
E myti nejen ademi vallai ❤️
kisha pas qef edhe nier mu kthy nNBA Harlem globetrottersat me ja hup topin lebronit e curryt 
ti kishin shfrytzu do 2sha tpasterta ku kta kan provu 3sha ,, pram kish fitu GSW sigurt
Finalja mdoket ka mu kan    Ke qysh ke Forca  
Termin i qmendur ishe sonte
Midis vodnos tu knu muzik tShvercerav  qekjo koka real love
Mka met zani nstadion qe e gjen najkush lajmromni
mos tish kan Shkup - vardar sot kom pas me shku nPej
Mu ka perzi Insta snapi me tifoza tShkupit tPrishtines edhe tDrites llug u bo
Shkupi - Vardar 16:15Shum ngat Europes veq ishallah najdon &lt;3
Tash vin postat “shkoj i bekumi veq edhe 30 dit meten”
Ja nisi puna per Sofren e Iftarit nCarshij tShkupit &lt;3
 asnjo ma i mir sosht, sosht per qudi
 valla boll marre , me qet gjest qka e paskan bo e paskan knaq , kush o kon aj budall qe o qu e ka bo ket… 
Eu qe ma kan ftof vallai :/ 
 po jo be qfarti ska mundsi asniher.. kjo veq munet me ju thir niftar qe don qe sdon tung e ka
 hahahahaha edhe ka me ja arrit qellimit
A ka t Hanen nKosov naj fest a ?
Ka pi shoh artistat veq mkeshet 
Tu e kshyr filmin e Prof.Sinan Dubreves
 se qoet tini e e mson orarin e aeroportit tPrishtines kurr men se kisha bo &lt;3 ke qysh ke npritje jom
 Hahahaha a ti tlejume e ki menova se tjeter kush
kush po xhelozon be
 Per ni tardhme ma tmir 
 ja qiv ropt e mur nqaf bayernin ..
 Qe njoftoju me fatin 
Duhet me pagu faktura smetka Thënje nga “Rexh Bossi”
 Shum mas je vlla me kohen .. spo ngajn mo me zan ven saba saba po pram permi 200 veta kan flejt nsa… 
 Skena nevoj per protest se i kem punt mir ...
Mjaftoj me ma prish naten .. film ma palidhje njet skom pa
 Shum urime per dashnin e re
 2019/2020 i shtohet edhe ni kravat
 e mer be se so shum zor
Mdoket ala ka njerz qe sedin historin e '' Njeri e ka prejardhjen prej majmunit '' edhe '' qysh jon kriju majmunat ''
duet me lujt ni Turnir tash kismet
   a po mdoket mu ajo
me kalinicin nuk shkohet nUCL
po menojn se sedi qka ndodh mas shpine be jau qifsha ropt
 ajde ishallah e kalon
nese dikush lyp me ja q! kejt qka i ka gjall e tdekt o ramushi
  Urime dtl vlla &lt;3
qr edhe un nShkoll fillore jom kan nxans i mir e tmesmen mkan perjashtu ama prap sdi me knu si katili
Dita mir shihet nMengjes ama jo n9 .. se un n9 se shoh as oren as diten -_-
 Kjo foto nxjeret me qellim mi kall kta t’Kosoves me na ardh per vizit sa ma shpejt. 
 Ni zo t'fmis e nijsha po s'disha qa po bohet... 
 Veq Kalofsh bukur ti 
 hahahaha mir ski faj sishin kallxu qkaq budall .. po fotoja ka dal mo o vlla u kallxun budall e tas… 
 SI KOM KSHYR LOJAT N2004 , skom ide per tash kesh tu fol
 po mir zine skan dasht me kallxu ka dal gabim ajo foto edhe o fshi pi profilit parzit sa e lexova l… 
kejt e dim qe fero vje pi mahalle, a na tjert svim pi mahalle
 . Lojen Monaco vs Porto se kom kshyr kshtu qe skom menim
 Lojen mdoket se paske pa .. hyn kshyre miir hapi syt edhe folim , un ala asni loj nJet se kom pa qe… 
 ni Gabim i Vogel ? ku e pae at gabim o vlla .. 3-0 kthej rezultat barcelona o ekipi ma i mir nbot p… 
 Para se me u lujt shorti faqja zyrtare e Romes e ka postu .. Nashta edhe ti je asi fansi i Futballi… 
fakte tGjalla se edhe UCL ndreqet edhe ala njerzt menojn qe Roma o ma e mir se Barca
Prej sabahit e kom dit shortin kojshia menojshin se po boj hjg
hehe qet keshme e kom pas inati 2010 e tash ala mashum
shiit ala jom me trauma tpramshmit
 so problem se nuk i kupton ti .. se ata se kuptojn veten niher e kem mi kuptu na ;p
 bohen ''ateista'' per me dhez .. a kur jon keq e nzor ka 100 her Shehadetin e o Allah nimom thojn
 Mos shkruni shume me dikon se keni mu msu keq ka me ju mungu
 Twitterash kisha pas qef qe kejt me bo RT qet video , qikes mixhes tem ja kan vjedh qanten sot n'Mery's Food and Coffe ne P…
Pi n6 jom qu fuckk
kur pi japin zor me fol gramatik pom lujn kejt
jo veq nSerov edhe nGazibab ka ndodh
pom knaq lajmi kur pi shoh gazetat tu kallxu qysh ka shku njeri i ka pagu borgjet nDuqane
Casillasi edhe Buffoni per mu kan me met Legenda
Erdogan: Turkija osht Kosov , Kosova osht Turki
 un i du edhe ata qe sum dojn
 Njonen ane tu e uru nji feste t'nji feje, n'tjetren ane tu i sha besimtaret e nji feje tjeter. Mentaliteti ♥ 
sot mka shku dita tu prit mu bo ora 11 .. koka bo n1
 sbon me nxitu se kjo ta pshur nxitimin bro kadal kadale
 Duet gjithqysh mja bo like ksaj zojes  se qe sja bojm like kjo naj pshur kejt senet qe i kena
 Un si njeri kallzova 
mashum se 400 followersa ninsta i kom fshi sdi qysh i kisha leju gjith ato budall me mi pa fotot be na
mashum se 5 veta ma kan lyp numrin me jau shit 50 dej 100 euro
o srbija me guxu mi pas hi kosoves per luft e kish bo ma heret skish prit tash
Edhe budallt po u majkan mes veti
===