Kush e ka edhe 1vit shkoll, du tthon kush o maturant durt nalt -  
Pse bjondina kur shkon ndet e mer deren e rabs  - Tflladitet ;p 
A pse bjondina kur shkon nduqon i fajten paret nder setlla ✌ - Me djers kurse 
Nese me ni vend shkrun ndalohet hirja per budall a kishe hi? ama klz nese sajebesh ... - Po 
shoci ma i ngusht  - Edoni 
shoci ma i ngusht  - Edoni 
A frajgeni naten, kuur flini diten  - Naauk :p 
Zezaki durt nder i ka t bardha se kur e kn li me boj t zez durt i ka pat te muri ... - Jaja 
Pse zezaki duret nder i ka d bardhaa  - Kur t haje chokollat mo i ngatroje me gishtat :P 
Pze zezaki oshte i zii - Se chashtau e ka racen :p 
Mo u  vaje mbare un vu jap leje mpajtni g tduni  - Oni :P 
A eshte e vertete se njeriu meson prej gabimeve ?  - Po 
Qka kishit ndryshu te shoku ma i ngusht - Mvaret chka kish pas nevoj 
Goditja e rradhes nga 12 vjecarja: munohen mem rrzu rzohen tu u munu ahaagagahahahah... - Ojttt 
Godet 12 vjecarja: po munohen me na ndaa, FUCK YOU najenaa bashk haLaaa ;$$$ - Omg 
Shkolla ma e majr  - Naim Frasheri 
Mirmengjess a u qut a flejtett.. - Qut 
Shenja horoskopit? - Peshku 
Ika un kiss - Kiss back 
Fol dns oj taj - So chat :P 
naten emiree  - G.N 
a po ju flehet be - Pak 
A bon te hish pak nwp .. - Po 
Sham e heshme ije - Sham flm 
Hey a bon te njoftona  - Me anonim si nauk :A 
3 fjal per mu ? - E mir,e bukur,e sjellshme 
A mdush  - Auau 
Shoçet e ngushta  - Fleta,yllza,ajshe 
Makfitet  (dhtahi a tu mtek kush jom hahahaa... - Me dh kush folen? selakja 
Ne kerkim te fatitttt ahahahhaagagagagg - Hahahahahahahah lidhje serioze? 
Shaum dush  - Taj dojshe tm hikish a un vech shkronjen e par :A 
Se dike kush jom  - Shkronjen e par t emrit! 
Ahaahhaa shkronjen e mesme t atij personit per te cilin m ngucish thuje, ather da e di se e ... - E 
Ene n det de shkojm bile e kam dajxhem n zvicer❤️❤️❤️❤️ - HAHAHAHAHAH mduket e di kush ije 
Shaum e shejshet ie, a de vejsh me mue tet hiki ne brodec???? ❤️❤️❤️❤️❤️ - N'det ni kruk? 
Sa vjet i kije oj bukuroshe - 15 
A kije emocione se de hosh n shkoll t mesme?  - Po 
Sa vj kie  - 15 
Jam vajz me taktik ta boj bllok edhe pik - Mu? 
Qka keni qef me dit per mu - A e dush dekand :P(chkjo ke pytja e par g merdh n kraje ;p ) 
kupa me kapak kupa pa kapak - Chashtau ka mbet :P 
Kur e kije menden t martohesh? - En 2min d vAjsh ? ;p 
Naj pytje per mu .. - Okay :P  
Hini ninsta demek bone like ahahahahha ckshau i be - Hahah akej 
Pazitni insta  - G o pazitni?  
suhejlab ekam insten kush mban follow ja kthej - Tkom follow :P florinaas e kom un ;) 
Njeri g e dush ma shom (pervec mamit en babit) - Daja 
Pula vezen a veza pulen  - Gjeli pulen :P 
Domlla i raft kti kiwit pa iftar dena lone  - Hahaha halishaj i mshelim 
A mendojsh tu flet  - Nc 
Kur hecish per udhe a tka ndodh tet zone gjumi nkom  - Nauk niher :p 
Taj ku msojsh  - N'gjimAz d hi :P n'Naim frasheri kom msau (ka gjasa me ni klas se me ni list is... 
 Do femrav veq banu kishe pi fotografon qitja telefonin perpara ato per 2 sekonda i rregullojn flokt, i qojn buzt, edhe thehen …
Nickii Minajjj Bomba Girl 
Follow me on Instagram: florinaas.           Add me on Snapchat: florinaaaaaaa.
Instagram: florinaas.                                    Snapchat:  florinaaaaaaa                            Kik: Florinaas
 lovee you babe &lt;3 &lt;3 &lt;3
  hahahahah shofet be shpirt :p &lt;3
 shaum tweet-ish :p &lt;3
 Shauuumm Twit-ish :p &lt;3
===