 hahahahahahah ee budallen e nanes
   a njihemi mtha, per ate i thash ashtu nuk e pata fjalen per kontribut a dicka tjeter
  po ama spat lidhje kjo, edhe pse sju njoh as shkodranin as ty po e di qe je "nacionaliste" q… 
  nora "nacionalistja" tu i thon serb dikujt veq pse ka mashum njerz nspace
 po thu ska shanca a?
 ty doket qe e ka prish se turkofil je, perqata smunesh me kuptu
 veq mos jau theni autobusin klubit hahahahah
 shum kot ja paske fut vllaqko
  o hekne ket emer
       veq qe e ke bo ti ket dizajn top 5 hyn
       a e keni seriozisht me ket emer a koqe hahahaha
 edhe do fore i kishte shkru nfillim sa hyna bimbimma u lshu naksion shum humorist isht baba
 ani more qite kujt po i ha kari hahahahahah sje tu bo najsen tmadhe o kar hahahahahaha
 shum pidha ka nxan valla mir e ki
 hahahahahaahah me dy profila, sa ma sigurt❤
 bullizmi o problem tjeter shum ma i madh, duhet me fol per at deputetet qe kur sja kom ni zanin tu fol per… 
  mos hyn si moderator n'at space se je tu ja ul nivelin shum tu nderhy palidhje edhe je s… 
  Belati Belati, i mire Belati n'2019 kur e perkrahi VV
 Ngushllime, kush o ky imani?
  pse spo mshelen qata 2 librarit me libra fetar?aa po nime shum menaxhera tmir kan hahahhahahahahaba
 fort e kem thy karin ntwitch 1 koh qija nanen
    kur ke puna me bo retweet skandalin e blastit qe ja fshin storyn misutes as 1… 
 si Alia kur u kon i vogel
  Çka nese kris luft n'Kosov? Pa me e msu turqishten mos u nisni knej. A u kuptum??
 Ee qka me bo masi ska kjo naj burr a bab a vlla me shku me tja qi dekt kti
 Shummmm kom keshhhh roptttttt
  Nkejt boten ndodh kjo po mos ha kar palidhje
 Tkan sha nja 2 tshqipnis ntwitter edhe she got a point qrrrr
 A ka tshkojn i rrehin qr
 Mir e ka mos e shaj 
 Ti nsuedi jeton vllaqko qka pritet mashum pi tejeFull e ki dhomen me shalla tFFK s me ylla
 E kan prish tregun
 Me demek ti ke than apo?
  OHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAH LUJTAAA JA KE PALUUU
  Shumic muslimane nkosov a ? Hahahahahaahahahhah
  Jon do persona qe kqyrin neper ksi rraste me mar vemendje ksi qe bertasin neper protesta pali… 
 Hyn lexoj ligjet e Allahut edhe e sheh a ngaterohen muslimant a jo
    + edhe nTiran mos e harrojm hahahahahaha
    Hahahahahahahahaha o motren ta qifsha nese je "ballist" i tetoves edin s… 
    Edhe ky ka bo perdhunime apo? U ropt npidh ti qifsha. Mos shkruj mo se d… 
  Mos shaj mos shaj2 lidhje me fe si ki as ti
 Hahahahahahahaahh o ta qifsha at moterr
  A pe hek ket flamur a u nisa per nkumanov? Ti vendos tash
   Ooo ropttt npidhh ti qifsha breee kejt qa i ki nshpi ti qifsha
 Na kena medalje ju skeni haaa
  Ku o dallimi i nderum?
 hala po ju dhem bEtha
 "Shko paloj vesht, mos bon ksi krahasime"200 iq
 Jau qifsha besin megjith ju amin
 E kta qe ju kan marr nshpi nkoh tluftes? Sjeni tu dit as me lu koqe vallabila
 Qe un pe heki kapuqin qaj gjak so i jemi..
 Veq mozziki e fol mir
 Hahahahahahahahahqbahah rooptt perl osht kjo
 Eihhh hupin Blinkat e Navi
 Boll boll mos ha mut ti
    HAHAHAHAHAHAHAHAHHA kejt nrregull amo kur po i bon tagg qeta t'hujt po mlun kejt
 Ti nihesh i bekum a
    A i ndrojm gajlet bro
 Mirmbrema o njeri i mire
 A munesh me ma sqaru pak ma shum se qka ke dasht me than, se spo muj  me kuptu jom pak i vonshem qashtu
 Amo sun hyn nxhenet
 Qka ka per me lujtTluj edhe une
 Hiq sedi cili je ti
 Valla prej qe je rrit pak ja ke nis po fol meqem
 HAHAHAHAHAHAHAHAHAHAHAH vissssiii my G
 ty tka dasht shum
 Flm qe po agjeron per twitterin
  Ky lineup u bo qe 4/5 muj sdi qa po presin shqiptart me mri mrena nates a ?E ku po du me dal… 
  Qka je qart vllaqko?
  Qka je qart vllaqko?
 Qe qka keni dit me bo ju, jau qifsha familen npidh kejt qka jeni kon atyRopt npidh jau qifsha 
 Hard reset ruterinamo tndrohet psw i wifis qysh e ki pas nfillim
 Qka u bo me shtet hajgare?
  O bravo o shpat se mrrenqetheee keejt
   nimoni njerit mos luni koqe
  HAHAHAHAHAHAHAHAHAHA ROPT TI QIFSHA I NDERUM
  Marre mkish ardh me lujt per kta 
 Kqyri n'anen tjeter triumfin e gjej me humbjen 
 Ja ma real se acc jot spaska hahaagahahahah
 Ropt npidh ti qifsha. Amin
  O ti qifsha ato ropt njo ka njo npidh, rrespekte ik qiju
 O joooooo, ska me shqipen touun!
 Veq ti din qysh me jau palu🤣
   Dmth. Tash duhesh me fshi tweetin, apo?
  Oooooo ska me shqipen toon
 Kur u instalu ajo frik per 100 dit nonen ja qifsha ????
 Legjendd je pasha zotin ahahahahahahah
  A i prekumm ATOO?
  Gabim o ky krahasim
 Sosht fest e jemja. Musliman jam
  Po ta lun koqen o vig🤣
 Marre per ty qfar niveli u rra debati!!! NAPOLITANKA A ?? luvaa ja qr
  Tha qe osht shqiptare, dmth e mbeshtet 1 kombtare.  ( nese mu leju me fol n'emer tsaj )
 Veq thehesh n'bel pak
 Po seee, u keqkuptuaa kjo 
 Ooo dekkaaa beee HAHAHAHAHAHAHAHAHA   merr njanin plas per tjetrin 
 Kshtu nashta s’jena en ama ni fjal t’keqe me to se kena pas...
 Neser vazhdo prap , dit te veshtira per ket popull
 Ama pom doket XXXTentacion ma shum pat mar 
 nah, gabim je!! muzik bon per ata qe ja shkrujn emrin n'bio t'instes 
===