Marsi erdhi serisht ti kur do vish ?
 o jau qifsha humoristat e nanes po shpejt keni harru qka kena hek na n luft
O enver hoxhaj eksportin e vipa cipsave ta ndalim. 
 Java mbas provimeve &gt;&gt;&gt;&gt;
 Mos pi mall boj palester
 o mret mos tpaft sajvi kec. 
 Ta then mbas Provimit☕️ 
Fakti qe dicka duhet te kete buje mediatike per te vepruar tregon se cfare jemi. 
 +1 provim per ne qershor ecimmm hahah
  en kali trojes a kon pi druni ama ka pas efikasitet haha
 Kush ta dha shpaten Ali Ahmeti ?
Kerkesa e quintit per lejimin e votimit te referendumit te Serbise ne teritorrin e Kosoves se pavarur tregon edhe n… 
Hitting em 1gg 2gg n sportlife me tjerat skom raporte bilaterale. 
 super mario na ka msu me shpetu princeshen jo kto kurva
Prajshim shpaja ama ndrecim kolibe. 
duhet tbohet peticion per ta bo hoxhen e sabahit t thajre ndrek se i pengon apasievit.
Do njerez duhet tmbajllin perdit ka 10 dru xhi na harxhesen oksigjenin kot
 Kallxom sasi,tet fromojm cmim.
Meraklit e borxhit,valla ATM mduket viti cket muj. 
Gjini po ndron sportet ,laleeeeee. 
Bonu demokrat mos gabo po grahi cdo nate.
Per tifozet e barces mbeshtetje maksimale , fillimi oshte i rond mapa adaptohesh,10 vjet ene ala ngrajhena ,forca milan.
Naten e majr te gjitheve ,pervec Sotiraq Filos, taj mund tshkojsh n’karret i nderuar.
Kengetaret shqiptar naper muzika. 
Lehte oshte ta shofish ni rab t verdh kur kerkojsh raba t verdha ,Lehte oshte ta xhish ni Sportlife , kur e kerkojsh nje t tille.
  Ka mbet 1 shtaj 
 pasha zotin qe right here right now po i premtoj vetes qe sa t'kryhen provimet ska me lon nji minut me m'ik pa e thy kvrin…
 Kit mbajllin flok un de mbajlli nerva se i kom plas kit per ket vit.
Per 5 minuta ti pastrojn edhe bllokat e shtepisePa marr parasysh a je hoxh a i perngjan haxhis. 
  Se vertajti e mbushi si dollma.
 Kech xhi de fshojsh en at mbas 10 lojave t sezonit ,ama mpelqen optimizmi xhi e kie
 gzuar be picka none (kalleee) 
Xhi t thujsh e kie sakt.
 Naten e mire vec ju djema, vajza ishalla mberdhifni sonte 
 Sa i don si i don .
===