 sa shum nan moj jam merzit 
 Duaje dikon qashtu qysh o, jo qysh ki qef mu kan.
 Kam me dek pi dosadllekit
 Faleminderit njerzve qe dita dites mbojn me kuptu se muj gjithçka me bo edhe pa ato
 haha taaa ha zemren tyy❤️❤️❤️
 Shum palidhje po doknu kur po shkruni pak shqip pak anglisht, veq t’ju kalxoj.. kllosharizem, balizem sa z’ban
 ma majr para se hich
 Zot jep men ku ska
 Sipas Shqiptarit numri followersave ne Instagram po t’kallzojke qfar personi o 🤦‍♀️
 djemt qe ngojn kong turke jon llaaajf
 Te kenaqesh me caktimin e Zotit,Per ty eshte gjysma e qetesise tende ne kete bote.
 kogja shperndaj pozitivitet te njerzt si njeri negativ qe jam per veti.
 Askush nuk ta hjek pikellimit, te gjithe vetem jan kurioz me dite se çfar lloj pikëllimi te ka kaplu!
 Un perveti se ndrroj shoqen e ngusht me sen jo si do do me duuuksa.
 SKA FJAL QE T'PERSHKRUN TY O HALIL .. ZOTI T'RUJT TY E KREJT SHQIPTART KUDO QE JAN, QE PO KONTRIBOJN PER ME I GZU FAMIL…
 Sa t'mire jon njerezit para se me i njofte
 Te urresh nuk kerkon forc,te falesh po.
 a tham qe kena mu bo kishe sna kujtohet ?
 “Kurgjo mos met dhon Allahu, veç pse s'ta ka marrë shpirtin pa u fal, veç pse s'ta ka marrë shpirtin kur je kon tu bo gjyna…
 1 foto qe e pershkrun komplet ket jet muti..Realiteti i dhimbshem vs Reklama e bukur 
 Mos falni dashni ven e pa ven
 Thojn : kqyre me kon rrin,me kon pin kafe,me kon shoqerohet edhe e din qfar njeri osht...Me mi kqyr mu shokt,dal ma i mi…
 A e dini se me shku me i fol njerit, ki 97.45% mashum shanca me u njoftu me at person se sa me e kshyr tan kohen si psik…
 hiq sta duuuu qet huj 🤬
 1Kafe shkon mas bukes 🤣
 kresha osht another level
 Kjo koh e ftoht ma kujton zemren tonde
 Njeri i fort je kur fal e jo kur e merr faljen si dobsi
 Ooo kur pi shoh 12vjeqart me ksi mesazhe pom hidhet me kcy prej tavanit n'tok si shqiponj 
 Kur krijusi i ka vlersu qaq shum femnat, kush osht i krijumi mos mi respektu ato.
 Si du syt qe rrejn, edhe nese jan ma t’bukrit nBot
 Definicioni dashuris osht Gjumiii
 Sdi qysh do persona per pak koh mujn mu largu prej teje edhe mu bo kishe nuk t'kan njoft kurr!
 Veq dashnia e nanes edhe e babes osht e vertet Tjerat rrena jon
 Qysh nihesh vetun kur Krijusi krijesen e vet kurr nuk e len vetun
 O Allah, na bej prej atyre qe kujdesen shume, per ndjenjat e te tjereve.
 Perse i jepni kaq shume rendesi, pamjes trupore? Une nuk kam degjuar asnjehere, se dy persona, kan vendosur te jene qi…
 Te jesh nje djal i mir per nenen nje burr i mir per gruan baba i mir per femijet ateher munesh me qujt veten BURR.
 Doctors life:-Ta kryjn fakulltetin.-Me bo specializimin.-Me pas ni gru doktoresh.-Me i bo fmijt e tyne doktor.The end.
 Per mu njeri ma i fort osht aj qe kerkon falje.Njeri ma i i mir osht aj qe mi kallxon problemet e vetaEdhe njeri qe mdon pe…
 Pe du dikan qe m'ban t'lumtur.Jo dikan qe: ami paswordat, mos bo ashtu se sje fmi, jo po na shohin, kush ke aj, fshije sh…
 Diqysh pom mungon ni person qe se kum njoft kurr. Feel me?
 Njerzit mendojn se je i cmendur kur flet per gjera qe ata nuk i kuptojne 
 Ti kisha jap qeta syt e mi me kqyr veten qfar klloshari je 🤨
 shum keq mu kon merzitshem e mos me dit pse
 Shkenca hala s’ka mujt me vertetu se ku ndodhet shpirti, a na shqiptart do e kena n’fyt do te huna
 Aq shum a perhap amoraliteti,sa qe mu kon i moralshem te trajtojn si i prapambetur.
 Spo m’intereson mo kush ik e kush vjen n’jetën tem , mu ka bo njejt krejt tradhti dashni falls e sene tjera..
 Ndryshe foli me tjert, ndryshe foli me ty.
po be u idhnojke pse sja kthej msgt nkoh ani zemra jem spoot tham un me nejt nchat temin k!
 HAHAHAHAHAHAHAHA edhe un veq jo crush i rendsiishem 🤣
 HAHAAAHAHAH mos u nguc
kur mami jem takon naj shoqe kur esht me mu fjala e tyre e para eshtt a qika jote kjoo aa ? joo sjam jam nal veç me va ngu muhabetin🤦‍♀️
 Sa dush munohu me fitu dashnin e njerzve ske me mujt.Munohu me fitu dashnin e Krijusti qateher  ki me fitu dashnin e kre…
 Miqesia eshte si paraja,me lehte fitohet se ruhet.
 -NDAALU, jeni i arestuaar per mbajtje te nje grumbull thikash. +Ku i kom be??-MAS SHPINE
 jo ene nja 5min
 jo ene nja 5min
 kush more pa ndjenja HAHAHAH
 ma majr vitit i shkruj en pres tma kthijese sa TAJ.
 E pse e kom ni force terheqese me shku mas njerzve qe nuk m'vleresojne ?
 njerzve nuk i intereson kur ti je vetem, atyre i'u intereson kur ata jan vetem.
 a ti psikolog je apo ?
 so veni per mu shpreh bash qetu🤷‍♀️
 as sot serdh aj msg. shendosh neser...
 qaq shum mka mar malli sa tkisha nxer prej menimeve e tkisha qaf...
 jo qe s'dim me dashuru po s'ka dashni mo 
 mu banem dishka ma nalt krejtve budallve 
 nvaret qfar rene osht ama po falet
 Shume osht turn off kur ni femen ja jep bash gjithkujt mundsine me ju afru
 Sa ma shum qe rritna e kuptoj qe do persona qe i kom dasht ngat vetes nuk i du mo! Do persona jon thjesht penges per zhv…
===