Tm falni krejt u femna se smund tva kthi sms se per tva kthaj sms duhet tm shkruni.
Muzika e preferuar per momentin...???
Paramendo... maca jem han buk njer kur e sosen kit buken.
Je bo bajat si maicat palm angels
Mka mar malli ta shof kujdestaren tu u nervozau per mungesat 🤣
Un jom caj budalla xhi e rrezikoj vitin per ti kallxau dikuj n'test
 Kur i haron botht nshpi
 Veq qato gishtat po t japin mesazh
 Lum ai burr xhi dt mareeee
Ishalla sma qon naj foto simpatia, se duhet me honger telefonin n'iftar.
Hey no kiss kiss inRamazan se osht very Haram !
Ta kesish emrin Era en tvdesish pi rrufejes ⚡
Ta kesish emrin Lumi en tvdesesh n det.
Ta kesish emrin Festim en tvdesesh tu qaj.
Kulmi:Ta kesish emrin Imer en tvdesish tu dhon.
Ta kisha ngjou profin kur mthonte mso Allahi e din shtej Astronaut de isha bo.
Tu ndajt veq kur dja boje skom koh une per t hup vaket.
Berberi: Mfalni si doni te ti pri fjoket?Klienti: Pa pare du
Vjera: Oj nause buk a kina?Nausja: nouk japonia.
M'jon bo ditet n'Maqedoni si Kinezet kit nisoj.
A u martove a?Po be u martova.Haj perhajr tu shtu shpejes en ni punjac.
n'vende tjera:Haj t'ngares pak se shaum kom honger buk...n'Maqedoni:Haj t'fi pak se shaum kom honger buk...
Hey kush ma gjen nr e Mozzikit se mkan mbet vetem nja 2 euro ta pajs si ti boj 2 milion?
E ka ref nona n'papushk en t'çon foto loçk un per taj jok tu qaj🤣
Njerzit ndryshojn, screenshoti mbetet.
+ Si ije ?- Vallahe si e merkurta as andi as kendi.
- Tej cauco a kendon kur lahesh?+ Aho perher.- E sa koh kije çi nuk ke kendau?
Se du matematiken amen km qif ti numroj paret
Kush t tha mi bi se ie e trash Hec meri nja di stolica en hunxhu cektau
Ej doja ta pejtsha hoxhen nise a osht haram tu e dit hoxha far njeri jam drejt ma bon po haram o...
Nëse mendoni se fitoni sevap me like osht isto si me shku n'haxh me Google Earth.
Shqiptari en Amerikonit i thot "tej din shqip ama nuk don tfolish"!
Llafin "Schatz" Ma shm e perdorin Shiptaret si jetojn gjermani se sa gjermont.
Xhi duhet sherki kur skie ftajr
Pirja e duhanit shkurton cigaren.
Çajin e pajn me zarinë, mbas çajit ha 3 sheqerpare..🤦‍♂️🤦‍♂️
Sje Shqiptar nese skie 1 najllon mbushet me najllona tjer..
Pi cilit vend na ndjekni hajt kit emnat e fshatave/qytetave ???
12 vjeqarja godet serish:Do te kisha dasht te jem filxhanTe vi ne duart e tua,Sa her te pish kafe te me puthish mua.
Nese jeta juj do te isht kenge si do e kishte titullin?
Femnat e sodit:Per taj mrreh zemra, per at mdhem shapjrti, mendja mrejn ke ai.
O gjali ferfules nk tpajtn policia a din tvozitish po tpajtn mfal a kie leje...En tiqe e dini vet...
Ta kesish emnin Shqipe en kur tt vejn menstruacionet bohesh fiks me vul SHQIPE e PERGJAKSHME
Cila osht ngjyra jot e preferaume??
Vec un en hoxha lutena prdit:Un i lus femnat,Hoxha lutet tvdese dekush.
Lepri kur i bon 2 vjet far bon??
12 vjeqarja godet:Un Bandash ti Kolic,Dashnija jon ska Koshnic.
Fjala V.I.P rjedh nga emri Visar Ismet Piva.
Dashuria osht si parki,Po kalove t'kapen barki.
Nese sedish ku e kie vendin...Shko pajt n'Katastar.
Para se tmendojsh 2 her mendo  niher a ja vlen tmendojsh.
As Iphone 4 nuk i ka ra vlera,Sa tka ra taj n'saj tem, adios.
Un me taj shkojm si,Unikatili me Shpat KasapinDashni e Pergjakt.
De ta kisha fal Dashnin.Ama puna o se sedi sa reqate ka.
From "Ta hongsha Shpajrtin"To "Ma hongre Shpajrtin"Real quick.
+ A miresh me deni Sport ?-  Po, Ngarendi, tu hiki ndjenjave.
Shqiptari ma shom frajget,Mo i hupe fjakat n'snap,Se sa pi virusit (covid19).
Kujt ja kishe dhon zemren veresaj, pa u mendau 2 her?
A bo zort njeri ta puthe shocen n'buz, menier thun femen e ka.
Armikun ma i madh i Gjumit osht Shkolla.
Kur jom nervoz en dizajni perdeve mpengon.
Sa majr binjaket njoni ta boje ni foto tmejr tu dit mund ta perdorin.
Mos u merzit nese deshtonPlani A,Kie en 35 shkronja qera nalfabetin shqip.
Cac Negativ xhi osht,As Corona se bon Pozitiv.
Ska shok t'ngusht,Kit i ka xhanau Fitnesi
A ban me dasht shokin e ngusht
Dola n'pazar thash ti bli do ndjenja
Tag shoket/shocet xh ini rajt bashk pi tvogli.
Alejna mejr ci jeton tej, mo kishe kon tej en ma mejr.
Selma tej kur folon lukthi mtollovejtet.
Medina pa taj ma mejr de isht jeta.
Besime emnin e mejr ama mend hic skie.
Oj Arta oni se tshkon matematika ama un nuk tboj hesap hic.
Besarta ke dal pi vinklle nise.
Tej Flora na ke dhej stillin.
Oj Besa je bo si trotinet
Sa ma shom shaj bieCac ma shom shaj bie.
Oj kulturen ta fajtsha n'mendEdukaten n'trau,Sinqeritetin n'zemër,En kusurin n'xhep.
Zemer shtaj si i ke lishau mustecet,S'dmth, se taj ije burriN'ket shpaj,Mos keckuptohena
Numri 3 pi thot numrit 333 a po ngrefeni se ini 3 veta.
Numri 1 pi thot numrit 11 o dyftyrsh.
Numri 1 pi thot nr 1.000.000 shum nanqim je.
Shkronja O i thot numrit 0 pse je thaj kshau ha buk.
Ma boni tha tdu ama si shok🤜 
Dua t'bi t'fi en mo ngrohem njer kur t'hujdiset kjo situata.
Vetëm vajzat hin n'kuçe en sn i kapje policia...
Kush e gjen cila osht e kunderta e qeshmes?
T'dalesh me femnat shopping duhet t'maresh buk me vete.
Mashkulli i vertet nuk ngarenden mbas 100 femnaveAi 99 kurva i bon ta xhelozojn 1 femën.
Raj rahat zemër un kom vendos ja taj dt mar ja ni qetër!
Tkina shendet ene internet.Se xhonat qera vin vet.
Tish zgjedh cdo problem tu qajt Barnatoret çep de shejtshin.
Cauca 13 vjet e ka shkruj nstory"Un pa taj sen flej"Kush ja ka mar kukllën ne tja ape amon ne flije.
Nuk e disha se jom i heshet deri sa ma bjiti baba ni BMW.
Tshpajes kur flin"Shhhhh qetsia e madhe"Une kur fli"Haj e renovojm shpajen"
Femnat shtej kerkojn djem si kajn çere(makina) tmejra. Po tej a me çeren de fish a si. Mrapa thauen pse ka dal djali automaniçar.
Po du nuse me cellofon se me letra laget
Don Xhoni - Kokaina 
Kur ma bojn prinderit kush ka pej cigare nshpaj?Shpaja be like: 
Dimnit kur jon plloçat e ftofta.Un be like: 
Shoqja jem kur ma mer crushin: 
rej shtej se mcite pi sisitemi. 
Ami nause pucit emin de bohet mejr. 
Kur mshkon buka kech!Nderkoh vllaj: 
Lije mi e pa nuk mi fugi sojt hich! 
I ka sos 4 fakulltete ene 3 magjistratura. Diten e par tpunes e shkeli Traktori.!!!
Mtha: "Taj ije ilaçi jem"- une meniher e bona status : "Feeling Paracetamol"
Shqiptari ma mejr te ta msoje vendin ku i mban paret sesa emrine nones.
Djali 5 vjet Iphone ka a une kur i kisha 5 vjet shejfsha ta kaperci hijen teme.
E kom ni shok en Linda Morina osht shaum per ket.
Oj tej cauco me frizur,Tbojn morat fiskultur.
T'lindi nona, t'rriti baba nfund t'mar un.
Pse t'bie n'dashuri tu kon t'bie t'fi lezeti i madh...
Femna nuk ka nevoj te studioje drejtsi, sepse ata saher kan te drejt.
Tu mendau si ta lone cigaren e ndezi njo.
E kom bji ni vag n'Turki per tu mat saher si hipi ma çet "MASHALLAH"
SHQIPTARIGjith dimnit han turshiGjith veren han piprika me voeEn nfund vdes pi shqerit.
Ta kom regjistrau numrin "ZORTI" se vec kur kie zort mthejren.
Gjali: Nuk tdu mo!Cauca: po, ene?Gjali: po nejs qaj..!Cauca: abe de rej une di prejshi shminkat per taj Gjindihalli.
Njerzit ma t'poshter n'bot:1. Kriminelat2. Politikanet3. Kto si nuk hiki pi ore kur hikin kit klasa.
+ o vlla far i vejn fuck you?- Ta ç*fsha nonen.+Tonden ho si njeri t'pejta pse nxefesh palidhje.
Xhi de bohesh kur de sosish shkollon ?- shauummmmm i luuumturrr
- Sa osht rroga?+ fillimisht 300€ a ma von 600€- Oni de vej ma von ater.
Bash kto ci rejn ma urt kto jon dreq...
Kur pordhin femnat n'gjimnaz:O mfal pa dashjeKur pordhin femnat n'teknik:O e kom dridh babo fjak kom cit
T'kom paj tu pa cigare...
E kom pa ni dit pa sherk ndash beso ndash mo besoCi 3 net fi me dritat ndezet!
+ A ije e lidhet?- po jam .... Bye!+ Shiqir si kone e lishet se tej me at ftejr de hajshe denjonin.
n'Maqedoni osht interesont se :"Kush punon ha"A kush nuk punon:"Ene han ene pajn"
Kur thauen u Rahatau se di a ka Vdek a u Martau.
Princesh n'FacebookModele n'InstagramXhenaze Live...
E lash CigarenE lash FemnenMla mendja...
Njoni mtha sun shtohesh tej me muMajr be vlla a pilivon tu duka une taj.
Kur don PRINCESHsillu si PRINC nauk si KAL.
Dallimi i sajgis Nuset 1980: A de pajni kafe?Nuset 2020: A de pajni shisha?
n'Maqedoni ma kollaj mer leje per pishtoll se sa leje per vozitje...
A e shajn vitin futbollistet kur lujn play station?
-Ku ije zemer ?Ce n'WC- lishoe ujtin ta ndaj mutin si shkon teposht...
Cauces shpajes i vejn era domestos!
Do njerz kan ma shum Like se sa mend
Ne hala CD e darsmes se kina pa a ai budalla e ka Lon gruen.🤦‍♂️
Osht fakt se callen fshat e kie ma inat, bash atej de martohesh
Kto si lon sms "SEEN" me qellim ishalla diten e darsmes nuk de u vin muzikat po as kamerat...amin
Un per viti kom vendos para di martoj caullet mrapa de martohem vet...
1284757583738483 her ju kom thon mos u bon kusem i lexove kit numrat...
Aj momenti kur un foli n'telShokët: fejke cigaren fejke cigaren veshi breket veshi breket
Ju si nuk i ktheni followat a doni t'bohi VIP-a a far???🤦‍♂️
Shqiptari kur idhnohet ene Liken e 2016 ta hek...
6 zero i kom vetem 1shi mduhet en bohem milioner flm klm...
Kohen e fundit shaum legjenda jon tu vdek, mka hi frajga en mu!
A e kishe fal tradhtin?
Femnat si skajn c**a jon t'bekaum se mund t'fin si do naten.
Kit kina pas ka ni femen ci rejfi me djemt.
Disa femna i dun djemt te ijen $impatik ene €legant.
"Shorts girls are the best girls"En nona jem e pjaka dmth osht best girl se osht e shkurt.
Njejt si i ndryshon  femnat sherki en djemt mjekra. (Fakt)
kisha hi gabimisht n'wc e femnave.
kisha hi gabimisht n'wc e femnave.
Sot 4 femna m'lutshin t'dal...
Berberi: Mfal si don te ti pri fjoket?Klienti: Pa pare du
Nuk ka dashuri pa dhimbje tha lepri ene e kapi perqafe iriqin.
M'jon bo ditet n'Maqedoni si kinezet krejt nisoj.
M'tha: du t'mbaj diet ama se di siI thash: ha grosh me lug t'makiatos.
Xheta ni Nokia 3310 e kisha hup para 10 vjetve.Kish hala 2 kocka bateri.
A don ni Murmu-kifle me llad
Kur hi n'Filma 24 cdo her si mar frejm çilet ni tab i ri.
E ka ref nona m'papushk en t'çon foto loçk un per taj jom tu qaj
Kallzom sa mdush mrapa dt rri en un taj
Kuedin xhumi se naten duhet tflish?
Kur i pren floket, amo bohesh pishman 
Shoqet e mia kur t'bahen bashk 
Krejt kan vetulla amo esenca osht mi pas nform
"Ato femnat qe rrin te shkallt e Gjimnazit" 
Kusuri ma i ombel n'bot 
Djemt ta zbardhin ftyren - tha njona qe ju derdhshin krejt nftyr 
A keni naj shok beqar? 
A e din at ndjenjen si osht kur tshkrun dikush i pari?- as un
Pse shoqes tem si thot askush ta du shoqen🤷‍♀️?
Zemra e kujt mun me kan kjo? 
Ishalla edhe do dit sna mshelin se i kom bli do tesha treja e hala si kom vesh
Veq me ja cu mesazhin me postier, se n'krrejt rrjetet sociale mka bllok...
Une mendojsha se Genta e klasese po m'don, ajo e kish pas veç sa me ja kallxu detyrat...
Buka 20 den taj han mut palidhje?
Tu u rrit tu u zbudallit. 
Kadaleeee nuk osht si mendon tej. 
Jet mizore, kit majza majza🦟
Femna o si borxhi, pa ja lyp nuk ta jep.
Prej se jena nda,çdo natë me dor jam tu i rra.
===