tash nqet nkoh ta then kjo shishja me uj nxet ner qebe
njani pe qajka tweetin
e pubg e loqk qysh luhet solo t knaq
tva fshi numrrin tash
paska  dal  nkafe nja 2
E cka tash ni sahat ma shum a ma pak me nejt ntw
  po dojna mi hup nja 30 milion
 hahahaha jo krejt nashta
Ermal Fejzullahu ft. Ledri Vula - Fshatarja ime
Kishe un nfoto me shokë
pse spot shaj ty direkt se qashtu ta riti morrin
spaska met njeri qe spaska shku
senet mat mira krejt rastesisht bohen
tshkoj jeta tu i kqyr punt e tjerve 
a kom a skom dosta thiri shoqet me ardh
Gjej dikon qe ta ndryshon jeten jo statusin. 🤔
Mendimi se femrat jan te pakuptueshme rrjedh nga meshkujt qe asniher nuk bejne perpjekje per ti kuptuar ato por vetem per te bere dashuri.
veq munesh mi dashuru ☺️
femrat smunesh mi kuptu.
dhipin e fort si t mangupit 🤔
ata folin kot veq jon tu rrejt
sa mir kur najkush bon najsen per inatin tan edhe i bje pishman qe e ka bo qat sen
neja osht e smut
a kam a skam dosta ti thiri shoqet
ti sa ki armatim une 10fish kam zemer
ka qef me lujt undercover me mu
ti po han mut si mu kan falas
 Kur harron diqka  edhe t'kujtohet kur sduhet
Sdi a me nejt per darsem a me shku npushim
 po plot ke bo hahah
Krejt followersat e mi se perdorkan tw
Dojn me na pa posht , na jena nalt
Ri me princin ton ruju po rxohesh pi kalit .. Kur ta shofsh ni princesh nrrug ka mu kon femra kti djalit
sa mir po rrin breh
jeta osht e mir kur din me jetu
tash skom shum femra kom veq femer
Thojn qe njeri kur t hyn wc shlirohet.. E vertet kana 
ahhh :( cka permene
Ku je llokum, koke UNIK sikur une...
Koha kalon shpejt prap ti je e njejt
1 prrilli ti mush syt me lot haha
Do sene ndodhin hiq pa i prit
Se jeta osht anderr, ku i sheh senet qe si ki
1 sen e di , Mos i beso Kerkuj ...
Keshi me juve si fora me bjondinee
Niva qe e kishe ndru statusin a
Ajo e din qe nuk e lo vet
Senet e mira nuk harrohen leht
Perpara i ka 2pac
Permas i ka Biggie
Femnes tem ja kom lon emnin une HIPHOP
"-E rendesishme ne jete eshte te mbash koken lart,dhe jo hunden"
Kur dy njerz duhen vrehet, zemra rreh e buza zbehet, kur tpreken gjaku nxehet, larg njani tjetrit vetmija vrehet...
Per qat pun jo hhh
neser hala ma hiq ..
sonte fol se neser t dhem buza :P
pa block po .. ama duhet me menu tmiren e dikujt qe mos mu nervozu
kur je i fort ja bon kujdes block edhe qet foto fb :) :)
hiq pa gjunah bre
per mi than femres tane queen duhesh me kan kogja nifar kingi
cka o kjo pun veq qika mdalin qe mi bo follow
ka mi bo 100 following
smunesh me na nal pa na vra 
sa fort kur ka block
nashta ajo so ma e bukura n'bot po Ajo boten tem pe bon t'BUKUR
Loti i ni femne vret ma shum se fuqia e qdo djali
E boj hallakam si ni shpi pa grue
Qun nate vepra jo llafe 
A po nismi per hungari hh
Nuk twitirratet hiq mo
Su rrike thash t hi tw
Tutku kthehet mas 3 mujve
1 Cigare shkon  Mas Bukes
Bureki 50 cent njerzit hajn MUT!
ku je llokum koke unik sikur un
edhee ky twitteri ishte kann ....
"Cka po kerkon ma shum prej ksaj bote dhe ketij njerezimi, ku ende besohet se njeriu e ka prejardhjen prej majmuni."
Nuk Ka Pauz E Bojna Pa Pauz Je Qaq E Mir Loqk Du Met Hanger N' Buuuz
Thuaj 1 fjal NAN tregom se a je gjall mbahu oj loke se te fort e ke 1 djal ne mshir te ZOTIT te gjith ne kemi mbet Gezuar per jet 
Nuk pe njo kto as ato pshur ntoo
Nese nuk je ne momentet e veshtira te mi fshijsh lotet mos u mundo kot ne Gezime te jesh afer
Vz - Une e di kush jom (Ft. Unikkatil)
Shume o ka ma don
Kush pasurohet me lotet e tjereve..asnjiher nuk dota shijoj lotin e gezimit ,....
Kto hajnat ton , Perlahen sikur fmia .!Diten bahen copa , Naten i bashkon rakia .!
Wpp su durun hahahah
Veq me ba me kris lufta do nuk i zen as BLLACA
se di qysh e bojshe kom besu qe mdojshe
Ktu kollaj krris lufta se krejt jon ba si gacaVeq me ba me krris lufta do nuk I nxen as BLLACA
Kur se kum pa hitlerin qekaq happy a
mka pelqy urimi hitlerit
krejt twitat per kengtar sonte
punen e nist kryje .. tradhtarin nftyr pshtyje
Arsyje jo nuk ka per mem thir mu idiot
Mkan ardh musafir tgilanit
Ajo qe po i Shkaterron njerzit sot, eshte garimi i tyre per dunjan
Rrisken qe ma ka dhon Zoti kerkush smunet me ma marr
Se t'isha konen vetja s'isha konen hiq kerkush.
E di qe s'jom kon vetja kum trillu dikush
Ti mbon me kesh pa thon kurgjo
Sa shpejt i ka dhan goll
S’po du, me m’kerku falje maji per veti fjalt..!!!
Kon pe shan me nan
Ti propozoje nje djale nje vajze per shoqeri eshte njelloj si ti thote asaj 'Te dua'.
Dashuri eshte shoqeria e tejzgjatur.
Nese nje djale behet miku i ngushte i nje vajze, ai atehere shume thjeshte behet partneri i nje jete.
Njerzit besojn sepse atyre nuk u duhen provat.
===