Prej gabimeve i msova senet qe nuk i pata tqarta
Un qeto ondrra ko mi ndjek per jet
 HAHAHAHAHAHHAHAHAHAH si mir valla
Nese sta din prezencen dhurojau mungesen.
 Wet nrreth tpar te kokam❤❤
E kam dit qe je budall ama dej qaq jo
 Kujtoja vetes qe jo çdokush e ka zemren si tanen
U bana shok i ngusht i vetes se veq veten e pata nmomente tkqija.
 Hahhahahhahahahhaha un veq per 1 edi ti per kan hahahahahhahaha
 Sa i kom ra un sdel bir nane qi ka ra pishman
Pusho,nese duhet,por mos u dorzo.
Nata mban er mekati
 Qetu ke fol si burrat qe doren 🤝
  aaa pasha kryt e babit ti mdole ajt kllx ni dat kur po shkojm
 Aj me det per mu ma qiti zanin e zi 
Mos u mbytni gjith me ni pik uj
Kerkush jo shoqet e mija tu bo foto&gt;&gt;&gt; 
Mos u dorzo kurr sepse ne momentin kur ti mendon se gjithcka ka mbaruar eshte momenti ku gjithcka fillon .
E rndsishmja o qe ti mu perpjek,kryt teposht e tu ec perpjet
 HAHAHAHAHAA Ajt se kur ta sho ka mi thon 
 Ndjenjat um kan dek i kom shti me ni sanek...
 Mu sa pom heket nja pom shtohen 10 tjera
Nese sillesh si budall tjert ala ma budall tbajn.
Edhe kur baj gabim qe sma fal nana, un apet ndashni tsaj mana
Do njerz largon shkaku se menojn ke mu ba ma i madh se ata
Andrra jote qe e ke pas prej fillimi,ndalohet kur ty trritet tuta ma shum se besimi.
Duhet mu knaq me pak qe me pas ma shum
Kur e do dike me shpirt,mosha,distanca,gjatsija, pesha.....Jan thjesht numra
Ndit sodit ma shum dashni kan kafsht sa njerzit.
Pse njerzit kerkojn fakte per te verteten,ndersa genjeshtren e besojn
As njeher mos i injoroni personat qe ju duan dhe kujdesen per ju,sepse nje dit to ta kuptoni se keni humbur henen ,… 
Mos u brengos nese je vetem,edhe dielli eshte vetem por perseri vazhdon te shkelqej
Pavarsisht si mund te jet,qka mund te ndodh mos u dorzoni kurr.
 Me ma idhnu nanen guhen ta shkurtoj HAHAHAHAHAHAHHAAHHA
Mbeshtetu veq ne zot qdo sfid ke me kalu.
Pasuria ma e madhe eshte mendja,ndersa varferia me e madhe eshte mos perdorimi saj.
Disa ilaqe nuk blihen ne barnatore sikurse prehri i nanes.
===