Nëse e shef dikan tu fol me urrejtje, ta dish se nzemren e vet ka 100her me shum urrejtje se sa ne fjalet.
 AMAR ft Donika - SHAWTY  via 
Ma real talk se di a ka me pas najher. Respekt 
 Hahaha boll i ka
Me fol pse po fol, mos me fol sen problem se sen po ri pa fol.
Veç fjal keni, jo vepra.
   Shoku tpakten un si aktivist po mundohem pak a shum tboj dicka.Përkufizimet… 
  Aktivist jam edhe Bdi jam. Çka ka tkeqe ktu ?
 🤣🤣🤣🤣 Ova kako naj nova verzija.
 Pikerisht se ka me shum Hate se support, kan ik. Ma shum kan qef me pa keq tjetrin se sa me pa mir vetin.
 Per cilin probem e ki fjalen ?
 Qysh jam tu e sha veten kur po foli per dy pasionet e mija ?
 Thjesht esht ni liber qe flet per manipulimin e njerzve prej krijimit te njerzimit. Ska tboje me BDI
Sen sjemi tu bo 
 Deshte apo sdeshte naj her vjen qashtu situata. Dikush e ngon dikan qe e ka lider Ali Ahmetin, dikush ja… 
Ti munesh me ble ROLEXIN po asniher KOHËN.
 1.Konkurenca,ka ma pak info.2.Nese klienti pyt per cmimin,70% ke shans me e shit. 3. Ne baz te mesa… 
 Baba po don me than qe ska efekt kampanja ?
Kom pa rich people qe jetojn nskamje, Kom pa shpirt perlyt me tesha tlame, Kom pa shpija tzbukurume e pallate,E ma… 
Spo ka kuptim mos me jau bo like statusat edhe fotot kejtve per Bajram.
 Faaaaaak cka je tu foool beeeeee.
Sot kejt ishin kon ngradski park 🤪
 Leleeeee, edhe kjo e mir o veq.
E kom ndreq puntorin ntavan, shum fillmski e kom bo, tash ka met veq me nis me punu.
 Ahahahaha e fort ke kjo
A ka met naj fmi qe i fluturon uquturmakat ?
   Yeeep normal qe kom
 Mo haver mos shaj me tiktok
Para se me lshu sezonin e ri t La Casa De Papel po ndjena njejt sikur me shku nfirst date.
Me dasht dikon tduhet me pas shum GUXIM.
Edhe 6 dit del sezoni i ri i La casa de papel, a jeni gatiiii ?
 Pse si ke shkru te drejtat e autorit ktu ?
 E shofmi do ti lem te flasin veprat.
 Mbas zgjedhjeve ka me pas shum shum shum ksi lloj projektesh.
 Mbas zgjedhjeve ka me pas shum shum shum ksi lloj projektesh.
 O edhe hekrit ja bojn qaren najqysh
 Po duhet me e shfrytzu bonusin
Stagnimi esht fillimi i nji fundi.
Sa te ket popull gjall dot ket rezistenc ndaj tkqijave .
Kush don me kajt nket koh tkarantines ne ta lshon filmin e historist te lojtarit PELE. Film kaq emocional moti koh skam pa.
Eee qe na knaqet e hajt.
 A kokshe aktivizu edhe knej, mir se na erdhe.
 Hahahaha se lo jo.
Jom lodh, po du me nejt i qet mos me fol.
  Ku me i dhan qato 5000euro tshkoj ti jap ?
 Qyyyysh po ato qe jan anej e kan ministrin e kulturës,  ti hajde knej ka ne se ne jemi a… 
Po po ato anej naj amatera. 
 Ose  ose shko bjer flej.
  se esht ruga e vertet.
 Programi jon o kon liber i trash me 150 faqe.
  se 100% te programit ton qe e kemi premtu e kemi realizu.
  se ato atje jan nooba
 Hahahahahahaha prap pot tham  se anej ska sen interesant.
 knej se per cdo problem kena zgjidhje
  se anej skish gjo
  se ato anej jan tu flejt
  e shef edhe me syt e tu e beson,  masanej i bjen pishmon.
  edhe ti sit dush me bo nej.
 Ti veq  masanej, punt e mira shum shpejt vin vet.
  se jena ma tsigurt
 se ato anej jan loosera
 se anej o palidhje 
 I ri kana kan mos ja zin per tmadhe.
 Neser n2 te kaimucki vazhdojm debatin.
 Ky ta shtin me kajt pitbullin.
 Un mendoj se ky lloj keçperdorimi do te na çon drejt nje ekstremizmi politiko-fetar, i cili dot jet vs… 
 O haver a po ti vjedhin tvitat a ?
 Mos u ban ciciafsh shlo hotspot.
 Perball postes nÇair te ndertesa prej ka hymja e par prej mbrapa
 Ndash nqeveri ndash te Visari shkojm kur tdush, veç kallxo.
 Shum video tpisavta po qon
 Po jan tu dergu vazhdimisht Qyteti shkupit ka dergu drona per me i detektu njerzit qe jan nen renoja. Ka… 
 I ke kry kollokviumet per qat po twitirat
Nprishtin e nala ni kamariere edhe thash mfal passwordi qysh o ? Ma boni, mir valla !Prishtinalit shum foraxhi.
 Me dhon ku sduhet kushton shum 
Kur je tu nejt me 20 veta qe sapo i ke njoftu edhe ty tvjen me tesh, edhe tesh, edhe kerkush stthot shendet. Edhe… 
Femrat skan qef me ju ardh era qebap se tuten mos ti han najkush.
 E kan udhen e hupt.
Do njerz jan tok prej natyres.
Pram fluffy (maca jeme) e kish zon nji lakuriq edhe ma ka shti ndhom, sa hini ndhom e shloj lakuriqin prej goje. De… 
Maca rin ku ka me hanger, e nese ska largohet, e ndron mahallën.
===