 au be bifce si bohesh en tai hahahahahahahahha 🤫 
 klubet e PL j'ua kan bo bajat futballin am ju e citni te fansat 
 tpaska rref baba tai
  e ka rendau Allahi at xhi e ka bo ka Barcellona.
 a sbon tjem deep kotekot?
 per mu perher d jeth thoth 🥺
 Gjithe menoj qe qikjo gjenerata jem edhe para neve kan me bo dicka ma mire e ma meçem, edhe tani hi n’Twitter edhe s’me…
   i vetmi lojtar xhi da unlockte pogben 
 shom ndrajshe vajn kto muhabetet me kt foton e profilit.
 sa baksuz duhet tjesh xhi bash kur vendosi nxemja globale tna mbajte txhish arsye per tjetau?
 nfund da xhije thesarin nbafce tvet o pn
 sn ka bo hic enchantment table se e kan vra tu mbledh leather per ti bo bookshelfat per level 30 enchanting.
 Tite ka kon ka Messi 
 flex per xhi mkan msau sopranos ke 
 plus e bona ckt xhi ta postoj kur tkaprcie kroacia per ta baksuzir deri nmaksimum 
Pedri o ne t'njejtin nivel te talentit me Afellayn en Bojan Krkicin ama nuk ini hazer per ti bo kto muhabete ju.
  au si i analizojsh hapsirat nsulm hallall tkoft
take a shot sa her xhi thot "spastron" komentatori i RTM 2 tu mendau se osht sinonim ma i sofistikaum i "pastron".
 per ramazon osht kon kjo sguxojsha me pi sende me alkool.
 mrajfsh branitsh mbas araujos en piques en dja dish gjegen gjalit.
 literally vjet u qajshit pse Neueri osht GK i Gjermanise a nauk Ter Stegeni.
 e vetmja fanbaze ini xhi shkojni pi ntkrahasaumes ni lojtari me goatin e GK ntshajtme per 1 sezon.
 gjuna en Werneri en Abrahami en Haalandi ta hupin karrieren tu prajt tlendohet Broja xhi t'lujn dni loj.
 sot ashte e diele 
 sta çel ende sajvi i 3 tai.
 zezakuizi d mirrte nja 150 likesa cataj pn
  i bim mbas seratonines
 tbh fakti se nfjalor tgjuhes shqipe a perdor fjala seksi en jo gjini osht ma shom arsye per tu kap ama sngucem un.
Njeri ma i heshëm n'bot! 
 cungi nis mo vec per nba fol dorzohu se gjuna ka nis tm vaje
 Da rrefte Lukaku Piquen.
 nese t'kan kallxau qeret si ju ka shku, kallxom en mu.
haj d him kit te faqja e Komitve n'Facebook en da shohim si jon tu hakat t'nisin luft civile se jan merzit pse ka pajk Vardari n'ligen e 2.
haj d him kit te faqja e Komitve n'Facebook en da shohim si jon tu hakat t'nisin luft civile se jan merzit pse ka pajk Vardari n'ligen e 2.
   kur dva ngjoje kt muziken UEFA dva heke licensen per tlujt futball kit.
 un sdisha si ta shkruj cat xhi ju murr goja kur dul da silva perpara ni akci 
 mfal king ki o pi atine xhi ta kishim shoc sda thajrshim kur d lujshim kunder besnikit
flm Arsenalit xhi ekziston per tm kallxau se sa kec me e pat punen Liverpooli, ka ma kec.
 Lironja Strugen xhi tkualifikohena 2 klube shqiptare per nEvrop?
 En un njejt mendoj se UEFA en FIFA jon Disney Villains come to life. Faleminderit shom! ❤️
 okej mund tkese 10 spanjoll tmajr.
 pi pervojave nLiverpool en Bavari a bo njer probably.
 u bo king shtahi da thajri ceferinin da shaj ka gruja.
 kur d boj pare tbli fen kualitet
 kur u pajtaum o pn
  e vetmja menyr per tbo muzika tmajra prap eminemi osht ti fajte dkush drog nsok. still the goat though
  seriozisht mendojsh se ende repovaten at a high level eminemi me cato muzikat e fundit ku vec fl… 
 jo hic bro na jan bo sholet si me i mbush me Peja.
1 like = 1 flm rosi xhi na e ke kallxau streamion
   hahahahahahhahaha d ta japem ni vajze t'bukur xhi raj n'kuzhin en d bohesh rahat.
   se disha se mundish hala ma shom tdalesh pi teme ama bravo!
  pi xhepcishti o ki gjali be.
  me s'pat kshtau nderhyrje n'loja t'mdhoja e lom kit i cojm tlujn biljard mos vrajten lojtaret 
 pi gojes tond n'vesh t'Zotit jarabi.
 nvend t3 ja la PSG njoni, ama besoj se ka vaket deri nfund tsezonit tva heke pi krajes videot e fjalimeve… 
  Barca duhet tjet falenderuse xhi e ka privilegjin tvizitoje kllub me 13 champions league ka 2… 
 Dmth bad refereeing sot ka kon vec xhi sju dha tverdh kit lojtarve xhi e rrethaun referin tkerkojn penal… 
 Barcen e du, fansat e Barces nauk se perher ckshtau arsyetime kini nese sfitojni. 
  Nejse se me e vazhdau ckt debatin dna perceshe Enes turki se shkrujm referata ntwitter.
  Shaka ke ajo pjesa e motivimit. Tucheli taktikisht da prajshtte Flickin 24/7, ama fatkeqsish… 
  says the guy xhi folen per statsat xhi i trajton kit lojtaret si me kon FM regens me kit stat… 
  Ndoshta ka kon i motivaum gje se nuk ka menaxher xhi da shaje ka familja n'pres konferenc me hup 2-3 loja me rend.
  Mbappe osht n'hap cataj, tu hakat ta pozicionoje vitin per t'shut per ma pak se 2 sekonda kun… 
  A dush t'lujm pa gollmona?
  mund t'perlahena per sende am valla kie cac trau per futball sa mos bazohesh halis ne xG..
  Pochettino ka mrojt n'finale t'championsit me ni ekip shom ma t'dobet se PSG, plus sivjet o t… 
 T'ishin n'shekullin 21 en n'Amerik burrneshat d i vlersojshim si brave trans queens.
 flm tifoz i ekipes ma tfort nhistori tfutballit.
fiton kush fiton nfund kit d festojm bashk me maica me ftajren e Xabi Alonsos
 a e mendojsh o pn ka gushti-shtatori kur d lujm prap futball ne 2 
Arsenalli o ekipi ma semi maturant ndynjo.
 dit e nat d folish?
 au be tjetojsha me optimizmin tond 1 dit kit jeten nrend da bisha..
 Majr be dërvenali, para 2 sahatve debatojshe se si ina ilir en pellazg en si maqedont skan identitet a… 
 eh, kur ishim bashk.. 
  e zdraun Kosoven, armiku i armikut tim eshte miku im.
 ok am per Vojsaven e bojsh ni perjashtim?
Nuk e di si mund 1 qytet ti prodhoje Vojsavë Kastriotin, Elitën 5 ene Rekllamën ene prap mos jet n'UNESCO.
 Nuk thash se osht gjeni, thash se di ma shom se un en tai, en se ka plotsisht t'drejt se futballi gjermon o krsh.
 true, Sancho osht proven vetem n'lig kari ku ka vec ni mbrojtes t'majr. Gomezi osht shom i fort, especial… 
 doesn't change the fact se i je kap Oweni kotekot per ckt debat, en se ka kalau 40 vjet perdit tu u marr me ni sport but okay.
 Sterling Sancho Kane Rashford jon kit ma t'fort se sulmuesit e Gjermanis, en at shom ma t'fort, nese shkoj… 
 Oweni ka harrau ma shom per futball se xhi d dim ne 2 bashk dniher o Pashtrik. Ama Allardyce osht ma efik… 
 jo vec tthom mos i vlersojsh shom hipsterat xhi lujn attractive football mni lig ku mbrojtja osht inekzist… 
 dmth en shtahi osht e diskutushme ckjo, ama kur e mendojsh se sa t'vjeter i ka lojtaret kombtarja e Gjerma… 
===