 ku ie be pajdh nene
 shom horny jom pr ni espreso te treshi fk
 Majr be no vec islami i ka fajet, nuk o se ne ina shom lesha kari. Pa mar parasysh asaj, mendoj xhi d… 
 hic se kom prajt se ni tip intelegjent si taj mund tboje kshau postime tbazaune nabsurditet pr tmbledh poena ninternet
 Pervec te majrave materiale, puna te mba shendetshem ene ka kraja, hin ne pun mo ma ha karin.
 kjo e justifikon kit dmth?
  en un sn e bindi vitin se sjom ki, ama mduketse nauk
  wtf valla ki o deni vllai jem
 Majmunin E Kontrollon Me Banane Ndersa Shokun Me Makiato
 Si te dallosh nje femer bazike:- Flet per astrologjine- mendon qe te hash edhe te pish uje jane trajta personaliteti-…
   mjekra e betshme in bold
 Cataj o kit poenta mgjanse hahaha
  Kie tdrejt doni se mendova ashtau un
A mund be dekush tma sqaroje pse jon tu e lag njerzit rrugen?
 Sot de shtajrem kursem kit perfekt jon sendet.
 *çilen derët e xhenetit*qiteki: 
 AHHAHHAHAHAHAHAH nuk o cac leht ta thujsh
   sn ta kuptova ket muabet hahhahah
 Neser mo se saunde von.
 Haj bon bije se e ke pas ditlindjen
 Mendoj xhi duhet ta plecnojm ket mesele hahah
 Nauk se kit kufit e mundshem i ke thaj, ke lon dega xhi sprehen
 Raj be rahat taj.
 Mos i thuj sabitit ashtau!
 Si i pershendeten berani femnat nshënd  
 Taj sta boj ni kruk
 Nuk o e shendetshme kjo majr po okej
Definitivisht jom njeri ma neglizhent nbot.
 Du ti paj kit pivat nbot xhi mos kese alkohol ndunja xhi mo bojn haram qeret. 
 Tkishe paj sa duhet sde ishe gerdit
Ose burek te haxhia
  T thash me mend prom hahahah
 O kon great tetova para se me ardh tipa xhi n emer tluftes 2001shit ene nemer tdeshmorve erdhen pi ma… 
 paramendo tdashurohesh te ni femen en kur tdalish tt thote hec ta bojm ni foto me doret te menjaçi
 Kom najs tva foli gjuhen
   Po tu kon si ma majr ce lujshim send u prajsh gjali tu ndajt hahahah
  Hahahahahah halaa be no xhi o puna sn i dal nqosh, de jem ka toka e premtuar se shpejti de kontaktojm
Xhi o be no gjith kjo e fugme nbith?
  Teper ie mainstream ahahhhahaha
 ti mshtajllen ndjenjat me foli ene ti reshkën 
 Majr o ta losh piven, pr tmajren e kombit
Sa her xhi ndjehem kec, mkujtohet se ka njerez xhi ngjojn turbofolk en bohem majr.
Neser e diell di vajshim trenerkat di hipim bicikllave ene de shkojm toposh.
 Ene ato xhi pertajpen me gojen cel.
 Shaum pak seriale celloj, ene edi se shaum vone jom me Breaking Bad aman nuk besoj se ka ma te majr, me kurseni ju t'Game…
 Vendim serioz o kjo, a ie i sigurt?
 Ma shom ma shom
 Nuk ka kurxho ma te kece se muzika e kece
 Kur e najsën dikush muhabetin me " O Vlla se une e kom ni tmajr, xhi kom va palloj njerzve nftajr" 
===