 dmth ke daja men shkujm ne nigeri
 Sondazhi ma i sakte si u bo per zgjedhjet 
 eme se en ashto 3 dit e mbajsh tej
 Mjegull perjasht mjegull neper story kingat tu pej shisha na e kan thejt
No problem kafe e mesme" 
efektiviteti i vaksines94.5%                       5.5% 
jeta ishte ma e bukur kor krejt dibra mbante zi per xxxtentacion
dmth nese jetujsh jasht vendlindjes nuk je shqiptar? 
 barem mo nuk ma cinte serbi nanen en motren,aj ne pejdh ne te nanes
shekulli 21 ende ka njerez si tallen per dialektin e dibres,en ma e forta folin ato kosovare si dibra i mbajti ne koen e luftes me buke
 okej ka do teprica ke ne si rejn vec per nomber
 en ma e forta cdo dit na kalon afer ne pazar pe mondet en ne kafe
te fillujsh pi ne diber si ka pas rast perdhunimi,njeriu si e ka bo osht i lir en ka bo vetem 3-4 vjet,kerkush nuk… 
nese folshin krejt per dibren se e pro koronen ce erdhen krejt ne diber sot?
 aj don vramun po ama kjo video osht ma para se te ndodhen ki rasti me ket george floyd
ende i kerkuj paret e sinetit upm
 si fb ne 2011 e perdorin
pak votoe jo shom 
 nana e paska qejf barin
 krejt mundoeshim te bim ne sej
karantina nuk zgjaten shomkarantina: 
cdo tweet Pubg ket cat,aj me na cani karin shom
ajde ajde en pak
fjoket e gjata mend e shkortna 
  per iftar aet pifi se ne sifejr ste mban
cish ani sifejr ej
tdi me i te kuce
 ne mondim ma shom se nithermejk
a jemi vec ne dibranet si kuptujm cdo dialekt? 
Jo skOm PeJ KorXh,AlerGji JeM 
2 minuta mbas iftari te anen ne mezzo 
pe ne vjet e morem vesht se ekziston twitteri  
mami shtejm en pak pomfritmami: 
 hahahahha vella ama shejf cme boni kjo
ne na e presin mikun 
 Kor i shof memories ne snap 
  aj ce ta prejsh hahahahaha
 shh se en on e kom qejf
 Kumanova po e feston muajin Prill- muajin per ndergjegjesimin ndaj dhunes seksuale me nje rast makaber. Ktu ku viktima fa…
on tu kerko ne google per deni film 
 ne te folen car dialekt te don pe mos e ndron dialektin se 1 shkopjan ceshet me dialektin ton
ej dibranke fol dibrance mos ja ci nanen en tej ctej
me mungon ajo koja kor i shkrujshim ne fb dekujt in ne chat
e tha dekush ma ne fond 
no one:babi:krejt politike osht kjo korona
a kini dru a jo?
 vella ne e fillom ket xho 
 Buta : I kom shit drog djalit te dajesDjali i dajes Butes tu e ngu kangen me familje : 
te ci karantinen e nanes
nominuj gjyshen,menduj se vec fejtet kot ne muabet 
vetem dhoma e refimit me mungon ne shpej
mbasi jeni krejt me te shpejs 
 sedin se tej karatiste je?
fillon krejt me dibranet euuu 
 gur te boemi me ket kajnge veres
  ahahahahhahahahahahahahahahqhhahag ejjjjjj e lae ponen en ske cbujsh ctej aa
dibranet tu u zan kush ti pagon kafet 
te tallesh me fene per nja 6 like 
ok ama cish karin ka interesant keto? 
 tej gur te boni ajo kajnga ce rejsh tosho?
vec mami me thot pe ajo ska twitter 
kor bi te fi                   kor ngrejem 
cdo maqin ne diber per momentin: 
i kom mbaro provimet pe asnjo skom kaluprap on: 
kor mendujsh se nuk e ke kalu provimin,pe ke shpeto per 1 pik 
 tej ta kesh mejr vella
kor u kerkujsh ne shpej pare per te dal 
mesoe vjershen jo butennn 
profesori e permenden fjalen seks ne klase te 8on: 
en sokun e ka kombino me bluzen 
kor ta deftujn pergjigjen ne test pe duet ta ndryshujsh pak 
budallat si ki nuk i sprovon zoti,ska nevoj 
dmth bashkimi kombetar ka mundesi te boet?
videoja ma me stres ne bote 
 aj se qeter kond e kini menden
 paska en emen ajo xhoja si e mbanje?
te veshish duks ne 10 en te boesh pishman ne 12,cdo dit
 hahhahaha denjer duet be
njerzit:ce nuk i        on:presish fjoket? 
 en veres i mbajm duksat 
kush osht per ta lan Fk?
 pse jem ne foto?
kush me jep netflix e fiton xhenetin mondet
on:skom stres per ne Fkmendja tem: 
 ej or tej eme pi struge e bish kafen”
kor me fteket se ka en 1 muj vere 
 kor te nejs per shkop ta lexuj ket 2 er en kom mbrej ma sa besuj ne mavrov
 a te thash mos pejsh ma shom se 3
ylli apa ti peje ato 40 miljardet si na i moer
shom colle me tha je,en ini ne snap 1 foto u cujti streaksave
ka mundsi ta jekim pjesen e lumi b en ta lam vec dafinen?
 hahahahahahahahah emer kapak or tej se shtatzan e lae ej
keto ma mejr a aqe?
 kor te boesh maturante te folish en tej
kor kopjujsh ne test ama prap 2sh marish 
 aj se te shofim kush te ceshet ne fond 
 tallami ta ka shkrujt ket tej sbesuj
e dish se osht vere kor e ket nr 
 Imagjino cfar bisede do bente ky me suzin...  
 Keto tu lujt fortnite vecse collet 6 vjet e folin ma mejr se 40 vjecari/ja me fakulltet aqe. ✌ 
en instagrami don te bie ne sej nisuj si snapchati
 shejfe me vella kan aro se i mbajshim me buk keto te kosoves
doktor duet te jet aj si te ma kontrollon testin e matures 
 e ka pas te shkrujtme budall te jet jo te vdes
on:me duet telefoni nema ctej     5 vjecaret 
 me ato jemi meso ma
kor jetujsh ne maqedoni kjo osht xhoja si e shofish ma shom 
tema ne provimin e matures kunder kopjimit”nxansit: 
 sa vjet ka me vella hahahahah
dalish me deni fejs pi amerikedibranet: 
 en ashto i ka qejf cocat
si i shof te shpejs kor duet te dal ama skom pare 
kor ja mboshen per radh te 4 cajin e rusit 
 haahaha sprejshim muabet per ket foton ne
folish ne snapchat si 20 vjecare folen te shet mend,ende ne fusion pi mbrapa ie se ka mbare
 Cish mond ti thoesh nji njeriu si te thot se xhexh kreshen ?
 Kur zysha anglishtes shpjegon fjalen "(car) makine"-Un dhe shoku ngusht i bankes: 
para iftari:asnjer sme pejet uj2 sekonda mbasi thret: 
kor duet te mbajsh deni colle si qan shom 
kor e pejsish mamin cka per sifejrmami:pi ne iftar cish ka mbeton: 
kor me apin njerzit pare per matureMe: 
lorini mer frejm”Njerzit:eeee maturant je a
 ne mest te twiterit hehe
Mami bon shtos palidhje pe tej te duen pare 
 -kush po m mson me lujt pubg?
===