Spo muj mi majt syt qel diqka
Se ku mran sedi tybe
Ca pika shiu me ran
Qija nanen sherefi tu bo sexting , a ka naj sherefe me mu??
 Pse sherefi osht ma horny se un HAHAHAHHAHAHAHA ja q dekaa
Mfs making me horny me zort 
Bimit pi qoni foto tcicav e mu jo a? Ani ani aj nalt ka mju vra
Ose dej nshen gjergj
Ajde puthmi dej nsabah
Krejt po thojn banu i fort, maju burrëE ka pas dashni e s'muj me harru kurrë 
 Ajde se ma mut ska ku shkon
 Bir shum je i informum mpelqen qishtu
 Ja ska asi kodre
Kto e shum te tjera na ndiqni pas pak se iku jeta per lesh
Qfar mendimi keni per kodren e diellit si park nacional?
Qe ki qasi foto qoma se un tybe nta kqyri leshin
 Paramenoje tan ajo femen aty ti shkon ja kqyr leshin .. po le be qija muhabetin e nanes
Ishte verrrrr moj  kur me laaaa Ishin ditettt plott vetmiiii 
Njerin parzit dojke me lshu shpirti .. a i tastatures ti  a
 Kisha fol po ma mir pe lo krejt
  Mfal brud skom qaq dvd tfort per kryt ton
 Kush ta prish dvd nkry
A dalim puthena nboj?
Qija nanen duhet mu pajtu qe sosht kjo jet qe une mu kan happy
 BABAHAHAHHAHAHAHHAAHHAHAHHAHA AJM A NORMAL GAJ
A ja qiva rini kultur e sporttttt
 Veq mu sma kthen a ani une mytnaaaa mytnaaaa
Videot e vjetra qe jon publiku n youtube jon special prz, sidomos dikush i mahalles ose diqka qe ka bo video, edhe… 
Un zdi per Ukrainën…Amo na jemi tsigurt  
 Hajde more perhajr une po u bojsha hallë
Zdi qka me bo qr
 Bir thojn qe n amerik qin shum a osht e vertet
Hmmmm po llem syni 
 Nejse havaja po ama taj mo
 Pse be ie ckac negativ
 Nuk behet autobusi mik jo
Bomni muhabet dikush se eca per lesh
 Jo mor mka kap me tripa tybe e pash te kafeneja jon labinoti tu fol turiqisht edhe meta edhe un
  Ahhh moj moter bile per pulen mdhimet …
 Kurban bajram vakti var
Hajat dert var borxh var cigare var ama 
 Cka i bje gudbaj fr frvr
Neden si uruspu japarssn
Ama ne var ne jok
Me fol me dikon nspace
E bukur simpatike je
U qova me sabah thash KATIL dosti jemGjinja jon ka thojn ja ke nis kto dit po flen
Ora po shenon 4:59
 Ja zdi un taj e dish
Dul lulija te dera
 Shom shtrit u pm
Se kto 5 miljardad e ri mut
Tu e rrollit me 10miljard
 Ene ajo nifar talenti o
Qe ka dikush qe se kupton le tregon se jau shpjegoj flm
Çite creven perjashta se da laj sokakin…
Dmth i paska qi nanen ukraines Rusia
Sn jom tu e podnes nise zdi pse
Jaja bruda a kall kit tu hakat
 tali u ba bab a un hala kqyri me rrit rankin ndot
 Kur ske ca ban futet robi e edito 
Nspace t kujna me hy me bo llaf se dekt
 Ose paramenoje qysh kan hanger smoka ose qipsa edhe me kap goten 
Shtrohet pyetja a me fshi a jo?
 flokt e lagta me long tpussyt🤞 
 Jo ne kete koh te lutem
I kom kry krejt serialat netflix baboo lujta
 E kisha mar exin i kisha q nanen shkelm teposht
Qija nanen zguxo njeri as me lujt valle
 Mka rajt nuchja mu nuk rej
 I kallxova se ske mund ene taj para do dite tha sn e lo vet
Me majt nudon e dikujna wallpaper nphone
Kur e mora vesht qe me qfar vorri o tu fol ajo qija nanen, vendosa te largohem nga kjo bot
===