jeta tfillon prej qaty ku mendon se ke hup
Du dikan tma kuptoje boten
Ku po shkon moj rrushe lales
 Un sa thash me nis ni master
nese kom bo najsen keq  ka pas naj arsye
Mos tishin kan kolokfiumet kisha nejt edhe 1 vjet nkarantin
 Hahahahaha shuj se u pakaa
Mos tpafshmi gajle tjera
Qetu kisha nejt 1 vjet karantin 
 Kejt kafet kena mi hec
Veq shqiptarin se nal karantina per mu feju
Po du me shku nfakultet 
 me nejt mrena qishtu une ja nisi luj luj luj
 Coronavirusi nuk munet me mrri ne Prishtine. Bllokohet ne rreth te Albi.
Me mujt ikisha shti nkanall do kolege
E paskan gjet krejt sot mu feju
Veq edhe ni provim
 A po i jep smoki a hiq
 Sa ta mirsh librin me msu
Mka mar malli me flejt n12-1
Nese sn bon mir bare mos bo keq
Seriozisht nisa me msu
Gzimet njet per mu kokan trralla
Shum jan tum mungu pauzat nfakultet
Qka ekisha hang ni baget
Menzi pe pres diten kur ka me nis me msu
Snapat lihen 1 sekond vetem per tu bo replay
Snapat lihen 1 sekond vetem per tu bo replay
Kerkush spo ri mas fjalve qe po i thot
Po du sa ma shpejt me nis semestri ri e ta pastroj gallerien
Sa shpejt tzavendsojn me tjer
 Meriton me bo retweet a
 sot vec netflix 🤝
Mas 3 vjeti muka mtek me ndreq ekranin
Qysh ka me nejt pa telefon dej neser nsaba
Smuj mi besu kerkujt
Mshkohet me naj vill nmes tmalit me shoqni
Tash tivuj vuj vuj
Qka po du me flejt 1 jav pa nal
Kam nevoj per ndryshime njet
Sa ma heret qe qona qaq mashum vanona
Jeta ish kan shum ma e mir mos ti kishmi njoftu do njerz
Qysh e qoj secilen tdille posht
Dit e nat dite nat
A patjeter ekam secilin sen me vrejt a shka
 Jo qe per at po tutna ahhahahahaha
Qka ekisha hang ni baget
A veq mu mduken palidhje qeto tripa a shka 
Spodi a muj me dhan gjak a smuj
Mshtijn nclose friends do njerz kot e kot
Nese ti thom senet para ftyre sdomethan qe jam njeri keq
Jam njeri i merdhift
E kom vre qe ndit maksimum  heci 20 min nkam
Parkingi ma i keq i mundshem osht nfakultet temin
Motivim per secilin sen perveq msimit
Qe 10 sahat jam njejtin vend
E du vetbesimin e qatynve qe e qojn veten pa limit nsnap
Menzi pe pres ta kryj kolokf e fundit
Sjom te shty nafaken me shkelm po pe shkeli me ker
Qaq qe skam qka me bo poi kshyri fotot kontaktve nviber
Sa shum mflehet kur kam me msu
Mu bo truni varianc median
Mlodhen ma shum me detyra projekte sesa me kolokfiume
 E un asnjanen sekam
Sa shum ju kom besuuu
Nmood per me bo gjithcka perveq msimit
Mos mdosadit qaq qe  me ti bo mute posts
Hec e kalzom mu 
 Amin!Per çdo lutje qe e kemi n’zemer po nuk mundemi me thon me fjale.
 Haj edhe un me ty
Pse mu sm vet kerkush a u ktheve a u qove
 vyn qesi pushimi. ‍♂️ 
Koha per me ngu slow muzika turqe
Sa dit e lodhshme
Sdi me ngu kang tjeter kur tpikna me njo veq
 Ngoje e mos kesh ktu
Kejt tmirat qe ike bo kan mu haru
Tshkoj dikun larg shum shum larg pi ktu
 Ti sike pa se ato ttshohin
Shum jam e lodht mo
Mos e ul veten tane per njerz qe svlejn kurgja
Sa mu pika shisha
 Hahahahaha hyn anash eshee
Shum gjendje tran na ka lan instagrami neve stalkerave me ket verzion tri
Nata so per me flejt po mi shtu gajle vetit me palidhje menime
Kur flej diten total trullavna
Sa heret kisha ra me fleejt 
A bon mos tja noj shum menen seciles imtsin 
Sjam gati me shku neser nfakultet
Kerkush se perdor snapin ma shum se un
Shum jam lodh pi krejtve
Sdi qka ju duket qaq mir efekti me peshk nftyr
Hahahhaah ani apet lodhje o
Tlendojn mashum kur e dijn qe je ngjendje mi dhan krejt per ato
 E para mashum pom pelqen
 E para mashum pom pelqen
 Te pointi po shkoj hajdee
 Deka per buk moss
Shum shpejt u smuna 
Sa boj plan me dal nis shi
 E un qe ikom thy e skam shti hiq 🤔
Definitivisht spasna gjum hiq
 Nese kesh nonstop telefon ater tjeter mhb
 Hahahahhahahahha ama na njo po njo 
 Ne mes asaj qysh dokesh jashte dhe asaj qysh nihesh brenda qendrojne Himalajet.
Film ma tmirr kur skom kshyr 
 Me ti njef tmiat ohooo
 Hahahahah eeee po ama pi ty ala skam
 Mu sum ke bo hala 🤷‍♀️
E nisi diten me tort
Mu lodh gishti tu i hec shpejt storyt e koncertit 🤷‍♀️
Po munona me gjet ni kang a veq ni fjal ja di 
Ka mem plas barki 🤭
 Hahahahaha qysh po thu ti
Ekom bo edhe macen si vetja 
 Skisha dasht kurgjo ma shume 
Ajde tash mi vet 10 veta cilen foto me nxjer edhe prap me nxjer at qe du un
Mem lan flej 2 dit
Fal qesaj memories snap po e shof se sa senet paskan ndru
 A sm nje be ti qe saa mo
Veq matka qe na pshton pi ktij nxetit
Zgjidhja e vetme ish kan  gjumi,vec mos tishin kan andrat
Ajde shti kejt me paret e bajramit me shku bazen
Fal do njerzve e kupton vleren e vetmis
 Kejt qeshmen me fry ska hajr boterr
A ska mu gzu un kur a shka o puna
A e ndrova venin mdel gjumi cdo gjys ore 
Ose e teproj me haje ose hiq nuk ha
Pse qelin IG tre masi qe e bojn publik lidhjen me najkan?
Du mu shoqnu vetem me ato qe mfeelin nmuhabet
Nese qika vnon unaza sdomethan qe uka feju 🤦‍♀️
 tu i mendu tan kohen njerzt qe nuk m'dojn, kisha harru me i dasht ato qe m'dojn..
Smuni me paramenu sa rand e kena na qe na dalin lot padashje kur nervozomu
Mos ja kallzo dhimbjen kerkujt,mos e lut kerkan per mu kan afer ty,msoju me  ja qel deren secilit qe do mu largu,dija vleren vetes..
Puna o me kan shkon e jo ku shkon
Sm kishte shku menja kurr qe kame lyp shivin najher 
===