 Po mundohesh ta harrosh apo po e pret te kthehet?
 Pernime sen stvyn ni djal qe jau bon like kejtve qikave qe i dalin perpara
Shkoj edhe kjo dat e mir 22.02.2022 
Kur do me kshyr big brother ama sen e le lojen  
 Kishe spe shef shka ka cit
 E me ndi ce ti je tu e ndii shka ban 
 Po tu ka rrit menja spi kthen 
    sa kesh tut than edhe un cet fjal 
 Veq po du qe ti ta dish qe gjithmone nji pjese e jotja ka me jetu brenda meje
 Ki mu kthy te un prap amo masi ta kuptojsh qe t'kom dasht ma s'shumti n'bot
Ky esht kalendari qe e dua fort 🥲 
 Duhesh me e dit matematiken e me ja zberthy ato dy te panjohur se mujten me dal te njohur per at
Sdi ku e marin at vetbesim ato ce miren me gjatsin ,peshen ,ngjyren e njerzve ntana ant bullizem edhe knej dalin ce jan kundra bullizmit 
Sdi ku dojn me arrit do e do ce mirren me gjatsin e njerzve pernime e keni a kerkush kerkan nuk e kan vet sa do mu kan e gjat ose i gjat
Sdi ku dojn me arrit do ce cesin foto edhe thojn un jam 1.90 shka me ba na shti 
Amo foto tmir i kam bo ❤️ 
O hala se kam cel zemren se me bo me cel her fyrn er ju merdhin e her del diell e ju djeg kshtu qe ma mir hic , let jet ceshtu vec fllad 
 Jo un thash ni shej me ta bo 
 Po cati nkufi ta baj shejen ti anej un knej po zor sun dal se llaki ska pasosh sun e ces ne te zez 
 Jo tatu shej me llak te thojve  kjo heket ja po dashka ni llak ekstra me majt 
This is me shejen ja kam bo adapterit vec edhe burrin duhet me xhet me ja ba ni shej edhe u kry 
 Tkisha pas ma ngat ta kisha ba dhurat ❤️ flm
 Te kane marre ne telefon ne 3 te nates per tju thene qe te duan? Jo? As mua, por mendoj se duhet te jete e bukur.
Do edhe postojn per fe edhe bajn llajk cika kejt deshh really ?
Cysh jan nxe shqiptart nkanga te unikatilit ban be ti vet kto e kan shkru tekstin
 A si ms ti njejshh nuk kuhen kshtu zine ce ski pi hic
 Ahhahahahah jo be leje
 Me ti lidh kamt ty a 
Pse more bani follow edhe ta hekni kallxo nese do vec me pas ma shum followersa ta ban dikush follow per hater un jo po dikush nashte
Njani mbani bllok vec pse disha me ja lidh kamt njerzve 
A ban ciken e motres se sjam un per album cover   
 Ban agje gjunahe hajde ktu me i la
 "traumat mkan bo ma tfort" fol per veti moter mu mkan lon gjys njeri
 Jo be ms ta nin sosh cajo shka po menon 
Interesant ti shifesh myten tu postu thenjee fetare a knej fjalt e pista nuk nalen tu shkruj nuk shkon kshtu jo
Ejj djali peribret kcen si kingur ntiktok kan lujt njerzit a spe ces videon se pe njerf najkush marre 
Ku  me xhet ceshtuu  
Kejt djemt e zant ce kan femra mi mshel rrjetet sociale kejt cikat mesin pa followersa 
 Ty sigurt tka mar malli
 qe 3 ore smi ka kthy fjalt qr nashta e ka perbi telefonin
Nuk i kuptoj ceto cet shkrujn thu ti e ki patjeter me ja kthy mesazhin ktive se zban 
 Hala jo po nihere na kan met do pi vjet
 Vendosa t'ia falja, por nuk munda, sepse ofroi arsye banale.
 Sot nje i ri/e re vazhdimisht zhvillohet me ate frazen “Shfrytezoje rinine”, kjo nuk ka diqka t’keqe nese thuhet me nje a…
Burrat spo kan muhabet tvetin e tan kohen muhabet te grave  
 Ahhahahahahhahahahahahahahahahahahahhahahahahahahahaha rastesish mra nsy se sisha mar me ty jo 
 Kush ash more ciki 
 fat osht ;kur ti e don nji person ,  e aj person ta kthen me t'njejten dashni .
 Po ti nuk e meriton me kalu ma mir 
 a e ki pa be na si tkesh pare kejt tdojn per hir t Allahit interesant
 Po normal ti spi ban gajlet e tua dikush duhet me ti bajt
  Ndac beso ndac jo
 E djali hoxhes  be kejt para kazinove po rri
  Jo tu flet jam per at
 Po bro tu flet jam
 Jo be vec shka po shof po foli 
Ah djemt ce munohen kejt femrat mi ba add kadal se po mytnu 
 Mos e le veten pa gjume, mos kaj, mos u merzit, mos bjer n’depresion, se vAllahi bash sinqerisht per kerkon nuk ja vlen,…
 Ma mire mos me pas sesa mos me dite a e ki a nuk e ki.
Puqrra jeme dul po e juaja  
 sja kthen msg 20 minuta edhe ta bon " a je tu shkru me dikan aaa " direkt block miqasii bonjani le ti jese djeg a je kon tu…
Ska ma kec vec pse ki tel pak mat mir do njerz ta bajn ajde e bajm bashk naj foto masi ti bajsh dy foto vec kur ta… 
Ju ce nuk e keni pa mir ishte me pa 
 Behu arsyeja qe dikush te besoje ne miresi....
Nese te kujtohem naten e don mem thirr lirisht thirrem se silent e maj telin sma prish gjumin pa gajle .
 Ty t'don ai qe ti se don,e ai qe ti e don e don tjeter kon
E vetmja loj ce skisha dasht me fitu  
Un po ama save e kam ntel  
 Po te ekzistonte dashnia...Kurr njerzit nuk do ndaheshin....
 M’ka marr malli per at kohen kur i lejsha teshat e Bajramit afer krys te palume, e menxi pritsha mu bo mengjes qe me i vesh
 Ramazani shkoj e un se pata at personin me fol deri nsyfyr edhe su bo nomi hiq qysh i jepshit ju zort me gjet para rama…
 Kjo zemra jem naive, ty ta kish fal edhe 99 her...Veq kish dasht ti mrena saj me nejt, dej vdekja t'na mer...
Mu martu sa familjarit i heken gajlet se u lodhe  tum xhet djem kshtu rahatohen te ngratit
Interesantja e ksaj pune ash se vet e pranojn djemt ket fakt 
Nese tbaj follow nuk pot tham shkrujem 
 Jan rrit me urrejtje sdin cka ash dashnia
Cfarë them un , flet per mua.E cfarë kupton ti , flet per ty .
Shum mpelqen me pergadit ushqime e sene vec kam qef mem ndimu dikush un pergadis a tjetei mi la ent se shum en baj… 
 Jo ty tbesoj po mka munu syfiri nashte 
 Apap ti i banee a
 Fakte interesante : A e dini se ne iftar nuk mund te hani syfyr 🥴
Secili e ka te drejten me ja dhan vemendjen atyre ce mendon se e meritojn vemendjen e tyre kshtu qe edhe e drejta j… 
 A ju shkrun najkush najhere veq me ju vet qysh je?As mu
 Mos ju lut askujt te qendroj pran teje sado qe ta duash,nese do te donte do qendronte pa ja kerkuar ti kete!
 Ato qe t'lojn veq per ni gabim tondin,kan planifiku moti me ik.
 qai qe tdon ta kthen sms nsekond jo mas 7 ore.
Vec kjo koka teper e bukur  
Ehh se kemi ket fat  
 Qohen nje mengjes plaku me me plaken, -Plaku; Oj plake, qitnaj nga nje kaffe! -Plaka; Ani, une po i qes kafet, ti lan…
 Kur dikush e ndan ni problem me ty munohu me ja hek gjysen e kti problemit e jo me shku me ju kallxu krejtve per problemin qe…
 Athu me kon osht tu fol
 krejt qka un deshta o kon veq me m'dasht.
 qka vyn ni djal qe e don vemendjen e krejt qikav?
 veq ni her n'jet kisha pas qef me pas dikon qe ish tut mem hup.
Mtha pse  eki pa mesazhin e spe kthen a knej poston e ti pse edhe pe shef se po postoj edhe spe ban llajk a
Ma shum pom bahen shikime nstory wp se llajka ne insta 
Pse te shqiptar met pa se je e shkurt menojn se je fmija i vogel 
 e tash qe s'jena tu fol a po t'kesh zemra?
Masanej dalin folin thojn femrat provokojn , shka ka mujt me provoku kjo gjyshe ce ka ardh nket gjendje marre 🥺 
 Koft perhajr hajr na koft
 Dej dje ki fol shti kishe pasna harru se e ki 🤪🤪🤪
 Te dashur prinder me bebe te vogla ne restorante, mos u ndini ne siklet kur ju kane bebja sa te mundet edhe dikush ju kqyre s…
===