Cdo gje eshte duke ndodhur per te miren tone...
"Mendja" hiq shkronjen M- endja.... mos u endni nga Mendja... degjoni shpirtin tuaj, zemren tuaj Zemer= Z- emer, Zo… 
Idea negative e mbjellur. Ajo nuk ka nje metod ka shume metoda, nuk zgjedh nuk klasifikon nga kush dge si do te fut… 
Sa mesazh i bukur 
Kure mos mbaj dyshime ndaj askujt. 
Faleminder per kete tregim te bukur Besnik Kryeziu. 
Kur gjithcka do e ke, ato jane miqt tane te dashur me te cilet asnjehere nuk mjafton koha per te qene bashke. Mesoj… 
Duajeni njeriun qe krenohet me ju.Sepse njeriu qe i gezohet vlerave qe i zoteron,kultivon dhe dashuri per ju.Hua… 
Nje gjarper e ndoqi 3 dite xixillonjen per ta kapur. Mbas tri ditesh,xixillonja e lodhur ra ne duarte e gjarprit. P… 
Ne kemi shume miq por kur vjen puna per dicka shume te rendesishme kemi vetem 5, aq sa gishtat e dores. Ne njeren a… 
Me kenaq shpirtin kjo video &lt;3 
Ne se pari i krijojme shprehite tona, pastaj shprehite tone na krijojne neve. Ju qe keni degjuar DJUJ besoj e dini per cfare po flas.
Ka plage qe nuk duken ne trupin tend por qe jane me te rezikshme se ato qe gjakosin...ato plage mund te jene zinxhi… 
Nga e thena ne te bere ka nje Univez te tere.
Zinxhiret e shprehive jane shume te lehte per tu ndjere deri sa te behen shume te forte per tu thyer.
Shprehite nuk i verejme sepse ata na verejne neve dhe na bejne te jetojme ne te njejtin vend perseri e perseri.
Vetebesimi, veterespekti e ben cdo enderr reale. 
O pa keto periudha te veshtira nuk ka ritje, pa shi nuk ritet fara ajo thahet, vec tu lulzu nuk kam pa lule pervec… 
Nese ulem te pushoj nuk mundem as 5 min te ri kot, pushimi me duket si humbje kohe! A keni ju kohe te pushoni apo te degjoni muhabete koti?
Shume kan qefe te transformojn boten pa bere edhe nje per veten. Vetja ju duket ok bota sju ben.
Njehere te shajne, pastaj te luftojne pasi vdes te bejne lapidar. Keshtu jemi ne njerezit ne kete plan te rafshte t… 
Sa ndjenje e bukur kur degjon lajme te bukura. 
Fajesimi i vetes apo te tjereve eshte energjia me e ulet humane. Mos ia beni kete vetes, pranoni gabimet tuaja dhe… 
Dhimbja eshte e madhe per popullin tone, por do te ju lutem me gjithe fuqine e shpirtit, me dhimbje nuk e ndrysho… 
Gjithe kjo dhimbje qe u manifestua diteve te fundit eshte si arsye e dhimbjeve qe kemi patur per nje periudhe te ma… 
Uroj te jeni mire miqt e mi...lajmet e fundit na tronditen te gjitheve. lutem per qetesi .
E kjo mbaroj mbas lekut, se mjerimi shitet dhe ka  99% klient. 
Shume per te mesuar ti akoma ke...
Kur dikush vozit shpejte ne komunikacion, i bie sirenes, ka te ndezura 4 drita leshoni rrugen se ka ndonje urgjence… 
Djalli futet ne mendjet boshe dhe i ben ata te heqin dore para momentit te fitores se madhe. N. Hill
Nuk e kuptoj pse deputet e Vetevendosjes kane kerkuar te numerohen keto vota?????Ju qe i votuat ato a e kuptoni ke… 
Ushtrimi qe rekomandon Hetem Ramadani per nje trup te shendoshe. 3 minuta ne dite. Por si qe thote mund ta beni edh… 
Kur ulet indeksi mesimit, kur ndalon ritja te duhet me shume kohe degjoe 
Ata qe jane pesimista jane pengese. Nese njeriu thot e kapercej jazin ai e kapercen, nese thote se kapercej ai ne j… 
Ja pse them degjoni njerezit qe kane arritur sukses. Tuti albanezi, tuti komandanti. Nese dikush ka 1 hektar toke… 
===