 Ktu jam ktu… Për ty kurr skam me ik
 Mfal Haver NaShtA Spi KupToN LojAt !!!Un E uLi  KrYt VeQ KuR i LiDhi ToJaT..
 No one Kto n’Facebook 
 A je zgjut a po rrin n'mendimee
 Munët me kon dita, minutat, sekondat e fundit qē fol me dikon vlersoje edhe thuja fjalt ma t'mirat se kurgjo nuk t'kusht…
 Shum po du mi shkru me pyt qysh osht.
 un sun po flejmendimet n'replay
 Nese don me dit me kon jom qe ngoRrall me tetont e shpesh me qekto 
Ma mir  bardh me ma bo n’cs se me dal me hec jasht nket koh
 Jam i vertet si vdekja!!!
 Ti je si ato kangat frengjisht, mpelqejn ama sen si mar vesh
Problemet ndoshta smbarojn perderisa flejm,amo mjafton qe dhimbje s’ndjejm.
Mos se t vrasin per ket qen 
Italia me keçap haxhi nenja vozit tocak,italia me majonez haxhi baba vozit mercedes
 Tprek dikush              Masi kthehesh e me dur t'lagta               shef qe asht          n'qaf…
 Nane tu ka rrit djali ma stlen vet ❤ 
 Sot po shihet se qfar dashnie kan Shqiptaret per Shqiptar♥️
 Sdi sa herMe ty m'ka shku menja me ikKu as vet na mos me ditVeq me ik surpriz me pritE sen me veti mos me marr
 +Aki naj hobi? -najher jastakun ekthej ka ana tjeter.
 Nëse sje happy bonu per inati
 Kur je happy e shijon muziken, e kur je sad e kupton tekstin.
 Me one night stand-a zemrën jau thejEdhe maj n'replay unë
Edhe me bo miliona apet ha pogaqe
 Eren tone kur e nij mushet zemra me dashni
 -dikur tkom dasht ma shum se eren e benzines -a tash tkam ma inati se eren e domestosit
 -Baba jem e kishe bo tag nanen teme te ajo muzika e Mozikit dhelper dinake -Nana jem ja kishe kthy siri siri dikush nmes n…
Njerezimit interesi ua ka myt trurin
 djemt qe veshin trenerka, jo djemt qe ngojn anglisht, jo do djem qaty ma anej qe veshen me rrollka jon jet e jo asi jo ks…
O yll i botes kur t shoh ty haroj ti jap bar lopes 
 Kur tkam lerg tkam afer se kur s'tkam tsho n'anderr...
 Zivotot ne e nutella
 Veshi jakne nsabahKrahi jem tan diten: 
 Ti vet i thot qutekit gel gel
 Un edhe uj kur pi mdoket qe baj troshka
 Nese tbjen najher nermend ty per mu qoma ti mu ni kang
 Kto persona sedi qysh e majn n'kraharorin e majt at cop akulli 
 Po ti maje lokacionin nsnap nal sa t dush se une ta kqyri scorin loqko❤️
 T’ish kan tradhtia land, ti ishe kan profesor n’harvard
 Kur e perdori fjalen “alltan” mdoket vetja shum mangup
 Najher nuk osht krejt te parja,ama najher osht krejt te parja
 Si ta kesh qefin 
 Ama n patik nuk asht interesant ma me tradit duhet me shku me papuqe
N papuqe gjuj ma mir 
Me ni vakt ka fol burri u ka dridh muri Tash folen gruja nalet struja (rryma)
===