3. Eksperte te ndryshem mendojn qe pranimi i  per negociata me  vetem se jep sinjalin e pare per nje terheqje t… 
1. Plani i Putinit per nje pushtim te shpejt te Ukraines dhe arritja e dy qellimeve finale politike, nderrimin e qe… 
3. Nostaligjia per te kaluaren eshte refleksion i paaftesis per tu perballuar me te tashmen dhe paaftesise per te p… 
Sa te ngjashem jane vandalet te cilet sot vandalizuan kongresin amerikan me ata te 27 Prillit ne Maqedoni. Jane ve… 
 Me shume se kurre me pare! 
1/2 Ata prap se prap jane shtete te zhvilluara dhe disi ndohsta munde te arrijn sukses ne luften kunder virusit.Nde… 
Sa me i vogel qe je, po aq i madh imagjinon veten.
Platoni, me "alegorin e shpelles" me se miri e shpejgon kete fenomen.
Urime 28 Nentori. Le te rroje per jete shqiptaria
E mbaj mend kur para 10 vjetesh nje Prof. ma shpejgonte librin e Fukujames "Fundin e Historis" duke me thene qe bot… 
Pom duket qe sot me dasht librin eshte nje lloj patologjie...
 Te na turli qyrri e bali ti lshon sirenat ne komunikacion! 
Shkenca nuk behet per mbijetese, shkenca ne esenc eshte luks.
Blerim Reka / Kujt i mbetet froni evropian? 
Ela tu pij makijato.
Ani be njeri kur ta shese dijnitetin e shet pak me shtrenjt...
Me shqeteson injoranca e cila jep lumturi.
Mundesi studimi ne njerin prej universiteteve me me perspektive, Universiteti "Nene Tereza" Shkup. 
Cysh more njeri e mer si normale kete punen e LGTB-se?!
Tash na zu gajla e ktyne p....
 Mos me thuaj qe edhe ti ke rreshqit ne keto tendencat e kohve te fundit kundrejt demokracise liberale 
Thuhet se, nese don te bejsh armiq thuajje te vertete. O leji armiqt, ne kete sitem nese e thua te verteten i lem femijet pa buk.
 Nuk mund ta besoj se, ata qe e lejuan fasadimin dhe shkaterrimin e monumenteve kulturo-historike ne Kosove, kane ndjenja…
Sot te thuah te verteten eshte shendertuar ne nje patologji nga e cila vuajne njerezit e drejte.
Mem ndihmu dikush si me perkthy "spatiality" ne shqip.
Prirjet e nje pjese te atyre te cilet veten e quajne intelektual per manifestime shkencore vetem se i ushqejne ndje… 
Po pse me urrejt kur mundemi me dashuru?!
===