Pa saber pa selamet ska sen
 Nuk e di per ty ama un kam humbur 5 familjar (femij) qe ka lind sot e te nesermen kan vdek prej atyre… 
 Ja paske kshyr fallin ti 🤪
Un i vogel kur mzike gjumi nkerr prej Shkup-Kumanov 
Ska moo baxhet, karasime, kadaif…
 Wow ka mdole ti se?!
 Thu se punt i kemi si Dubai tjeter hall skemi 
 Ndoshta pse ska. Vesh asniher 🤣🤪
Sa her osht tu mra ki tel jem prej dore cudi qe hala po bon
 Epo qysh kish than shefi e djegi e nuk i zbres qmimet 🤪
Un si 10 vjecar kur e teprojsha nshpi edhe tshpis u mundoshin me pajtu me pare … 
 Po ti kallxon aj shoqi se nime
 Kto bile paguhen e naa hiq 
 Ka than i nderumi qe me pa pakez drit
 Msheli syt qeli veq kur ta shifesh kalendarin 1 Mars
 Sbon mu merzit 🥲
 I 5 per mos me tmorr msysh 
No one: Une: kesh tu than diqka po harrova
 Ki ba pare shti perqat sje tu dit 
 Arbana dokesh shum bukur sot
 Valla qekjo aktorja me tqaf besoj qe tkish kry pun
Qysh ka ardh koha Mk me shku mysafir me qese osht vertet lluks i madh
 Haha faleminderit ndonjeher fjala vlen me shum se sajgia 
 A ska naj torte me pre a :P
 Cdo vjet ulqin ndrroje pak
 Un po bi me flet 🤪
 Ky ka dhan dat albini spo jep 
 Ndrroje bre vajz kerkush me zor spo tma
 edhe ni kojshi i jemi qe shet boronica ish tu qit album mtregoj ma heret!
 Aa pe gjujka lugen tavan qaq e paska pas
 Shpresoj ta kesh vaksinuar se shum i bukur qenka 
 Ai nuk te le vetem asnjeher
 Spo thir mo daja ka bo shoqni … 
 Nballkan pergjithsi ska siguri po ishalla kosova forcohet ma shum
Prej Vaksines e kemi 
 Ose tnjejtin cmim e ka e shkrujn aty kishe zbritje 40%
 Ani klysh jon hala ma tmir 
 Nashte sja ke kthy dm
 Jo se tani spo dim mu qu po mesim deri von
 Albinicilin duhet me pi nashre i kalon
 8 e 10 minuta sot
 Kuku bal heret kokshe qu
 Okej ani (sa me ja bo qefin qaty)
Klop: Nuk do e ftoj Real Madridin ne ditelindjen time
  tfort e ki shoqin pi amerike
 Bile ma drejt se diaspora qe voton ska ato sjan dikum prej asni partije, ven se me than faleminderit qe po dryshojm pak kjo 
 Spo bohet viran 1 muj me lan svrehet llomi
 mthojshe mirre ngjyr tkuqe qe e bardha ma mir po i shkon 
 Daja thell ne mendime
 Deri shti qka lexova komente krejt spanjollt tu shkru kosovo es serbia veq njo dul esht futboll jo pol… 
 Si besoj prap kjo koh nsekond ndrron
 Namin e paska ba
 Cilin vend jan mshel fakulltetet?
 Edhe un mendoj njejt thjesht i duhen lojtar te ri panvarsisht ktij sezonit mendoj qe e meriton edhe sezonin e ardhshem
  Jobe se per hajgare. E ka pas
 trup me pas se men dit sodit nuk tvyn shum  
 Nashte i del i njofshem virusi
Idk man kshtu me flejt spo mflihet po syt po mshelen vet
 Nese e ki fjalen per sot ftoft valla 
 Me 1 milion mahalles ja paguj nxemjet edhe ty ti zgjidhi 100 problemet. Me 2 milion kurgjo 🤣
Kur du me dal me shoqni ama kerri osht pa naft 
 Heki qicat po tshifet wallhacki prej nqill
20 koksha martu qe dy vjet e spe disha 
  po facer bir kokshe kon ma i ei ani kqyrja mustaqet apapap
  Une bir me viber se whatsap po naj pergjojn bisedat 
  Ti po rren po rren po rrren
 Khuu bir pi ramazanin e kalum spaske qit 
  Un kam mendu qe peshkatar je
  Hahahahahah si ti doje letrat e mija se sjam nzor une e di ti 
  Na kemi luftu bashk be si Koshare 99 si ne Sllupcan vitin 2001 per ni ideal mu bashku… 
 I ke prirjet per poet.
  e ti bir qe je gati 2 metra i bje dy her me tthan a ?!
 Tweeti asht mendim shti a tpelqen ajo kejt sjemi tnjejt
 Na neser fmive ton a ju se keni provu virusin 
  po ttham rrite bir mjekrren ti jo 🤣
  Nuk e di qysh po e merni guximin me fol e me e ofendu popullin ton veq per me mar ni like ne rrjetet sociale.
Un flej gjum un gerrhas se un jam njeriii ....
 Lumturia sheron cdo lloj semundje , prandaj qeshni o njerez , qeshni sa me shume !
 Qka po mdhimet i ngrati 
 Ishalla se qeto marjanat boll tkshi jan
 Po thot kjo shoqja jote ku po qaros 
Ti e dije po se dije
 Vllavi ma keq se shkavi
Un me kolegt kur e japmi provimin e njejt... 
 Bir ti me shtete tmdhoja
 Mara skam hi asniher sdi qysh mpaska dal
  Qka me pa bardh ish ba 
  Gabim e trusa foton tane me hek mvike palidhje .
 Sigurt qasi mjalti kan perdor
 Ska koh aj asht i zant tu i shky pasaportat e shtetit vet 🤣
 kur e shoh qe kam veq 1%  bateri ntelefon edhe se kam adapterin aferune:
 I mecen na menojshmi qe budall hahaha
 E ka marr at ukin me vete mu rujt pi alienve
Gjith ni prof i jemi ja bajke: Shqiptarit ja jep gishtin ta merr doren 
 Kjo koh skthehet mo 
  tpresim ma tfort per 2020
Kqyrem nsy kur tfoli unee 
 Deri sa marr frym,vrapoj, shikoj ,jam mir besoj qe i lumtur jam gjithmon duke faleminderu zotit.
Une kur ja qelloj paswordin naj shoqit tem 
Dollar edhe funtaFranget nZvicerr se po nihen ma tsigurta...
 Hahahaha ajt be se kishte qare kishte mjalt 
 Je tu msu shum perqat
Un si fmi kur bike shii 
 Qeshtu kurr trrok rryma
 Se pata per ty prof 
Adem mos mungo edhe niher se tkapi pllafon tok pllafon tok.... 
 kur e shenon “a u qive“ n’ven “a u qove“ 
 Po mujshe mi porosit me qira
Qe qetu tu e shiju jeten ... #Çajmelymon 
Kur mendon qe i ke bo krejt pergjigjet sakt provim 
Zot ruaje popullin Shqiptare,se Shqiperine 50 here e rindertojme!
 Sbesoj tortur ma tmadhe qe ka
 Ose kur i thu te ta then ne sy ne vend se me fol mbas shpine
 Mos po del naj skenderbe
 gjithcka filloi nga ketu 
 Kqyr qonja edhe nonat n'hotel sonte le t'i respektojne se po koriteni 
 Pranvera vera vjeshta dimri
 Ani barem per stres kish kry pun 
 Mjalt per mi kalu provimet 
 Hahahahaha po kemi fitu prom si bindshem perqat efektet e fitores 
Saranda ma e miraa 
Kur tpunon truni prej i vogel 
 Hahaha podee mu mkonvenon me hup 
 Hahahahahahah thjesht je e vecant kerkush sosht perfekt hahaha
 Valla bash mu kan tkishim hy kshu nsettings edhe nervoza off ama joo hahaha
 Rrofshin ato qikat qe ja majn fustanin permas
Boll fort inati isht me i dhan dikujt perparsi komunikacion e aj mos me ta ngrejt doren 
Si ato macat e egra kur tnisen mu ngjit mes veti 
 Po ata skan sy me tpa ty perqat 
 E qeshtu po u koritke njeri
 Sepse mendja tjeter ka 
===