 Tkish kan twitteri shkoll kishin ngel shumica arsyjet1. Dojn me dhez tu i nenqmu njerzit2. Me dhez me foto nbikini3. Mu…
qifsha nta u piqku mater
Ti je asi bali qe mendon qe jan kurva kejt ato qikat qe sen i ze
Un sdi ku e gjeni at inspirim me postu foton ku ju vizatohet ai p** shtremt
ma ke tesh karin me kto flok sinqerisht 
thiri edhe ti najher 
 po perngjashi kujna pi kallxon pralla
 ec ta kapi faqen shko veshi pizhamat
qeky shum si qeky  
Demek un shpijen shum tmir e motorrin e fort ec more fmij i pergazt me mundin e babes lazdrohesh 
Zbulohet gishti marramendes miq 
 bir potkallxoj un qe vet ma hajke mi like fotot
te majt bothen se pi hik 
sduhesh me prit duhesh mebo vet 
Oooooj balica maica zez me jelek tbardh nuk shkon merme vesh niher e pergjithmon 
ju djemt qe njani tjetrit i thujni thz,thl kejt nqender sot me ju pa
mos mi hup streakst de 
 fmijaqit karin ja hanksh
ajt se perderisa ki pas fr me emrin shaban as ti sje ma e mir 
qeshtu kur sje e mir as vet 
  ska me nejt shum
Ta ha dreqi n bark se sbon bismilah 
 Tu rit nera bro
 vjell bro kush po tndal
 Nuk be sbesoj qik e mir doket
gjuna kjo qika pale sa mshan
Qa thuni a me ja kthy ksaj qikes twitterin a jo?
shum bajata njerz kokshi
mem zbulu kush jam athu a o e rrezikshme kjo qika a mban najsen?
a qysh po tshkrujkan koment paa tnjoft aa kuku
Maheret koka desh me hacku qet twitter valla
Interesant qka ska fol kjo qik ktu me kerkan
qeky twitter me tbohet u jemi a kjo fatmirja le ta qel nje tri
 Qka po u rasshe ti kamos
A ktu po mujshe mu rree me najkan saaa mir
 ket tw seka shkrujt kjo qika qe eka ket twitter kshtu qe fshije se pa buk mes
 qka ti nin moj ty o vintill
 pse ti a e vet najkan qe ju shkrun djemve t huj aa a a ????
Po u knaqka more njeri ktu
 spo tvje turp ty me shkrujt me djem t huj e mu pse mem ardh
 Qka kesh be ojti
 Ma kujtove at thenjen ma mir vetem se sa nje shoke te keq
 E qfar i duhet shkelqimi kur eshte veteeeem?????
Qysh be muni me flejt qekaq heret
 Mos u pikello per ate qe ta humbi te miren qe i bere, sepse ti deshiron shperblimin prej Allahut.
 shum interesant amo se sot sefte permena crush n tw 🤷‍♀️
qysh be ti e mlume a knej naper twitter crush sene mene — HAhahahahahhahahahahahha edhe un jam njeri peace 
Si arrihet deri ne bllok — Qysh je tu shkrujt vec kur ta shifsh tuka bo bllok fap fap 
Dyqysh mukon qe ka nai pytje interesant n’curious cate ekisha postu amo skaa
 Ja e pelqej qaty fap fap ja ska mavone
 Mukon qe e pelqej sja baj bllok 
Ta baj bllok fap fap ska aty
Dyqysh podu mebo nje crush be
Ja sot zoni sjuv ka ni
 bazohu qysh e njeh qat person jo qysh t fol dikush per to.
Po dojn nai vegz me ma nxjerr e tani n’to mu vjer
Ndoshta neser un sjam gjall ndoshta qyqja knon mbi varr ndoshta edhe ti mkerkon me mall e na takoft i madhi Zoooo…… 
 Hahahahahahhaha ms kesh se sen pe mer guxhimin
qe sa po du met shkrujt sun pe mar guxhimin sedi qysh reagon — mere guxhimin 
Por kaktusi nuk eshte si ti.Ate nuk e perqafojne dot..!
 Kur une te keshilloj ,mos prit te shikosh njeriun para teje"E Persosura",Une te keshilloj te jesh me mire se une,Ndoshta Zo…
Qka t’vyn me pas shum njerz afer kur nuk eki ata qe t’mungon?
A osht keq me flejt nervoz? — Kur je nervoz sen flen 
Ti zban me nxjerr lote,ti duhesh me fshi ftyren,zban me merzite djalin ti duhesh me dite menyre,nano ai osht shembu… 
 Kah si alena po dokesh
Bash kur duhet me pas skam batery
 kta e ban vec selaki dizhonskes
 dil prej fillmit dil
Shum po vuaaaaaj~~~~~~~~~~~~~~~~~~~~~~~~~~~~~prej Mickojave
 AaaaaaJoooooooooooooooooooo sosht e vertete genjeshter shpifje
Po thojn qe je menemadhe a eshte e vertet — Sosht 
Ma mir vet se sa me dikan qe tbon mu n’dje e vetmume.
A tka lon pershtypje naj djal? 🦋 — Ala jo 
A menon se egziston dashnia? 🦋 — Vec mes meje edhe nanes teme 
Edi qe njerezit largohen kur je keq ata qe te donin kur ishe mir
Sinqerisht pom mungon diçka qe edhe me pas tash nuk ma kish permbush mungesen
Do seneve qe ju kom dhan rendesi................mo s’ju jap
 shka o tu ndodh?????????????? 
 Qka osht kjo be
 erdh dita qe ekom prit pin shtator
Qka mi intereson mu beee
Ti ri n’chat kur t’folsh me mu,un pse s’rri ska lidhje.
Mos me duaj kaq shum,se s’dua qe te vuash,me ler te te dua une,sepse un duroj cdo gje nga ty.
A ka mundsi mem lan me flej pam nervozu ?????????????????????
Sosht mendjemadhe vec pse nuk i jep cdo kujt mundesi me njoft.
Kush e adhuroi Ramazanin,ja pra Ramazani shkoi.Ndersa kush e adhuroi Zotin e Ramazanit,vazhdon edhe pas Ramazanit me adhurime.
  Aq e kaa e aqq e kaa e moj fatmirja qerpikun moj fatmirja qerpikunnn
 Saaa e kaa e saa e ka oj Kosova token
Sa e kaaa eee sa e kaa eee oj ora dakikun oj ora dakikuuuun
 Mungesa jem,a t'dhem,a m'ki n'harrese?
Ti mace e zeze,ti mace e zeze shum e pa bese
 une jom aj qe ju jepi advices per dashni krejtve a vet jom single,
 Nese ni femer ne nje moment ta qon vetullen, automatikisht ti si mashkull lirisht munesh me ja lshu vendin edhe rrugen…
 qe motra jem per bajram hajt 
 Ani telefonin mushe me batery se sta mush kush 
 adetin me jau bo
 Un e ha amo so qe ma kona qaq shume bakllaven
 S'ka dicka ma emocionale se perfundimi i taravive t'fundit!Pernime jon xhennet i ksaj bote!
O bllok n tana ant me ja bo mukan  qe tdo nime tshkrun edhe prej n viber tnanes po shuj allahile
Ty zemra tka vdek ke nevoje me n gjalle
Pse ta boj like ose rt sjam tu tu lshu o kikirik
 2 crusha nmahall1 te stacioni autobusit 3 nshkoll2 kamarierat te kafja 50 ninstagram THIS IS MY FRIEND
 Pse me u hakmerr?Kush tka humb tash veq se e ka ndeshku veten.
Me dike jeton e me dike je gjall
E verteta vertetohet,rrena mbetet rren....
 Hallki:Une: Tu e shiju jeten (tu i kqyr punt e mia) 
 edhe shitsit adapterave ju kom ba bajat gjdo jav ka 2 ti ble.qfar jete e mallkuar
Ne nje bote plote urrejtje ne ende duhet te guxojm te duam..!
 jo qe najsen po fort ju du juve qe s boni rrafsha.
 Zemra mban ka mbrenda, qka smujn te mbajn malet.
Kur Allahu ia mundesoi te udhezohet kush je ti qe ia permend te kaluaren e tij te hidhur?!
 apedi tash qka osht genjeshter?
 sje mo shoqja jem
 ende po vazhdon miq
  Sinqerisht tal mke lodh me qeta patjeter qe po
  Mos um qartni rrini urt
 ato tishin kon tmajra kishin mas fr per veti
 un mos tet kisha dashten nuk tkisha luten amo un taj tdu ene me taj du tfoli
 crush denifitivisht Ishallah kallesh n hell
Mos lejo met trajtu keq vec pse e do.
N ditet e sotme ai qe dashuron na ngjall menjeher dyshime,ose e marrim per dobsi ose te pavlefshem.
Ska ma keq se me pas klasen pa organizim
  Vec ti mo jo ajde dtnm
Cdo e keqe kujtohet,cdo e mir harrohet.
 Nana tha na bekoj Zoti mbijeton veq ma i forti 
 sen ri ti pa komentu jo
   Ti shkon per mu heheh
   Ti ala shkon ms rrej hehhehe
   Un kom shku pa qant hehehe
 Apedi un qe knoj shum e mka met La lalalalalalaala
 Ekom pas amo sekom pa veten
O Allah largo prej nesh cdo gje qe na largon prej teje...!
===