  Po bir e maj men tash mbetet tshifet ku do mrin me talentin qe ka
 Ska ide loje qajo histori cdo jav...
 Hahah ti qe e ki gejmerin ta then
 I forte s'jam bo, nuk po kam kohe mu marre me tuita mo. Po luj rolin e vezhguesit 
 Spo shoh tuita t'mire
ROMELUUUU LUKAKU! GET INNN
 O t'i ardh fundi lidhjes shumvjecare
 Qe un po t thom
 I gat je ti bir sun tmrin as virusi
 Mvjen inat qe ne si fitum nfinale
 Rrogen si numer telefoni
 Ajde kshyre te un se qysh punohet 
Sedi per ju ama un ket grip e kalova ala pa u bo mainstream me koll e temperatur me frymarje qysh ne Shkurt e zgjati rreth 14 dit 
 O bir shum je tu chatshit
 Per neve qe se marna vesh gjuhen a ka perkthim 
Vit i ri probleme tvjetra
 Mire se ju gjeta 
 Ozili kur su kon lojtar qe kthehet mbrapa me ndihmu nmbrojtje se so stili vet, ktij i  duhen 2 mesfu… 
  Nker tbenit jay z edhe pint ska tjeter aty 
 Nqofse e ki ni qaty e ki ni sigurt 
 Nifar kohe singullari mdoket e ka pas si emer tartit singullar kodoshi sa e maj men 
 Hahaha ka logjik ama ma mir tbjen mos me mar persiper ket epitet se so per tmir
 Hahah knej e perdormi mas shumti per dikon qe nonstop fol si nalet goja... kodosh mo
 Kodosh i bjen spiun ose njo qe fol mas shpine qe sma sekret tjep te tjetri nshansen e par qe i thu mos i kallxo najkujt 
 Edhe un kom pa bir sdo me than qe i ka bo dikush e u rra nat gjendje. Overthinking edhe depresioni jan ma zi se me tbo dikush
 Vetem te ne i bon dikush dikujt edhe lun mendsh le bir mos bo hajgare 
 Pallavra jan bir vazhdo me tvjetren 
Mirmengjes, 1 dite ma shum per tkalumen 1 ma pak per tardhmen
 Si fitues i ktij kuizi pe du dhuraten 🤣
Koha ideale me hup streaks se spo durohen edhe flakat e snapit nket nxeht 
 Qija robt bir thuti se ky na jep buk me hanger 🤣
 Ajax mka befasu seriozisht, mos e nenvlerso se nji juventus, Real madrid me eliminu sesht pak
Shkon nfitness, i bon 4 serija nga 12 story edhe kthehet nshpi.
 Qytet europian jane n'rrugen e duhur.
 Ncdo aspekt jan lart cdo qyteti tjeter ku jetojn shqiptaret. Shembull per tu ndjek
 Cfar ironie me shkrujt kunder Skenderbeut ne gjuhen e Skenderbeut
Kur e kujton qe Ramosi e mur kartonin e verdh nlojen e par me qellim qe tjet i paster me kartona ne fazen tjeter 
Vjen vikendi prishet koha...
 Po sjam hendikep ntru tkeqen dy tri fjal jam ngjendje mi lidh vet 🤣
Nqofse don me bo dicka bone sot se neser eshte gjithmon vone
Nqofse e ke bo plan me flejt edhe pahiri e hap youtubin... e hongre!
 Un si tham vec e ha
 Rri bir se mir jeni nPL ju atje
A ju shkojn ligat vegjetarianve kur e shohin barin e kosit, sikur mu qe mshkojn kur e shoh pulen tu pjek?
 Dobt jeni mbrotja ju lshon uj ntana ant. Si sit per mill 
 Ku jeni nis me at mbrojtje?
 Ju rrxojm pa problem
 Beje retweet kte tweetin provoje se si dihet 
  Kroatin e kena ama prap u lendu ka probleme me gjurin
  Sa e lexova hajde krejt mshkoj mendja te kjo kenga legjendare 
  Funi funit pa t thir shkoji hahaha
  Biro nqofse st thir ndarsem si fan numer njo i tij bllokoje ntana ant
 Haha me ta qit ni kafe tnjoftomu vec per qef 🤣
Per cfar 'Partners in crime' e ke fjalen, me ja majt deren e WC njona tjetres a?
Su bo jeta monoton ti e bon tu i frekuentu vendet e njejta cdo dit
Ka nxjerr foto me fraerin me pershkrimin "Ti je bota ime". Kjo eshte bota e 5 mrrena 6 mujve, siq po shihet paska v… 
   Hahah un jam cricket ama shkreps jau ve flaken 
   Hahaha qe besa edhe per vete paska fol🤣
 Per PL qysh osht i ngadalshem sdi a kish kry pun edhe si rezervist
   Ala skeni flejt a🤦‍♂️
From 14 vjec dhender to 13 vjec nane real quick
Deri dje kena kesh me statuset e 12 vjecareve ama prej rastit tfundit duhet mi marr me seriozitet
 Shkupi u kon dikur i mir se tash u bo ni katun i madh
Tre fitoret ma t'mdhaja post lufte per Kosoven:1. Shpallja e pavarsise;2. Taksa prej 100% produkteve serbo-boshnj… 
 E ke hutu edhe google translate 
Grekt jane krenar me 200-300 filozofat e vet, a cka me than ne per 4-5 milion filozofat ton? 
Me hap dritaren me ajros pak edhe jasht
 Ronaldo me mospjesmarjen i dha pik. Tekefundit ish-lojtari eshte fitues, ky nje gjest i ulet ptej tij. 
Kur edhe nboten e kikirikave eshte dimer qe smahet men 
 Normal i bashkangjitmi urimit edhe ne 
 Hahaha reni si per haxh mu nis 
 A u mush numri? Nqofse jo qe un vullnetar 
 Ku jana ata qe thon 'Koha sheron plaget'?; me ata e kam 
 Merre me men sa mund tjem 
Kaluan kohera qe asgje nuk sheruan.
===