Qe sa spasna hi n'twitter phaa 
 shkrimin mat tmir se un edhe  se kini hahah !Sit tdoktorav
 Ke ftohte naten? Ndihesh i semure?-Shko te gjyshja ajo do te detyroj te veshesh 2 par pizhame plus do te mbuloj me 3 jo…
 ahahaha un ty ta ha zemren ❤
O zoot sumeja shka mkish shkrujt nfb si loqkk osht bee shum e du ❤
Me klasen tu bo della shum budall i kam tklases bee ahahahhaha 
Isra osht njerii ma i mirr nboooooot ❤❤❤❤
 Ahahaha hajt se nashta vi ni krug ka gjilanii 
Phaa 4 matematiik duhet neser me permirsuu 
Qyyysh keqkuptojn do njerz edhe tani nuk tbesojn kur ju kallxon tverteten ncnc 
 okk pa problem shhhhhh mos folnii se isra ka dishkaa 
 mos u dashurove qiko hjg be po baj tduu ❤
 ta shoh nashta vi me nejt veq ni or
 joo ket or kam gjuh shqipee
 Jo Jo qe bilee jam tu mrri edhe ni stacion 
Shumm e duu bree ❤.  
 une menova qe berna frasheri ma jep ni keshill 
 ahahhaa shka me boo .
 Ku e dii veq qashtuu mrroken 5 minutat 
 ueet berna frasherii ahahaha 
 Mamiii po thot bernaa me bo bukeeen ma shpejt. I thaaash 
 Nanuqii hala se ka ndreq buken oj loqk 
 priit hala skum hanger buk.
Sot kam me shku te Berna. ☺
 kur tum kujtohet qka kina bo me Bushren hahh!!
 Ahaa po jo mooj sum ka merzit kurkush po veq me bo rtw oj qurr 
Gooooll neymaaar BARCELONA deri nvdekjee ❤❤❤❤❤❤❤
 Joo se tash vjen qika e tezes pi suedie e un duhet me priit 
 ME FITU BARCELONA SOT BOHNA NJERI MA I LUMTUR NBOT
 Se di ta shoh nese vii tkallxoj unee ndm 
 lutee se valla knaqmi ta dish qe si bjen pishman ☺
  ahaha edhe un tyy ❤
 po hajdee moj valla knaqmii ☺
 ahahaha ta shoh nashta vi soot si diheet 
 Ta shoh a muj nashta vikendin vii une nese je nshpi normal
 Edhe un kam talent p.sh me flejt,me hanger,me nejt,apet me flejt,apet me hanger,apet me nejt
 po kujna kam me I ga MALIT normaal 
  HAHAHAHHAHAHAHAHAHHAHA sje mir ti jo
    hahahahahahha shum mo :P
   ahahah ti ma I meqmii normal 
    veq un ult hahahha &lt;3
Ejj bee hala ora osht 9 a mu jan tu mu mshel syt ....
Nese do persona ta kan pa foton e pasaportit ose t'leternjoftmit edhe vazhdojn hala me nejt me ty ta dish qe pernime t'dojn ☺
   vall nimeti i njet o qysh o kon hah &lt;3 XHOKII O ma i mir &lt;3
Kto ma t'mirt ☺       ❤ 
 okk loqk Zoti kabull ishalla 
  Valla sbesoj smunet me ndryshu i njejtii osht si saher qysh u kan 
  joo be apet si XHOKI sosht kurkush ❤
 soot smuuj se ka me ardh almiraa 
 Kurgjo sjon kunder Mbuleses ama kto qe jan tmbulume ne ta ken 1far vetqendrimi e mes tbojn beter ktynve qe jan tpa mbulu…
 pak nfb veq edhe ntwitter ja kan nis me bo check ina
Shum shpesh mka ndodh  
 1qik ideale qe  nuk shan nuk pin cigare nuk i jep rast qdo djalit  - ksi qik ideale rall qe egziston 
 XHOKIIN loqkk e komm &lt;3 
 ahahah jo bee unee e kam 
T'klases shum della I kam Bree hahahaha 
Kena lujt pytje a veprim krejt gjenerata khaa qfar budall Jan 
Spo rrihet n'or kujdestarie pfff 
Spo rrihet n'or kujdestarie pfff 
Hiiq spom shkohet neser nshkoll 
 une menova se jenii masditee per qata thash qe jam tu ardh po... 
 BEBET - tknaqin , jeten ta zgjasin.
Si brabrii kena daal ahahah  tduii   
Gjeografii duhet me msuu 
 ahahahah si brabrii :P :v :v
 ejj ama ju neser a jeni paradite nshkoll a ?
 joo t'marten vii se i kam 6 or ;)
Sot na ka tut ni qen edhe fatbardha ka hyp permi anesen pi tute ahahahah dell bree :P
E ki leht, e ki leht, e ki leht ajj Qysh ki qef qysh ki qef tii ....
hey baby ckemii.... e shoh veten tek syt e tu ....dicka t'perbashkt kemi -Alban Ramosaj &lt;33333
Khuu edhe mami jem osht te knuu Jessie J -sweet talker une ja kum fiksuu nkryy tu e knuu 24 or ahahah :P
Happy birthday EMINEM &lt;333333
 ani anii knaqnu juu knaqnuu :P
  hahahahahhahaha valla jena knaaaq :p
phaa t' 9 u knaqen kan shku nstrug qe 3 dit a na hala as n'saraj skena shkuu phaa sosht feer. :(
 aaa psee ?? ku ka me hii
T'marten kam me shku te "26 Korriku" mi pa t'klases se mka marr malli mi pa :))
ikaa ntm gjum t'embel gjithve ....
spom shkohet neser nshkoll ...
Phaa sot qysh e ka rrxu imani edonin o zot qfar delli ahahahah :P
     ahahahah hiq mos ma kujtoo :PP &lt;3
      o bash valla sidomos ka funi haha &lt;3 pot tkujto…
 kush tha bee qe ju kum harru mos hin ngjyna israa po un spo kam koh me ardh se me gjith qef vii 
Sot jena knaaq nshkooll o zoot qfar della 
 S'harrohet kjo dit bree o zoot :PP      
 mka mar malli me pa   &lt;3
  dashuri tkom ty oki &lt;3
  ta ha at zemer &lt;3
 ta ha at loqk  &lt;3
 oo edhe mu bree o shpirti jeme &lt;33333 :'(
Ndjenje tjeter, Fat!Po qka mi bo tash hey?Qka mi bo tash hey?...
  amaa une ma shuum &lt;33333
Urime festen e Kurban Bajramit !
 ahahahah ku ma kujtove muahahahah
===