 "pse be e ke mar taj gjal i ri, sn d bojsh caull mo sebepi vakcines a si ke lexau lajmet"
 Vec te shqiptaret n6 nsabah hahet birjon, mish ene bakllav mbrenda ni periudhe 30 minuta, en gjith… 
Hipish nkombi, temperatura 29, kombi ka vec 1 dritare, ene sa hipen njona, jet a vdekje e ka ta mshele chat dritare… 
Temperatura 33, hunxhet ntrotuar pa asni dru perreth, kafe tshkurt, nargilen ndor. Pse ene si?
fun fact: Amsterdami osht qytet ma i vogel se Tetova
"vErA sTinA mA e mAjR" ho ndale kt nxeftin shtaj si e perballojsh ftoftin. Vec lekuren mo ta hek pi traupi
Ja qr cfar nxefti🥵
 Holy shit jaja cfar mendimi ka
 Hajde tlujm basket njen sa denjonit ti ndalet frajma ose tpesoje sulm nzemer
 Not every jew is a zionist. Ka edhe palestinez tkqi, nuk dmth se arsyetohet ti vrasish krejt palestinezet,… 
*hits blunt*Ka dikush xhi punon A1/Telekom en merr rrog per tprintau faturat en i fajten nzarfa
 Vec dil t Enjten para VERO en da shofish pse ka hala ckac shom
Stres i madh kona crypto...
 Po prcat hala sot kina or policore ama bindi njerzit se sbon...
 Fjala Mbappe nenkupton dhunim sistematik 
Tchellojsh si hipen vlera e DOGE tu e ngjau Agim Tejecin &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;
 Kjo supa xhi vlon ktau shom shije tmajr mduket ka
 Celsi osht o Edon, kur e ka prajsh Jugosllavin va ka vjedh kt celsin e shpajes atine t Jugosllavis
 Ta kisha xhet ma lir ckt xhi e ke bli
 U knaqet tu u feju, une hala tu e tregu ngjyren tem t'preferume
 G dm thujshe nese thom se hala se kom pa LoTR?
Se shteti kur tqin man, tqin me laps
  Vec shpata e Irphan babes e bie nmend kt
 Tkishna pas edukim seksual pi ma moti nuk d kishna ksoj raste sot, se kto vec jon t frustraum seksualisht
Festa o kulmi ironis n Twitter, shtaj e vertetoj 
 T gjurmve zamet ama Petritit mund ti shkrujm tboje levizje me Jerichon en muzikat e veta. I did
Thash d bi d fli heret sot, filon termeti n5 nsabah en shkoj xhumi
Kshau ndjenje ne skina pas as kur Gruevski pajki 
Mbas sedi sa vjetve 
 Kto jon kategori qeter, vec 2 qeliza i kajn ntru, njo per t honger/paj qetra per tmar frajm
 Tpakten casabalinka e din g osht redditi o Doni majr kona
Kur mendojsh se e kije zgjidhjen per tcheat nprovim, ene tdel kjo: 
 Ska raste nese nuk testohen njerzit 
 Ergen that low? Ergeni ka flow en lyricism ma shom se kit kto qeret bashk kombinaum. Ergeni osht the nr.… 
  Mendoj se dikush xhi e ka ngjau Good Kid, Maad City e din kt fakt
  Se ju don kari, edhe i kuptojn krejt Shqiptaret pervec juve rebelave qe nuk dini gje tj… 
 Se its 6:03 diten e 2 bajramit linda njerzit tash kan flejt
   Un shpesh e mar Bloodhound am mundi en Lifeline tluj tmajra jon t2
 Per 1 saballajk tva pagujsh policve mundish en rab tmadhe en npajk tnates t vozitishntetov vec a kije p… 
 Haahahah anonim shkaku i privatsis sdu tm paditin
 E shtoj tpashmangshmen ama
  Osht out of the usual turkish series, qe se ka qellim kryesor dramen e dashuris si krejt tjeret.
 Google intermittent fasting edhe e kqyr qe sosht bash qashtu qysh menon ti, po ka shum ma shum benefi… 
 Nese tpys diçka, di diçka! Don't mess it up
 Jom tu e ushtrau vitin mo nervozohem kur dma hekin followin ene kur sdm folin per udhe mbasi tsoset shkolla
 - Kallxoma naj film- Game of thrones- jo be se garant palidhje- kqyre epizoden e pareNeser*A e kqyre epizoden e pare…
 Edhe 2 muj edhe do fillojn njerzit qe i ke perchaf chdo dite, ke ndejt bashk nonstop mos tet folin edhe tet injorojn rruges!…
 Njejt si kur lujsh kuka msheftas njefish deri n 100 sajt mshel mapa kur i chelish asni shok sn e xhish🥂
 Pse e ka kompllukin krsh
 Nonen pi shipkovajce baben pi veshalle a gjali turk,e hajde shtai!
 A thu ferri ngrit e parajsa u kall
 i mshefi ndjenjat si ky tipi kameren. 
===