 pak veshtir po do ja dalim
 e rikthejm per shkaqe 
 shpesh ja thom vetit qet sen HAHAHAHAH DEKA 
 hala mpajtin pse dush t'hikish pi kti vendit...
 sdi pse i bertitsha ati nllunapark nale anijen me kejt shpyrtin po le mos e nal hiq lem qaty
 Po ti spom thirr
 e ktyne te shpija qka me ju bo
 se kuptoj pse profa i edukates fizike mka shti me bo sallta boni more vet bablok pse mi bo un
 Vllau vogel qe menxi e kena qu per syfyr tu na kshyr qysh po bojm hajgare me ta. 
 Sjemi msu tgzoemi be robt pa ndodh ni baksuzllek sboet
 qysh po fejohen njerzt si mju qellu nsmok
 me jetu me shkije dmth t’zhvillohet aftesia me e dit a osht ni njeri Kaur a Shqiptar veq n’ftyr me e kshyr
 Relationship Status:⚪️ Sad⚪️ Taken Qohet njeri n'sabah s'din ka me ja majt
 me ket kang qel sabahu 
 Tu i pa kta t’Kosoves tu bo panik per 400 raste ne dite.Ne nderkoh ne ne Maqedoni me 870 raste 
 Sa here t’i perqafi njerzt, i perqafoj ma shume sesa qe duhet se gjith thom;”qka nese osht hera e fundit qe p’i perqafi”
 Maqedonia o edhe e jona, tu i sha shqiptart gllupa kallzoni jo patriota!
 Kejt tu u martu e feju E un tu i kshyr tu e tradhtu njoni tjetrin
 A ju ka ardhe me kajt najher veq prej faktit se sa shum e doni dikon?
 Kur i thu ndoni referenti ne administrate shteterore me ta nxjerr ni dokument, dmth me bo punen e vet:
 ishalla po heket korona 
 Bajat e keni bo 
 Twitter duhet me lexu kete storie. 
 Sa mire me i ndegju prinderit tu lyp me u hap shkolla. Po m’intereson, a jemi qaq te dhonun mas edukimit a veq po dojm me i…
 qu gjali nanes se 9- a prap bayerni a?qu more se 9 sahati je vonu per n'pun :p
 Kta qe s'po e vnojne masken veq po e kallzojne ftyren e vet
 Qaq sa muj me dasht dikan muj edhe me urrejt
 Nese e bojm zoom foton e dyt secili e shef reflektimin e vetes. Na e dijm qe ska send ma te vlefshem se vetja, kjo pra osht h…
 Gjendja:As vet se di qka osht tum mungu, s'jom happy, as sad, as nuk m'rrihet, as sen nuk m'bohet
 Mdoket qe kejt prind e thojn qet sen  
 Si m’duken cunat qe jane me te shkurter se sa une: 
 Taksist, njeri qe i paguan taksat me rregull.
 Rini, thuaja kanges me te bukur qe di,sepseLevizja po vje❤️ 
 Pse gjith kur i lutna Zotit me mrujt prej tkqiave ja nisin me mu largu njerzit
 Sit ja nisi me kesh un pak n’or tmsimit-profa: 
 Djemve s’ju kan hije filterat e snapit!
 Ska moree me Shkupin  
 kur t'dalin memories nsnap me shoqni t'shkolles t'mesme 
 S’je shqiptar nese nuk e ke nji nga kto pjatat n’ shpi 
 M shkoj jeta tu thon "shnosh"
 Qysh me ndreq orarin e gjumit gogle serq
 Nese s't'shkruj s'osht pse maj krenari po thjesht i kam pa disa veti t'kqija te ti qe m'pengojn me vazhdu me u shtir qe qdo…
 Pse prindt shqiptar menojn se mu qu heret zgjidhen kejt problemet
 Qfar tesha ki me ble per bajram ?-Paj ni mask ni par dorza edhe kshyrmi edhe diqka tjeter.
 krejt e kem pas ka ni simpati nshkoll fillore veq kush trren
 Mra me pa kte perle, smujta pa e postu ahahahahahahah 
 hypi mini n'biciklet ja ka shkel 210, se ka dit qe s'ka koshnica i ka shkel dy budallica, budallicat kajshin minin e sha…
 Lutu nnamaz e jo ntwitter.
 Pjesa me e bukur e te paturit shok/shoqe qe  nga femijerija eshte kur fillon  biseden me fjalet “ a e mban mend kur”...
 Buka te dajt tastes different
 Fotografia n’momentin qe e shkrep nuk doket kurr interesant, mas do vjete e ka vleren nostalgjike shum t’madhe, kujtim i pa…
 na jem maqedon ;) 
===