 Nuk m'ka ra me pa njerz ma tpa edukum se ntwitter!
 Para se ti paragjykoni njerezit perkujtojeni thenien e Profetit a.s “A ja hapet zemren qe ta shihni(qellimin e tij)?”
 Kur jom nervoz si kontrolloj fjalt e mija
 u paska rahatu ajo hahaha
Dhimbja duro duro ktheje n'force cdo lot duro duro vec edhe pak duro duro
  Hahahha se di kinez njeri mdoket hahahah
 Bot Zed a u ktheve a
 Jo be se ma shum i ke vjedh 🤣
   Bonjau edhe qekto RT se ki qef ti 
 Veq pe postoj qetu 
 Gzushem kam bo be qe si tdal nuk hi mrena dej nesrit
 Mirmengjesi ne ket dit lirie pas karantine
  Hahahaha jau paske palu bro
 O baba mut e kan bo be rust e familes
Familjen be ta martofsha. 
 Me tupana burrat e lujn veq a little bit different
 Ncuk po per kto e pata fjalen edhe pse Une jam Google Pixel 3XL user qe me 1 kamer krejt telefonat i ka… 
 Dikush bile le te flen ,le te knaqet .
 Urime ditlindja edhe 100 tjera tlumtura 
 Urime dat/ditlindja sa rrnofsh u gzofsh ❤
Update i instagramit mdergoj dej te aj opcioni request to delete Instagram profile.
Kur tqetsohet femna edhe te thot okey fol, mos ja nis me fol se esht veq nje fillim i problemit ri🤪
 Po m'dhimet Rapi jo reperat qe jon dalë prej vetit 
 Qija be ropt su bo me punu rahat njeri
Asnjehere mos e duj ma shum shoqnin se vllaznin
for real ajo sdon lule ajo don cant edhe pare nbank
 e kur tjep shaqa kunder juve a gzohi ;p
 Harrohet oh sa shpejt harrohet cdo e mire
 ོ⠀⠀⠀⠀ོ⠀⠀⠀⠀ ⠀ ⠀⠀⠀ ⠀⠀ོ⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀ ོ⠀⠀ ⠀⠀⠀⠀⠀⠀ ⠀ོ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ོ⠀⠀⠀ ོ⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀ ⠀ ོ⠀⠀⠀⠀⠀ ⠀ ⠀⠀⠀ོ⠀⠀⠀⠀⠀⠀⠀ ⠀ོ⠀⠀⠀⠀ ⠀ ⠀ོ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ོ…
Bitcoin do me na dal pjes e LGBT se ntkuqen o ka rin qe sa e sa  
 po bojm pare digjital ;p
Veq mi fitu do RT 
Unikkatil Jaran  (Me Tekst)  via 
 fb per trafik ;p
ti je inspirim i jemi
 Kurrfar kong sjon tu qit qetash
Puno mos u bo gllup i ki 210212912912 metoda per me u bo i pasun veq prej Internetit dhe qatij llaptopi qe e perdor veq per Muzika e Filma.
Po du mu pa ni dit, veç na dyt Me ti thon tri fjal en kater sy
Femnat thojn ju djemt keni perparsi veqkur sju konvenon
A osht tu ju bo instagrami 
Qka boni ju ajeni mir  
A ka insomnia dikush ktu
A esht dikush gjall
Qysh jam tu flejt qohna 
E i pershendesim filanin shabanin fistekin
Se po bohet dicka e madhe
Tkan rejt kur tkan fol per mu
pom doket sa o tu ardh dimri qaq ma shum po nehet ntwitter :D
ala paska knej neje mdoket hahaha
spo ma nin kush qa tha qa tha qa thaaaa
 nese mendon qe ska alkohol gabim e ki :)
 jo une po ta garantoj qato qe stbohet haram. Veq mendo qe ka alkohol edhe spe vazhdoj ma shum
 veq qat fjalin e fundit ma mir mos e kishe permend se haram esht .
 ruje veten djalo se gabim e ki
 hahaha po veq i mjeksis nuk kryhet
A ka mbet gjall dikush knej
Eu hallall hallall halllall si ju ka zan gjumi
Podepo so tum marr gjumi qr
Nese nuk i kthejm na
erdhe ne bot per te shikuar me syt e zemres
Veq kur pom thojn qe turki na ka bo muslim  mvje prej mrena me shku mu gjujt prej ures gurit
Zakonisht njeri e shpreh at qe e mendon vet jo tjert e per mu dok ma i menqem e thot si me bo tjeterkush.
Mos u bo lop se burr i ke thon vetit
hej mamamija ti qik e shpis
ti po ma then si cigarja e par mas iftarit pom hyn ntru le ntru po edhe nzemer
tan naten rim diten flejm poget edhe dita bajramit ngjum
se e vetmja shpres
mos e vlerso kerkan ma shum se vetja se deshprimi esht qeshtje kohe :)
Mos harro kush je kan :)
gabimi im i vetem per ty ishte se une u interesova shum per ty, aq sa nuk e meritove :)
parja e qon ujin tenalt
pse boesh lesh edhe me prish disponimin nket or be
dikush qe ta prish disponimin n5 sabahut
shko ndreqe at goj
fmija a mdoket a u dasht mi pas 3 or gjum
ai moqmi: nese ski cka me tweet dicka tmir ma mir mos tweet hiq po flej
i ki bo do vjet mare duhet me te ardh
e lumet ju qe po ju ze gjumi -_- vdekje
kejt gjall shendosh veq pa gjum
ja paskna harru pw twitterit hahaha
ose i mshojn murrit murrit hahahhahahahahah kuku 
me fol me kesh palidhje
naten e mire ju pershedes me nje kivi para gjumit
endee ka shpress te buzeqesh
ende ka ndjenj ende ka stine
ende ka shpres ende ka jet
===