E gzofshi Fiter Bajramin nga tokat arabe  ♥️
Edhe sa koh dot mbeshtetesh te fotografia e dikujt qe ska dhan kontribut per vendin qe sot pe gzon.. 
 Nahahahahahahahahaha archeee be me looot 🤣🤣🤣🤣
Njerzit jan virus, Corona eshte vakcina..
 Moze samo pivo 🤣
Ni femer nese t thot 'ban cka tdush' kejt bani veq qat cka don mos e ban.
Tish kan aborti pa pare skishmi pas pun me bitcha..
 Be sure for that , bosh kan met dal :)
 Un se kam bo, besoj qe u vertetove qe sjam tinejxher?
Kur ki nevoj per ni dor tngroht, ma mir kape doren tjeter,se prej tjeter kujna ska hajr..
 Ma mir dikon qe e don me pa vit per vit se sa dikon qe se don ti me pa dit per dit
 Spot kuptoj, banu ma i qart ku i kum pas gishtat ? 🤣
 Bahahah jo bro provoje ta then 🤣
Opaaa qe 1 vjet spasna hy ntwiter 🤣
Na Muslimant e kena zor, se luftojna me kejt.JoMuslimant e kan ala ma zor se luftojn me Nja. ☝️
Nket shtet ekziston koha para lufte$ edhe mas lufte$..
Pata shum sene me than, per qata nuk thash sen..
Dej sa shumica lujn Csgo, qajo pakic qe met spriton me u gjujt e mu plagu..  
Haaj be se t'ish kan i mir perendimi dilli kish lind anej..
Ti kishmi shajt dhe protestu liderat tjer botror sic e shajm taipin e shaipin kto far makrona si kishin zhagit protestusit brutalisht...
 Ruju najdit po ju hyp skijave 🤣
Tre her me perserit rrena bohet e ver8..Kam pareKam pareKam pare
  Hahahah mos thir deshmitar se maf ke me i pas punt 🤣
 E di qe ksaj radhe ju ka deshpru diaspora mirpo jbg
 mfal shoku si mundet nga diaspora te kontaktojm me ty ??
 Sot njerzit krenohen me at qe duhet t'turperohen..
 Kojdiii be qia na edhe mu spo ma rrok 
 Hajjjj be. Qe po ja futi ni report
 A tu kujtu passi a
Mu sen pom kap FBI e leje mo gripi
Kur qohesh nsaba si mos tja kshyrish last seen'in dmth kjo pun kana BITIS :P
Lumturi asht me e vnu kamen nshporet edhe mos met djeg.
Mveti ni fmi a punon kompjuteri? Jo i thash amvise osht. Prej at dit ska haber prej fmijees..
A kaaa najsen bre ooooooo twiterash
Ka do njerz qe bohen tlumtur kur prej nmarket i marin 2kese teper. Mos i ngucni ata
Pytja ma palidhje nbot: A tduhen pare?
Tu e mush shpesh telefonin, saqe kur pe shof adapterin pa telefon nshteker pom doket si me lan cheshmen tu rredh...
Tjera her nime zor o kan jeta, psh nsaba gjelin sen e ke bo Snooze
Tu e prit 2015,kur papritmas vjeen 2014s
phe phe phe me vjet spasna hy ntwitter
At ftyren as un bile sn ta heshoj. -Retrica
Te gjith femrave ua uroj javen e pastrimit per Bajram :))
Si tet gjeje najkush kryp nsheqer dije se ta ka vnu menen :|
T ish kan jeta kuzhin, un veqse sunger isha kan..
Ni bardak tamel pot majka 5 sahat t ngim, dmth un ka me i pi 4 bardaka :p
Abe mi pre venat ok, ama ma keq se mi pre shpresat ska :\
Kishe ka me pa femra tmira nanderr saher pare se me ra me flejt e ndreqi frizuren :))))
Mfal sdo me than qe je gabim, po kjo dmth se vleren qe ja jep ni personit asht ma e madhe se egoja jote
A un si saher sdi sen perveq cfar lande kam
Mos e hup at njer qe mundohet me turli far budallakia me ta ndreq tripin xD
 hahhhahh jojo, muj met fug veq asi kikirika tportokallta :p
N3 tnates kallamoq ohohoho
 haaaaahhh heke jastekun vnoje librin
Se maj men kur kum flejt qeshtu 
Koh ma tkeqe shnosh ma..
Taman thash tmsoj pak, meniher mhipi ni lodhsi,ni kputsi auuu si ndrog mu kan sn livriti
5 pare bile si jap.. 
Veq mu neervozu une meniher e ndroj hashtagin :)) 
Taman thash tmenona per pushime, mu kujtu faxi 
a po mbijeton najkush be ¿
Tkisha ra me ni ishull kisha dasht mi pas me veti qeto cka pi shof nTv :p
Huuuhh u bo epten nxeeeht
Kujna i flehet le ta shloje STARin, meniher i del gjumi :p 
Veq kur ulna e diktoj se sa jam loodhh e sa jam shkoooqq..
Falja hyres dolen jasht
Dola jasht hyrja falas (:
Me shku une qetu nSurvivor mdoket se knaqna.lezzet ama veq pse ska wifi sshkoj
Ne guzeeel Istanbuuul beee
Ni kafe me malen
Grep per gjum  !!
Nesr i lir ka me ja lag sedii :\
Menon qe e njeh mir,veq kur ta kshyrsh as pi larg as pi ngat se njeh..
Tknaq era tokes mas shivit :)) 
 hahahahha garant e ki pas naj ombrell tmadhe :p
 shiu i mir o kur je mrena rreth xhamit, ama ta klx qefin kur tjesh jasht :p
 ooooo bak seeenn shiu po ta ndreq fillmin a :p
Tjera her shum u tutsha pre dites han, a tash pom doket shoum e thjesh :)
Do njerz nime si manekena jan, ape di ato nvitrina cka nejn pa tru qka jan.
Krpa e verdh nkuzhin perjeton mashum akcione se un ;/
Ska djal tkeq, pak pare kan
Ska djal tkeq, pak pare kan
Un per veti e mledha ni grusht bresher
Ska ma keq edhe tflehet edhe kallesh prej nxehtit
Ni dembel i famshem ka than: Abeee futjaaa,
Baben tem edhe nanen teme shum i xhelozoj, asniher ska me pas ni djal si une
 ndjen dhimbje per te vdekurit ne Turqi  
A bohesh sebep me mu hargju bateria?
Si bokseri hunt qashtu i kam edhe puntt
Ato qe pritojn me i la dhamt, le t hajn djath edhe drejt ngjum 
Mora me bo naj levizje qe tbohet aksion ose naj zhanr tjetr :p
Mu ka bo jeta si film dokumentar
Nata e qet, nesr koha nice
I heshem, pareli, me kocka,  hajgarexhi,romantik.-Shpirti ti po i don 5 djem permeniher. Nahhhh
Bukurosheve nuk va baj hallal, me qellim qe nboten tjetr me u taku :p
Te secili burr i suksesshem qendron nje femer, sa ma shum femra aq me shum sukseseee (:
Nxe me pare, ftoh me pare
Pse nuk va kum qu 10personave ato mesazhet fetare nket gjendje jam \:
N jeten teme vetem 4her kum rrejt. Aha kjo u ba e 5ta.
Moshatart e mi jan martu me fmi jan ba, un ala lypi dhom tshprazt mu mshef prej mysafirve..
Veq mbiemrin e kam tperbashket me t familjes hiq mashum
Au bre qfar llokumi jam tu hang auuu
Ska ma fort kejt qohen n8 shkojn npun e nfax, a un kontra henes ja terti gjum :D
Koha ndalon ateher kur e shlon bojlerin..
Mas majrti mu mlu mejr ene me ja zavajt gjum
Mduhen 2-3dit dej sa tvij nveti,a per tu rraskapit meniher. Jam bo si puzzle :/
Me nargilat nqesi vakti mir o
Kejt e perdorin fjalen VIP a kerkush sedi qka dmth.!?
Arsyja e vetme per shkurorzim te disa qifte osht MARTESA
Kohes funit jam bo si fjok e zagllavitt kurqysh spo qelna
Najhe ka nevoj njeri me than "KADAL BE WLLA SHKA JAM TU BA UN"
Kto muzikat shkavellski shum ni trip i cmuet
Te sakam jas, ti za mene si spas :p hhhah
 oh moj e ngrat aj spot tbaj fore se ki kollokfium. Ama te deshiroj suksesee hhhha
Jo veq ntweeter anemban botes
Prej mrena pom vje me than qe kejt qikat qetu ntweeter jan tbukura dhe tzojaaa
 sban me fshi tuita gjeget loja
 eeee ktu kejt jan poeta,filozofa,t dashurum, badihavgji. Un te kjo e fundit baj pjes :p
Koha pom thot: Rasja gjum more papak..
 pse saher tragjikisht mbarojn kta thi filma?
Parashtrohet pytja pse pizzagjit nuk i bajn shofera tndihmes shpejt¿¿¿¿¿
Jetojm ne nje vend ku pica mrrin mashpejt se ndihma e shpejt :p
Kejt me kera me flamura tu bertit naper chairchank
Skan faj be jena te etur dhe te urritur per nje lider si ai 
Mashum ttont tu u gzu per erdoganin sesa ato
Kejt shkupi me turqelii hahaha
E kum mar ni liber turqe me fjal t urta, ama shum palidhje po vijn kur po i perkthej nshqip
Nqesi vakti qka shkon? Medcezir edhe ni Dorina 
 Me pak fjale dashuria nuk ka cmim
Me dal jasht pak su rrika nshpi
Aj qe e di punen e ban,Aj qe di pak t jep mend,Aj qe sdi hiq t kritikon,Aj qe sen e ban ta nxhet naj fjal.
Opaaaa nturki u paska blloku twitteri
 je 1sh fare moj shoqe klases :p
 popoo super edhe leje qaty anash kur tkaloj tanej e mar :) thuj atij amiri vjen e mer
 qiti sos tbardh ma shum edhe djegsss
 tjeeeeeter plus ma mir
Dhe e konstatova ni sen: At dit qe dicka mbaron, dije se at dit fillon dicka.
Sma ka mar mendja qe bona firmash ama u bona :)
Napravis dobru ekipu, i to je to.
Mu mknaqi per wampirat dej n4 po punojke :p 
Aj momenti kur llastiki i qorapve tle shenj nkam eddhe e krun kamen hahhaha lezzeti ma i madh
 tkisha kan i hajrit emrin hajri e kisha pas, mirpo jam i mir dhe emrin amir e kam hahah mhahahah:p
Planet e mija synim kan per mu prish
Kam nevoj per pushim pa hesap.
Kur pe menoj qe nesr heret duhet mu qu spo du hiq me flejt..
 hahahahaha shuumm flm :))
Te kuptohemi: SM KAN PERZAN PO E KUM LAN TYBE
Aj qe se shef doren, menon qe fjalen lapsi e ka shkru
  pi ka i pate dajt ti ¿¿¿
Edhe plus ka me pagu njeri mos tma shkele dikush emrin
Vjen dita ka me shku nUsa edhe pa u shkru emri jem te yllat nHollywood se la
Masi hupi milani mir o puna, po i rrun lojtart me atletico madridin, per hakmarrje drastike
Sa tbona mermer te pallati jot, mamir bona dhe e qeli lule 
Mka plas naj organn
Pergjigjet qe ma thejn :Po cashtu pata qefHiq sm interesonShka tdush banAbe hiq sma ninPo ani
Djal chapken ska, po ka djal naiv i cili o hup nmesin e shum femrave per me gjet femren e duhur :p
Njerzit i bashkon ndjenja, ndersa i largon mendimi
Do te jem me mir se dje
===