 Nuk ishte e lehte aspak, por duaja e bëri :)
 Pot prejka si skallper i ftohti
a jom une shpirti jot qe jeton mrena teje e ti se ki vrejt a?
   bisha me 3 koka
  8 aty mu kon ki vakt edhe per flokt
  u sos kjo pun bir besa bes pula pes
  aaa jo se lam ashtu bir valla jo
 sedi sa muj me tbesu bir
nuk osht bresher, maturantat po gjujn me gurzi.
nuk osht shi, jan lotet e maturantave.
 i ngult n'andrra t'pa perfundume, t'prekshme po t'kundershtume
  profesori shum mir ju paska msu, problemi o te ne qe si kena menu persdyti fjalt e tina
 Jam i tmerruar me lajmin per mbylljen e palestrave te fitnesit. Çka beje une tash, aaaa... ?!?!
 qe ma ki qit ni gjaz
 o shoch nuk do mund tvaj un sonte
  qetsoju lock a do pak uj
 Kthemi ato qka mi more!Zemren Deshirat BuzqeshjenKthemi krejt me ren
 Ekan thy oj Nanë 
 HAHAHAHAHAHAJAHUAHA-nashta i veshi ;( 
    valla po bir ahahahahahhahahaha
 hahahahahahha cka me bo
 "flip your phone. ˙ʇ,uop noʎ ʇnq 'puɐʇsɹǝpun noʎ ʞuᴉɥʇ ʎɐɯ no⅄ ˙ʎɹoʇs ǝloɥʍ ǝɥʇ ƃuᴉʍouʞ ʇnoɥʇᴉʍ ǝuoǝɯos ǝƃpnɾ ɹǝʌǝN"
 Pyte hanen ajo e di sa mke mungu
 Ndoshta jane duke ardhur, ditet me te mira nga me te mirat per ti jetuar..e huazuar. 
 Mshele deren edhe shkyme driten kur tdilsh jasht .
 mora mi bo foto
 Tregoni sa njerz i keni humb tu i dasht
  neve super po na dalin n’ajfon
 okej zemer dhimbja tshkatrroj, amo e mira e asaj o qe edhe tndryshoj.
   HAHAHAHAHAHAHAHHAHA 36 i paska ky
zoti e krijon naj person veq per ty
 Me i prit ca njerz met hap naj tem bisede esht si me prit me i gjet 100 euro n'rrug, jo qe smun ndodh ama kerkush sman ymyt.
 dhimbja hiq pa fund me epizoda,un e vetja si dy idiota 
plagt ma nfund sherohen krejt cka mesin jon veq shenja 
 Me ni lule sqel pranvera, ama qajo lule o shenja qe thot se pranvera tu ardh o!
gjyshi jem ka jetu 100 vjet............tu i kshyr punt e veta 
do me dit kur lindin e abortojne veten 
 hahahahahahahaahahha cka ta kthej tana ky erifi
nje mengjes i bukur, Shkup 
 a ka najsen me bomben mrena?
 hahahahahahhahaha flm ta kthefsha
 bane rt viran e pasha hahahahahahahhaa
 e paske bo punen me dal si k albo nfoto me grusht e mos mu dok klloshar ❤️ e gz
 qele ni tw tri hyhy
 se ka psikopata nket dunja perqata
 dashuria osht si pordha, po i dhave zor e ban mut
krejt neper pushime tu e thy veq un npun JDKWNDBEJWJSBEHEJJW
 un nstory veq edhe atynve qe i kam ma t'afert
mos ma uroni bajramin se pritoj me jau kthy msg
 shum kam nevoj me dal nqet koh me najkan edhe me fol per krejt senet qe i kam nmen
 popo nuk zgatna mhb shum
 saher qe thuhet "ekspreso", ni italian vdek
 hahahahahahahhaha un u cudita qysh se kish shkrujt kerkush hala
 0, ma mir temiz
   duhet me e rreh deri tshpurret tana me e rre edhe pse u ka pshurr, dupllo qytek 1… 
   valla be e mush edhe at a e di qysh
  qyteki pi xhenneti ka dal
E KONFIRMUAR!!! Neymar Jr me prejardhje shqiptare.. 
ni shoki jem e ka baben polic, saher qe e rre baba vet e shkrun nbio "ACAB"
===