 ssdn duhesh fal me dhan
keni nevoj mu flladitirat
 way too sick" smuj me surf ku po lahni ju se wave i flliqt sikur deti n'Durrs' "s/o to… 
njerzt qe i mshelin dritaret n'bus n'ksi zhegi tu ju tut promajes lypin qi at piqk nane
 E kam at pikellimin e kohes se veres
 osh' ni dru i pllastikes
so marre mu zeletav me pidh nclub
gjyshi jot i dehun menon jom i Pejes kur i thom jom pijan
 "o nanqim dynjaja pi njerzve t'mir rrnon"*vazhdon mi bo shtypje mja marr ni kese pa pare*
 "valla shejtani te huna njerit jeton" *i bon 2 ceva hazer*
man it's been a tiring day edhe deshta me ju thone "Naten e Mire". shpresoj me ju pelqy &lt;3
   e pa nema vise cile mile
  nemoj sa stimi lunatami
 pse i ka veq 6 :/
deshta me postu "Alert" po qka kari krejt albumi o' i fort
 urime mret ishalla edhe plot tjera❤️
 skqyr filma tprevarantave ti
 nuk e di a ka mat fort se  
 dashni tejmase andej &lt;3
 sima tu e myt si ç'doher. 
 mi kallzu aviqit qe jam kull
 si xhuxhat e borebardhes
 A di dikush mem kallxu pse doket Burim karameta si Eric Andre 
 Ransomi tha sa shlire po fol ti haver jeta spot kushtojka kurgjo
Hava ka dale prej veshkes, ti ke dale prej koqes 
u nervozova me chelsean, e perzuna edhe loqkin n'shpi
çdo vit ju rritet mendja nalt si fatura
 me ajvar te vjeteshit
 gzohu o njeri pa jet, kesh o ka tvyn me kesh
"baba jem nuk nin ere, as une nuk ni ama vec ka ana djatht"
  i ka zatek allahi 2003shat
un jam hamza edhe un ngrehi kamza
 Qysh thirret joint-i ditelindjes ?Iznenaduvanje - DhurateDuva(nje) - fryj/fryn (perdoret per duhan… 
edhe njiher Veli Sahiti i pijavt n'Route 66 nji ausllanderit ja boni qiken rrezil pse se ka njoft se kush o Trixi
  domethan mundet me ti pa tweetat ?
 mos shkruj me tbardha se lag
 krejt stafi interventna bashk me inspektorat e kan qit tfitin n'TV edhe jan tu kesh mes vete
 Sot po nihna si aj i shkupit qe e pat vetshpall veten kampion t twitterit edhe ja pat dhon trofeun vetes me ni burektor…
   a per 500 lek e ki munan ?
  te un s'o tu shfaq problem, but coming on YT soon
  punen munesh me ja nal Zekes, ama Zeken jo
interventna policija nkerr tu bo vija
 Ekrem Gj. - extape (vol. 2) - PROMOAlbumi "extape (vol. 2)" - 4 shtator 2020Falenderime te gjithve qe kan marre pjese n're…
 kur ja nisen arabt turqt e shiptart mu bo t'famshem me rep n'gjermoni e pashe qe gjermant kan hek dore prej low iq activit…
 Rambo me mu si ramushi oo 
 Jada got so many bars, as krejt BIK-u prej se o formu s'kan bo qaq Amin-a
  sjeni veq ju tseroves
2Ton osht bosi final i simpave
 garant n'cvetan kishin msu
a mos ka than Eminemi "kape vajbin e mos ma tesh" ? I bet not.2Po2 8 : 2 Eminem
 "kur je kogja njifar cope ama mson n'cvetan" series
 "Por mbi te gjitha, xhemat, mos harroni se harami me i madh osht me ju besu ktyne kurvave" 
pidhat e nanes bojne ma shume filma se mistreci
i lumi Isa barem e ka mbrri darken e funditktu me sabah shipcat qohen me kaftjall ta ngulin
  n'kto dite t'ftohta acar
 My homie , producenti ma i qart, pjese e Infusa Music, e ka publiku beatin ma t'ri. Lshoja ni vesh a dy.YouTub…
 foton me shpage te dera
"toka rrnon prej njerzve shpirt t'mir"*vazhdon mi bo shtypje tu ja lyp 1000 denar borxh*
    ose portal me bo teleport
 pshurrim bossa dej sa t'pshurrin gjakju ajim turit pak e msohen me ec n'vakt
s'lypin qi nanen hoxhallart sa lyp qi nanen xhemati 
shpirtin te huna, hunen n'shpirt
 prindt habiten pse me na shoqnohen fmit
"Po ka pak mu lodhe veq se mu lodhe ka shum? ku mi qu paret ?"~ Orçe
"shloje rrymen n't'zez se n't'bardh osht", si me pas ngreh rryma kok qe 1 muj
italija me ka dzav haha
  garant naj shok e ka ndrru instagramin e ka bo kta, une jo
===