 Kqyrem mu tu thene "mos ma teshni me njerez t'kote dhe show palidhje"
"1 uje te gazuar me temperature dhome ju lutem" 
 Pse be ban share linka te Instagramit ne Twitter? 
 Cima tu u kthy prej parajses mi qi motren kryesusve t’super liges 
 Po ta qi more at nan
   Gjeth mir e t'gzum ju pafsha. ⚫
  Paske shku per  lesh
  Hup mos te t'shoh
  Kshtu çka je legjend je. Veq dresi MUT!
 Uuuu zemla jeme vogël 
   Ajt se kam per t'jau lodh Theo'n n'Fifa 21. Veq me ja ba Pace 95.
Vetëm se studion Fashion Design/Art nuk dmth që duhesh me  u vesh si budall.
  s'ki nevoj me mbajt distanc ti, 2 metra rrumbullak je.
Çka kan hi rinija n'fillma me ksi kapuça te peshkatareve be? 
 Po ama veq te aj veni te mavrovka ku t'mshon promaja.
 S'KENI FAJ JU JO, KAM FAJ UNE QE JU NDJEKI MBI 15 VJET.
La katha de papel!
 E kam nja ma t'mir une, shkrujem messenger se s'ban ktu me ta qu.
   OOOJJJ LOÇKAT E MIJA ♥️
 Rebicin dojn me e ble perfundimisht.
Vetllat e hjekta, pantollet e ngushta t'shkoqta si femer, komt e depilume, dog filters, e maicen UÇK nuk shkon!
 Ti je lule vet oj lule.  ♥️
 At t'fundit qysh e bane me Anallog edhe R2 a?
 Po thot Beiri: "jo s'mundesh mu kan".
 So problem do mejrrin.
 Aaaa lajmi madh valla. Se na me Estonin punt i kena keshtu: 
AAAA TASH E KUPTOVA!!:Nuk e ka kuptuar:
Hala Teenager-a m'japin ketu keshilla jetesore. Ec be pash Zotin mos m'shtini me sha.
 Qetu m'ke pelqy s'ka shka ktu. 🤷‍♂️
Kur mi blejke Nana teshat me m'bo edhe n'mot. 
Shoket e tu jane pasqyrim i vetvetes. Shoket i zgjedh vete nuk ti jep Komuna.
Si ne Basketball ju kan ba gjuajtjet e lira Messi't.
 Ma te rrezikshem se ata qe nuk e kane lexu asnje liber jane vec ata qe e kane lexu vec nje liber. Pa marre parasysh sa e mire…
  Qu kthehu vllavi jem krejt t'falta i ki. Na ban hallall qe t'kena sha!
Kam qen Fans i  prej ne femijeri. Jam rrit me emisionet e NASA-s ne  &amp;  edhe du me ble Dukser… 
 Abe per jeten be n'pergjithsi
 Sa ma shum po shoh ksi postime, aq ma shum po mendoj qe Hitlerit i kan mbet do pun n'gjyse.
 Maica Marvel, maska Joker dyqysh shum palidhje
I urt osht Agoni vetem se kaq najher. 
5 minuta ju duhen me nxjerr pare prej n'bankomat. Ec **** nanen shpejt e shpejt kry pun aty!
Kush nuk ka n'kry, ka ne Instagram.
A knena punt Zi! 
 Kjo osh asi Osmanlishte e vjeter...
Kqyr kur t'baheni Nëna mos harroni me ma tesh me i qit ka 20 storie 3 postime n'dit t'fmijes, me e ba emrin ne rrje… 
 Pse niher e ke shkrujt "Jetoni" niher "JetoJni"?
A ju kum kallzu per at rastin kur kam shku n'provim edhe kolega para meje ja ka ba "çfar lande osht kjo o vlla"?
OOOOOO JA HA ZEMREN UNE KTIJ ♥️♥️♥️ 
O pa ta ble qet dres se lo oj loqk!  
 Dul Besiri pi twitteri rrshqite krejt ti
Demokraci - Dikush t'thot shko n'K** ti shkon ku te duash.
Jan mledh nKafe "5 Shoqe" dhe kan shujt!Skan pas çka me fol, krejt Shoqet jan kan aty!
N'qofse behem "shofer i autobusit" at'her ka me vesh "kmisha me krah t'shkurta".
Biro banma njo qeshtu tu e qit tymin.
O moti kan dhan Shqiptart golla n'Bugari.
===