Pasha zotin po sta kish shkrujt akrepi ni tekst ma mir se anisa veseli qe kryjen
Shpat Kasapi ft Mossi ...Coming soon
  Kishe qaq e rrezikume u ndi kjo e pi kallxon tjerve t'keni kujdes pi kti 🤦‍♂️
 Ti i pase problemet shum t'lehta motra jem
   Ma hanksh karin ti
 Edhe bardhi u kan 1 nivel ma nalt krejtve sonte
 Per cilet maqedon e ki fjalen bro, qato 5 shqipe shka ken n11-tshe ja majten lojen
  Mundni kta muta? 🤔 
 Ani gangi ju paska mbledh 
 u kry edhe kjo, elhamdulilah 
 Po shka mer be vesh nfutboll ti pash zotin
 Hazardi top lojtar osht ,ska faj se lun me ni ekip qe sja din vleren
 Jo jo hala ska kurgjo zyrtare
 Shti mundesh me flet rahat❤❤
 Pershendetje shoqeri e twitterit. Ky shoku im i femijerise ne foto, fatkeqesisht ka pesu lendim te rende ne unazen e 6 cervik…
 Rini, thuaja kanges me te bukur qe di,sepseLevizja po vje❤️ 
 E dim na mire kush asht Hashimi mos na kallxo ti per ta 
  Ti n'emer e sheh se shka asht
Valla bro nuk dashta me ta kesh ftyren se nuk e kam zakon me u sha ka pamja e jashtme se nuk e kemi zgjedh asnjani… 
Mos ja merni per t'madhe kti se ne pergjethsi fansat e Arsenalit jane me pasoja psiqike, nuk i mer kerkush nbote se… 
Paramenoni ka hala njerz shka e perkrahin PLAN-in  shka pritet ma shume pi kti vendit
 Rreshitja e Hashimit, per vrasjen e Astritit. 
Kto shka shperndajn urrejte ne mes shqiptarve t'Kosoves, t'Shqipris, t'Ilirides etj ropt np*dh jau q*fsha se Adem J… 
O m'lujten be '' feministet ''  
Shqiptarve devqa i duket reper i fort a fero, buta, s4mmi, fuego t'dopt  
Kshyrne trendin e ri m'lujten  
 Bakllaves ka pas me ja qit
Ja ka pru daja pi Zvicre parfumin gucci gjysem tperdort edhe kjo del e qet ntwitter kishe me qat fragrance lyhet gjithmone 
Rron Gjinovcit  respekt maksimal ja ki tregu vendin Edi Rames sonte
 Dont care - Mos u kujdes 
 Ju lutem te pakten me shpernda 
 Bashkndjejme me te gjithe te prekurit e sezones se dasmave 2020 ! 
Pasha zotin kom me bo like qet koment (masi krejt)
Shti kana gabim edhe mi bo punt e shpis sipas juve a? 
Qeveria Hoti thojshin HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHHAHAHAH
 Heke ket reply ose shifmu ngjykat
Nuk asht qe skisha humb pesh, po une e urrej humbjen.
Virusi ska me mbijetu shume gjate. Virusi: 
Vetvendosje me shkijet jan ato pisa e kan tradhtu uck. LDK❤️❤️ 
Qe pse femrat skan lidhje me rap 
Ti agjeron se asht ramazan, un agjeroj se skam pare per buk. Ta dim ku jem 
Pse Kumanova me pas spital e Sllupcani jo 
 Po fol per turp tu e pas ket foto nprofil 
Un e pasna numrin fes (5)-Ramush Haradinaj
Me gjet "Piken G" qysh pi gjeni antenat e 5G, kish me pas shume ma shume lumturi n'ket vend
Po de i ki ndihmu ti me ni qese me tesha , po para 21 vjetve kur baba edhe nana jote skan pas ku me flet qato shqip… 
   A ma ha karin
  Kuedi bro per mu asht shum i fort su reper
 Mo be se i ri hala
Mkan ardh qeto requesta n'fb, spedi a mi pranu 
  A je mir vlla a u lodhe
Maradona ti qi ropt
 Ku po ma din moj emrin
 U dalloka se kshyr porno t'zive
  Ooo po ti paske bere pune te madhe
A je me Albin Kurtin?Jo be un jom me Isa Mustafen aj osht baba per ktu.. 
  Bravo shpresoj se ki sukses me ket talent ne te ardhmen
Po ha kivi po pi kivi 
A e di be per shka asht tu fol be ta qifsha humoristen 
 Hiqmuni karit me ata minuka 
 Zdi ku pi shkon nmend me bo tweet meniher masi pi vdes gjyshja
Bravo per ty qe e ki dit pi ma heret 
Jo ti munesh me fol veq per nanen tane 
Ama trimnin shka je tu e kallxu 
 Video me e re e italis, as korona smundet mi ndal me ngu muzik tmir 
Kishe po foli dishka 
Dita e dyte e karantinesUne ne youtube: 
 Albin Kurti ne ate kohe u kan n'burg nBeograd vllavi jem
 Qeky account fake asht me ka 200euro lidhmu
 Aaaa shti e ndrrove
 Asni msusit e asni msuses sja uroj 7 marsin,nuk e meritojn,se kurr sm'kan msu diqka per jet,m'kan msu… 
 Asni msusit e asni msuses sja uroj 7 marsin,nuk e meritojn,se kurr sm'kan msu diqka per jet,m'kan msu… 
Asni msusit e asni msuses sja uroj 7 marsin,nuk e meritojn,se kurr sm'kan msu diqka per jet,m'kan msu diqka qe ekzi… 
 Veq vazhdo ti hiq mos ta nin
Ose ndoshta jane broke kupedi 
  Po bro kapak qetu ty qysh tkam a p ta do
  I nanes tane jam
 Zoti te denoft per ket palim qka ma ke bo
 Po kjo ska zhdryp pi marsi nanen ja qifsha ndarsem kana kan spo shof dishka tragjike
  O pis pse po ja gjun qikes
 Ani ani veq vazhdo ti mos ta nin
 E po bro aty problemi vet asht a mashtrohet ajo a jo pi atynve djemve ama sa per me vesh e per me dal e drejta vet asht
 bro kjo pi bje qe nese ni femer nuk vnon shami edhe del naten me pi kafe asht kurv ,po le be mos ja qi na mos fol palidhje
po bllok pse e hangra se ?? nuk thash dishka tragjike veq thash se ja kisha thy ftyren me llos
 moter nese ki munci edhe niher me shkrujt pak ma qart se nuk tmora vesh
 jo jo veq vazhdo ti se nuk guxon kerkush met hi llos ftyres veq ka t'pash qashtu tu u pirilav nkamer m'er… 
skam dishka me ty personale po shka i kisha hi llos n'ftyr kur t'lazdrohen qeshtu femrat ja kisha thy ftyren 
 Jom n'semafor, qe u kall e verdhaPer ni minut pritem se erdha
 Shum golli fort u kan qeky a 
Sa per dijeni ky asht lojtari ma i mir n'ekip t'atynve 
 Garant se kshyr kurr po veq e ka per flex se me bo me pas kshyr secilen loj tArsenalit moti kish ra n'depresion
Po normal qe asht problem ani me dres tArsenalit hahahahhahahahhahahahahahhahahahahah 
 Mos shaj me fjalor qifsha bothen e fjalorit
Me falni per fjalorin
E morem vesh se i do be ti qifsha gjarrpnit se kejt e ki per mu kallxu po  kerkujt kari sasht tu i hanger 
Tha nje fanse e Man Cityt 
Treshja me e forte ne lige 
Kjo koka ma bet se ajo me gjarrpen 
  Leje bro se ka hup marrja n'dit t'sodit
  Mos kesh ta qift bota nanen
 veq grahi ti, te mbeshtesim pa mase, edhe ni bolle kena me ta ble koft kismet
 Edhe qeta e pash ja qiva na
 Jo be moter qfar defekti ti kokshe shume e mire po veq t'thash tpaska ik buza
 Ku me guxu me hi shkijet tane
  "Vetura duhet te jet tpakten 100metra mbrapa kerrit "-Gazi
 Sit mendojsh se je tu ma palu me kto reply je shum gabim
 Ti per mu jo cicet po edhe pidhin qite po ti edi vet nmendjen tane se i ki qit kto foto per attention,… 
 Dmth pa m'pyt dikush un skam t'drejt me fol a?
a deshet be njeri per 500 like qija na 
Veshu moter se ftoft 
 Qfar tqime be 1 goll ma shum mos fol palidhje
 Un pallavra sjam tu fol bro. Po nejse secili e ka mendimin e vet. Urime
 A pot duket se jam tu bo hajgare a?A sa per reciprocitetin ta dish se ka me pas pik pozitive pi SHBA… 
 Shum shpejt ket flamur "t'bukur" kan me zhduk vlla mos u ban merak 
Shka be a ja ngule atynve dyjave a? 
Chuck Norrisi filmin 2or e ka kshyr per 20 minuta 
 Po edhe Cicat jan tul oj cic
 Veq zhanrin kallxoma bro
 Po ket foton per shka e qite se?
Tu u mbrojt pi hEJteRavE 
 Hajde krejt report veq per gjizin hehe respekt
Ule pak doren moter se spo ti rrok hija e dores syt hiq 
Me mungon twitteri nshekullin e 13 p.e.s kur e paten vra Akilin e kur e qitshin naper tweeta - po na mungon shume,… 
 sa mir qe ja paske mshef emrin kastriotit se palidhje
 ky koka aj te google translate albania
 O ta kishmi pas na ni Albin nMaqedoni be pasha zotin kurgjo ma shum skisha dasht, sja dini vleren besomni
 Absolutisht e pa vertet secili send shka e ka than
Kshyrne granitin i ka qit dy foto t'veta kishe na spe dim se asht i njejti njeri 
  Bro tpershendes se kokshe i ran shum se me ato shka pata pun i kryta tprsh vlla tfala mbretneshes elizabet
  Une kam frik veq pi zotit
  Le le bro se po shifesh ashiqare
  Bro mos me asi shprehje se na ktu pedera i thirrmi kto djemt
  Oooo mere vesh se smujtet hanger kari nese ski kar e le mo me me ta qa
   O bro bro qetsohu kadal se hajgare jena tu bo bro mos u nxej tlutna mere me qetsi
  Hehehe po shum ju paska gjeg be nanen ha
  Pe paramenoj qysh je tu u ndi nket moment kur pom thu bravo me demek qysh po ja paloj adi pe lo pa fjal
  Shka e keni mor moj qaq ngat zemres se veq koqe lujta pak ske dishka shum mu mor tragjike ti n… 
  Po shti me kshyr holl e holl as ty nuk te takon me kan gazetar (per shpfjet qe e ki zakon mi… 
  Me tcuditttt ky vllau 
 Me ti furr mir, se e ki merak ti mi furr njerzit
Une tu fol ntel me tezet, nderkohe prinderesha 
 Pi te sekonda 7 mduket e mujten emocionet me ato stilla tMuhamed alis
 Ku je nis me kto mend oj moter shqiptare
 A ke kjo ajo qe shet konopa??
  Jo be vlla mos ma ban qefin
 Hehe vazhdon koqeluajtja nga koqegjikjaaaa
 Hehehe, koqegjike e fort kokshe shum palimet e forta i pase respekt
 Po, shume e vertet, per qat arsye secilen kang e ka HIT. Sjam fan i asaj ama ja keni shum inati
 O zot qfar talenti, ti ki me mrri me ket aftesi qe e pase
 Ndihm Urgjente Per Ardit Gashi 
===