 Shpresa osht edhe tezja jeme ma e mira nbot
 E le fakulltetin edhe arsyetohet thot hajt se edhe marki me bill gates e kan lon, o pidhnane ata e kan lan harvardin e jo aab…
 Ajo vesh patika Fila amo okej zgjedhe ti ato
 “Besa-bese vetem nje vdekje se tjeter s’ka n’kete jete, edhe nje fjale e mire. Ckado qe t’ndodhe, krejt se bashku kemi me dhan…
veqse nice try loqko
 "ha najsen, trashu"A ta ha motren, ta perbij krejt familjen ti qifsha krejt ti qifsha
 "humb nje vajze ne Kosove"shqipet: U SHKU TE AI JARANI MU QI HAJT SE KTHEHET
Phu ta qifsha rodin 
 Kush qihet skallxon, kush kallxon sqi
 A e kam tdrejt bir?- Po be bir kurgjo ski veq gjak qe o tut dal
 omg halloween po veshna si qdo t premte amo po i vizatoj nja dy rrjeta t marimangav n faqe ja u qifsha kurvat e vogla
 artisti jot i preferum osht buta mos mfol
 a do bomi kshtu edhe na hahahahahahagaga
 kuku zot qysh mun njeri me kshyr nftyr kto edhe me thirr kadrije
 Mickoja se din ncilin muj jena
 dikush lyp pune, dikush puntore, dikush lumturi amo shumica familjen npidh lypin me jau qi.
 Qeshtu zhag o ngeh Albini, duke e mbrojte UÇK-n qe ju mos me u ngreh zhag sot.I thojshit qe osht pro serb!Karma is a bitc…
 lidhja duhet me kon 50/50 ajo merret me problemet e mija konstante dhe mjep dashni tmadhe e une ja boj po dokesh cute ni here…
 qe qetu n cinemarine 
 vllaqko dhipi jot po i lyp 300 llajka per me qit video qe ty tu kan duft 3 muj me i pa
 Kejt dilerat nShkup postojn hadithe e ajete nfacebook
 Uoooj princesha veshnu ma trash kur dilni ntakime, se na shkun bubrrekt neve tu u mundu me u doke xhentellmena tu ua jep du…
 oh grue breh ishalla ma fal zoti qe e kom bo pause njo 19 her me lexu komplet qka kan fol
 ska sen ma t padurushem se dhipat qe ja kan nis me pi kishe bari
 - Kush o ma i vogli nshpi te ju?+Babi-Pse babi?+Se aj hala flen me mamin
 ti qifsha ndjenjat qe mi kishe pas
 I tha Muzati Lopes pasi qe u ndan
 Osht e vertetume se qikat jon ma tbukra prej moshes 20 vjet deri n30...A djemt prej 50 mij euro e tenalt
 kjo osht si ajo rrena e dajve kur trritesh tmarum ngjermani
 po qihen sa po munen tani pe kepin pidhin
 jo jo s’jena krejt deshtima t’karit
 "o budall" "shuj" "tmys"
 Sa ma t heshme jeni kur si lyni buzt jashta vijave tbuzes
 Edhe mu mka than, ama per mu mir e kish pas
 E djegi venin sikur dielli token h3h3
Kur o i trash edhe pareli o si panda,a kur o veq i trash o si derr
 "Teper po kom stres n'kompani t'babit. M'kane inat krejt punetoret, se shume i ri edhe shef, e mandej po m'bojne mu sjelle keq…
 Duhet mu msu me bashkjetu me to... 
 Dorza aparatit kafes masi e qet 1 espreso tshkurt
 Bdija saher fiton,deri sa tju gerditet vet politika qaty kan mu kan hahahahahahaha
 Mos rrej qekaq pot tham
 Bir sa skandale jan bo..Qekjo qe e thave ti so skandal o rutin e dites hahahahahahahah
 I ka do stilla si marcelo najher
 Njerzt e lodht e marin secilin kompliment si flirt
 Shka tu kujtova npik tnates
 A e ki per mu a per naj veton tjeter
 Milani sot me hy nCHL me ket ekip bon ma shum se krejt ekipet e italis bashk mu bo
  Po thom un, para se me shku puthum shumShpirti so toksor qun, nuk ngihet me brum
 svyn shum veq ni plum shpirtin ta liron si pllum
 Vnoje masken mos u bo feminist.
 Rasti ran leje qija muhabetin e nanes hahahahah
HHAHAHAHAHAHAHA A JA QIVA ROPT
 parameno mu kon psikolog e me tthon pacienti "o jom shum keq bre spo di ka mja nis se nashta st`intereson" e ti mja kthy "me…
Tmirat sjan per mu nuk i du si maj ngat
 Veq pe postoj qetu 
 Kur ni sen i jashtzakonshem tbohet pjese e zakonshme e jetes, nuk i hup madhështia, po na nisna mos me vlersu mo madhësh…
 Se pa mu vari karin jeee e e e
 Cka osht kjo "Goj"          Cka osht kjo "Ore" 
 Tqifsha gjeneraten masi se dijten edhe 50 centin ropt jau qifsha
Tkisha njek ton jeten ta kishe pas emrin Euro hhahaha
 Perderisa do twitterasha te lodht, qe ndikohen prej titujve te gazetave, edhe arritjet ma te mdhaja i kan kalimin e dyte te fa…
 Pe nguci burrin kaniher po boj hajgare...” 
Ta rasi fllesh edhe tprej me leftclick
 Menja mos te ju shkoj me m’thir ne dasem! Ha shume, me kcy s’di, me nje fjale jam mysafir koti!
 Hala n'zo pasha nanen 
Saher sje mdoket qe po bjen shii
Tu jetu sot per sot smunesh me pas mir neser - Ismail Kadare
 Pot dhem qe sem ki pas qysh ki pas qef mem pas
Ta kom qi sta kom qi
 Kalofshi nje dite te bukur sot❤️ 
 shakat anash jemi ne dhimbje edhe sonte 
 mfal qe ta lash seen, pahiri e qela
 Ta qift njerzimi at non
 i mshela syt mu ka dok si me hyp ntaksi
 Jaaaaaaaa bir qetu beb ska po mos ma luj koqen
 Ja bir per qfar bebe je tu fol sdi hiq
 Erdh njani n'barnatore tha:Bjerma be vlla viagra se i kam do puntor nshpi jam per ngut.Eee po du me thon:iiikni oo puntor…
 Kusheri gabim e ki,a ka ma mir se me ja bo rrafsh njerit leje le tknaqet Hehe respekte te fala krejtve
 Urime Kosove u kthyn udhtimet falas per Albulenen, ajde punojme tash e shkoqim bothen na tjert per me udhtu Albulena
 T’miren do njerz ta marrin per dobesi
 Kom pa rich people qe jetojn nskamje, Kom pa shpirt perlyt me tesha tlame, Kom pa shpija tzbukurume e pallate,E mas tyne…
  Valla sdi pse pot shajn , kur bash ti skoke me tmarr seriozisht .
  Valla sdi pse pot shajn , kur bash ti skoke me tmarr seriozisht .
 Ti edhe kur sem kallxon, mkallxon sjellja jote
 Gjermant futball kan nis me lujt, na bajram sen dalmi me bo...
 Shi - anglisht : She...dmth Femnat jon bereqet...ku po don ma shqip ?!
 Mbulesa eshte adhurim ndaj Zotit e bullizmi juv buron se kjo eshte ni vajz qe sju ngjall epsh se nuk e qet veten nqat niv…
 Shum s’kena, po jena rahat ! 
 B site clear, ajde monto ma shpejt...-Mka rra C4 n'mid
 Mirmengjesi mbreterit e mi, mos bjerni pre e pidhave qe e kan pussy loose si tojat e Air Forcave tmia.
 ta qifsha ket jet t keqe ta qifsha
 this could be us ama un du tbona pro nCSGO
 E be nanen i kan bo ka 25-26 vjet edhe hala ta bon follow t’pret deri t’ja kthen qe me ta hek, krejt kjo qe me pas followe…
 Ngone mire e masnej le te logjikojn do njerze se a duhet mu fal a jo?Historia e harruar perseritet! 
 Fillma bani Fillma mos hani
 Veq tja shoh najkujt tweetin “tkena thirr po sje qu “ pa jav qi ropt npidh tonve se lo
 Na e meritojm mu mshel nshpi edhe ma shum se kaq, bile pom doket shume qef mu mshel nshpi kunder asej qka pernime meritojm.…
 kur najsish lujsh csgo en e shofish se kit ekipa o me rus en turk 
 Nuk e di cka ka për me kesh ktu, qysh nuk duhet me kesh nese ni burr e bon ket sen, sduhet me kesh as kur gruja e bon ke…
 Jo krejt ata qe i don t’meritojnë.
 “Nuk kam me dek prej korona virusit, kam me dek prej skamjes”!   
 Smuj me nejt rreth njerzve qe me za ose pa za gjithmonë thojne "qeshtu jam un" per me i ik rritjes. Pse me limitu veten…
 Msimi online 2020O djal qka po ngan pi asaj sobe nket sob - lem rahat oj nan se edukat fizike kena
 Me na ra neve korona, korona hin nkarantin🤢 
 “Me pas miell e sheqer nat kohe je kon dikushi”
 „Ti tash kollitesh shlire, n‘ate kohe s‘kena guxu“
Po du me pas pare sa kom plane
 a dojshit me dek more kullera qka u bo tash
 ma boni "mfal zemer, amo spo je kreativ sa duhet kur po hin ndy hapsh" 
 ktu ta lujn koqen o bred pit
  1 euro pe nali per buk 49 i shti me lujt qe ti ski qi pidh kurr n jet
  Jo na pshtym n ajer ama nese pak logjikon graviteti e ngre ntok
 Dola me femer bir , ish kon me shoqen  e vet kaka qysh ma hanke ajo shoqja vet
 Ftyra e unifikume mashkullore kur shtyhesh ndisko edhe duhesh me kalu mes dy qikave a knej do me jau bo me dije qe sje n…
 Zyrtare;Shpall diten e enjte diten ma palidhje te javes, diqysh dite pa identitet! Flm
 Qr menxi se i gjeta parking kti nonqimi 
 "loqki qysh kush o more? presidenti i zemres tane hehe, pritem se jom ka vi, nashta nuk me sheh se jom vesh pak kamufllazh aha…
 hej skeni rren, para 15 min, tu ec neper qytet, po i shoh nane e bir, tu diskutu fort dhimbshem, edhe hajt si shipec une, u af…
 pasha allahin skeni rren, veq ja nisi havaja mu terrav pak si shi, edhe oh allah ndore tone, po lshohet ni si lloj konge a dov…
 ju sja luni koqen vetit sa duhet, qata menihere kani kur lun koqe dikush me juve
 veq pse i ki flokt pink ose najfar ngjyre palidhje sdomethon qe je woke
 Nuk e di qysh, veq osht mush Twitteri me adoleshenta t`kqi. E para, sa shume po bojshit bullying nje pjese prej juve tinejgj…
 sesa djemte. Osht per me u habite e per me u ndi keq, ne kete kohe kur ka fushata gjithandej mos me bo bullying, po mendoni…
 Jo sherku, jo maicat, jo farmerka, jo ferrari, jo prostitute, jo kesi, jo asi, mos bre se me 20 vjet hala nuk keni pa bash k…
 shkaku qe ju e keni bully neper rrjete sociale? Nuk osht cool me kon idiot as idiote. Osht cool me shku me mesu naj gjuhe pr…
 ketij grupi. E zgata pak, se zakonisht ne Twitter boj ma shume retweet, veq adoleshentat po me deshprojne. Deshprues fakti q…
 Pse po merzitesh qe ki jet t'keqe? Ki ni familje qe t'don edhe osht afer teje prej momentit kur ke ardh n'ket jet. Ki kulm mb…
 heec bre mos luj koqe, rihannen e ki qit dy here
===