Edhe Netanjahu ribrendohet ne jeshil
 Te cmoj, ta kam thene, por me mbeshtetjen tende te krimineleve qe na mbyten 18 vjet rradhazi ne Maqedoni… 
...se robi pin kur s’o vet... 
GENERAL 1 EPIZODA  via 
Te quash veten njeri e lere me intelektual e te votosh keta kriminel senil e lere me ti mbeshtetesh...jo shoqeria,… 
Te bashkuar apo te mevetem, shumica e shqiptareve ne vitet e fundit kane qene kunder duit. Dui moti ka humbur legji… 
Kur flet nje politikan hajdut me partnerin maqedon dhe kerkon mbeshtetje per investime ne kulture, ai fillon te qes… 
Kshtu ka qene Muçi Muzbajdin Qamili para aktoreve te mi para premieres se Oda Blu para shefit te tij Menduh Thacit,… 
Listave te hapur u frigen vetem hajdutet dhe diktatoret. Nuk ua mban ti masin forcat vet a vet. Si burra. 
Capi, shume kemi humb qe ste kemi me! Zoti ta rruajt familjen! 
A kjo ma perkujton gostivarin: 
Sot ishim ne dreke me Bajrush Mjakun dhe me thote leje bre se sbete asgje per Teatrin tone per femije. Thash prit p… 
Te shtunen ne parkun e qytetit;) 
Falemnderit Salajdin Salihu qe na nderove me prezencen dhe me ndarjen e pershtypjeve! 
 Nuk e di. Doli si film ne festivale, tash si serial.
Televizionet serioze promovojne kulture te larte ne lajme, jo shund. Flm RTK 
Gostivari mendon se ska djem:) 
O Edi Rama a e di cilin e ke ambasador ne Maqedoni? Apo nuk ta ndi!
Koncerti i sontem do te mbahet. Nuk eshte rock koncert. Eshte muzike serioze qe te qeteson shpirtin. Eshte festa e… 
Nuk eshte me bileta. Vetem vesheni bukur si per feste, formalisht, dhe lirisht zini uleset qe ju pelqejne. Ska prot… 
Trishtohem, me nxjerr prej lekure kur degjoj dikush te frigoje femijet me polic dhe doktor. Lere me djalin tim. Edh… 
Nje muaj pa gjume, duke vrapuar prej dere ne dere neper institucione qe te mbaroj punen qe e filluam me Asafin. Edh… 
Kur iu nisem kesaj pune ne krye me ministrin Asaf Ademi, na thonin sbehet kjo pune. Na thonin njerezit qe skane nde… 
Pullin' Up - JAX 
Ah si me shkohet ne Tirane te dielen ta shfrytezoj per here te pare te drejten e ta votoj , ndoshta sjell kembe te mbare te ne:)
===