shum pe permen kur moti tka harru
- nuk pi duhan - nuk pi alkoohol- nuk nervozona- nuk xhelozojmdoket pi tmirav pasna me dek...
U dashurovaU dashurovU dashuroU dashurU dashuU dashU daU dU deU deshU deshpU deshprU deshproU deshprovU deshprova
 dikon qe e du e du me kejt qelizat e trupit
Kurrkujt mos i kallzo problemet qe i ki, 20% t'njerzve s'ju intereson, a 80% tjerve gzohen qe i ki
Pergjigje e sakt e shum pytjeve osht : kqyre punen tane...
shum bana nervoz kur nervozona per palidhje
Profesori :  ska me honger ushqime n'or t'msimit *banka e fundit 
Nese nuk t'nervozon barem ni her n'dit dmth nuk t'don
un me ni krembanane gzona e le mo ma shum 
*qysh po munesh vet ?-e ti qysh po munesh me secilin
 definitivisht sjom ka i besoj kerkujt mo.
e keqe per veti, e mir per tjert...
skom koh mi urrejt ato qe m'urrejn, sepse jam i zant tu i dasht ato qe m'dojn...
 fmit e kan zemren e vogel amo kan dashni t'madhe 
+ me qka mirresh ?- modele jam n'instagram..e ti+ un ushtar jam n'PUBG
 "Mbje telefoni""**Me : o ishalla smu ka thyTelefoni : 
mos kallzo qe din me vizatu se kurth osht
kur shoqja jem m'bohet si melaqe 
sa fort ish kan secili njeri me kqyr punen e veeet 
*spo di ku mi lon kto durt ?!- starter pack 
-ki mastika-ja jep nja shoqes-ajo thot para krejtve se prej teje e ka marr-mas dy minuta...ski mastika
Sa fort ish kon n'anderr me bo screenshot
A ki naj hobi ti ?Un : 
ska mo Xemia update : aga xheem 
o prof a ta fshi tabelen ? - jo ska nevoj, qe un e fshiMe : 
kqyr kalendar, tetordel jasht, maj gati qershor
nese e lo buken ngjys kur m'thirr ti, dije qe ki vler t'madhe te un
 Pe du dikon qe mkupton,edhe at her kur sdi me spjegu veten.
 Kur t’ban crush t’ri... 
a me flok tgata? 
a vjen ajo dit kur truni ka mu kon n'mod ?
A e dini at sen kur e mirja t'kthehet me t'mir As un..
veq me qaf edhe mi harru krejt merzijat&gt;&gt;&gt;&gt;&gt;&gt;&gt;
ku hupi aj fmija te un qe bertitke "spoo duu me honger spo duu"
nuk osht marre me fol me vetin, marre osht nese t'sheh dikush tu fol me vetin
 Sot ka me dal me ngajtAlso me : sa dal pi shpije 
Eh valla...fort mir edi se edhe un i kom pas do prqa qe kan lujt me mu n'fakt me pamjen tem e un pi inatit e bona t… 
jo qe m'nervozon amo aj t'lutna shko mytu...
pse nuk flen ?- t'lutna pa pytje t'komplikume
un barem e kom ni talent, i boj njerzit me kesh me lot bile
un ala nuk kom pa njeri t'fort me kalume t'leht
Kto me barkin rrafsh a i kan krejt organet apo i mungon najsen ?!
A ushtron najsen?- Po i rrotulloj syt
Nobody: My dad: - O ty tkam djal shpije be aj boma do buk tana shko blejm cigare
nese e pin kafen n'ven çajit na dy smujna mu shoqnu...
Nuk e ni vetin shlir kurr rri me do njerz normal, jan teper dosatshem nuk jan interesant edhe qaq
Edhe kto rrjetet sociale e kan pershtat ngjyren qashtu qysh e ki zemren
Amo prap e hupii kontrollen
Kontrollim i vetvetes osht kur n'market rastsisht kalon te çokolladet edhe e man vetin mos me ble
nese un kom shpirt sdomethon qe duhesh me ma nxjerr permi hun
Shedi pshe amo qum kam shef me fol shi bebat
Mirmengjesi mir osht kur qohesh vet e jo tjert me t'qu
A din anglisht ?-PoAj perktheje ket "po qysh jo"-Yes how no Jaa po shihet qe po dishe !
ju qe rrini veq n'telefon kur jena n'kafe ta dini se dit bardh skeni me pa
nuk i besoj atyne njerzve qe tan diten livdohen
shqiptari mesatar del ma heret pi pune se e ka ni pun
nese ti mi vonon mszh 11 or un tye ni dit e ni nat aj tash..
Nese vendos mu ndryshu najher, kqyr te e mira mu kon, sepse e keqja kurkujt mir si ka bo*edi najher t'vjen me ja… 
N'barnatore:A keni hapa kunder inatit?-Po.E per inati nuk i marr
E perseris nese mbon bajate kurr nuk tshkruj
Mu ka bo bajat bukuria, trupi po du karakter, shpirt, zemer..
Do sene nuk kan shku qysh i kom menu po kur jeta mla pa fjal un kom  knu.. 
 A ka mundsi mem qaf naj fmi se veq ato dhurojn dashni tvertet
 Njerzit qe jan pa ndjenja dikur kan pas me shum se qe duhet
 Po thom e keqperdor shoqnin
kur mos ban se i bjen pishman 
Mfalni amo nime spom intereson per jeten e kurkujt
dikush tkupton veq me shikim e dikush as fjalt s'ti kupton
 Veq s’muj se vetit bllok ja kisha bo qaq bajat njeri qe jom 
 I dashurum me vetmin
  ah be vlla tye pak po tdoket gajlet qe i ke, e tash edhe tmiat po mi man a?
btw ket piktur e kom bo para ni viti
un nuk dyshoj amo s'besoj
ma shum lutna per ato qe i du se per veten...
dhimbja t'forcon qaq sa t'lendon...
T'dobt e paske baterin..- a be edhe nervat i kam t'dobt amo pe qoj diqysh...
N'shoqnin tem ma shum m'shkojke nerva ata qe n'gojshin qasi muzika vajtuse, e qe bi un qat deregje tybe kurr se kom menu
 Ndihesh i vetmuar edhe pse i ke shum njerez ngat vetes , arsyeja? Ne mesin e ketyre njerzive nuk eshte personi zemres
 Ku e din kta t’rijt e sodit qka osht muzika 
* Pse je qaq e keqe ?- Tash un e kom renin..
Edhe aj i forti per dikon osht i dobt
*Kur shkoj dikun n'musafir :- Ajde ha bukMe - jo valla sjom untAlso me: 
Nese keshi edhe pa ty dmth spom duhesh
 Ti msoju me kuptu tana fol palidhje
 Ky "term" sosht i thant mu pajtu ti,amo nejse qysh e ceka ma heret fjalen injorant.
 E ka than ni njer qe esht ma i meqem se ti,qe me kuptu ma let injorantat.
 E per qat shkak e caktova pin fillim qe femra duhet mu kan trendafil me "therra" po jo secili djal e… 
 Epo nese ja vlen edhe ta merr menja mi ba durt me gjak,pse jo
Thot bonu e sinqert, po kur ja thu t'verteten idhnohet... epoo tash
Parameno sa shikime i ke hup tu kqyr n'telefon
Tan kohen keshi me njerzit, se kom leht valla
 Jon do sene t’paharrushme ku gjdo her ta prekin shpirtin..
Tjera shtete: I don't know him?Te na: nashta me ftyr si ta shoh sigurt e njoh.
Un nashta skam moter amo e kam ni shoqe mashum se moter❤
A thu a tweet dikush per mu? 🤔
Mu sem m'shkon kurgjo n'jet se i kom injoru ato mesazhe "Dergoni kete mesazh ne 10 veta dhe...."
Coming soon...-Ju atje n'banken e fundit,jaaashtt
U mytem tu bo copa me vllaun tem, ja kan nis edhe muskulat nform me mu bo :p
 Prsh edhe krejt passwordat mi pas,nese ajo e ka nijet me tradhtu ta ban
 you're right amo nese e don i beson edhe s'dyshon bile
O shoq nese ni femer ta jep ni shanc, ty duhet me shfrytzu at shanc e jo femren.
Mdoket jom e vetmja qe nuk tutna prej qenit ose naj insekti
Jepma naj kompliment edhe kqyre qysh kuqna🤗
nervoze + xheloze = zoti t'rujt
E bona ni termin per te syt,se nime sdi qka pash te ty
Kur mthot dikush e fort koke:- 
 Qum qum e miil je..ahh
Secili prej ne e presim dikon edhe pse edim qe kurr svjen.
Nobody :Me : edi qe jom e gat po hiq bre sma nin :p
Pedu ni person qe muj lirisht me nguc
Jan dy lloje te njerzve:-ato qe lahen me uj -ato qe lahen me parfem
 Ftyren e ki per modele ta dish
Stresi,nervoza,depresioni vijn veq kur jeton per mi knaq tjert
Kisha dasht mem dasht
Doktor me zor po marr frym!-Vesh farmerka tjera..
 Sa njerz i keni humb tu i dashte?
Mos jepni shpres kur skeni ndjenja
Shprehu me koh qe mos t'hupim koh.
Kur jena kon tvogel kena aktru kishe jena tu kajt veq mos me shku me flejt. E tash aktrojm kishe po flejm veq mos t'na shohin tjert tu kajt.
Un dyqysh e kom ni shije quditshme,mplqejn njerzit qe kan shpirt :/
-Jeta jote nuk osht e jotja nese shpesh menon se qka thojn tjert.
-Shum koke e urt spo folshe shum a*Foli amo jo me ty
 Shum e heshme jeBesoj qe edin
 Vetllat i ke si modele be
===