 Na doktora jena veq mantillat si kena
 loqki kqyr mos po tknon sorra zez ndritare sepse ti ke vdekur per mua
 13 arsye a? veq nmengjeeees 
 Pi t’hones me ja nis kadale 
 Suporti:                        Urimet kur ja del: 
 Students be like:        / ||  \                      /        ||         \                 /          ||…
 me dit mami qe ha makarona jasht 4 euro ropt mi qin
  Tkum vrejt po sdojsha met than
 Walk of shame amo jom tu i qu ent qe mu kan grumbullu ndhome drejt kuzhines
 Kur stkum pa qekaq pozitiv
  Une e thiri po mpaska injoru
 Une e kam shiku me komentim gjermanisht, ama shqip koka kane tjeter nivel 🥊Ta ha zemren   
 Saher qe ha hajvar ose e kry copen e bukes a hajvari met, e tani e mar do buk me kry hajvarin qe o met e tani em met buk…
 Kerkan se pahe shti me kesh
 Jetojme ne nje shtet, ku te ashtuquajturit Maqedonas, i quajne Shqiptaret pakice, por harrojne se vet jane pakice ne nivel b…
 Pt.1Le t’bohna unë kufoma e ardhshmeE dorës t’m’sheft,E gjakut ton t’nxehtëNëse t’kqijat t’i kom majt m’sheft’.Poez…
  Mkallxoj po tana e pranoj faktin se une jam ma e nxime se ajo🤭
  Pom intereson qetash edhe mu
 Spe maj nmen ha ha
 Kurr sem ke dhan
  Faleminderit per suprizen po spom rihet prap
 A pe she hiq so interesant mi pas 20
 E shtina babin me thirr baben e ni shoqes me bind qe me lon me ardh me ni ville se kejt shoqnia e sene...Po aj e bindi ba…
 Meta tut prit shka ki me fol
 Shum e njofshme hahahahahaga
 Shyqyr qe se ki se tana skishmi lujt bashk
 Veq per keksat shkoj
 Te akademina shkojm kur ska ven nrondevo
 Besnik shum je bo i detajeve
 Telefonin, Kuleta             Ta qifsha   Qelsat, Cigaret.               Masken ta…
 si paha ngja tezakit baba jem i ka qef
  Shum cool valla pse pot vje inoti se ti ski qesi karike edhe drit
 Tkan koristat per shokt
   Hahahhhahahahayhah te geshtenjat be
   Kikit i dal une edhe qeshtu mledhmu
 Hahahhahahahhahahahgahaga pse sem ki vet pse ri ntelefon tkisha kallxu
me nxer telefonin mu bo kishe po shkrun edhe pse ski internet 
 T'plast allahi shtrig muti hahahahahhahahaha 
 Ngone mire e masnej le te logjikojn do njerze se a duhet mu fal a jo?Historia e harruar perseritet! 
 Veq qaty kur kan Anglisht edhe nperkthim ja bon gjeografi edhe ja nis tu than shtete mka smu
 Mozziki be pi nhan vrehet
 A po t hin nerva perkthimi kejt kontra
 HAHAHAHAHHAHAH mos ma gerdit patlixhanin ej
 Pse mos mu kan karantin a e ki festu a hahahaggagagag
 Na e meritojm mu mshel nshpi edhe ma shum se kaq, bile pom doket shume qef mu mshel nshpi kunder asej qka pernime meritojm.…
 Sakeq qe sen e ngon me Dj
 Un dhe  tu mendu qe kushedi sa mir po kcejm 
  hahahahhahahahaha ishalla se ki me mu
  jo ato vlejn mashum si kujtim ahhahahahahahhah
  a jo bakshishin 200€ e kam hala qe ma keni dhan masi e kum than poezin
  faleminderit shum mi keni pas lan do edhe per mu ntok mu ul mos mu bo me lloq
 Llokum edhe petull sosht i njejti send
 Pare naten, pare diten. 
 Tv era bllok muzikor
  Sedin qfar pun mqel
 Hahahahahhahahahaghahahahahaah e beeee nanen
  More driton pi n shtator jam tu e prit vizatimin tem
 o piterpan kur skum perjetu ksi mare para familjes be budallen e nanes
 heej tashme e dini qe kam ber nje nderheyrje qe quhet lipofilling
 E mor djali jem krejt mshelen naper shpija se nifar smuje dekes i thojshin kon e nxike e palojke a une dilsha tinez kishe po…
 hajt shoqi se i msojm per sdyti
 Kur je musafir edhe tvetin a je unt? 
 Mendoj qe Ramushi e ka meritu qat rrog, se ai edhe knojke.
  ejemjaaaaa mukon ju kisha pa pi nxham tu bo foto
 shko nFON -shkenca politike
e mir o dej atdit n provim :p 
 PASH DY SYT NE BAALL DYY SYT NE BAAAAALL A E DIN SA TKAM DURUUUUAAAAAR A MENDOVE VAAALL SE JAM I MAAAAAAARR DHE UN KAM QEN I…
 Kom me organizu ni neje kur ti heki protezat:)))
 Na me sy t’gjelber pak me dasht pertoke ju shtrim juve tjerve 
 ku i ki pas ment ma heret se svishe
 Zani i Erza Muqollit osht zani ma i bukur n’bote
 Mirmengjes gjithve perveq ktij shitsit t'lagjes, qe me ndrru edhe modelin e pashtetes bohet marak mos mka rra firma.
 Me hi n2020 tu kajt a thu qysh tshkon viti se ?
 kur e lexova dej te kusherina menova ki me than pse te voret o ftoft 
 Njerzt dojn met pa mire amo kurr ma mir se veten
 A juve qe ju doket vetja perendesha masiqe bukurine e konsideroni gjithcka, qe edhe nji fakt qe bukuria e mrenshme asht s…
 me mu ki qef içerden me kshyr edi une
 kejt pasna harru qe egziston ky sen&gt;&gt;&gt;&gt;&gt;&gt;
 kesh tu ta bo retweet po une sdi me vozit kerr
 e une jam pas bo barbie per 1 prill edhe niher indiank shka tbaj shti
  thuji ti kishe e ka ndreq foton fuki
 pse rren naj ka bo ni vendas i lido di jesolos aty
 ku mos mu dashuru te ajo loqk
 Krejt nrregull veq flokt mos mi prek
 edhe nuci thot ani shko
 arsyja pse e kom tash dioptrin -38383883 mkan kesh kur jom kon ma i vogel edhe si kom ndu syzat kurr 
 ta kishe qel tweeterin para 5vjetve se kishe pas usernamein driton768537828938563828919
 veq pse e kum dit qe prit sthash
 De pajki te krejt
 qeshtu kur ta kish albumin e kreshes
 boll ma ka thy juljana mo HAHAHAHA
si akili themren ti mu dobsin ma din mvyn dikush me ma thy zemren kam nevoj per inspirim 
shka osht me ti dhan tre land  
 AHAHAHAHHAHAHAHAHHAHAA oj e poshterrrr
 AHAHAHAHHAAHHAHAHAHAH fakullteti ika fajet
 HAHAHAHAHHAHAHHAHAHAHHA une po koleg
 Une: Mam qom prej gjumi n7 ora neserMami n'ora 6: 
 Haj more Zot a mrrijm me pa edhe na ket dite  
 hahahahahhahahhahahahha hiq ske InTerEsaNt
 pse se bone edhe ti albaniantakeover
oj mami apo be kush tshan e shan veten??? 
 qite edhe at foton me maicen 1D
  shum ja ke nis romane sene vene dishka
 epo mir masi mfal
 tema ne provimin e matures kunder kopjimit”nxansit: 
 im happy qe mjan rrit flokt but at the same time po du mi pre prap
 HAHAHAHHAHAHAHAGGAHAH hiq mos e ndro
 kjo ke pika ma e sakt qe munesh me ma pershkru paraditen  lem bre tknaqna edhe qeto muj be pis
 cka o kjo paradite🤔
jo po ti spaske puqra! 
 mir ke parzit be pse po rreen
  edhe kiki tu na qu ka mahallat me qen
 me qu inat shum
===