 Kur i shoh shqiptaret e Maqedonise duke u radikalizu per klasen politike ne Kosove, ndersa Ali Ahmeti fiton atje qe 250 vjet,…
 Secili qytetar i Çairit meriton ma mire. Po duhet bashkarisht me punu ma mire, duhet me u anku ma mire… 
 Zgjidhje alternative kane qene mbikalimet, po nuk perdoren. Shembulli konkret mbikalimi ne Bitpazar te… 
 Kur na jemi shembull si popull, kur nuk e gjujm berllogun prej dritares, e kur i respektojme rregullat… 
 Mediat e kane punen e vet, po neve nuk na duhet krahasime nacionaliste. Neve na duhet si popull me u v… 
 Banoj ne komunen Karposh, rralle m’bjen t’shoh qe dikush e kalon rrugen larg vizebardhave ose ne semaf… 
 mbase duhet me u pergjegjesu populli jone mos me e kalu rrugen ku t’kan qef, mandej heken muret?
 Hajt edhe per mu bone 1 termin please
MAni breH se pandemi  
 E ka shkrujt keq, po thelbin e ka t’mire. Jo vetem krahasim Drenice-Prishtine, po  qytezat e fshatrat kr… 
Grate qe plotesojne kushtet, po! Grate qe jane vetem gra, jo! Ps, barazia gjinore nuk arrihet kur hala e pret bur… 
 Per neve nuk vlen ftesa, me 14 shkurt shihemi ne Kosoven e lire :D
  Na jemi njoftu be zemer moti
 O lal ende se ke verejtur qe me ndjekesit e VV nuk flitet dot?
  Qysh je tu e ngu dora dora million dolla 
 Bleni drejtperdrejt prej familjareve, komshinjve, bashkefshatareve, e fermereve tjere vendore, Tash ma shume se kurre o…
  Hahahahahahahahahahhahahahah Benxhi, VV still me trauma te PDK
 Koke kthy ne fole ahhahahahhahahahahaha
 hahahahahah leje se ky i ka qit punt nterezi
  Hahahahahah hajt le tem tregon dikush qysh muj mu knaq me pak e pi kthehna that type of life
 Vec tregom cfar jete kishe mujt me bo pa pare?
 Lo, lajtem lesh, sdi cka tet tham!!!
 S'po munesh me ju ik be lo. Njerz me influenc n'shoqni e profesor n'universitete. Pak me u qu pesh edhe n… 
  Mos ta nin se ata i kan burimet e veta
  Po m’pelqen entuziazmi me mujt me bo dicka krejt bashk, edhe nese ki naj iniciativ I’m all… 
   Oj Lejl per nja 2 vjet qe e shoh qe spo dhezi knej kqyr najqysh me mi bo papiere atje
  Kemi ma shume probleme se mundsi. Fakt duhet me pa t’miren prej ksaj situate, ama duhet si… 
  Puna osht qe me mujt me depertu prej Maqedonise e mos me lon venin tond qe me shku n’shtet… 
  ka shume arsye, pe perfshi edhe veten ktu, ndryshe jon kushtet ne shtete europiane ndryshe… 
 parameno rinia qe jetojn n'Maqedoni sa ma gjyna jon :(
  Parameno ky me pi caj trusit 2 dit spo flejka
   n'ma shume aspekte po hajt :P qe lejla tregon a ma mire nprishtine a nshkup :P
  mos u merzit zemer, per ty ka me bo cmos qe me e qel prap Menaden
  Na qeshtu lujna, pa guri s’rrim n’shpi
  Vec trego a po don mu ul perpara a permas
===