  Drejtoj rendet para 10 vjetve en mapa rahat ie zduhet trruhesh
 Tu hec nudh mvajn tja kputi grusht dikujt
 der qelu  ,u familjen  der hapu 
 dulem pak hi king 
 nuk je e bukur por je erotike
Ama asnihere ske pagujt JAUUU 
 Y prej I ka shum dallim
  Ardi pi kur letrare taj be
 Mos u lidh shumë me njerzt se t'gjith kan me t'lan nji dit.
 Raj se majr o kish najs tvaje teko
 Kjo shkon per ish caucen e kls ton 
 De va jap vizen tu dive mduket
 Manjaki per chat hupe 20 min sot
  Zhep vlla ma nfund
 Qysh kur dal n xhami Qysh kur dal n xhamiVlla e din kush jom unLere Edin e Hashim ThacinHajde bashkohem me xhematinFal na…
 Okej per ditlindje ta jap dhurat
 U kryy🤘vec se sosht maic
I paskan ardh atoo 
 Vec pakes buzt zmadhoj en tamom ie
 Nese e prekim veshin edhe kocin e kames kur jem tu flejt a bahen andrrat screenshot ?
 ju femnat xhi sna e kini dhon veres, harrojni duksat dimrit :p
 lock jukom ne ti thote dekush dj nikit ta ndroje playlisten
 nuk ije kampionat botror tet pres en 2 vjet vec se sije hazer taj
 Do njerz me bo me shku musafir n’Gjermani meniher nbio flamurin e Gjermanise po edhe gjuhen e telefonit e ndrron🤦‍♀️
 Shom tnemet ina ne xhi jetojm ntetov valla .
 Duji t’metat,se t’mirat ja dujn t’gjith.
 Shum urime per ty
 mbushni mbushni xhepat me gjersen e qytetarve tthjesht. zoti collon.
 Nauk kit mo rrii
 HAHAHA okej le, ikk
 Kem tu ebo cheket broski
 buraz xharka jot hala 'blessed' e mba nbio
Urime ditlindja jeme kitve
Do qer ropt na q*n emocionalisht 
 Ti blej per ditlindje
 Si per gjuhna ke dal te kjo fotoja 3
Do sekonda me mi fal ti kisha thon edhe do fjal
Eduu ni fmn per nshpaj ( lidhje serioze), skapercen vakti hic shtaj per ramazon
T hish kontra me kt hava ta then
 Broski kto smi ke cu a ncncn
 Pse e ushqeni veten me urrejte se kuptoj
Kot se shkojsh nvende tforta kur skie shok ttbojm foto tmajra
Me i hek floket qel un kraja mdel ma kec se udhet e tetoves ( kit gunga gunga)
 Yhyyy shum jon t dalin en per neser
 Mend per qera her
 Tkom thon shajfe nfillim vaktin mapa hin nfilma
Kur e shajn shokin tem per nonen 
A je idhnau?- joEhh majr super- ehe
 E kom fatin e fucking baksuzit
 Per pak keve tu u zdrau
 Uuu mshkrojte kit bro
 Ne zemer te shkupit
 Ncncncn vec per interes
Si u knacem e asniher su gzaum
Dashnin e pash per her tpar nshikimin e par , nshikim e dit erdh ma mur njoni me X6
Edhe plagt nuk pi ja lo mo kohes pi sheroj vet, se koha munet me ma ngul apet.
    Hahahahah ska rezik pi valonit kom flejt edi
    Un me valonin me ni shtrat kllx pi shtaj
 Sa majr per mue
 Sa kec kto xhi sekajn follow tishofen
 Okej lock sndalem vtm ttknachi taj
 Tqift kali i Skenderbeut 
 kam album me foto tua, qe i kshyri kur m'mungon
 sa kam un mall, ska deti valë...
Gojen si thob , veq tum je ka qet
 shtaj kan e shof nqytet mduket si taj
 Kjo fotoja che 1 vjet pi veres
 Kjo fotoja che 1 vjet pi veres
Taj shom e majr ie kshau pi jasht ama vetem duhet te emka 5 milart ni shpric mbrenda at eren e kece tta heke
 A jom i vetmi qe jom knaq tu i kqyr qita ktynehere 
Singëll unn singëll ti singëll asnjonii
 Ajt boootra jem se bohet mir
E kam nje feeling prej dites te pare qe t’kom pa une ty
E verteta peshon ron
 tu e feel muziken deri n'koc     
 eee tash per cdo naat pi raki edhe veen
 Ja bonen shom pajsh , ni dit spajten pse pajsh
Npamje mi analizu doken burra a mi hi ma fellit me i analizuu dalin kurva
 majr ke djali ama sedi g pat i mur udhet e kchija tu ngarend mas femnave 
Ftyren e ki llom, e by*hen e ki okej
 Abe dil se skom kan ta mundi biljard
 kurgjo kunder Fuegos as S4m perkundrazi i ngoj dyt ama duhet me pranu se dissi i S4m me i forte a ky i Fuegos s’paska er…
 Hahahaha ka mundsii tjesh
 Ma heret mthan se ka ma kan ndryshau mendimin mendoj se ka 🤷‍♂️
 Jo bee sbesoj se ka
A ka dni femen cute si nfoto en live?
Mos ju len faj gabimeve po permisoj
Mtha skie per tem harau asniher, ama sedii kush mtha 🧐
Me pare ndroje jeten jo veten
 O birr a je tii ?
 Kit puna te snapi osht 
Kit tmajrat ika vec se so e jemja
Ka en pi atinve xhi vajn misafir te taj en tthujn mfal emrin si ekishe taj ?!!!!
Ja boni per mue 1 limonad nporci
Vec nja 2 plane tm kishin dal si ikom mendau shtaj multi miljoner de isha
 Mos fugni gjubre , mendoeni se per cdo send xhi e fugni dikush perulet per ta marr
 Ahh kec ju me fraera 
nashta un nuk jom ngjyra qe ti preferon, po ni dit ka met mungu me ta plotsu pikturen tond
 Kari dikujt xhi sn e dallon y ene i ka mbet t fole
  Ka hala me kec 
 shoket e vet e thajrin o uki, shoci nrealitet hala klish o me veshet pa pre
N jet ski shok po ki familje
Shtaj e kuptova pse sjom i heshem 
 Krahet mzgjaten cdokund , ama mendja hala mrrajn te ni njer
Ne i fajsojm disa njerz per gabimet tona,a harojm se ne vet e drejtojm jeten ton.
 Ta kishi bo tmadhe per jugohromin ene per gjubret xhi i fugin ka nauk sa xhi e bonet tmadhe ni krajm nmh  g dul sot sde ishim…
Shocet e moja jaa valla kur nuk t’hek pi snapi ene kur de boj frajer, shtaj kit gjem nsnap ikom🤨
Deniher duhet me u largu prej krejtve per ni koh, nese t’dojn kajn me t’lyp e nese nuk t’lypin aty e shef se sa ki pas vler ti te ato.
 Jo ne duhet me u sigurt tkena pare shuum
 o shoc dil be pi filmi
Ne ina popull xhi vtm ankohena ene sbojna kurxho per situaten xhi tu na ndodh
Mbare osht t’shtajresh si dikush xhi nuk ie.
 HAHHAAHAHAHAH LEGJEND IE EJ
Shochnija osht sendi ma i majr nboot po do m*ta sja din vleren.
U nis per te crushi 
Vec kur dashnija nalet chat her ja nisin dhimtat
Un jom hala chaj i njejti, zemer ti ke ndryshu
A u boooo? A u boooo?  u bo su bo i chela sajt
Jeta jem o sikur film, ama kurxho so aktrim
Gjith diten mundohem t ha shendetshem ama si tvaje nata pa mos e bo ni tost ta ha ska shonc
 Snalum dej t’bohet e jemja 
Kshau ka lezet hish nsnap,ninsta,ntwitter.. kitt  tknacen sajt
Une kornetin me akullore hala pi urfujtii eha 
Vdic X najsen shiptaren tja ngjojn muzikat
Zemer taj Zoti tka krijau diten e diell ka pat vaket tet boje perfekt
 mu crushi ma ka bo mute profilin, a ti merzitesh se nuk tshkojn punt mir.
Haj se de bohet majr ni dit
Po mduket qe sot kom mu taku me zotE ni nji zo qe thot cili o arsyetimi jotSpo t'vizitoj mo, se ka plot koh qe jo… 
Se vec terr e zi shohin syt e mi
Mos shajfni filma horror me saba mgjoni mue.
Sikur melodi zoni saj nvesh tmi
A bon niher tbojni bajrom me tshpajes mapa tva urojni qerve
Mirmengjesii kitve pervec atinve
Vec se najsen pederat taktivizohen nTetov
Vetem ni fjal mjafton per tu bo njeri ma i lumtur nbot
  Epash epash vetem se ishte tu e tradhtau
Per njerzit xhi jan kon nrrethin tem tngush kom bo plot sende per tkon majr ama se vlersoj asnjoni
Shom njer pa fat jom
 Me e pa 2 3 her deki krejt 
1 her e kom pa e kom ra n dashni
Mbylli syt leht une t'vi si deja vu
 Kit xhi du osht tjem i pavaret , ta kem ni parntere jete xhi tm kuptoje tjese perher ngat mu supportive,ni pun me rrog mesat…
 Mund ene pa dhom
Shume shokin mue ma mur interesi
Hasmit kur mos ja bon qifin ttshofe tmerzitet, perher chesh
Ka ardh ni vakt xhi me e pa ni chift bashk shom vjet thujn jaja kto hala bashk jon
Mos e hup shpresen beso ti, kurr mos u dorzo
Chach shom jom nervoz sa xhi najsi cheshi me vitin🤷‍♂️
I n’gult n’ondra te pa perfundume
Edish at momentin kur ie shom kec en vajn momenti tbohesh shom majr? - as une sedii
 Perpjekjet e tua asnjiher skan me u vlersu te 1 person qe sja nin per ty.
Nese kit xhojat n’jet xhi t’duhen mendojsh se ikie ska shonc prap ka nise xhi t’mungon.
Kur shkoj n'ferr autograf ka me m'lyp hitleri
E bukur je sot, e bukur je edhe neser, e bukur ke mu kon edhe mas 15 viteve, prap n’fund bukurija t’hup e veprat t’… 
  Udhes per 2sh osht
e ti sa dush me kon i qart noshta ,trunin e ki t'ikt ndoshta,po prap kjo e jotjat'shtin mi harru krejt noshta..po… 
Varfnija varfnija po mi justifikon krejt krimet e mia tha Gruevski
 Mvajn kec dush sdush chataj ina 🤣
 Sbesoj se bash per aska skie nevoj , vtm nese ikie kit ato tduhen ngat vitit en per qeret skie nevoj
 Hahahahahaahahahahahahaha e fortt ke kjoo
 Flm shom i madhii❤️
 Skie faj dt ngjoj taj, hahaha flmflm
  Flm shom ma tmajrit ini❤️
sdi a tgzohem si ekom ditlindjen a tqaj, +18
E di qe o pak von, vec shume po du me ardh te ti abon?
 1 mesazh ma kisht ndreç naten 
 Un I bona tona senet qe dikushi smun I bon, po apet dyqysh spe don, u bo jeta Monoton
 Sdi kush ika fajet vtm se smert ekom
 Brudii urime me kit tmajrat
  Caull berem sbojm filma, ju kursem tmdhi a ma caull se caullet ini
 Dostat i ul posht per ni femenTi sje kurgjo tjeter babs , je baaaal
  Lloc na kini me filma caullesh
Per do njerz nuk ka della sbohen mo, drejt per n’otpad jan bo
Shiptarit ie tu i bo majr ati i duket se kec i bojsh
Per ty kallxoj dashni e ti kallxom a pe she
Se ni koh doren tem se ke lshu, e soot me mu po sillesh ashper
Vec sa ja nisen maturantet me unfollow dhe block
 Ejj shajf majr se fotot toja vet ike bo save
Kur mthujn nsnap xhi tthash se harova ene me edit xhi mke thon nuk tkallxoj thom en un kom harau
 Hahahahah pshtt ejjj mos fol mashom se fajten en shom qer
E kom ni shok qe osht shum bitch
Nanes tem ka 50 her ndit i thujsha tm vnoje buk ene nonder i dilsha, shiqir de jese rahat 1muj
===