 Super pra se mu dok qe ora 20:00 ke per at.
 A mujtesh me lon ma vone se axhenden e kam full sonte :p
 Çka i ka thane batmani spidermanit? Çka ti pst pst 
Ma new school se krejt ju jom edhe kur du jau kthej 99ten 
Marin Mema paska qene sot ne Shkup, a murr pjese dikush ne kete tribune me na tregu çka u fol?
 njeri ma shum punohet kundra se pro bashkimit kombetar
 Mos ta ndin, se vdesim qysh na ka hije.
 a osht nevoja me hallakat tavanin a hala situata e qet brenda kufijve
 Jo bre nipo ktu krejt xhak shqiptari o
Kafja mengjesit sot ne Çair
 Me randsi foren e ki kuptu :p
Bleni djem se erdh dita 
 gjumin e omel &lt;3 
Moter, a t'japin ne Kumanove? 
Dite te mira po vijne 
Pi ja ndin ksaj se mas shumti raste pa nenshtetsi ka ne Kumanove.Popullata e shkret pagun ne spitale 20 euro per n… 
 Po kjo e vertete osht, edhe pse ne at kohe ka qene ni president pro-rus ama sen e mohojm fakti qe i ka shit armatim.
Te ky vendi ky jetojm veq shqipet jane me Ukrainen ta keni te qart. 
Krejt qekjo luft o tu ndodh, shkak se un sja u kam çu mesazhin 10 vetve.
 Po e vertete kjo, ama ne at kohe ka qene president pro-rus.
 Hajde ma shpejt ti japmi share hahaha
Sa mire ja nisa qatij tutoriali m'lat pa e kry, ju skokshi normal vllaqko.
Shyqyr qe lockat e mija prej maqedonia as space as twitter se lodhin per sen, po veq aplikojn per dojshland.
 Nuk i mshohet zidit me kry oj Besa Llapjani
Pe zojm qe po miratohet ligji per martesa te t'njejtes gjini edhe po ju lejohet me adoptu femije. Paramendone ni ra… 
Pune, pune nate e dite qe te shohim xhurmonin
 Thujuv Ylli mka than ku tdush parkoje🤣
Parkoni ku tdoni naper Kumanove, se kto te merimanges apo pajakit jane tu pi kafe perball meje🤣🤣
Djalli ta haje, na çat marmiten pz
Situata gjendje koka bo
Nanen ja kajsha çka tdoni besoni e boni, se shyqyr Zoti e ka lon vorrin per ni person, se me kan varrez masive kahre edhe aty ishim bo.
Po me uren ç'paten xhanem?
 KNO FILONID ALIU TKNOFT ZEMRA
Shum rand m'goditi qikjo 
O Allah jepmi edhe ni par sy ta shof 
Hapuni ju o dyrt e xhenetito sonte herojt let vijn tek neulur kam kryq ndezur cigarente dridhin sharkin ne kullen e re
Urime Nana Kosove qe vdes me tkallzu sa tdu
Vepra mbi toke e trupin nder dhema gezofsh pavarsin me i bukuri atdhe 
Neser me kall krejt flaken me ja shti me bija e me fmi
 Tybe met rrejt se nuk e mbaj mend emrin.
 Njeri jam kan me ni kafe ne Çair, kafja ne oborr te shkolles.
Nji Shqypni e kisha, nji Shqypni e dueVeq me hjek kufinin qe na ka pervlue
 Te menza ma ngusht edhe ja bojsha, shiko zogu un pres qe te thuash po, por edhe nese thua jo ske nga shko kuptooooo
150 den Kumanove-Shkup, a jeni more normaaaaal?!
Edhe un kam dasht mi propozu njanes, po na as objekt skemi pas 
Shnosh kryja se kapuça ka sa tdush 
Neser agjenda po thot qe jam i lire ton dite skam naj takim n4 sy
 Ksaj tabele i mungon veq Bashkimi
Sot tan diten e dill
 Ju bej thirrje followersave te mi qe jan ne Ukrain te largohen menjeher
Prej Mallit Te Bukurise  via 
 Po mfal se harrova se ky eshte kushti
Ni ide per me kursy rrymen ju qe nxenu me rryme, dilni vlla nxenu jasht se 14 grade ishte sot
Edhe e disha si e la Xeni muziken qe o nifar shenje e keqe 
Moj sharki e leht si era,a ka ardh n'Shqypni pranvera
 Jan tu e lyp naj shkenctar te naj labaratorie te droges🤣🤣🤣
Shum helikoptera po na sjellen per mbi shpi
  Me ty jo veq kafe, po pe shtrojna po tpinaaa po tknaçuuuuuum
  Valla hyrem te stacioni i autobusave jem taku
Kafja mengjesit me mbretin 
  Pse o djem jo?
 Nje retweet mjafton! ❤️ 
 Me rreh mushknit apllauz
 Kur t'mpret gruja, si Nana qat her martona 🥰❤️ 
Kysmet po ja nisim me msu DevOps, dikush naj keshille apo eksperienc?
 Nje divlake e vertet
 Hahahaha fol bre Hyrem
Ishalla edhe whatsapp, se na lodhen me story. 
 Ngushllime Agense mos u merzit tkuptoj shume mire, bonu e fort.
Cka osht ni nat so pernat, duroni edhe ju pak pz se na çat karikusin.
 Valla na folmi shum pastert ne krahasim me trevat tjera
 Normal ama mbret osht
Çfare ndjesie e mire kur pe shof qe tek Axha Avni ende figuron adresa qe jeton ne Kumanovë 
E shpallim gjendjen e jashtzakonshme me ket kang
Baneni RT ti gjejm kto persona, qe jane ne foto qe mi ftu me ardh ne Kumanove me bo prap ni foto tek vendi i njejt. 
Na fal zemra e vogel, se na nuk te meritojm.  Minister  presim me morr masa edhe me reagu sa ma shpejt
 u dasht me postu videon
Dajt prej veriu te çarrtem
Aida Baraku - Si Titanik (Hiti i viti 2001)  via 
Ju te Struges a bon vlla mos me postu foto edhe video sa tbjere bor se po ndikoni negativisht
 Keq qe e kena veq ket
Dikur onderr sot realitet, na prij o mbret. 
Se shpejti me zanen e malit 
 Ky i ka pas 3 Ylla nGTA qe 2 dit
Na çat karikusin pz 
 Boll e keni shfrytzu profen per marketing te juj, ne emen te solidarizimit me to.
Lirisht un gollman, prazi, duda, stupci, bubi, rrusta, granada, hanifja, braha, pucki edhe saçi po ju çpordhmi more. 
Duhet me ja çu amanetin nvend se na vret buka e Zotit. 
Das ist nicht normal pasha cullt e lubidragit, shyqyr qe jam single se qysh ka ardh rryma shtrejt, nafti ajo kjo u… 
Apet nafta paska hyp, do tbana i pari i nbot qe e ka kthy kerrin pi ndizell nplin.
 Paske shije or mik
Shkolla e futbollit Kf Kumanova 2010 
 nqet foto veq njoni person din me knu edhe nese mendon qe osht bleona je shum gabim
 Hahaha e shpejt je
 Kush ka pare ma shum Meda ose Labi?
Kenge Moj, Agron Llakaj - Çelo Mezani - Kenget Epike - Vizion Plus  via 
Ket takim ky e ka bo veq per PR, se dje vdiq ni komandant i zones karadakut ne burg qe u mbajt padrejtesisht burg qe 13 vjet.
A tkallzoj Albin çysh ja u ka ngul grupit te Kumanoves ku bojn pjese edhe familjart e mi po edhe Muhamet Krasniqit… 
 Fatkeqsisht na ka mbet prej shkive per at se kshtu sduhet me i thon
 hahahah ska pse, veq mraz nenkupton ftoft, ngrice.
 Na i thojm praz..
Sinqerisht mo Kumanova sbashku me Likove duhet me ja u ndalu bre krejtve as shtaba mos mi lan mi cel se na lodhen l… 
Me kqyr holl e holle krejt na jemi fajtore nga pak, pse e kemi lon me shku kaq keq punt se jemi bo si hiena ni vend… 
Tash le tdale me Ali e Zijadin e le t'folin, edhe pse ky i pari sbesoj qe del edhe qe ja ndin per neve po edhe ki i… 
Paramendo shekulli 21 me ndejt ne burg veq pse smundesh me deshmu se je i pafajshem?! Mandej me vdek ne burg tu qen… 
Ma lodhen tu e postu at foton per dimrin ne kurdistan, a ne mahall tvet sdalin mi ndihmu kojshive.
Çito t'jashtmit a kurs intenziv po majn vlla per mu kajt a çka o puna?Kthehuni n'ju dokt keç.
 Nora qikjo nmidis a?
Veq me dal me pi kafen e mengjesit per s'dyti
 ato dy nuset kur e kan pa rozafen tu ja qu buken te kalaja
 A po bohet mire a jo?
 Ishalla ma e mira e dunave
Vendim ma tmir skam me bo, kur ta blej ni banes n'Struge 
Gjanat duhet mu kqyr nga dy kendveshtrime:- kendveshtrimi numer nji- kendveshtrimi numer dy
Sonte po bojm sefa
 I bi pishman mo qaq
Xeni e paska lon muziken, un sa dojsha me thirr me knu te un ndarsem. Su shkru mu martu po get.
Te asnjana sjam i mire 
  qe koka shkru me u bo kojshi
 shum e rond qikjo
Pz na leni rehat, mos na çani karikusin vk
Moti skam pa sen ma funny🤣🤣🤣 
Ni shqiptar tipik, pse ty e mu jo? 
 Skan mbet kumanovar mo krejt ne dojshland jane
 hahahahha tpres ne Stakollm
 A po mundesh me m'paramendu mu?
Sot tan diten e dill
Aman moni me çesi sene tdillen se po nisna nkam per Stakhollm 
Eh ç'u shkru me ra deshmore 
 Boni qare vetes, se nvakta tandin babxhyshi jot i ka pas fmit e bitist🤣🤣🤣
 Na te keqen vllau
 Ko me tcu te aj hoxha qe fryn per midis hahahahahhahahahahahahh
Historia qe harrohet ajo perseritet 
Tu e kry obligimin qytetar, tu e pi kafen e mengjesit.
Lepuri ne Amerike ka pasaport, te na plakat 80 vjeç skane nenshtetsi as pasaport se jane 'teroriste' te cilesume pr… 
 hahahahahahahahahaha e paske xhet dallimin
 Ide e mire tybe hahaha
Cysh me deshmu qe sjam un ky djali nfoto? 
 Kafet e mira plluuus muhabeti
Ju lutna per vetepermbajtje masive se hala ne janar jem
 Dy gjana qe e permbushin njana tjetren
Sa here e kqyri naj seri te Familjes Moderne krejt mkujtohet jeta ndivel si fmi kur jom kon
 Grupe fundamentaliste ncncnc, Zoti hajrin ja u dhasht.
 Te grupi i Kumanoves jane dy familjare te mi kshtu qe ska te boje me ket, po Artan Hoxha ne opinion tha nje… 
Mi bo mi ra permbi un si treshifror duhet me thirr Saben per me la 
Me morr ni gajbic mu puth me to 
E pita kafen e mengjesit, e kryva obligimin tem qyterar.
Shyqyr qe po bje bore e pi mlon t'zezat e ktij veni
 Rruga ku osht dr nurije qe tcon ka divla ntmajt e ki para udhkryqit
 dyqani te un kishte buk
Erdha te Lagja Trimave ndryshe po frymoj
Ku mos me ja plotsu deshiren ksaj per Shqypni etnike 
+ Do e shpetojm Loren?- Do e shputojm do ja c*m mouutreeen 
Nje grup nga Kumanova po mbron Lulzim Bashen?!
 Se di a e bojn prej injorances apo me qellim?!
Un obligimin qytetar e kryva, e piva kafen e mengjesit.
Neser me saba storyn e keni me mbishkrimin she said yes, ani un tu u bo kreativ sa ma trup koka dasht🤣
 Hahahah ani nkojshi qaty
Axheeenda sot e sterngarkume
Sidomos kto ka ana nanes 
Era shtet, Albin Kurti VV 51% 
 Mfal se nuk e pasna dit sakt, po ndo vende kam ni qe 800 den i pagujn per at.
Veç Ron Artesti per ndrrim te emrit ja kalon maqedonis 
Mos po rrezikojm me dal me pi kafen e mengjesit.
 Per momentin jam nzyre valla🤣
 kthema followin o ti djal mos maj stav
===