So Interesant Gjith me ker me dal nsheher. Dilet. Edhe me 30 ton Najher   
Po du Armiq. Trij Se Ktyne Tvjeterve Kam Nis tju Pelqei Po Mi majn Gajlet me Kan dal e. kan e Paloi  i Kuptoj Tepricat 
Nuk dihet. ikem apo Erdhem  
Edhe statusat.  Sdin qysh me mi kushtu pi ngatroin venet.   Rakun ma kan  lut me ta. fal jeten. Krejt qato mrena Pragut Shka iki
Shokt e tu dridhen kur un i Nali shesin bythen  me. Gjeth tie. Vec sa tjau Fali
Rall e permall ksajde 
Mangup. Tastature mo . A ka ana. Tjeter lut. Rakun. Me jau fal ✌️
Thoin kurxho sjet per Nat. Bot keejt kthehen. Vech momentin ...
Baren e tjetrit. Kan me hang. Ato ...!!
Haroin. Qe shokt  e tyne ma kan lut rakun me jau fal.
Pi shoh do njerz. Fryhen me ryma 
Sonte kysmet. Analist. Per realmadritin po bona 
Kaniher. Ja vlen Mubo Mendjemadh 
Aw mplasi krija krejt shum oka mdhem 
Gam gam gam kur sju pushon goja se Krejt qakom dasht njet imora
Ty ta kthejn shpinen. Shokt e Per Mu qohen nkam
Fjalt e tua vech pluhen qojn Nhava ✌️
Respekt jap per Ata. Qe nzemer um Majn ✌️
  jo bureka. Per. Sabah. Bojm 
Fresh. Pej te bagaa. 
Pas kejt ksaj. Lodhje.   Shka. Flejet. Shti knaqesh
Relativisht sot. Lochk dit ukan
Me zeshkin. Npraktit. Ne shkencat. Politike
Live nga Universiteti shtetror i tetoves
Parajsa dyrt sti qel. Nese ti dikujt ja mshel
Gjitchka ne jet arihet mjafton endra per Nje qellim. Dhe durimi
Pershendetu e rrenat lej
NjeRzt. E sodit. Bote. Me torta. dojn me. Mar. hë
 Prishtina ende Po Feston 
Egziston edhe seni mir nket jet po e kechja. E mbizotron
Ama apet. Spe msheli
Kur. Eki sja din vleren. Ku se. Ki e lyp
Njerzt.  E mir. Perfundoin si njerZ. Tkchi.
Teta. Gjyle. Ikish ble. Dimit e bardha. Ene kmishen e bardh 
Shnosh be. Kthejau met mir. Edhe pse. Met kech. Tgjuhen 
Qysh mu sill mamir sdi
Sha po di be.   Stadin   Tmiren qe eban
Thjesht. Me. Respektu. Gjithka. So kech
Nuk e gjykoj askend thjesht degjoje kshillen time
Amin zot faleminderit nanes. Qe Mriti ndjep
 VETEM TY TE DOJNA NE 
Kejt. Dita tu kesh na shkoi
Kem une lumi. Zeshki  edhee mumini
Nscm. Nramastor.  Nshkup. Qija ropt. Jem. Pkut.
Deri shti me.  Shokt e klases
Vech nshpi. Mu knaq nnjeri valla
 Prej t'hanes t'premten e pres... Ma nfund weekend
Mos ma mer Per dobsi nese. sot Tregoi Dashni thjesht Pot jap Shancen qe Mu sma dha Asnji.   .......   
Munona. Me disponu. Gjalin
3 or kisha flejt.  Uh.  Qfar. Xhumi. Shisht
Soot. Shum heret. Jam qu
Shti nxhami me shku
kesh i percella. Mysafirt. Per gjermani
Sa. Erdha pej airoporti
  shtyje pak me dor
Shum rall pe pordori twiterrin he nan
 sen sen eron je ka krija ti ahhaha
Kem sonte ka korabi me kliken e vjeter
   Ti moi mke than hahaha
   Mapak. Fjal mashum pun
  tlaj si Faktura e Kekut
Mtha ban twet. Qe po baj hahaha
Sot. Dite mir.  vallah
Sot.    Nshkup me shokt. Kesh
Skam hi moti ntwiter
Jo. Asi shok. Ka. 2 palt. Qe jan
Kallabllak te shpia fatit une omeri plot. Shok.  E vertet.
   Po.   Po. Hahah. Munomi mukan haha
  hahaha rasti qem ndodhi hahhaha aksident
Zoti kan e don e sprovon me naj pun tkeqe
   Hahaha ban vaki edhe nsinedigini  urohett
   Vech nditlindje e bajram ka
N1. E gjys mpret. Nzyre. Pergjethsi.
Dit pune. Sott per Mu. Inshallah. Allahu Ma Lehtson Punen me qat. Pergjethsin e Ekonomis
   Ediin per kan ke ky twet. Hahaha 
  ja valla ish tut plas.  Jeteki hahaha
Nbigini neser. Mamair. Qiko ahahahha
   Hahahaha valla. Ishe trash pak
Ish ba. Si louuchk
  hhaha skan faj valla tpash.    Top ishe ba hahahah bombē
Funksionart. E bdis.  Ilshova sot naksion per ne ekonomi. Mthan qe puna kryhet.
Nuk shkoin mesazhet. Puff
  jom tu rejt. Se ti. As pi Luanit. Stutesh.hahahahahhahahahahahahhahahahahahah. Hamamin
   Dhihesh jo tutesh hahahahahahahhahahahahahahahhahahahahhahaha 
Sot. E xhuma. Elhamdurilah
 Sonte tek Pista Kosova Durres Plazh 󾌳󾌳󾌳 
Masnej. Ntrening kem. Banem pak muskulla. Hahaha. 
Jemi la nat ujtin e ftoht
Sot kem nmatk me bulin me shokt e klubit
Qata sum sheh mekon do  vech munesh mempa.  Gjithka
 hahaha. Mobe. Mos u qel hahaha.  
   Hahaha per mu je merzit a hahahaha. 
   Hahahah   Je merzit a
Mshih sy. Tash shihe. Veten. A jam un imazhi qe ti ke endru tan jeten
  hahahaha seki keq edhe ti 
  hahahahahaha. Sun. E man vetin njeri. Mxeht.  Ani. Nato momentat kur. E sheh. Naj qik me miniq lele. 
   Hahaha mamir. Ftoht. Se nxeht.  Se nxeht. Dichysh. Hahaha hup kontrolla
 haha.jo ngjermoni.  Nshkup po
  hahaha.    Edi po. Vlla. Puna. Qashtu pe lyp sun mri te krejt me ardh
   Joh lochk se. Me ni. Shok. Tjeter. Tjeter. Kum ekena plan me shku
Teper. Nxeht edhe sot. Phaaa
Prej nessr. Vazhdon prap lufta
Sonte pushum  pak.  Sdolem.  Kerkun vech ka disi  edhe ka baga
Tivech. Fol se. Sapi don
Te disi me bulin edhe fatin
Per ket. Sezon tardhshem SHOGUN
Pi neser. Nisin ushtrimet intenzive
  i thira paret. Ntel mabanen qe po vim. Ahhaha
  hahaha.  Shihmu mavon. Edhe. Tajap 
   Tkuqe. A. Tbardh tbut a tfort 
  hahaha joube.   Nuk bojm asi pun. Hahaha 
Ani Barem ktu ka levizje. Tulifar. Shkina. 
Babi ka shku npushim shti une duhet me nejt. Nduqan. 
Se na myti lodhsia 
Neser prap. Vazhdon Lufta
Faleminderit. Allah per tmirat. E ksaj Bote
Dit e paharushme sot me Faatin.
Qekto 4. dit. Ftoht. Ktu kejt me blluza. Tuhec
Tripat. E tu. Ikom ich n 2008
Phu familen   Kush kame ishti. Teashat nkofer. Pritessa mbi nivel
  mos thuj se sidihet. 
 hupesh. Atje  se ven imadh asht
Se me 2. Ftyra. Sjetohet 
Spres un pi tjerve 
Jeten e Kom Fantastic. Si ktu. E. Atje. Sndjej kurfar dallimi
. Smirna une me centa. Khm khm
Aki far komenti ?
Krejt femnat kan qef me pas 1 mashkull perfekt,ama un smuj mu kan mashkulli i krejt femnave
Kejt.   Sen. Vin ne vend. Nisen qe metet. Si saher MMV
Epash. Edhe at. Qiken. Ndor. Tpapkit
Kismet po shkoiishmi me shokun
Tpremten. Dj blunti edhe real1. Ishin te. Gaxha.
Tisedin se qa je tu than
Sezon per mu o kejt dimri e vera
Kthehen trimat. Tpremeten prej. Ngurbet
E Puthi Qiellin Falemenderoi zotin se per To ederdhi Lotin
Ithom je yll deti se qielli Ka shum
 Neser Koncert Ne Durres Plazh Pista Kosova 󾌳󾌳󾌳
 Jom GG man sum pelqen me fol shum Une ma shum veproj ntana anet e boj shkrum... 
Official GUCCI tveshi pej Komve. Deri te Kapucci ✌️
2 muj. E gjys pa trening. Teper. Kech
Mka mar malli me pa filma turqisht    Seviurum jok sevirum. Helaq. Bahet hahaha
 Kta qe kan shku ndeti, spo dihet a kan shku me hi mu la, a me nejt 24 or hale n'internet
Haha. Qaj isht be shka e msoishin tjert. Me fol. Pi tutes ingon naj dit. Pale kur tja bajn ama motren aj jaujep meniher
Shkami ba. Fmij hesapi
Nshkoll mbahet. Si bilioner. Ashpin eka. Tuju rzu
Jupaska. Krujt njonit ne instagram.
Tushku nbanof. Me Pi Kaffe
Mathej qekjo kanga. Elvanes. Puthe. Aj. Beati mka hy nkrye.
N5 e gjys kam ra. Ne 8 jam qu deka kejt
Menxi pres. Mu nis. Edhe tja futi nxhum.
Nbus. Tuprit mu niss.
Edhe. Qik shpie. Edhe Nparty npraty. Nuk. Shkon kshu
Promfit shkurt e ship kompir. Ahhaa 
   Shuj. Se. Sotu na ftoh. Frigoferi. Dichka.   Uka prish. Nmator. Sun po jauftohmi hahahah
Kush ka mu qu. N7.
Luten njerzt. Me pas. Emrin frigorifer. Qe ma jau ftoh krejtve hahaha 
Kto 13. Vjeqaret  qe godadin mashum kan newoi per perqafime. Sesa  per. Fjal
Perpara. Ekisha ni shoqe qe.  Jeten per to e jipsha. Po. Asaj ja mur jeten qeni 
Ari o ktu pari a po nini Fantazera per mu o sezon krejt dimri e vera
Kur. Tkthjellet nsabah. Let ven nshpi.
Sonte kame ba drass rusin edhe kame lan ndiskotek
  hahaha. Zaif. Kohen e funit. Se shum po. Shprazmi 
Hahaha muka vesh me kmish me shpicerka jahahahahhahaha. russ mo
Prap. Ndisko. Ka rezervu tavolin russi sonte. Juka. Dok mir. Prom hahaha
Ne bahnnof. Me rusin. As. Sprite. As. Ekspreso se kthjell shka me i ba be naa
Hahaha kejt. Ngjum nejn. Klloshari
Ka. Qef. Npuf. Me shku ama mu sum lajn me hi se 18 vjet. Sikam
Prom me rusiin. Deri 4. Ndisko. Ekem. Rexh kejt
So pun mu fri. Me. Xhum
 Noizy ft Lumi B, Lil Koli, Varrosi, &amp; Mc Kresha - Take a Picture ... 
 nese je me ne qiti edhe ti tre gishtaa
 shum shpejt Mc Kresha nshkup
 25minuta vones. KuptohetJemi ne Shqipri 󾌳󾓶󾓶󾓶 
Nqofse. Do me pa qfar. Djali osht dush mi hap kraht. E jo Komt
Russi. Ka qef meshiju detin perqato po shkoim. Haha 
Tpremten kismet. Pelajm berlinin ndanimark po shkoiim.
4. Ore.  Gjum. vech diqem krejt
Prom. Hallakm. Ndisko ekena ba. Ne 5. Kur kena ardh nshpi
Nballkon tu pi kaffe
- Jam pergjegjes per ate qe them, e jo perate qe kpt ti !- Pablo Escobar
Pak jema merzit. Po   Ska lidhje
Knej. Hala. Ka. Osht. Mas mirti
Kallet. Edhe. Digjet. Pom doket. Njejt osht 
Konkurenca jem 0.fare. Nese se ke kuptu. Ater. Qenke. Rot k###
Per mu svlen hich.
===