 viti 2022 e ti livdohesh qe pin bari edhe alkool 🤮
 Ndoshta me vonese ama e kemi festu Pavarsine e Kosoves qysh osht mas miri, bashk me Lulzim Jashari djalin e te madhit Ad…
 une nsemestrin qe kaloj.
 Per juve qe keni provim  
 po, nese aj shperngulet n Prishtin
tha: duhet tvish nuse n Shkup
 Duheni me i dasht fmit e juv edhe kur jan me faj, jeta ka me i denu edhe kur skan faj.
  Zotri i meqëm,  e din ma majr se un ene taj ket punen e sinjaleve nervor… 
 Kur mthot dikush i ke qit punt nterezi Nderkoh punt edhe jeta jeme 
 Auuu, perxhumsh ta duroj at t luje
 Boll xhi skina ligjerata me ato. Mu imrin ma shkurton aj i dites ejnte, mos permendi emra…
 Aidi o te dajxhet po haj da bojm se ta ka psw e twitterit
 Shhhhhh mos ma chel gojen se kit i maren vesh do sende
 Edhe un prit sot prit neser kur po thir ibuu po sosh tu thir kshuqe mos u anko per tjert!!!
 UT-ja ma majr t ejnten n akshaum…
 Mos kshau se zo t dyshoj 
 Shaum je prek nise
 Jooo vAllah ma majr se n Pekon sm bohet askund ama u desh tvajm se koleget qera ishin ke kjo kafja qeter
 VAllah su desh t ngrajhena pi n Pekon tvajm ktau
 Lumet taj. Mu mtha kamarieri ska asni kafe, na a prajsh aparati
Biseda me  osht njejt si t lexojsh libër 
 Jam kurioze ta dij se qfar arsyetimi do thon perdhunuesit per nje ngacmim nrrug qe i ndodhi sot nje vajze te mbuluar? madj…
  Bashhh. Egoizmi mbi nivel.
 Mos e kish pas at askush se kish thkaj krajen ta chlloje
 ra qeveria e spo bisha un pi provimi phe….
 Qe urdhno ata prishi🤎
 Je e mirseardhur. Vech mos u smetajt kur tna shohesh tu paj cigare me profen, bashkangjitu ene taj❤️
 Sagllom mi kan verejt shikimet
 Vech dja boj ej hajdi kush o per cigare, ajo e para
 E dish ato filmat/serialet aktoret xhi shkojn n fakulltet. Chaj hesap (trailerin vech e pam sot)
Profin me gjith asistenten Zoti i lasht. Oret e ktine konkan si nfilma…
 Pi musojshit e kie
 Ndoshta je ma i shkurt se dikush ama i shkurt nuk je.
 Far txhet taj kshau tt hije nqif njerendi?
 Hahahahaha. Ani be loqko, un de vaj kismet, vech fejau.
 Aaa tamam tamam. A dm thajrish nfejes tonde?
  Jo se edhe un du tluj. Le tlun me tenxhere
 E du shum, shum shum shum❤️
 Nese te tjeret nuk besojn , ti mos u merzit silli mallborot nastall !
  Po aa? Ani taj si tthaush
Frajgem po i mar musojsh kto caullet te Fluenti, shaum caull tshajshetttttt🥰
Frajgem po i mar musojsh kto caullet te Fluenti, shaum caull tshajshetttttt🥰
 Sa majr. Un afatin qeter…
 A hyne n provim sot aa?
   Pa pa ti i kap gjith
 De ta mteki kur te ta sho emrin nlist.
 e pata nijet me msu ja nisi kria, parameno me mar librin pernime me msu cka bahet pha
Spaskim faj ne xhi se kina mar seriozisht se se paska sot. 
 Zoti ti lasht mubarek. Jo un skam
 Faleminderit oj zemer❤️ te dua❤️
Ktu te Bukuroshja e Çarshis 
 Donte tet shofe sot u bo kahar se si kallzova se ke ardh. EyvAllah bebek❤️❤️❤️
 Nona babit planifikon tm therre kurbon
 A ajo tjetra(e din cila), ndoshta s’hyn se ma ka uru Bajramin ja ka nis me u udhzu mduket se niher e paten tranu hoxhovicat
 Ah bebek si dihet. I kom gajle shkallet e Fluentit, me sabah agje jom...
 Pa pa ti, e di ma. Po sjam tu mujt me e ba Z’në e Zorro’s ☹️☹️☹️
 Mjn thaj mi para disa ditesh. Me t fshojtme e din se si uspehen...
Mjan thaj thojt, i pres tm rajten. Nona jeme: xhi je bo ni cauc e majr pa thoj.
 Qe tkallzon pyte edhe per temen
 Nhumbje osh prap se prap
   Ma qan me thoj ma von bon eksperimente me studentet
    fmia jem po ska bre si tiiii
   I kam do ankesa tjera po spo du me e bo ifşa veten
  Vet sdo ndryshim mapa ankohet.
  Mos u bon kurse se dish far ie!!!
 pse pe tweetni qata qe spe jetoni?
   Kie fat tjesh inspirim i tweetave t ksaj
  Ma e heshme se ajo d jesh
  Lidere grupi vech jam bre. Ama se ka mar pi mu
 E di ku e ke marr inspirimin per ket shkrim❤️
  Mo ja ka mar Kadi tlf????
  Shtaj hala ma ngat. Lishoj signallet
  Dm ishin duk si muzik sgllm
  So dns majr me Merkurin
 Adresa e gabuar sjell ndjenja te padeshiruara.
  Hahahahah. Ene pak en  e mer dipllomen e nivelit akademik.
     U desh tm kesh non po hajt hahahahaha
 Njerzt qe shiten ktu ntwitter a njete tperditshme jon llom &lt;&lt;&lt;
 Nauk nauk majr e kom shkr
 Budall sthash sbohem, thash sjommmmSe per ke e bomja si tthaush taj. Fjala jote ligj
 Hala sjom pending shyqyr
 HAHAHAHAHAHAHAH AMINNNN. Mendon se i ha ato rena. Ani budall anii
Teper krijesa palidhje chato xhi paraqiten ndrajshe, a nfakt ndrajshe jon. Plus en bajn llafe teko tiqe. Vech e ma… 
 Presjen Qendresaaa. Do kishe kalu po ja, se ke vendu presjen.
Te aj kolokviumi xhi nuk hina koleget kishin shkruj ka 5-6 faqe🤯 Me pajk ato ene mu zemra dem gjege...
Rin me mu deri n syfyr🫀 
  Boll mir e ka Xhejlanja
   Zonja kryetare ma xhini at xhi va kom kerkau ju lutem. Flm
 krejt e kem 1person qe u shku prej jetes tonë , po  e kem percjell me gjys zemre
 Ne me pak se 24 ore humbem dy artiste te mrekullueshem!Rasimin, i cili na ka rrit me humorin dhe rolet e tij komike.Lurani,…
 Je tu fol per mu en do qera🤝Ndjenjat e njejta❤️
 Me ni vaket n Rahime☹️
  Pi tmsaumes e ka mos ja zin per tmadhe
  Xhi i vajn ki llaf? Xhi o kjo xhoja?
 Paramendo tkish kon en dikush qeter ataj. Vech paramendo
 Shihemi n afatin tjeter🤚
 Ene un. Lip me e çu pak ka aj profi
  Na e tregon koha
  Taj mduket para mu
  Niher skm vaket. Mbas nja 2 muj e xhims fillojm me pergatitjet
En parandjenjat e forta i ka. Tshohem a di dalen tsakta te un. Shpresojm dmth 
  Un sn i zo bes ksaj nise
 HAHAHAHAHAHAH. Ma kish ça edhe trurin me thonj
 N tnjejtin kat kimi kon ama dm kish thon aj so problemi jem osh problemi i ortopedit
Ma frajk de kisha sos pun ta thajrsha me kamer tma shofe rentgenin shoki xhi e ka sos mjeksin se sa n spital t Tetoves
 Faleminderit shum. Edhe ty Zoti sabrin
 Fakt!!! Rast konkret mkie
  O ty traft preshi kreeeees
  Sbe nmend kjo me paj ni bokall kafe
===