  Djalosh, Ska nevoj mem pyet dikush qe te flas, shiko punen tende
  Po komentoj Suno, Allahu nashta don dhe e shikojne hakun me syt e zemres, Allahu nashta ua zbut zemrat, nuki dihet 
  Nuk ehtë pytja konkret te puthja dores, po eka per qellim respektin ndaj te ma diturit, se nje… 
 SubhanAllah qvar mëshire ♥️ 
 Kurte plakesh e mer vesh ku shkojne
 Cilsi e mire, marrja eshte prej Besimit (İmanit)
 Sdi a egziston gazetar qe e verifikon lajmin ? Nivel botror po flas?
 Me siguri ekishte zaptu donje vend
 Ky tipi nuki don edhe jobesimtaret qe jan human e le mo besimtaret..
  Nese ske pas shanca ti me zgjedh cvar ngjyre po don, as ky ska pas shanca. Thjesht Allahu k… 
  Ty nuke jap pergjigje ngase nuke meriton vetem nje blloc
 Per me egzistu egziston, por a eshte kjo ne regull? Normal qe seshte ne rregull.
Vetem per gjinine femerore 
 Kishte qen me vend me pas thone: une friksohem prej Teje (Allahu) dhe prej vetes, sepse Allahu i u… 
 Veq i desht me ndru germen N me germen P 
Heshtja perball te keqitMe flet i keqi ashtu siç flet,urrej t'i jap pergjigje.E shton kenaqesin e tij çdo dit,u… 
S'i bindesh All-llahut dhe pretendon dashurin e Tij,Kjo eshte e pamundur, me logjik e refuzuar.Nese dashuria jote… 
 Bank te shkolles a 
 Me fal nuke disha 
 Ndoshta i pelqejn postimet qe i bani ju? 
 Andrrat e mira jan prej Allahut, e andrrat e kqija jan prej djallit, sherimi nga andrrat e kqija esh… 
 Ka mundesi, sepse nese ti e len nje pun per Allah, Allahu zavendeson me nje mate mire.
  Mes teje dhe Zotit, dhe mes teje dhe raportit me njerezit, dhe mes teje dhe raportit me familjen ️
  Fal nese deshiron Allahu meta fal ty 
 Kujdes nga keto takvima te turqise qe jan shpernda viteve te fundit tek ne, aty qart shihet se e lejojne kerkimin e ndihmes…
 Thuaj nese don Allahu, se Ai Allahu i mjafton rrobit te vet, i plote fuqishmi. Allahu te bashkoft me familjen️
  Naten e mir , dhe mi mesu femit jo mi pushkatu.
  Domethene kur keni pas marre ska pas vajza 14 vjeq shtazane?
E adriatik kelmendi badihava skan thene pleqt, pazari shpis nuk del nqarshi 
Merr dituri te dobishme nga dijetaret tone, mos prit viti 2019 mete ndryshu, se nese ti se nsryshon veten tende All… 
  Dora jepet e vertet, por meta ngjit doren esht kuptim tjeter. Kuptim mai veqant, sikur met… 
 Mashallah Allahu ju dhash bereqet.
 Nese ben duron nuk rrxohesh
  Qellimi jon esht ta flasim te verteten, dhe nuk na intereson kush e feston e kush jo, çdo… 
  Nese fusim qka duam ne ket fe, nuk mbetet asgje nga islami, por thjesht nese don festoje… 
 Ban bismillah kqyre qysh qohesh 
 Beshar esht ne gjuhen arabe qe dote thote NJERİ. Ne trojet tona perdorit si njeri jo i bukur.
 Ate perfshin edhe ty a veq tjeret?
 Munden me qen dyert e qiellit te hapura dhe te pranohet lutja. Plus nuk lejohet me bo lutje per denim.
 İ paske diktu vllaqko, bash qashtu valla 
  Allahu t'shperbleft vllai dashur.
 Nje lloj normalizimi mekatit ?
 Kta emra ne gjuhen arabe jan shum te bukura, shembull Shaban esht muaj i shejt gjithashtu edhe muharrem e… 
 1 pasi qe me 2 shin skam lidheshmeri 
 Bone te miren dhe gjuje ne deti. Nese sta din krijesa ta din krijuesi !
===