 sdi pse i paramenova qeshtu mickojat nturki 
 pasha zoti qet 5:30 e lo veq mja nxirr gjumin vetit e mi kallxu qe ki me flejt hala hahahaha 
   leje se ke tum myt tu shku nmatur
  hec more shko rxoju pi nkajak mos fol shum
 po normal be se kthen njeri shokin pin nmatk npazar
 shum bukur paske dal klm
ku hupi nime kjo 
 hahahahahahahahahah ska nevoj me zgat be
  kshyre ku paska shku ..
 Nese besniki ish kan mac
 mpelqyn qeto foto qe i bona qetash 
   shpresojm tjet naj anderr 🤯
 i ki do urime edhe ti
 aj na kallxo pak qysh o nfk?
  cashtu asht. shoce brvo llajk
 spo quditesh mo a hahahahahahahaah
 kesh tu menu kush ke
 omg qysh e gjete
 hahahaahahahahah ah mirki ah
  Jooooo pse e pash
 hahahaahahahahahahaha jobe se lojen e kshyrsha
Kojshia jem maqedon full za e ngojka feron 
 Per 5 minuta aty jam
 Boll o per sonte me ra me flejt se neser duhet me pushu tan diten
 Vi me naj ker tmir po tham
Qysh e menojsha jashten kur shkojsha nshkoll heret 
 Sa e mir je moj
 E pritsha qet koment 
 Epo tash del najno
 Problemi koka te motrat jo te mosha dmth ahahahahahah
Ah sikur tkish pas ne Shkup
Du me jetu n'qytet ku ka det ✨✨✨
 Ooh qysh smu paska kujtu
 Shka ka neser be
  boll e mir koka
 Kshyri mir se del najno 🤪
 Mas teje zmr :* :p &lt;333
 sa kompliment i bukur 🥺
 Pode na prit shka kame than Addasi
 Kunata jem ma. e mirs🥰
 nZoo koka kan tu shku
 Reja jone Lana ne kanagjegjin e Egzonesmashallah 
  HAHAHAHAHA un kshtu tdu ama jo nqesi menyre 🤭
 apeshe me mar lakmi
Qysh me ja shti nqef perdorimin e ndegjuseve babit tem se mi lujti ment
 Idk man kaniher bota s'osht e asaj
 Rubrika : mesazhet gabim per bajram 
 me nxer telefonin mu bo kishe po shkrun edhe pse ski internet
 Tish kan e zaif
 veni ku mi ki bo do foto shumm tmira  
 Jo be kto ikan bo nmartes tsecilit djal
 Edhe ti mgerdite me qat kombinim hahahahah 
Pasna mu knaq tu e kshyr içerden tash hohooo
 Hhhaahhahaahha edhe me nafak hehe
 Mir qe skena nevoj se kur pe shoh nervat me ti prish
 Mdoket ka ni limon pe ha kshtu gjdo nat ufff🤤🤤
  Pi kur ti kshtu cit
 patika per femna t'shkolles t'artit qe ma shum i dojn qent endacak se nanen e vet
Era llak edhe ufo🤤🤤🤤 
 Parameno un saher gerditna qeshtu
 Qysh e gjete beee pha
===