Dardha ka bisht, thote populli!  via .al
 Fatoni genjen!Ballistet ia kane nxi jeten (financiarisht) KF Shkendija nder vite. Ata thjeshte imitojne grupet serbe te tifozeve
 Nuk e kuptoj kete urrejtje patologjike qe  ka per Shqiperine, ndersa po i shave Zvicren e Dick Martin cmendet!?
 flet per hallet e futbollit e keta te  merren me kartolina dhe librin e  . Mos harroni librat e Fevziut.
Edicioni i lajmeve ne  si TVSh-ja ne kohen e Berishes. Fillon me cka ka thene Basha sot!? E ai cdo dite te njejten gje thote!
Dhurate me te bukur per 28 Nentorin na solli  ne -channel! Nishanin per te na dhene keshilla se si ndertohet shteti. Hahahaha
Nuk ka nevoje per koment!  
 Beni mire me u mesu me humbjen. Do e keni shoqeruese te fatit per shume kohe! Ngushllim: "Humbja eshte pjese e lojes"
 Mos harroni te ia kujtoni Thacit qe ta kthej kete date ne feste shteterore! Qesharake. Feniksi, hiri...
 Shqiptaret kane nje fitore. Barazime ka pasur shume mbreme!!! Forca ALB
 Per kete dite saksifikuan Ahtisari, Thaci&amp;company. Ata qe aludon ti kishin te tjera ideale.  
 Deshet apo jo, me keto mendime ju vetem zbatoni projektet a Akademise Serbe. Sa per futbollistet merrni se na lodhet!
Nese ju intereson se si duket nje ndeshje e kurdisur ne futboll, shifni  . Me qesharak jane gjermanet. Forca 
 Dhe sa per informacion, edhe ky edhe Shkodran Mustafi jane me origjine nga Gostivari!!!
 Nuk ka vend per zhgenjim. Luajtem si te barabarte edhe pse me 10 lojtare. Tani te shohim perpara.   Shqiperi
Cka ndodhi me . Sjellje e turpshme ne konferencen per shtyp. E ka kapur panika si duket. Mungese eksperience! 
 Kendej e quajne "Jusuf Qamilica"! E glorifikon vetem se e ke mike, por mbetet pjese e nje sistemi te deshtuar e te korruptuar.
 E kuptoj nevojen per te bere nje urim rasti. Por ai mbetet sinonim i nje politikani anadollak. I korruptuar dhe i kapur.
Disa sahanlepires nuk thone asgje per ata qe dhunojne Kosoven per dekada me radhe. Por merziten shume per dhunen e sotme.  
Te huajt kunder dhunes! Po te kishin hajdute te tille ne qeveri do ti digjnin te gjalle e jo vetem ndertesen.   
Nje gjetje e bukur nga Joni. Ne jemi ne France 2016.   na beri krenar. 
 Vendasit ne sekondat e fundit ofenduan futbollin skocez, aq sa publikut iu desh te kerkoj falje duke duartrokitur Shkendine!
Cmenduri ! Konsumojne energjine elektrike pa karar dhe kur duhet te paguajne - bejne vetvrasje! Dhe fajsojne !
Nje pergjigje e duhur per Ben Blushin! 
Hahahahah! Ky Skender Hyseni paska rrjedhur krejt! Po fluturon n'hava me kete ligjerate qesharake ne !
Populli thote: "Le se fukara, por edhe i keq ka f'tyra"! Skender Hyseni ne 
Kryeministrat e Kosoves paskan zene mediat ne Kosove! Po thone se kosovaret nuk jane te vetedijshem se sa mire jetojne!  
Isa Mustafa si Sali Berisha! Sa here qe dikush proteston i duket se do me ia marre pushtetin! Mjerre Kosova!  
Pervec se argati i Serbise eshte ne krye te qeverise, edhe policia e tij ka mentalitetin e policise serbe.  
Shoqatat e luftes ne Kosove bojkotojne protesten! Kuptohet pasi ata jane"'arsimdashes" dhe anti dhunes! Vetem mjerr rektori i UP po e kapen!
 Huliganet duhet denuar, por kjo policia e KS me ngjan me ate te Sali Berishes! Vetem sa nuk jane ftuar edhe police nga Serbia!
 perdor fotot e auto-servisit si vetura te Ermal Hoxhes e mediat ne Maqedoni i besojne pa verifikuar faktet! Gazetari analfabete
Kryeministri  mbron ate qe duhej ta shkarkonte! Reagim tragjiko-komik! Sa keq per Kosoven! Nje zot e di cka e pret neser!
Bujar Nishani ka hequr mustaqet! Tani e kam te qarte pse humben Reali, Barcelona dhe Milani! 
 Eshte shume me mire se cdo koncert apo prezantim i llojit te Medes e Sabrise me familje. Skena dhe orkestra jane ne perfeksion!
Ali Janukovic!?! Nje gjetje shume e bukur! Lexojeni ne 
Ky komunisti i perbetuar i Millosheviqit, , pa fije turpi sulmon Rexhep Qosen! Ky eshte kulmi! Duhet shkulur sa me shpejt!
Kur degjon kete Llute injorantin, habitesh se si nuk e paskemi ditur me heret se sa i mire na paska qene ky  .
 Me premtime te tilla tallin miletin qe e shohin si dele! Dhe kur mileti i voton perseri verteton se e meriton te quhet dele!
 Ne  duhet te thuhet: Ky eshte Chelsea im (lexohet: Cellzi-mashkullor), dhe jo "Kjo eshte Chelsea ime"!
Nese konfirmohen rastet e dopingut, mendoj se peshengritja duhet te ndalohet me ligj ne Shqiperi! Na turperuan para gjithe botes! 
 Te lumte per guximin ne kuvend, por i kote duket glorifikimi i nje deshtaku si Mustafa. Deshtoi me Prishtinen do te deshtoj perseri.
 Kjo Vjosa duket me shume e penduar se sa nje politikane parimore, sic deshiron ta shet veten!  eshte nje parti qe vdes!
 qenka ne ndeshjen -PSG! Po ia coj 1 pershendetje per nje nga anetaret e familjes-ashtu alla shqiptarce!  -ser 
 Mos harro te marresh mesime nga Fatmir Besimi. Ai e coi Maqedonine ne BE!?! Kosova ne BE me kete qeveri? Enderr e bukur!
 largohet nga gara ne  ne menyre te turpshme. Dikur u akuzua per shitje te ndeshjes se kombetares. Apo e kam gabim?
Nuk e kuptoj pse  u ngut te uroj Ise Mustafen!? Me duket se Kosova ende nuk ka nje kryeminister te ri! Te pakten deri neser!
 Sa keq per kosovaret! Kane ne gjirin e tyre nje lider si Albini, por perseri votojne Hashimin per te vazhduar mjerrimin.
Haj per hajer ! Qeverine e mbeturinave komuniste te recikluara e bete. Tani vrap per te gjetur nje bilete per Subotice!?  
Mire thua z. , por si behet qe gjerat assesi te ndryshojne? Kosovareve rruga per Subotice u duket me e lehte se sa protesta!
"Kategori e dale nga lufta"!? Cka eshte kjo? Specie e re!  
 Per sa kohe shoqeria kosovare ben sehir, kerkesat e tyre do te shtohen. Sot kerkojne regjistrim, neser nota, diploma e pune!?
Nese FSHF deshiron ti fitoj piket duhet te harxhoj pak para sepse keta te -s jane lehte te korruptueshem.  
Thone Kosova e Shqiperia jane me te korruptuara, por harrojne organizatat si , ,  &amp; se simbol i korrupsionit eshte .
Sipas disa demokrateve si kjo gruaja qe flet ne  po te mos ishte Enveri shqiptaret do te kishin iPhone qe ne vitet '70!
Ne  nje grua flet pa lidhje per jeten ne Shqiperine e Hoxhes. Sa per strofen e trete te himnit le ta lexoj Ismail Kadarene.
Presidenti jep interviste dy oreshe dhe nuk citohet gje nga askush! Kjo i ndodhi Nishanit ne . Shembull i nje Interviste te paguar.
 i  zgerdhihet se do behet pjese e qeverise, ndersa populli po i iken per Evrope e Siri! Sa poshte kane rene kosovaret!?
 I thoni Belines se Enveri dhe socializmi kane vdekur dhe nuk ka nevoje te frikesohemi t'ia permendim ose shfrytrzojme emrin.
Atifetja lexoka libra sa here ka kohe te lire!? Kjo do te thote se eshte policja e vetme qe lexon!  
 Kjo zonje perbuz intelegjencen e nje populli te tere. I thoni te kete pak respekt per Kosoven. Do zoti e then qafen sa me pare!
Ka nje Alket ne SuperSport i cili kalon ne delirium kur permend emrin e Novak Gjokoviqit! Nga emocionet, vend e pa vend e quan edhe Nole!
Edhe Safet Neziri paska shkruar liber historie per filloriste! Epo ky eshte kulmi! Femija im duhet te mesoj nga libri i tij. Hapu toke!!!!
 Te denohen lojtaret per performance te dobet eshte OK, por t'i detyrosh te perkulen para nje grupi tifozesh eshte jo humane!
 e beri m.tin dhe tani na e servir pa turp arsyetimin! Jo faleminderit! Besoj i ka pelqyer -t. I befte mire!
 Nuk genjen asnjeri! Ata thjesht nuk dine cka ndodh aty. Detyra e vetme qe kane eshte te mos krijojne tollovi neper korridore!
Per nje fishekzjarr ne Dortmund nderpritet loja. Ne Beograd jo!  me dy standarde! Si do ta komentoj kete  mafiozi numer 1!
 duhet ta dergojne ne gjyq diku ne Evrope gjyqtarin Atkinson. Le te provoj se ne c'baze ka kerkuar vazhdimin e lojes. -alb
 I gjori per pak servilizem sigurisht qe ka humbur besimin e dhene nga CNN! Tani mund te shkoj e te kerkoj pune ne RTS!
 Nuk e kuptoj se si pranove te futesh ne ate studio me 4 - 5 llafazane te paguar dhe te merzitshem.
 Pajtohem, por them qe duhet pergatitur mire kjo perballje ne , se Platini ka filluar te tashme te flas per "mina me sahat".
Serbet na sulm frontal per te ta hedhur fajin mbi ne. Ne krah po u del edhe . Duhet marre seriozisht kjo nga ana e .
 Nese UEFA nuk na i jep 3 pike, ceshtja duhet derguar ne gjyq diku ne Evrope ose SHBA. Mafiozi Platini mund te shpik gjithcka!
A po pergatitet nje denim per Shqiperine pas komentit nga krye mafiozi Sep Blatter? Denohen deklarimet politike, e jo dhuna! -albania
Qershia mbi torte do jete kur nga Beogradi te dalim pa u mundur!   
Ka nje gjyqtar idiot nga Skocia qe ka nda mendjen qe ta nxjerr Realin fitues ne Sofje!  
 Te dergosh nje njeri si Ristani ne takimin me BE do te thote te perbuzesh vendin tend! Ska faj  qe reagon ashtu!
 Duken mire, por endenuk jane ndeshur me rivale serioz per te pare se c'mund te bejne! Gjithsesi, Suarez mbetet nje vlere e shtuar
 Keshtu thonin edhe te Liverpool, por tani po bien nga liga! Edhe te Reali bejne matematika te tilla per Benzema!
 Emri ne bluze i shkruar me germa shqip Me mire vone se kurre! Uroj t'i sjell fat ky permiresim! Suksese Blerim!
E kuptoj gezimin e dikuj pas fitores se  ndaj Omanit, por ta barazosh kete me fitoren e shqiptateve ne Portugali me duket e tepert!
 Fitoreeeee. Kjo eshte zemra shqiptare! Shkojme me tej. Hap pas hapi!
Duket se  me asteriks paska mundur Omanin. Hajt duroj disa gazetare dhe PDK-ne tani? Edhe Atifetja do jete gezuar pas kanagjeqes.
Duket se  me asteriks paska mundur Omanin. Hajt duroj disa gazetare dhe PDK-ne tani? Edhe Atifetja do jete gezuar pas kanagjeqes.
Arrestohet . Te pakten do bej 1 nate ne burg. Duhet t'i harxhoj parate e vjedhura tani se gjykatesit kane filluar te ferkojne duart!
 beri mire qe shkoi te Gallatasaraji, por tani eshte koha ta shkruaj emrin ne gjuhen shqipe ne bluze e jo ne serbisht.
E shajne Foto Strakoshen se kaloi ne Olympiakos! Mos harroni se ka qene kapiten dhe lider i kombetares. Suksese Foto! 
Qeveria dhe Edi Rama nuk po kerkojne largimin e Fullanit! Interesante! A thua bythen e kujt po e mbrojne?  
 Ky Petriti qenka nje cun i lezetshem. Logjiken e paska humb fare. Me nje fjale ai thote: pas neve le te behet qameti!
 Ky Petriti qenka nje cun i lezetshem. Logjiken e paska humb fare. Me nje fjale ai thote: pas neve le te behet qameti!
Ne kete Boteror me shume pame statujen e Krishtit se sa futboll. Dhe fituan ata qe nuk bejne kryq kur futen ne loje, pervec Kloses! 
Shume e lumtur "dashnorja" e Putinit!!  
 Edhe ate Nojerin ta kishte pare ai Rizzoli! E bere Gjermanine kampion.
 Shqiptaret mund te jene 35 % ne shtet, por kurre nuk kane qene me te perbuzur. Ne administrate jane vetem per te blere burek!
Ky Levi duhet te largohet se kjo Gjermani eshte bere banale si puna e Italise. Probleme me Ganen, SHBA e me ALG. I pret Franca!  
Eshte koha qe Kosova te refuzoj nje here eksperimentet e Evropes. Sigurisht do jene fitues. Serbet e injorojne ne vazhdimesi dhe fitojne!
Kjo Italia nuk e meriton te kaloj grupin. Nje ekip qe ta shpif futbollin.  
Gjithandej ne bote reklamat e birres behen me meshkuj, vetem ne Shqiperi me femra!!! 
 Nje hap domethenes. Vetem keshtu per ta bere ALB nje shtet modern. Si thua edhe vet, tani radhen e kane "lazaratet" e tjere.
Nuk e di pse, po Spanja dhe Franca me duken kombetaret me antipatike ne Boteror! Te dyja golat e vetem i kane shenuar nga penalltia.
Humbja e Berishes i deshperoi kosovaret aq sa thonin se greket e moren Shqiperine. Sot atyre ne Shqiperi u dhimbset Thaci!  
 Urime! Evropa beri te veten! Une besoj se Shqiperia tani nuk do te humb asnje minute per tu be pjese e Evropes sa me pare!
Unifikimi arsimor. Edhe kur bejne nje gje te mire, shqiptaret e bejne per interesa personale!!!  
 Dite e shenuar ku nis zyrtarisht levizja drejt bashkimit arsimor mes Shqiperise e Kosoves! Tani live tv nga Salla e Hartave …
Paska perfunduar BigBrother ne . Ky eshte lajmi me i mire kete mengjes! Hapesira mediatike nga sot do te jete me pak e ndotur!
 ne Ligen e Evropes! Kjo eshte fantastike kur dihet se ku ishim pra tre muajve. Tani presim fitoren e pare ne skenen evropiane!
Per  Shkendija e Tetoves luan ne "Gradski Stadion"! A keni redaktor? Sa per informacion Shkendija luan ne Stadiumin e qytetit!
Barcelona po behet me keq se Reali i para disa viteve. Ndryshon trajnere pas cdo deshtimi. Jemi ne pritje te emrit te "viktimes" se re!
Cdo dite e me teper bindem se shqiptaret e MK jane populli me i mjerre i Evropes. Debati i sontem ne Alsat-M e verteton kete! Hapu toke!
Intelektualet leter BE-se dhe NATO-s! Paska "intelektuale shqiptare" ne Maqedoni? Ne bote kjo kategori s'ekziston. Qesh e qaj me kete milet!
Januzaj zgjodhi Belgjiken. Theft qafen! Por me te gezuar dolen FFK dhe disa gazetare kosovare!!!!
 Njolle nuk do kishte kur Kosova vet do te denonte kriminelet e luftes.Pra fajtorin fillimisht duhet ta kerkojme brenda.
 Krimi duhet denuar, por te jesh i sigurt se Gjykata Speciale e njellos Kosoven. Njolle qe veshtire se do hiqen ndonjehere!
E degjuat kete: Arsyeja pse Gjermania nuk denoi veprimet e Rusise qenka fakti se ruset jane "clirimtaret" e Gjermanise!
Gostivari sot ne mengjes! 
Pyeteni Ben Blushin nese di te shkruaj dicka tjeter pervec rreth fese? Ndoshta me nje teme tjeter arrin te behet shkrimtar e jo provokator!
Dikush tha: "Injorantet jane te sigurt kur thone dicka, perderisa te mencurit gjithnje kane dyshime"! Sot e vertetova! Thenie shume e sakte!
Hungarezet duket se kane gjetur varrin e Atilas! Nje ogur i mire per ata qe kerkojne varrin e Aleksandrit te Madh diku nga Sveti Nikolla!!!!
 Nuk di nese e ke me ironi apo jo! Duket paske marre shume kritika, por mllefin e zbraz tek ky debat me mua! Shendet dhe sukese!
 Shume poshte e rrezove debatin! Gjithsesi, mire je ti derisa kungulli shkon mbi uje! Sa per vizatimoret -jane me me vlere se...!
KB Prishtina ne "Final Four"! Bukur! Por asnje faqe sportive shqiptare nuk ka emrat e tre klubeve tjera te kesaj finaleje! Gazetari amatore.
Fundrrinat kur vdesin duhet lene mbi toke dhe jo ti varrosin me nderrime! 
 Ta gzoni, por mos sulmoni ata qe luajne per kombetaren kuqezi. Te pakten mos u beni anti-shqiptar! E mira eshte se jeni pakice!
Disa gazetare kosovare kur pane se ekipi Kosoves mbeti me disa lojtare te deshtuar neper ligat inferiore iu turen Canes me shoke! Turp!!!
KS ne diten e pavaresise. Shtet pa identitet, me korrupsion, papunesi e varferi te frikeshme. Pa ideale e histori dhe me flamur qesharak!
Levizja Socialiste per Integrim, Bashkimi Demokratik per Integrim dhe Levizja Demokratike per Integrim! Per cfare integrimi e kane fjalen?!
Rama nxit polikanet te perkrahin Thacin ne garen per Cmimin Nobel! Kesaj i thone patriotizem...pa fre! Se Kosova shkon per lesh-ska rendesi!
PD paska reformuar doganat! Duhet guxim budallai per ta thene nje gje te tille pas pamjeve nga Durresi! 
Berisha kunder "Jugosllavise se re"!! Duket i paska prishur marredheniet me Damir Fazlliqin! Vazhdon me ndotjen ditore te hapesires online.
Kosova duhet bashkaur me Shqiperine se po kthehet ne nje Siri mes Evropes. I degjoni keta te FRM? Deri ku mund te shkoj larja e trurit!
 "Shkelje ligjore"!!! Nuk e paskam ditur se ka edhe shkelje te lejuara me ligj! Apo perdorni Google Translate per perkthim?
Ylli Sallahi dhe babai i tij qenkan austriake. Ta shohim cka  do thone pas disa viteve. Kam degjuar per disa "austriake" te penduar tashme!
 Tani pres qe edhe Enver Robelli ta mbeshtes Astritin, se fillimisht sulmuan vetem Shpendin dhe harruan cka ndodh ne veri te KS!
 Fanella (bluza) ngrin nuk ngrihet per nje minute!
Hej! Desh me zuri gjumi pa e derguar mesazhin e rastit. Gezuar 2014! Shihemi neser! Ketu ku jam une te gjithe jane ne gjume!!!
  Nuk ju kam degjuar te kerkoni qe flamuri i Ahtisarit te valoj ne veri! Nuk eshte i KS se me tjeter flamur u luftua.
Sukesese . Vetem mos bej sic bene ata para teje dhe suksesi eshte i garantuar. Ne na duhet nje shembull ndryshe ne qeverisjeje!
Nje deputete shqiptare paske thene se E. Hoxha ia shiti Kosoven Jugosllavise! Me sa di une, per te shitur dicka duhet fillimisht ta kesh.
101 vite Shqiperi e pavarur. Krenar per kete, por i deshperuar kur e sheh perhere te fundit per gjera te mira dhe te paren per budallalleqe.
A ka ndonje mundesi me ia nderpre lidhjen e internetit Sali Berishes. Te pakten per disa dite. Arsyeja: Ndotje e hapesires online!
Rama dhe Gruevski ishin me grate, ndersa Thaci vetem!!! Vaj halli per te kur te kthehet ne shtepi! Do duhet te gjej nje arsye te forte se...
Edi, fali se nuk te kuptuan! 
Shumica e kosovareve me shume e vajtojne humbjen e Berishes se sa humbjen e 1/3 se Kosoves. Prandaj, Berisha mund te kerkoj azil ne Kosove!
! Sonte do luhet vetem per fitore!
Theu qafen! Shqiperia shpetoi! Tani do te vazhdoj te jetoj ne Facebook dhe ne zemrat e shumices se shqiptareve ne KS dhe MK. Besoj jo gjate!
Sali Berisha garanton se do vazhdoj te punoj per shqiptaret! Uroj qe edhe kete here te mos e mbaj fjalen - sic ka bere ne keto 20 vite!
Edi Rama e quan keshilltar per rajonin, por me shume duket si keshilltar per mashtrimin e opinionit kur vidhen zgjedhjet!
Ata qe sot kerkojne te lejohet shamia neper shkolla, po ta kishin pushtetin as me shami nuk do t'i lejonin te shkojne ne shkolle!
Desha ta pyes Atifeten ku jeton! Duket se nuk sheh se ne cfare mjerrimi jeton shumica e kosovareve. I beson Hashimi, sigurisht.
 Na i shkunden "motrat" keta. Nuk e dija se shqiptaret kaq per qejf i kishin pasur keta me ngjyre. Edhe foto e video na postojne!
 Nje video po sillet neper Internet 
 I bashkohem thirrjes per mbrojtje te Alma Lames. Jo vetem Vetvendosje, por edhe institucionet e Kosoves duhet te veprojne!
 Ka plotesisht te drejte - per fatin tone te keq! Ndryshimi do te jete shume i veshtire, por le te shpresojme.
Edi Rama vend e pa vend e permend LSI-ne. Thua ta kete nga frika apo dashuria madhe? Besoj e para se edhe ne edhe ai e din kush eshte Meta!
 Po kjo cfare tu desht! Ai foli per doreheqje se e kishin genjyer se do fitonte! Prandaj kishim 3 dite heshtje varri dhe lot...!
Sipas disa njerezve ketu ne Maqedoni, Berisha kishte bere shume per ne. Arritja me e madhe levizja me karte identiteti mes dy shteteve. UOU!
Edhe 30 vite me pas, shqiptaret vazhdojne te qajne per liderin politik! Por kete here qau edhe lideri vet! Ketyre u shkon kenga e Genes.:-)
Mire bere qe ike nga partia, por shpresoj te mos ikesh keshtu lehte nga pergjegjesia per gjithcka ke bere.
E bukur kjo! Duhej nje sllogan. Dhe kur vjen ne kete menyre, atehere nuk ka nevoje per koment. 
 Iu pergjigj ndonjeri pyetjes-titull te emisionit, apo vetem "lane nje groshe pa uje", sic thone tetovaret?!
 UNEBESOJ! Kjo eshte kombetarja e vertete e shqiptareve. Si asnjehere me pare!
Nuk e kuptoj: shqiptaret (ballkanasit) pa breke perkrahin protestat e turqeve qe kane ekonomine me zhvillim me te larte ne Evrope!
 Lexojeni kete shkrim! Kush e gjen ku ka qene Edi Rama gjate luftes se Kosoves!?!? Por per Damir Fazlicin cfare mendimi kane?
Me thoni kush eshte ky Pitella. Me ngjan si ai austriaku qe vinte te mbronte Berishen sa here e kishte punen pisk! Rama kopjon Berishen.
 Integrimin do ta provoj tani me Ramen,  pasi ka siguruar nje bllok te ri per ta kthyer e shitur Shqiperine e mbetur per skrap.
Edi Rama ata qe mendojne ndryshe i quan opozitare te deshperuar. Por a ka njeri me te deshperuar se ai qe kerkon fitore nga blloku i Metes?
Rama e Berisha propagandojne fitore ne zgjedhje. Por pak rendesi ka fituesi pasi qe te dy kane ngjalen e korrupsionit (Meten) ne bark.
Meta kerkon 3 deputete, 3 ministri dhe kreun e Kuvendit! Po blloku? Apo tani do te perdor smartphone!?
Sa pa lezet keto komentet e Edi Rames per Berishen. Do te ishte mire te na tregoj nese ia ka blere nje bllok te ri Ilir Metes.
Edi Rama projektin e tij e quajti "Rilindja shqiptare",  por tani duhet ta quaj "Rilindja e Metes" dhe t'ia siguroj atij nje bllok te ri!
 Duhet te reagojme te gjihe qe te parandalojme kete perdhosje te ardhmerise se Shqiperise. Rama nese do Meten le te kaloj ne LSI
 Po del se e keqja e Shqiperise nuk paska qene Sali Berisha, por Edi Rama! "Krushqi me Jovan Bregun! Obobobo"! Peshty e lepij!
 Europianet edhe mund te jene paguar per te thene nje gje te tille, qe keta ta kene si arsyetim per pislleqet qe i planifikojne.
===