Ku i gjeni kto poezi nket stres
 Sa keq me pas emrin fatbardha dhe te kesh fat te zi
 A qaq je pa fat
Ama a ka met najkush pa
A ka met najkush pa
Mfal a je ti pi atynve cka vnon shminka npllazh
Mfal ama masi qaq ki qef me nxjer video tu bo lip sync a mundesh bile me msu kangen plsplspls
Hej hajde folna deri nsyfyr tana per bajram bomi bllok
 Ku spo ma ngjet qeky verona kurusi me shku nspital pak me ndrru ambijent se spo rrihet.
E paramendo mu nal interneti
 Flm per publikimin. Apet.
 Corona erdh por ti kur do vish
Bitch ti je hajgareee
 Nvaret sa rri ndill
Per msitni i qesin fotot me motra e vllazni 
   Un thrras peeeeej edhe gjakovvvv oooouuuuu
  Parzit kem tu dek ama ti shum larg oj sibel
Ah moj anna ropt he
  Stbesoj mo oj sibel
  A bon mem njoftu edhe mu me cat jet se kjo e jemja sbon hic
Ku mete ti aloooooooo ku mete ti lajmroooooooooooooooo
  Xhi de pajsh bardhavele,miss trauma
Dhe ne nuk te pranojme sepse tani per neve je nje e huaj 
 Po masi sen tbona kurgjo🥺
 Bardha ma e mira ma e kompletumja
 Ama cac shum followers ce ki ktu i ke mahnit kejt
 As ty jo qysh duhey hodor hodor
 Gimi vogel pse u laaaaaag
 Ani be ajde ti un ka me ta kallxu
A e di ti cka domethon me tu flejt
 Pom doket se tnita te thon qet sen
Ha me gojen mshel u idiot 
Hej a edini qe kur i boni buzt overline diktoni? Just asking
 Hahahahaha a tdhimti buza
O kuku ja ngjiti kameres 
 Po mo mu gerditen ama edhe un i du ashtu ama edhe mu kan gerdit amerveshajo
A mi pre a mi rrit a tkafta a tbardha? Problem i madh 
   Mos u gzo palidhje oj bardh
Kush o tu desht me met invalid hit me up 
Pse vnoni shminka ne plazh?
 Hahahahaha jo ama mkapi dosada
Ti me mu ki hi ngjina
  Hahahahahahahahahaha mo moter mo
  Mvjen shum kec cka je tu tentu mu perzi ntweet temin,a se din as qellimin e kti tweeti edhe… 
  Mvjen shum kec cka je tu tentu mu perzi ntweet temin,a se din as qellimin e kti tweeti edhe… 
  Mundona mi ul njerzt cka sjon vetvetja.
Thash se boni zilja 
Shka ja kisha ndreq qat qerpik 
Un cdo 5 minuta tjeter teme 
Edhe un du mu kan nksi gjendje lol im crying lol 
 Ka mi kallxu ademit
 Un sa e di ti e ki vec nji vlla :(
 Jooooooooooooo ma poooooor une cka skom shku hala eeeeejjj allllhhhooo 
 Shum kec cka e ki privat twitterin
 Zoti trujt oj bi amin tybistikfa
Gjethajo ironiiiii omg ku pe gjeniiiiiuiii
My dad veq kur tentoj me ja permend tatujen :) haha :) :) 
Dit ma tgat se sot mo shnosh
 A a a a a a a a
 Shiuuuuu i vereeeess shiii i ngroht i dashuriiiisss 
 qysh more jau vlersojm femrav moralin tash na? 
Meta pa frym vec te shkrujt tweetin 
Ej po edhe un be nime kesh e pash filmin Dy gishta mjalt ama skum bo foto,tash a mzihet qe e kum pa a jo
Po bollni de mo me ket sen se so pun mi hik ksaj videos 
 Faleminderit qe mi keni mshel dyrt
 Ncncnc valla poe shkas po kae
 Hahahahaha ta ha be zemren
Kur e ki cef nji foto edhe e nxjer kasmos 
 Pse e ke shkrujt qysh duhet its making me nervous 
Hajde ma kneeeee eeeeeejjj
  rruga jon be parzit
 Mos me perdor telefonin&gt; me ju qu mesazhe njerzve
===